#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AbilitiesPage

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AbilitiesPage.AbilitiesPage_C.ExecuteUbergraph_AbilitiesPage
// 0x00E0 (0x00E0 - 0x0000)
struct AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0018(0x0010)(NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate2;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonButtonGroup*                     CallFunc_SpawnObject_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButton* AssociatedButton, int32 ButtonIndex)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonButton*                          CallFunc_GetButtonAtIndex_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortTooltipContext*                    CallFunc_SpawnTooltipContextWithSource_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortQuickBars                                K2Node_CustomEvent_QuickbarIndex;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EFortQuickBars QuickbarIndex)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonButton*                          CallFunc_GetButtonAtIndex_ReturnValue2;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyUserFocus_ReturnValue;              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle2;             // 0x00A8(0x0010)(NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate5;             // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle3;             // 0x00D0(0x0010)(NoDestructor)
};
static_assert(alignof(AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage) == 0x000008, "Wrong alignment on AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage");
static_assert(sizeof(AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage) == 0x0000E0, "Wrong size on AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage");
static_assert(offsetof(AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage, EntryPoint) == 0x000000, "Member 'AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage::EntryPoint' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage, K2Node_MakeStruct_DataTableRowHandle) == 0x000018, "Member 'AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage, K2Node_CreateDelegate_OutputDelegate2) == 0x000028, "Member 'AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage, CallFunc_SpawnObject_ReturnValue) == 0x000038, "Member 'AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage, K2Node_CreateDelegate_OutputDelegate3) == 0x000040, "Member 'AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage, CallFunc_GetButtonAtIndex_ReturnValue) == 0x000050, "Member 'AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage::CallFunc_GetButtonAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage, CallFunc_GetUINavigationManager_ReturnValue) == 0x000058, "Member 'AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage, CallFunc_GetPlayerController_ReturnValue) == 0x000068, "Member 'AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage, CallFunc_SpawnTooltipContextWithSource_ReturnValue) == 0x000070, "Member 'AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage::CallFunc_SpawnTooltipContextWithSource_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage, CallFunc_GetContext_ReturnValue) == 0x000078, "Member 'AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage, K2Node_CustomEvent_QuickbarIndex) == 0x000080, "Member 'AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage::K2Node_CustomEvent_QuickbarIndex' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000081, "Member 'AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage, K2Node_CreateDelegate_OutputDelegate4) == 0x000088, "Member 'AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage, CallFunc_GetButtonAtIndex_ReturnValue2) == 0x000098, "Member 'AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage::CallFunc_GetButtonAtIndex_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage, CallFunc_HasAnyUserFocus_ReturnValue) == 0x0000A0, "Member 'AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage::CallFunc_HasAnyUserFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage, K2Node_MakeStruct_DataTableRowHandle2) == 0x0000A8, "Member 'AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage::K2Node_MakeStruct_DataTableRowHandle2' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage, CallFunc_BooleanAND_ReturnValue) == 0x0000B8, "Member 'AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage, K2Node_CreateDelegate_OutputDelegate5) == 0x0000C0, "Member 'AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage, K2Node_MakeStruct_DataTableRowHandle3) == 0x0000D0, "Member 'AbilitiesPage_C_ExecuteUbergraph_AbilitiesPage::K2Node_MakeStruct_DataTableRowHandle3' has a wrong offset!");

// Function AbilitiesPage.AbilitiesPage_C.OnQuickbarContentsChanged
// 0x0001 (0x0001 - 0x0000)
struct AbilitiesPage_C_OnQuickbarContentsChanged final
{
public:
	EFortQuickBars                                QuickbarIndex;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AbilitiesPage_C_OnQuickbarContentsChanged) == 0x000001, "Wrong alignment on AbilitiesPage_C_OnQuickbarContentsChanged");
static_assert(sizeof(AbilitiesPage_C_OnQuickbarContentsChanged) == 0x000001, "Wrong size on AbilitiesPage_C_OnQuickbarContentsChanged");
static_assert(offsetof(AbilitiesPage_C_OnQuickbarContentsChanged, QuickbarIndex) == 0x000000, "Member 'AbilitiesPage_C_OnQuickbarContentsChanged::QuickbarIndex' has a wrong offset!");

// Function AbilitiesPage.AbilitiesPage_C.HandleBack
// 0x0010 (0x0010 - 0x0000)
struct AbilitiesPage_C_HandleBack final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AbilitiesPage_C_HandleBack) == 0x000008, "Wrong alignment on AbilitiesPage_C_HandleBack");
static_assert(sizeof(AbilitiesPage_C_HandleBack) == 0x000010, "Wrong size on AbilitiesPage_C_HandleBack");
static_assert(offsetof(AbilitiesPage_C_HandleBack, Passthrough) == 0x000000, "Member 'AbilitiesPage_C_HandleBack::Passthrough' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_HandleBack, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AbilitiesPage_C_HandleBack::CallFunc_GetContext_ReturnValue' has a wrong offset!");

// Function AbilitiesPage.AbilitiesPage_C.OnAbilitySelected
// 0x0318 (0x0318 - 0x0000)
struct AbilitiesPage_C_OnAbilitySelected final
{
public:
	class UCommonButton*                          AbilityButton;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortTooltipUIContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitiesPageTile_C*                   K2Node_DynamicCast_AsAbilities_Page_Tile;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemTier                                 CallFunc_GetTier_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue2;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0018)()
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0040)(HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ZeroConstructor, ReferenceParm)
	float                                         CallFunc_FMod_Remainder;                           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FMod_ReturnValue;                         // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A8(0x0018)()
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x00C8(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x00E0(0x0018)()
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FB[0x5];                                       // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTooltipContext*                    CallFunc_SpawnTooltipContextWithSource_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetTooltipTextFromToken_OutText;          // 0x0118(0x0018)()
	bool                                          CallFunc_GetTooltipTextFromToken_ReturnValue;      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetTooltipTextFromToken_OutText2;         // 0x0138(0x0018)()
	bool                                          CallFunc_GetTooltipTextFromToken_ReturnValue2;     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0158(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData3;             // 0x0198(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData4;             // 0x01D8(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCombinedDescription_OutDescription;    // 0x0220(0x0018)()
	bool                                          CallFunc_GetCombinedDescription_ReturnValue;       // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23A[0x6];                                      // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData5;             // 0x0240(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array2;                           // 0x0288(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue2;                      // 0x0298(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData6;             // 0x02B0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array3;                           // 0x02F0(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue3;                      // 0x0300(0x0018)()
};
static_assert(alignof(AbilitiesPage_C_OnAbilitySelected) == 0x000008, "Wrong alignment on AbilitiesPage_C_OnAbilitySelected");
static_assert(sizeof(AbilitiesPage_C_OnAbilitySelected) == 0x000318, "Wrong size on AbilitiesPage_C_OnAbilitySelected");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, AbilityButton) == 0x000000, "Member 'AbilitiesPage_C_OnAbilitySelected::AbilityButton' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, K2Node_DynamicCast_AsAbilities_Page_Tile) == 0x000010, "Member 'AbilitiesPage_C_OnAbilitySelected::K2Node_DynamicCast_AsAbilities_Page_Tile' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AbilitiesPage_C_OnAbilitySelected::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00001C, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_GetTier_ReturnValue) == 0x000020, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_GetTier_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_Conv_ByteToInt_ReturnValue2) == 0x000024, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_Conv_ByteToInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_Subtract_IntInt_ReturnValue) == 0x000040, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'AbilitiesPage_C_OnAbilitySelected::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000088, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, K2Node_MakeArray_Array) == 0x000090, "Member 'AbilitiesPage_C_OnAbilitySelected::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_FMod_Remainder) == 0x0000A0, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_FMod_Remainder' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_FMod_ReturnValue) == 0x0000A4, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_FMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_Format_ReturnValue) == 0x0000A8, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000C0, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_IsValid_ReturnValue) == 0x0000C1, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_GetDisplayName_ReturnValue) == 0x0000C8, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_TextToUpper_ReturnValue) == 0x0000E0, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, Temp_byte_Variable) == 0x0000F8, "Member 'AbilitiesPage_C_OnAbilitySelected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, Temp_byte_Variable2) == 0x0000F9, "Member 'AbilitiesPage_C_OnAbilitySelected::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, Temp_bool_Variable) == 0x0000FA, "Member 'AbilitiesPage_C_OnAbilitySelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_GetOwningPlayer_ReturnValue) == 0x000100, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, K2Node_Select_Default) == 0x000108, "Member 'AbilitiesPage_C_OnAbilitySelected::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_SpawnTooltipContextWithSource_ReturnValue) == 0x000110, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_SpawnTooltipContextWithSource_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_GetTooltipTextFromToken_OutText) == 0x000118, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_GetTooltipTextFromToken_OutText' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_GetTooltipTextFromToken_ReturnValue) == 0x000130, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_GetTooltipTextFromToken_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_GetTooltipTextFromToken_OutText2) == 0x000138, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_GetTooltipTextFromToken_OutText2' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_GetTooltipTextFromToken_ReturnValue2) == 0x000150, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_GetTooltipTextFromToken_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, K2Node_MakeStruct_FormatArgumentData2) == 0x000158, "Member 'AbilitiesPage_C_OnAbilitySelected::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, K2Node_MakeStruct_FormatArgumentData3) == 0x000198, "Member 'AbilitiesPage_C_OnAbilitySelected::K2Node_MakeStruct_FormatArgumentData3' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, K2Node_MakeStruct_FormatArgumentData4) == 0x0001D8, "Member 'AbilitiesPage_C_OnAbilitySelected::K2Node_MakeStruct_FormatArgumentData4' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_TextIsEmpty_ReturnValue) == 0x000218, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_GetCombinedDescription_OutDescription) == 0x000220, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_GetCombinedDescription_OutDescription' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_GetCombinedDescription_ReturnValue) == 0x000238, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_GetCombinedDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_Not_PreBool_ReturnValue) == 0x000239, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, K2Node_MakeStruct_FormatArgumentData5) == 0x000240, "Member 'AbilitiesPage_C_OnAbilitySelected::K2Node_MakeStruct_FormatArgumentData5' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_BooleanAND_ReturnValue) == 0x000280, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, K2Node_MakeArray_Array2) == 0x000288, "Member 'AbilitiesPage_C_OnAbilitySelected::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_Format_ReturnValue2) == 0x000298, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_Format_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, K2Node_MakeStruct_FormatArgumentData6) == 0x0002B0, "Member 'AbilitiesPage_C_OnAbilitySelected::K2Node_MakeStruct_FormatArgumentData6' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, K2Node_MakeArray_Array3) == 0x0002F0, "Member 'AbilitiesPage_C_OnAbilitySelected::K2Node_MakeArray_Array3' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_OnAbilitySelected, CallFunc_Format_ReturnValue3) == 0x000300, "Member 'AbilitiesPage_C_OnAbilitySelected::CallFunc_Format_ReturnValue3' has a wrong offset!");

// Function AbilitiesPage.AbilitiesPage_C.HandleSelectedButtonChanged
// 0x0018 (0x0018 - 0x0000)
struct AbilitiesPage_C_HandleSelectedButtonChanged final
{
public:
	class UCommonButton*                          InSelectedButton;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InSelectedButtonIndex;                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          NewLocalVar_0;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AbilitiesPage_C_HandleSelectedButtonChanged) == 0x000008, "Wrong alignment on AbilitiesPage_C_HandleSelectedButtonChanged");
static_assert(sizeof(AbilitiesPage_C_HandleSelectedButtonChanged) == 0x000018, "Wrong size on AbilitiesPage_C_HandleSelectedButtonChanged");
static_assert(offsetof(AbilitiesPage_C_HandleSelectedButtonChanged, InSelectedButton) == 0x000000, "Member 'AbilitiesPage_C_HandleSelectedButtonChanged::InSelectedButton' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_HandleSelectedButtonChanged, InSelectedButtonIndex) == 0x000008, "Member 'AbilitiesPage_C_HandleSelectedButtonChanged::InSelectedButtonIndex' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_HandleSelectedButtonChanged, NewLocalVar_0) == 0x000010, "Member 'AbilitiesPage_C_HandleSelectedButtonChanged::NewLocalVar_0' has a wrong offset!");

// Function AbilitiesPage.AbilitiesPage_C.AddTilesToButtonGroup
// 0x0038 (0x0038 - 0x0000)
struct AbilitiesPage_C_AddTilesToButtonGroup final
{
public:
	class UVerticalBox*                           ButtonContainer;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitiesPageTile_C*                   K2Node_DynamicCast_AsAbilities_Page_Tile;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AbilitiesPage_C_AddTilesToButtonGroup) == 0x000008, "Wrong alignment on AbilitiesPage_C_AddTilesToButtonGroup");
static_assert(sizeof(AbilitiesPage_C_AddTilesToButtonGroup) == 0x000038, "Wrong size on AbilitiesPage_C_AddTilesToButtonGroup");
static_assert(offsetof(AbilitiesPage_C_AddTilesToButtonGroup, ButtonContainer) == 0x000000, "Member 'AbilitiesPage_C_AddTilesToButtonGroup::ButtonContainer' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_AddTilesToButtonGroup, CallFunc_GetChildrenCount_ReturnValue) == 0x000008, "Member 'AbilitiesPage_C_AddTilesToButtonGroup::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_AddTilesToButtonGroup, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'AbilitiesPage_C_AddTilesToButtonGroup::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_AddTilesToButtonGroup, Temp_int_Variable) == 0x000010, "Member 'AbilitiesPage_C_AddTilesToButtonGroup::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_AddTilesToButtonGroup, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'AbilitiesPage_C_AddTilesToButtonGroup::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_AddTilesToButtonGroup, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'AbilitiesPage_C_AddTilesToButtonGroup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_AddTilesToButtonGroup, K2Node_DynamicCast_AsAbilities_Page_Tile) == 0x000028, "Member 'AbilitiesPage_C_AddTilesToButtonGroup::K2Node_DynamicCast_AsAbilities_Page_Tile' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_AddTilesToButtonGroup, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AbilitiesPage_C_AddTilesToButtonGroup::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_AddTilesToButtonGroup, CallFunc_IsValid_ReturnValue2) == 0x000031, "Member 'AbilitiesPage_C_AddTilesToButtonGroup::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_AddTilesToButtonGroup, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000032, "Member 'AbilitiesPage_C_AddTilesToButtonGroup::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_AddTilesToButtonGroup, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'AbilitiesPage_C_AddTilesToButtonGroup::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function AbilitiesPage.AbilitiesPage_C.InitializeAbilityTiles
// 0x01D0 (0x01D0 - 0x0000)
struct AbilitiesPage_C_InitializeAbilityTiles final
{
public:
	TArray<class UFortGadgetItemDefinition*>      SlottedGadgets;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UAbilitiesPageTile_C*>           AvailableSlots;                                    // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitiesPageTile_C*                   CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue3;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue4;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_GetQuickBarSlottedItem_ReturnValue;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_GetQuickBarSlottedItem_ReturnValue2;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_GetQuickBarSlottedItem_ReturnValue3;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue5;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue6;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue2;            // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue2;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue3;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue7;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHeroManagementContext*             CallFunc_GetContext_ReturnValue3;                  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHeroUIData                            CallFunc_GetHeroData_HeroData;                     // 0x00A0(0x0020)(NoDestructor)
	bool                                          CallFunc_GetHeroData_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortUIPerk>                    CallFunc_GetHeroAbilityPerks_HeroAbilityPerks;     // 0x00C8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_GetHeroAbilityPerks_ReturnValue;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue4;                  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortUIPerk                            CallFunc_Array_Get_Item2;                          // 0x00E8(0x0098)()
	class UFortItem*                              CallFunc_GetQuickBarSlottedItem_ReturnValue4;      // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_GetQuickBarSlottedItem_ReturnValue5;      // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilityKit*                        CallFunc_GetGrantedAbilityKit_ReturnValue;         // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortGadgetItemDefinition*>      CallFunc_BP_GetGadgets_GadgetItemDefinitions;      // 0x01A8(0x0010)(ZeroConstructor, ReferenceParm)
	class UFortGadgetItemDefinition*              CallFunc_Array_Get_Item3;                          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AbilitiesPage_C_InitializeAbilityTiles) == 0x000008, "Wrong alignment on AbilitiesPage_C_InitializeAbilityTiles");
static_assert(sizeof(AbilitiesPage_C_InitializeAbilityTiles) == 0x0001D0, "Wrong size on AbilitiesPage_C_InitializeAbilityTiles");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, SlottedGadgets) == 0x000000, "Member 'AbilitiesPage_C_InitializeAbilityTiles::SlottedGadgets' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, AvailableSlots) == 0x000010, "Member 'AbilitiesPage_C_InitializeAbilityTiles::AvailableSlots' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, Temp_int_Array_Index_Variable) == 0x000020, "Member 'AbilitiesPage_C_InitializeAbilityTiles::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_Array_Get_Item) == 0x000028, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_Greater_IntInt_ReturnValue) == 0x000030, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_Array_Add_ReturnValue) == 0x000034, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_Array_Add_ReturnValue2) == 0x000038, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_Array_Add_ReturnValue3) == 0x00003C, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_Array_Add_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_Array_Add_ReturnValue4) == 0x000040, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_Array_Add_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'AbilitiesPage_C_InitializeAbilityTiles::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_GetContext_ReturnValue) == 0x000048, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_GetQuickBarSlottedItem_ReturnValue) == 0x000050, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_GetQuickBarSlottedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_GetQuickBarSlottedItem_ReturnValue2) == 0x000058, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_GetQuickBarSlottedItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_IsValid_ReturnValue2) == 0x000061, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_GetQuickBarSlottedItem_ReturnValue3) == 0x000068, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_GetQuickBarSlottedItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_IsValid_ReturnValue3) == 0x000074, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_Array_Add_ReturnValue5) == 0x000078, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_Array_Add_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_Array_Add_ReturnValue6) == 0x00007C, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_Array_Add_ReturnValue6' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_Array_RemoveItem_ReturnValue) == 0x000080, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_Array_RemoveItem_ReturnValue2) == 0x000081, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_Array_RemoveItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_GetContext_ReturnValue2) == 0x000088, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_Array_RemoveItem_ReturnValue3) == 0x000090, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_Array_RemoveItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_Array_Add_ReturnValue7) == 0x000094, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_Array_Add_ReturnValue7' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_GetContext_ReturnValue3) == 0x000098, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_GetHeroData_HeroData) == 0x0000A0, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_GetHeroData_HeroData' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_GetHeroData_ReturnValue) == 0x0000C0, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_GetHeroData_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_GetHeroAbilityPerks_HeroAbilityPerks) == 0x0000C8, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_GetHeroAbilityPerks_HeroAbilityPerks' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_GetHeroAbilityPerks_ReturnValue) == 0x0000D8, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_GetHeroAbilityPerks_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_GetContext_ReturnValue4) == 0x0000E0, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_Array_Get_Item2) == 0x0000E8, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_GetQuickBarSlottedItem_ReturnValue4) == 0x000180, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_GetQuickBarSlottedItem_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_IsValid_ReturnValue4) == 0x000188, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_GetQuickBarSlottedItem_ReturnValue5) == 0x000190, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_GetQuickBarSlottedItem_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_GetGrantedAbilityKit_ReturnValue) == 0x000198, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_GetGrantedAbilityKit_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_IsValid_ReturnValue5) == 0x0001A0, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_BP_GetGadgets_GadgetItemDefinitions) == 0x0001A8, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_BP_GetGadgets_GadgetItemDefinitions' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_Array_Get_Item3) == 0x0001B8, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_Array_Contains_ReturnValue) == 0x0001C0, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_Array_Length_ReturnValue2) == 0x0001C4, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_InitializeAbilityTiles, CallFunc_Less_IntInt_ReturnValue) == 0x0001C8, "Member 'AbilitiesPage_C_InitializeAbilityTiles::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function AbilitiesPage.AbilitiesPage_C.UpdateAbilityMovie
// 0x0010 (0x0010 - 0x0000)
struct AbilitiesPage_C_UpdateAbilityMovie final
{
public:
	class UFortGadgetItemDefinition*              InGadgetItemDef;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AbilitiesPage_C_UpdateAbilityMovie) == 0x000008, "Wrong alignment on AbilitiesPage_C_UpdateAbilityMovie");
static_assert(sizeof(AbilitiesPage_C_UpdateAbilityMovie) == 0x000010, "Wrong size on AbilitiesPage_C_UpdateAbilityMovie");
static_assert(offsetof(AbilitiesPage_C_UpdateAbilityMovie, InGadgetItemDef) == 0x000000, "Member 'AbilitiesPage_C_UpdateAbilityMovie::InGadgetItemDef' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_UpdateAbilityMovie, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'AbilitiesPage_C_UpdateAbilityMovie::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AbilitiesPage.AbilitiesPage_C.HandleInventory
// 0x0010 (0x0010 - 0x0000)
struct AbilitiesPage_C_HandleInventory final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AbilitiesPage_C_HandleInventory) == 0x000008, "Wrong alignment on AbilitiesPage_C_HandleInventory");
static_assert(sizeof(AbilitiesPage_C_HandleInventory) == 0x000010, "Wrong size on AbilitiesPage_C_HandleInventory");
static_assert(offsetof(AbilitiesPage_C_HandleInventory, Passthrough) == 0x000000, "Member 'AbilitiesPage_C_HandleInventory::Passthrough' has a wrong offset!");
static_assert(offsetof(AbilitiesPage_C_HandleInventory, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AbilitiesPage_C_HandleInventory::CallFunc_GetContext_ReturnValue' has a wrong offset!");

}

