#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActiveModifiersHUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ActiveModifiersHUD.ActiveModifiersHUD_C
// 0x0030 (0x0268 - 0x0238)
class UActiveModifiersHUD_C final : public UFortHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UHorizontalBox*                         HboxModifierStack;                                 // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FTimerHandle>                   Timers;                                            // 0x0248(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UMissionDetailsModifierRow_C*>   ModifierRows;                                      // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_ActiveModifiersHUD(int32 EntryPoint);
	void Construct();
	void OnActiveGameplayModifiersChanged(const TArray<class UFortGameplayModifierItemDefinition*>& AppliedModifiers);
	void PopulateModifiers(TArray<class UFortGameplayModifierItemDefinition*>& InModifiers);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ActiveModifiersHUD_C">();
	}
	static class UActiveModifiersHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActiveModifiersHUD_C>();
	}
};
static_assert(alignof(UActiveModifiersHUD_C) == 0x000008, "Wrong alignment on UActiveModifiersHUD_C");
static_assert(sizeof(UActiveModifiersHUD_C) == 0x000268, "Wrong size on UActiveModifiersHUD_C");
static_assert(offsetof(UActiveModifiersHUD_C, UberGraphFrame) == 0x000238, "Member 'UActiveModifiersHUD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UActiveModifiersHUD_C, HboxModifierStack) == 0x000240, "Member 'UActiveModifiersHUD_C::HboxModifierStack' has a wrong offset!");
static_assert(offsetof(UActiveModifiersHUD_C, Timers) == 0x000248, "Member 'UActiveModifiersHUD_C::Timers' has a wrong offset!");
static_assert(offsetof(UActiveModifiersHUD_C, ModifierRows) == 0x000258, "Member 'UActiveModifiersHUD_C::ModifierRows' has a wrong offset!");

}

