#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AmbientControllerComponent_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass AmbientControllerComponent_Athena.AmbientControllerComponent_Athena_C
// 0x0078 (0x0168 - 0x00F0)
class UAmbientControllerComponent_Athena_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(Transient, DuplicateTransient)
	class USoundBase*                             Loop_Morning;                                      // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Loop_Evening;                                      // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Loop_Indoors;                                      // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Loop_Night;                                        // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Loop_Day;                                          // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AmbientMixA;                                       // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AmbientMixB;                                       // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bActiveMixIsA;                                     // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CheckFrequency;                                    // 0x0134(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInsidePrevious;                                 // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsInsideCurrent;                                  // 0x0139(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        AmbientMixIndoor;                                  // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      PlayerController;                                  // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetLPFFreq;                                     // 0x0150(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentLPFFreq;                                    // 0x0154(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InsideLPFFreq;                                     // 0x0158(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutsideLPFFreq;                                    // 0x015C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CurrentOneShot;                                    // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AmbientControllerComponent_Athena(int32 EntryPoint);
	void Set_Storm_Amb_Layer_Enabled(bool Enabled);
	void On_Game_Phase_Step_Change(EAthenaGamePhaseStep GamePhaseStep);
	void On_Game_Phase_Change(EAthenaGamePhase GamePhase);
	void ReceiveTick(float DeltaSeconds);
	void On_Day_Phase_Change(EFortDayPhase CurrentDayPhase, EFortDayPhase PreviousDayPhase, bool bAtCreation);
	void Evaluate_Inside_State();
	void OnCheckIfSurrounded();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void RegisterTimeOfDayCallbacks();
	void Crossfade(class USoundBase* NewSound);
	bool Trace(const struct FVector& Start, const struct FVector& Direction);
	void SetIndoorMixEnabled(bool Enabled);
	void SetTargetLPFFreq(float Target);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AmbientControllerComponent_Athena_C">();
	}
	static class UAmbientControllerComponent_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmbientControllerComponent_Athena_C>();
	}
};
static_assert(alignof(UAmbientControllerComponent_Athena_C) == 0x000008, "Wrong alignment on UAmbientControllerComponent_Athena_C");
static_assert(sizeof(UAmbientControllerComponent_Athena_C) == 0x000168, "Wrong size on UAmbientControllerComponent_Athena_C");
static_assert(offsetof(UAmbientControllerComponent_Athena_C, UberGraphFrame) == 0x0000F0, "Member 'UAmbientControllerComponent_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAmbientControllerComponent_Athena_C, Loop_Morning) == 0x0000F8, "Member 'UAmbientControllerComponent_Athena_C::Loop_Morning' has a wrong offset!");
static_assert(offsetof(UAmbientControllerComponent_Athena_C, Loop_Evening) == 0x000100, "Member 'UAmbientControllerComponent_Athena_C::Loop_Evening' has a wrong offset!");
static_assert(offsetof(UAmbientControllerComponent_Athena_C, Loop_Indoors) == 0x000108, "Member 'UAmbientControllerComponent_Athena_C::Loop_Indoors' has a wrong offset!");
static_assert(offsetof(UAmbientControllerComponent_Athena_C, Loop_Night) == 0x000110, "Member 'UAmbientControllerComponent_Athena_C::Loop_Night' has a wrong offset!");
static_assert(offsetof(UAmbientControllerComponent_Athena_C, Loop_Day) == 0x000118, "Member 'UAmbientControllerComponent_Athena_C::Loop_Day' has a wrong offset!");
static_assert(offsetof(UAmbientControllerComponent_Athena_C, AmbientMixA) == 0x000120, "Member 'UAmbientControllerComponent_Athena_C::AmbientMixA' has a wrong offset!");
static_assert(offsetof(UAmbientControllerComponent_Athena_C, AmbientMixB) == 0x000128, "Member 'UAmbientControllerComponent_Athena_C::AmbientMixB' has a wrong offset!");
static_assert(offsetof(UAmbientControllerComponent_Athena_C, bActiveMixIsA) == 0x000130, "Member 'UAmbientControllerComponent_Athena_C::bActiveMixIsA' has a wrong offset!");
static_assert(offsetof(UAmbientControllerComponent_Athena_C, CheckFrequency) == 0x000134, "Member 'UAmbientControllerComponent_Athena_C::CheckFrequency' has a wrong offset!");
static_assert(offsetof(UAmbientControllerComponent_Athena_C, bIsInsidePrevious) == 0x000138, "Member 'UAmbientControllerComponent_Athena_C::bIsInsidePrevious' has a wrong offset!");
static_assert(offsetof(UAmbientControllerComponent_Athena_C, bIsInsideCurrent) == 0x000139, "Member 'UAmbientControllerComponent_Athena_C::bIsInsideCurrent' has a wrong offset!");
static_assert(offsetof(UAmbientControllerComponent_Athena_C, AmbientMixIndoor) == 0x000140, "Member 'UAmbientControllerComponent_Athena_C::AmbientMixIndoor' has a wrong offset!");
static_assert(offsetof(UAmbientControllerComponent_Athena_C, PlayerController) == 0x000148, "Member 'UAmbientControllerComponent_Athena_C::PlayerController' has a wrong offset!");
static_assert(offsetof(UAmbientControllerComponent_Athena_C, TargetLPFFreq) == 0x000150, "Member 'UAmbientControllerComponent_Athena_C::TargetLPFFreq' has a wrong offset!");
static_assert(offsetof(UAmbientControllerComponent_Athena_C, CurrentLPFFreq) == 0x000154, "Member 'UAmbientControllerComponent_Athena_C::CurrentLPFFreq' has a wrong offset!");
static_assert(offsetof(UAmbientControllerComponent_Athena_C, InsideLPFFreq) == 0x000158, "Member 'UAmbientControllerComponent_Athena_C::InsideLPFFreq' has a wrong offset!");
static_assert(offsetof(UAmbientControllerComponent_Athena_C, OutsideLPFFreq) == 0x00015C, "Member 'UAmbientControllerComponent_Athena_C::OutsideLPFFreq' has a wrong offset!");
static_assert(offsetof(UAmbientControllerComponent_Athena_C, CurrentOneShot) == 0x000160, "Member 'UAmbientControllerComponent_Athena_C::CurrentOneShot' has a wrong offset!");

}

