#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Announce_OnboardingSatelliteCine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Announce_OnboardingSatelliteCine.Announce_OnboardingSatelliteCine_C
// 0x0028 (0x0400 - 0x03D8)
class AAnnounce_OnboardingSatelliteCine_C final : public AFortClientAnnouncement_Cinematic
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMediaSource*                           SatelliteMediaSource;                              // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AllowSkipping;                                     // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EFortUIState                                  StartingState;                                     // 0x03F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F2[0x6];                                      // 0x03F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMediaSubtitlesPlayer*              SatelliteSubtitlesPlayer;                          // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Announce_OnboardingSatelliteCine(int32 EntryPoint);
	void HandleAllowSkip();
	void HandleClientEvent_CinematicFinishedPlaying(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void OnClientAnnouncementStart();
	void OnClientAnnouncementStop();
	void OnPlayerSkippedCutscene();
	void OnStateEntered_9AA291E3426E3967D1365A9851D878CE();
	void OnStateEntered_9B2A7CB14D8998F7D97BBB902DE431B7();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Announce_OnboardingSatelliteCine_C">();
	}
	static class AAnnounce_OnboardingSatelliteCine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAnnounce_OnboardingSatelliteCine_C>();
	}
};
static_assert(alignof(AAnnounce_OnboardingSatelliteCine_C) == 0x000008, "Wrong alignment on AAnnounce_OnboardingSatelliteCine_C");
static_assert(sizeof(AAnnounce_OnboardingSatelliteCine_C) == 0x000400, "Wrong size on AAnnounce_OnboardingSatelliteCine_C");
static_assert(offsetof(AAnnounce_OnboardingSatelliteCine_C, UberGraphFrame) == 0x0003D8, "Member 'AAnnounce_OnboardingSatelliteCine_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAnnounce_OnboardingSatelliteCine_C, DefaultSceneRoot) == 0x0003E0, "Member 'AAnnounce_OnboardingSatelliteCine_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AAnnounce_OnboardingSatelliteCine_C, SatelliteMediaSource) == 0x0003E8, "Member 'AAnnounce_OnboardingSatelliteCine_C::SatelliteMediaSource' has a wrong offset!");
static_assert(offsetof(AAnnounce_OnboardingSatelliteCine_C, AllowSkipping) == 0x0003F0, "Member 'AAnnounce_OnboardingSatelliteCine_C::AllowSkipping' has a wrong offset!");
static_assert(offsetof(AAnnounce_OnboardingSatelliteCine_C, StartingState) == 0x0003F1, "Member 'AAnnounce_OnboardingSatelliteCine_C::StartingState' has a wrong offset!");
static_assert(offsetof(AAnnounce_OnboardingSatelliteCine_C, SatelliteSubtitlesPlayer) == 0x0003F8, "Member 'AAnnounce_OnboardingSatelliteCine_C::SatelliteSubtitlesPlayer' has a wrong offset!");

}

