#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaTeamInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaTeamInfo.AthenaTeamInfo_C
// 0x0038 (0x0270 - 0x0238)
class UAthenaTeamInfo_C final : public UFortHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UVerticalBox*                           VerticalBoxSquadMembers;                           // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UAthenaTeamMemberInfo_C*>        SquadMembers;                                      // 0x0248(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UAthenaTeamMemberInfo_C*>        DisconnectedSquadMembers;                          // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          bAddFriendOptionsDisplayed;                        // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AthenaTeamInfo(int32 EntryPoint);
	void RolloutAddFriend();
	void PreConstruct(bool IsDesignTime);
	void HandlePartyLeft();
	void Construct();
	void AppendSquadMember(class AFortPlayerStateAthena* PlayerState, int32 PlayerIndex);
	void ClearContents();
	void HandleSquadHitInfoChanged(TArray<float>& HealthFractions, TArray<float>& ShieldFractions);
	void HandleSquadMemberAdded();
	void HandleSquadDBNOChanged(TArray<bool>& TeamDBNO);
	void HandleSquadDeadChanged(TArray<bool>& TeamDead);
	void HandleSquadMemberPlayerNamesChanged();
	void HandleSquadRevivingChanged(TArray<bool>& TeamReviving);
	void HandleSquadMemberRemoved();
	void HandleSquadTalkingChanged(TArray<bool>& TeamTalking);
	void HandleSquadMutedChanged(TArray<bool>& TeamMuted);
	void ClearSquadMembers();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaTeamInfo_C">();
	}
	static class UAthenaTeamInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaTeamInfo_C>();
	}
};
static_assert(alignof(UAthenaTeamInfo_C) == 0x000008, "Wrong alignment on UAthenaTeamInfo_C");
static_assert(sizeof(UAthenaTeamInfo_C) == 0x000270, "Wrong size on UAthenaTeamInfo_C");
static_assert(offsetof(UAthenaTeamInfo_C, UberGraphFrame) == 0x000238, "Member 'UAthenaTeamInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaTeamInfo_C, VerticalBoxSquadMembers) == 0x000240, "Member 'UAthenaTeamInfo_C::VerticalBoxSquadMembers' has a wrong offset!");
static_assert(offsetof(UAthenaTeamInfo_C, SquadMembers) == 0x000248, "Member 'UAthenaTeamInfo_C::SquadMembers' has a wrong offset!");
static_assert(offsetof(UAthenaTeamInfo_C, DisconnectedSquadMembers) == 0x000258, "Member 'UAthenaTeamInfo_C::DisconnectedSquadMembers' has a wrong offset!");
static_assert(offsetof(UAthenaTeamInfo_C, bAddFriendOptionsDisplayed) == 0x000268, "Member 'UAthenaTeamInfo_C::bAddFriendOptionsDisplayed' has a wrong offset!");

}

