#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSeasonBPTrackerSimpleWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaSeasonBPTrackerSimpleWidget.AthenaSeasonBPTrackerSimpleWidget_C
// 0x0048 (0x0290 - 0x0248)
class UAthenaSeasonBPTrackerSimpleWidget_C final : public UFortAccountWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(Transient, DuplicateTransient)
	class UWidgetSwitcher*                        CompleteSwitcher;                                  // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                CurrentText;                                       // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DividerText;                                       // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItemIcon*                          ItemIcon;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MaxTextBlock;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ProgressHB;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TotalText;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         LastBookXP;                                        // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaSeasonBPTrackerSimpleWidget(int32 EntryPoint);
	void OnAccountInfoChanged(const struct FFortPublicAccountInfo& Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSeasonBPTrackerSimpleWidget_C">();
	}
	static class UAthenaSeasonBPTrackerSimpleWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSeasonBPTrackerSimpleWidget_C>();
	}
};
static_assert(alignof(UAthenaSeasonBPTrackerSimpleWidget_C) == 0x000008, "Wrong alignment on UAthenaSeasonBPTrackerSimpleWidget_C");
static_assert(sizeof(UAthenaSeasonBPTrackerSimpleWidget_C) == 0x000290, "Wrong size on UAthenaSeasonBPTrackerSimpleWidget_C");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, UberGraphFrame) == 0x000248, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, CompleteSwitcher) == 0x000250, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::CompleteSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, CurrentText) == 0x000258, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::CurrentText' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, DividerText) == 0x000260, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::DividerText' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, ItemIcon) == 0x000268, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, MaxTextBlock) == 0x000270, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::MaxTextBlock' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, ProgressHB) == 0x000278, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::ProgressHB' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, TotalText) == 0x000280, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::TotalText' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonBPTrackerSimpleWidget_C, LastBookXP) == 0x000288, "Member 'UAthenaSeasonBPTrackerSimpleWidget_C::LastBookXP' has a wrong offset!");

}

