#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaGamePhaseChangeWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaGamePhaseChangeWidget.AthenaGamePhaseChangeWidget_C.ExecuteUbergraph_AthenaGamePhaseChangeWidget
// 0x00A8 (0x00A8 - 0x0000)
struct AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaGamePhaseStep                          Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable2;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable3;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable4;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable5;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable6;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable7;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable8;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable9;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaGamePhaseStep                          K2Node_Event_Step2;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Message;                              // 0x0058(0x0018)()
	class FText                                   K2Node_Event_TimeText;                             // 0x0070(0x0018)()
	class UWidgetAnimation*                       K2Node_Event_Animation;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaGamePhaseStep                          K2Node_Event_Step;                                 // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable10;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget) == 0x000008, "Wrong alignment on AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget");
static_assert(sizeof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget) == 0x0000A8, "Wrong size on AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, EntryPoint) == 0x000000, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_byte_Variable) == 0x000004, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable) == 0x000008, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable2) == 0x000010, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable3) == 0x000018, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable4) == 0x000020, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable5) == 0x000028, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable6) == 0x000030, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable6' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable7) == 0x000038, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable7' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable8) == 0x000040, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable8' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable9) == 0x000048, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable9' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_Event_Step2) == 0x000050, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_Event_Step2' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_Event_Message) == 0x000058, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_Event_Message' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_Event_TimeText) == 0x000070, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_Event_TimeText' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_Event_Animation) == 0x000088, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_Event_Step) == 0x000090, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_Event_Step' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000091, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000092, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, Temp_object_Variable10) == 0x000098, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::Temp_object_Variable10' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget, K2Node_Select_Default) == 0x0000A0, "Member 'AthenaGamePhaseChangeWidget_C_ExecuteUbergraph_AthenaGamePhaseChangeWidget::K2Node_Select_Default' has a wrong offset!");

// Function AthenaGamePhaseChangeWidget.AthenaGamePhaseChangeWidget_C.GamePhaseStepChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaGamePhaseChangeWidget_C_GamePhaseStepChanged final
{
public:
	EAthenaGamePhaseStep                          Step;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaGamePhaseChangeWidget_C_GamePhaseStepChanged) == 0x000001, "Wrong alignment on AthenaGamePhaseChangeWidget_C_GamePhaseStepChanged");
static_assert(sizeof(AthenaGamePhaseChangeWidget_C_GamePhaseStepChanged) == 0x000001, "Wrong size on AthenaGamePhaseChangeWidget_C_GamePhaseStepChanged");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_GamePhaseStepChanged, Step) == 0x000000, "Member 'AthenaGamePhaseChangeWidget_C_GamePhaseStepChanged::Step' has a wrong offset!");

// Function AthenaGamePhaseChangeWidget.AthenaGamePhaseChangeWidget_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct AthenaGamePhaseChangeWidget_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaGamePhaseChangeWidget_C_OnAnimationFinished) == 0x000008, "Wrong alignment on AthenaGamePhaseChangeWidget_C_OnAnimationFinished");
static_assert(sizeof(AthenaGamePhaseChangeWidget_C_OnAnimationFinished) == 0x000008, "Wrong size on AthenaGamePhaseChangeWidget_C_OnAnimationFinished");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_OnAnimationFinished, Animation) == 0x000000, "Member 'AthenaGamePhaseChangeWidget_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function AthenaGamePhaseChangeWidget.AthenaGamePhaseChangeWidget_C.UpdateMessaging
// 0x0038 (0x0038 - 0x0000)
struct AthenaGamePhaseChangeWidget_C_UpdateMessaging final
{
public:
	EAthenaGamePhaseStep                          Step;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Param_MESSAGE;                                     // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Param_TimeText;                                    // 0x0020(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaGamePhaseChangeWidget_C_UpdateMessaging) == 0x000008, "Wrong alignment on AthenaGamePhaseChangeWidget_C_UpdateMessaging");
static_assert(sizeof(AthenaGamePhaseChangeWidget_C_UpdateMessaging) == 0x000038, "Wrong size on AthenaGamePhaseChangeWidget_C_UpdateMessaging");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_UpdateMessaging, Step) == 0x000000, "Member 'AthenaGamePhaseChangeWidget_C_UpdateMessaging::Step' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_UpdateMessaging, Param_MESSAGE) == 0x000008, "Member 'AthenaGamePhaseChangeWidget_C_UpdateMessaging::Param_MESSAGE' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_UpdateMessaging, Param_TimeText) == 0x000020, "Member 'AthenaGamePhaseChangeWidget_C_UpdateMessaging::Param_TimeText' has a wrong offset!");

// Function AthenaGamePhaseChangeWidget.AthenaGamePhaseChangeWidget_C.PlayGamePhaseAlertSound
// 0x0068 (0x0068 - 0x0000)
struct AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound final
{
public:
	EAthenaGamePhaseStep                          Step;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaGamePhaseStep                          Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable2;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable3;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable4;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable5;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable6;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable7;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable8;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable9;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable10;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound) == 0x000008, "Wrong alignment on AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound");
static_assert(sizeof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound) == 0x000068, "Wrong size on AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Step) == 0x000000, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Step' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_byte_Variable) == 0x000001, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable) == 0x000008, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable2) == 0x000010, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable3) == 0x000018, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable4) == 0x000020, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable5) == 0x000028, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable6) == 0x000030, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable6' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable7) == 0x000038, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable7' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable8) == 0x000040, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable8' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable9) == 0x000048, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable9' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, Temp_object_Variable10) == 0x000050, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::Temp_object_Variable10' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, K2Node_Select_Default) == 0x000058, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'AthenaGamePhaseChangeWidget_C_PlayGamePhaseAlertSound::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AthenaGamePhaseChangeWidget.AthenaGamePhaseChangeWidget_C.PlayIntroAnimation
// 0x0010 (0x0010 - 0x0000)
struct AthenaGamePhaseChangeWidget_C_PlayIntroAnimation final
{
public:
	EAthenaGamePhaseStep                          Step;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation) == 0x000008, "Wrong alignment on AthenaGamePhaseChangeWidget_C_PlayIntroAnimation");
static_assert(sizeof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation) == 0x000010, "Wrong size on AthenaGamePhaseChangeWidget_C_PlayIntroAnimation");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, Step) == 0x000000, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::Step' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, Temp_bool_Variable) == 0x000002, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaGamePhaseChangeWidget_C_PlayIntroAnimation, K2Node_Select_Default) == 0x000008, "Member 'AthenaGamePhaseChangeWidget_C_PlayIntroAnimation::K2Node_Select_Default' has a wrong offset!");

}

