#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSeasonTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AthenaSeasonTab.AthenaSeasonTab_C.ExecuteUbergraph_AthenaSeasonTab
// 0x0170 (0x0170 - 0x0000)
struct AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortDirectAcquisitionOfferInfo*        K2Node_Event_OfferData;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaAccountContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button4;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCurrentSeasonName_ReturnValue;         // 0x0028(0x0018)()
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0048(0x0018)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFortItem* Item)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	class UAthenaDirectAcquisitionMTXDetails_C*   CallFunc_Create_ReturnValue;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Level;                                // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button3;                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_ComponentBoundEvent_ActiveWidget;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ActiveWidgetIndex;      // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaSeasonPageWidget_C*              K2Node_DynamicCast_AsAthena_Season_Page_Widget;    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSeasonPassLevel_ReturnValue;           // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFirstLevel_FirstLevel;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue2;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaSeasonLevelConfirmationModal_C*  CallFunc_Create_ReturnValue2;                      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue3;                  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSeasonPassLevel_ReturnValue2;          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSeasonPassLevel_ReturnValue3;          // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue4;                  // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSeasonPassLevelInfo*               CallFunc_GetLevelInfo_ReturnValue;                 // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_GetSeasonStoreEndDate_ReturnValue;        // 0x0110(0x0008)(NoDestructor, HasGetValueTypeHash)
	TMap<int32, class UFortSeasonPassLevelInfo*>  CallFunc_GetAllLevelInfos_ReturnValue;             // 0x0118(0x0050)(ZeroConstructor)
	int32                                         CallFunc_GetSeasonPassLevelMax_ReturnValue;        // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab");
static_assert(sizeof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab) == 0x000170, "Wrong size on AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, EntryPoint) == 0x000000, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, K2Node_Event_OfferData) == 0x000008, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::K2Node_Event_OfferData' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, K2Node_ComponentBoundEvent_Button4) == 0x000020, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::K2Node_ComponentBoundEvent_Button4' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, CallFunc_GetCurrentSeasonName_ReturnValue) == 0x000028, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::CallFunc_GetCurrentSeasonName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, CallFunc_GetContext_ReturnValue2) == 0x000040, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, CallFunc_TextToUpper_ReturnValue) == 0x000048, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, CallFunc_GetOwningPlayer_ReturnValue) == 0x000060, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, CallFunc_Create_ReturnValue) == 0x000078, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, CallFunc_IsValid_ReturnValue2) == 0x000080, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, K2Node_Event_Level) == 0x000084, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::K2Node_Event_Level' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, CallFunc_IsValid_ReturnValue3) == 0x000088, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, K2Node_ComponentBoundEvent_Button3) == 0x000090, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, K2Node_ComponentBoundEvent_Button2) == 0x000098, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, K2Node_ComponentBoundEvent_ActiveWidget) == 0x0000A0, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::K2Node_ComponentBoundEvent_ActiveWidget' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, K2Node_ComponentBoundEvent_ActiveWidgetIndex) == 0x0000A8, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::K2Node_ComponentBoundEvent_ActiveWidgetIndex' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, K2Node_DynamicCast_AsAthena_Season_Page_Widget) == 0x0000B0, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::K2Node_DynamicCast_AsAthena_Season_Page_Widget' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, CallFunc_GetSeasonPassLevel_ReturnValue) == 0x0000BC, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::CallFunc_GetSeasonPassLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, CallFunc_GetFirstLevel_FirstLevel) == 0x0000C0, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::CallFunc_GetFirstLevel_FirstLevel' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, K2Node_ComponentBoundEvent_Button) == 0x0000C8, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, CallFunc_GetOwningPlayer_ReturnValue2) == 0x0000D0, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::CallFunc_GetOwningPlayer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, CallFunc_Create_ReturnValue2) == 0x0000D8, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::CallFunc_Create_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, CallFunc_GetContext_ReturnValue3) == 0x0000E0, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, CallFunc_GetSeasonPassLevel_ReturnValue2) == 0x0000E8, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::CallFunc_GetSeasonPassLevel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, CallFunc_GetSeasonPassLevel_ReturnValue3) == 0x0000EC, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::CallFunc_GetSeasonPassLevel_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, CallFunc_GetContext_ReturnValue4) == 0x0000F0, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, CallFunc_Add_IntInt_ReturnValue) == 0x0000F8, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, CallFunc_GetLevelInfo_ReturnValue) == 0x000100, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::CallFunc_GetLevelInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, CallFunc_IsValid_ReturnValue4) == 0x000108, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, CallFunc_GetSeasonStoreEndDate_ReturnValue) == 0x000110, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::CallFunc_GetSeasonStoreEndDate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, CallFunc_GetAllLevelInfos_ReturnValue) == 0x000118, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::CallFunc_GetAllLevelInfos_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab, CallFunc_GetSeasonPassLevelMax_ReturnValue) == 0x000168, "Member 'AthenaSeasonTab_C_ExecuteUbergraph_AthenaSeasonTab::CallFunc_GetSeasonPassLevelMax_ReturnValue' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.BndEvt__PurchaseLevelBtn_K2Node_ComponentBoundEvent_40_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonTab_C_BndEvt__PurchaseLevelBtn_K2Node_ComponentBoundEvent_40_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonTab_C_BndEvt__PurchaseLevelBtn_K2Node_ComponentBoundEvent_40_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_BndEvt__PurchaseLevelBtn_K2Node_ComponentBoundEvent_40_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaSeasonTab_C_BndEvt__PurchaseLevelBtn_K2Node_ComponentBoundEvent_40_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaSeasonTab_C_BndEvt__PurchaseLevelBtn_K2Node_ComponentBoundEvent_40_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaSeasonTab_C_BndEvt__PurchaseLevelBtn_K2Node_ComponentBoundEvent_40_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaSeasonTab_C_BndEvt__PurchaseLevelBtn_K2Node_ComponentBoundEvent_40_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.BndEvt__LevelPageWidgetSwitcher_K2Node_ComponentBoundEvent_1_OnActiveWidgetChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct AthenaSeasonTab_C_BndEvt__LevelPageWidgetSwitcher_K2Node_ComponentBoundEvent_1_OnActiveWidgetChanged__DelegateSignature final
{
public:
	class UWidget*                                ActiveWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ActiveWidgetIndex;                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonTab_C_BndEvt__LevelPageWidgetSwitcher_K2Node_ComponentBoundEvent_1_OnActiveWidgetChanged__DelegateSignature) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_BndEvt__LevelPageWidgetSwitcher_K2Node_ComponentBoundEvent_1_OnActiveWidgetChanged__DelegateSignature");
static_assert(sizeof(AthenaSeasonTab_C_BndEvt__LevelPageWidgetSwitcher_K2Node_ComponentBoundEvent_1_OnActiveWidgetChanged__DelegateSignature) == 0x000010, "Wrong size on AthenaSeasonTab_C_BndEvt__LevelPageWidgetSwitcher_K2Node_ComponentBoundEvent_1_OnActiveWidgetChanged__DelegateSignature");
static_assert(offsetof(AthenaSeasonTab_C_BndEvt__LevelPageWidgetSwitcher_K2Node_ComponentBoundEvent_1_OnActiveWidgetChanged__DelegateSignature, ActiveWidget) == 0x000000, "Member 'AthenaSeasonTab_C_BndEvt__LevelPageWidgetSwitcher_K2Node_ComponentBoundEvent_1_OnActiveWidgetChanged__DelegateSignature::ActiveWidget' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_BndEvt__LevelPageWidgetSwitcher_K2Node_ComponentBoundEvent_1_OnActiveWidgetChanged__DelegateSignature, ActiveWidgetIndex) == 0x000008, "Member 'AthenaSeasonTab_C_BndEvt__LevelPageWidgetSwitcher_K2Node_ComponentBoundEvent_1_OnActiveWidgetChanged__DelegateSignature::ActiveWidgetIndex' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.BndEvt__PageRightBtn_K2Node_ComponentBoundEvent_84_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonTab_C_BndEvt__PageRightBtn_K2Node_ComponentBoundEvent_84_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonTab_C_BndEvt__PageRightBtn_K2Node_ComponentBoundEvent_84_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_BndEvt__PageRightBtn_K2Node_ComponentBoundEvent_84_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaSeasonTab_C_BndEvt__PageRightBtn_K2Node_ComponentBoundEvent_84_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaSeasonTab_C_BndEvt__PageRightBtn_K2Node_ComponentBoundEvent_84_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaSeasonTab_C_BndEvt__PageRightBtn_K2Node_ComponentBoundEvent_84_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaSeasonTab_C_BndEvt__PageRightBtn_K2Node_ComponentBoundEvent_84_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_45_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonTab_C_BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_45_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonTab_C_BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_45_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_45_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaSeasonTab_C_BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_45_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaSeasonTab_C_BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_45_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaSeasonTab_C_BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_45_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaSeasonTab_C_BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_45_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.BndEvt__PurchaseSeasonBtn_K2Node_ComponentBoundEvent_61_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonTab_C_BndEvt__PurchaseSeasonBtn_K2Node_ComponentBoundEvent_61_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonTab_C_BndEvt__PurchaseSeasonBtn_K2Node_ComponentBoundEvent_61_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_BndEvt__PurchaseSeasonBtn_K2Node_ComponentBoundEvent_61_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaSeasonTab_C_BndEvt__PurchaseSeasonBtn_K2Node_ComponentBoundEvent_61_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaSeasonTab_C_BndEvt__PurchaseSeasonBtn_K2Node_ComponentBoundEvent_61_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaSeasonTab_C_BndEvt__PurchaseSeasonBtn_K2Node_ComponentBoundEvent_61_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaSeasonTab_C_BndEvt__PurchaseSeasonBtn_K2Node_ComponentBoundEvent_61_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.GenerateOfferWidget
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonTab_C_GenerateOfferWidget final
{
public:
	class UFortDirectAcquisitionOfferInfo*        Param_OfferData;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonTab_C_GenerateOfferWidget) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_GenerateOfferWidget");
static_assert(sizeof(AthenaSeasonTab_C_GenerateOfferWidget) == 0x000008, "Wrong size on AthenaSeasonTab_C_GenerateOfferWidget");
static_assert(offsetof(AthenaSeasonTab_C_GenerateOfferWidget, Param_OfferData) == 0x000000, "Member 'AthenaSeasonTab_C_GenerateOfferWidget::Param_OfferData' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.OnNavigateToLevel
// 0x0004 (0x0004 - 0x0000)
struct AthenaSeasonTab_C_OnNavigateToLevel final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonTab_C_OnNavigateToLevel) == 0x000004, "Wrong alignment on AthenaSeasonTab_C_OnNavigateToLevel");
static_assert(sizeof(AthenaSeasonTab_C_OnNavigateToLevel) == 0x000004, "Wrong size on AthenaSeasonTab_C_OnNavigateToLevel");
static_assert(offsetof(AthenaSeasonTab_C_OnNavigateToLevel, Level) == 0x000000, "Member 'AthenaSeasonTab_C_OnNavigateToLevel::Level' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.GenerateLevelWidgets
// 0x0068 (0x0068 - 0x0000)
struct AthenaSeasonTab_C_GenerateLevelWidgets final
{
public:
	class UFortSeasonPassLevelInfo*               LevelInfo;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USeasonPassLevelWidget*>         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class USeasonPassLevelWidget*>         CallFunc_AddLevelWidgets_LevelWidgets;             // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaSeasonPageWidget_C*              CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFull_Full;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonTab_C_GenerateLevelWidgets) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_GenerateLevelWidgets");
static_assert(sizeof(AthenaSeasonTab_C_GenerateLevelWidgets) == 0x000068, "Wrong size on AthenaSeasonTab_C_GenerateLevelWidgets");
static_assert(offsetof(AthenaSeasonTab_C_GenerateLevelWidgets, LevelInfo) == 0x000000, "Member 'AthenaSeasonTab_C_GenerateLevelWidgets::LevelInfo' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_GenerateLevelWidgets, ReturnValue) == 0x000008, "Member 'AthenaSeasonTab_C_GenerateLevelWidgets::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_GenerateLevelWidgets, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'AthenaSeasonTab_C_GenerateLevelWidgets::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_GenerateLevelWidgets, CallFunc_AddLevelWidgets_LevelWidgets) == 0x000028, "Member 'AthenaSeasonTab_C_GenerateLevelWidgets::CallFunc_AddLevelWidgets_LevelWidgets' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_GenerateLevelWidgets, K2Node_CreateDelegate_OutputDelegate2) == 0x000038, "Member 'AthenaSeasonTab_C_GenerateLevelWidgets::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_GenerateLevelWidgets, CallFunc_GetOwningPlayer_ReturnValue) == 0x000048, "Member 'AthenaSeasonTab_C_GenerateLevelWidgets::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_GenerateLevelWidgets, CallFunc_Create_ReturnValue) == 0x000050, "Member 'AthenaSeasonTab_C_GenerateLevelWidgets::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_GenerateLevelWidgets, CallFunc_IsFull_Full) == 0x000058, "Member 'AthenaSeasonTab_C_GenerateLevelWidgets::CallFunc_IsFull_Full' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_GenerateLevelWidgets, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'AthenaSeasonTab_C_GenerateLevelWidgets::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_GenerateLevelWidgets, CallFunc_AddChild_ReturnValue) == 0x000060, "Member 'AthenaSeasonTab_C_GenerateLevelWidgets::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.SelectPageByLevel
// 0x0030 (0x0030 - 0x0000)
struct AthenaSeasonTab_C_SelectPageByLevel final
{
public:
	int32                                         TargetLevel;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USeasonPassPageWidget*                  K2Node_DynamicCast_AsSeason_Pass_Page_Widget;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsLevel_ReturnValue;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonTab_C_SelectPageByLevel) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_SelectPageByLevel");
static_assert(sizeof(AthenaSeasonTab_C_SelectPageByLevel) == 0x000030, "Wrong size on AthenaSeasonTab_C_SelectPageByLevel");
static_assert(offsetof(AthenaSeasonTab_C_SelectPageByLevel, TargetLevel) == 0x000000, "Member 'AthenaSeasonTab_C_SelectPageByLevel::TargetLevel' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SelectPageByLevel, Temp_int_Variable) == 0x000004, "Member 'AthenaSeasonTab_C_SelectPageByLevel::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SelectPageByLevel, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'AthenaSeasonTab_C_SelectPageByLevel::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SelectPageByLevel, CallFunc_GetChildrenCount_ReturnValue) == 0x000010, "Member 'AthenaSeasonTab_C_SelectPageByLevel::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SelectPageByLevel, K2Node_DynamicCast_AsSeason_Pass_Page_Widget) == 0x000018, "Member 'AthenaSeasonTab_C_SelectPageByLevel::K2Node_DynamicCast_AsSeason_Pass_Page_Widget' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SelectPageByLevel, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AthenaSeasonTab_C_SelectPageByLevel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SelectPageByLevel, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'AthenaSeasonTab_C_SelectPageByLevel::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SelectPageByLevel, CallFunc_ContainsLevel_ReturnValue) == 0x000028, "Member 'AthenaSeasonTab_C_SelectPageByLevel::CallFunc_ContainsLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SelectPageByLevel, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000029, "Member 'AthenaSeasonTab_C_SelectPageByLevel::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SelectPageByLevel, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'AthenaSeasonTab_C_SelectPageByLevel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.SetupViewedItemData
// 0x0110 (0x0110 - 0x0000)
struct AthenaSeasonTab_C_SetupViewedItemData final
{
public:
	class UFortItem*                              Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetSingleLineDescription_ReturnValue;     // 0x0020(0x0018)()
	class FText                                   CallFunc_GetShortDescription_ReturnValue;          // 0x0038(0x0018)()
	EFortRarity                                   CallFunc_GetRarity_ReturnValue;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0058(0x0018)()
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x0070(0x0080)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue2;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue3;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonTab_C_SetupViewedItemData) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_SetupViewedItemData");
static_assert(sizeof(AthenaSeasonTab_C_SetupViewedItemData) == 0x000110, "Wrong size on AthenaSeasonTab_C_SetupViewedItemData");
static_assert(offsetof(AthenaSeasonTab_C_SetupViewedItemData, Item) == 0x000000, "Member 'AthenaSeasonTab_C_SetupViewedItemData::Item' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetupViewedItemData, CallFunc_MakeLiteralName_ReturnValue) == 0x000008, "Member 'AthenaSeasonTab_C_SetupViewedItemData::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetupViewedItemData, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000010, "Member 'AthenaSeasonTab_C_SetupViewedItemData::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetupViewedItemData, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'AthenaSeasonTab_C_SetupViewedItemData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetupViewedItemData, CallFunc_GetSingleLineDescription_ReturnValue) == 0x000020, "Member 'AthenaSeasonTab_C_SetupViewedItemData::CallFunc_GetSingleLineDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetupViewedItemData, CallFunc_GetShortDescription_ReturnValue) == 0x000038, "Member 'AthenaSeasonTab_C_SetupViewedItemData::CallFunc_GetShortDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetupViewedItemData, CallFunc_GetRarity_ReturnValue) == 0x000050, "Member 'AthenaSeasonTab_C_SetupViewedItemData::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetupViewedItemData, CallFunc_TextToUpper_ReturnValue) == 0x000058, "Member 'AthenaSeasonTab_C_SetupViewedItemData::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetupViewedItemData, CallFunc_BPGetRarityData_ReturnValue) == 0x000070, "Member 'AthenaSeasonTab_C_SetupViewedItemData::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetupViewedItemData, CallFunc_MakeLiteralName_ReturnValue2) == 0x0000F0, "Member 'AthenaSeasonTab_C_SetupViewedItemData::CallFunc_MakeLiteralName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetupViewedItemData, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000F8, "Member 'AthenaSeasonTab_C_SetupViewedItemData::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetupViewedItemData, CallFunc_MakeLiteralName_ReturnValue3) == 0x000100, "Member 'AthenaSeasonTab_C_SetupViewedItemData::CallFunc_MakeLiteralName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetupViewedItemData, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000108, "Member 'AthenaSeasonTab_C_SetupViewedItemData::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.UpdateSeasonPurchaseState
// 0x0100 (0x0100 - 0x0000)
struct AthenaSeasonTab_C_UpdateSeasonPurchaseState final
{
public:
	class FText                                   CallFunc_GetName_ReturnValue;                      // 0x0000(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0068(0x0018)()
	int32                                         CallFunc_GetSeasonPassLevel_ReturnValue;           // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0088(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array2;                           // 0x00C8(0x0010)(ZeroConstructor, ReferenceParm)
	class UFortSeasonPassLevelInfo*               CallFunc_GetLevelInfo_ReturnValue;                 // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue2;                      // 0x00E0(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OwnsSeasonPass_ReturnValue;               // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSeasonTab_C_UpdateSeasonPurchaseState) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_UpdateSeasonPurchaseState");
static_assert(sizeof(AthenaSeasonTab_C_UpdateSeasonPurchaseState) == 0x000100, "Wrong size on AthenaSeasonTab_C_UpdateSeasonPurchaseState");
static_assert(offsetof(AthenaSeasonTab_C_UpdateSeasonPurchaseState, CallFunc_GetName_ReturnValue) == 0x000000, "Member 'AthenaSeasonTab_C_UpdateSeasonPurchaseState::CallFunc_GetName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_UpdateSeasonPurchaseState, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'AthenaSeasonTab_C_UpdateSeasonPurchaseState::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_UpdateSeasonPurchaseState, K2Node_MakeArray_Array) == 0x000058, "Member 'AthenaSeasonTab_C_UpdateSeasonPurchaseState::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_UpdateSeasonPurchaseState, CallFunc_Format_ReturnValue) == 0x000068, "Member 'AthenaSeasonTab_C_UpdateSeasonPurchaseState::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_UpdateSeasonPurchaseState, CallFunc_GetSeasonPassLevel_ReturnValue) == 0x000080, "Member 'AthenaSeasonTab_C_UpdateSeasonPurchaseState::CallFunc_GetSeasonPassLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_UpdateSeasonPurchaseState, CallFunc_Add_IntInt_ReturnValue) == 0x000084, "Member 'AthenaSeasonTab_C_UpdateSeasonPurchaseState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_UpdateSeasonPurchaseState, K2Node_MakeStruct_FormatArgumentData2) == 0x000088, "Member 'AthenaSeasonTab_C_UpdateSeasonPurchaseState::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_UpdateSeasonPurchaseState, K2Node_MakeArray_Array2) == 0x0000C8, "Member 'AthenaSeasonTab_C_UpdateSeasonPurchaseState::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_UpdateSeasonPurchaseState, CallFunc_GetLevelInfo_ReturnValue) == 0x0000D8, "Member 'AthenaSeasonTab_C_UpdateSeasonPurchaseState::CallFunc_GetLevelInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_UpdateSeasonPurchaseState, CallFunc_Format_ReturnValue2) == 0x0000E0, "Member 'AthenaSeasonTab_C_UpdateSeasonPurchaseState::CallFunc_Format_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_UpdateSeasonPurchaseState, CallFunc_IsValid_ReturnValue) == 0x0000F8, "Member 'AthenaSeasonTab_C_UpdateSeasonPurchaseState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_UpdateSeasonPurchaseState, CallFunc_OwnsSeasonPass_ReturnValue) == 0x0000F9, "Member 'AthenaSeasonTab_C_UpdateSeasonPurchaseState::CallFunc_OwnsSeasonPass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_UpdateSeasonPurchaseState, CallFunc_IsValid_ReturnValue2) == 0x0000FA, "Member 'AthenaSeasonTab_C_UpdateSeasonPurchaseState::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_UpdateSeasonPurchaseState, CallFunc_Not_PreBool_ReturnValue) == 0x0000FB, "Member 'AthenaSeasonTab_C_UpdateSeasonPurchaseState::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_UpdateSeasonPurchaseState, CallFunc_BooleanAND_ReturnValue) == 0x0000FC, "Member 'AthenaSeasonTab_C_UpdateSeasonPurchaseState::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.UpdatePageCount
// 0x0040 (0x0040 - 0x0000)
struct AthenaSeasonTab_C_UpdatePageCount final
{
public:
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumWidgets_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue2;              // 0x0028(0x0018)()
};
static_assert(alignof(AthenaSeasonTab_C_UpdatePageCount) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_UpdatePageCount");
static_assert(sizeof(AthenaSeasonTab_C_UpdatePageCount) == 0x000040, "Wrong size on AthenaSeasonTab_C_UpdatePageCount");
static_assert(offsetof(AthenaSeasonTab_C_UpdatePageCount, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000000, "Member 'AthenaSeasonTab_C_UpdatePageCount::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_UpdatePageCount, CallFunc_GetNumWidgets_ReturnValue) == 0x000004, "Member 'AthenaSeasonTab_C_UpdatePageCount::CallFunc_GetNumWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_UpdatePageCount, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaSeasonTab_C_UpdatePageCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_UpdatePageCount, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'AthenaSeasonTab_C_UpdatePageCount::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_UpdatePageCount, CallFunc_Conv_IntToText_ReturnValue2) == 0x000028, "Member 'AthenaSeasonTab_C_UpdatePageCount::CallFunc_Conv_IntToText_ReturnValue2' has a wrong offset!");

// Function AthenaSeasonTab.AthenaSeasonTab_C.SetupViewedItemName
// 0x01B0 (0x01B0 - 0x0000)
struct AthenaSeasonTab_C_SetupViewedItemName final
{
public:
	class UFortItem*                              Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumInStack_ReturnValue;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTokenType*                         K2Node_DynamicCast_AsFort_Token_Type;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0068(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x00B0(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x00C8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData3;             // 0x00E0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0120(0x0010)(ZeroConstructor, ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData4;             // 0x0130(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0170(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array2;                           // 0x0188(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue2;                      // 0x0198(0x0018)()
};
static_assert(alignof(AthenaSeasonTab_C_SetupViewedItemName) == 0x000008, "Wrong alignment on AthenaSeasonTab_C_SetupViewedItemName");
static_assert(sizeof(AthenaSeasonTab_C_SetupViewedItemName) == 0x0001B0, "Wrong size on AthenaSeasonTab_C_SetupViewedItemName");
static_assert(offsetof(AthenaSeasonTab_C_SetupViewedItemName, Item) == 0x000000, "Member 'AthenaSeasonTab_C_SetupViewedItemName::Item' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetupViewedItemName, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000008, "Member 'AthenaSeasonTab_C_SetupViewedItemName::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonTab_C_SetupViewedItemName, CallFunc_GetNumInStack_ReturnValue) == 0x000010, "Member 'AthenaSeasonTab_C_SetupViewedItemName::CallFunc_GetNumInStack_ReturnValue' has a wrong offset!");
