#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDirectAcquisitionMTXDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaDirectAcquisitionMTXDetails.AthenaDirectAcquisitionMTXDetails_C
// 0x00D8 (0x04C8 - 0x03F0)
class UAthenaDirectAcquisitionMTXDetails_C final : public UFortDirectAcquisitionOfferDetailsWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 BaseColor;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BaseColorDetails;                                  // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BattlePassGlow;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               BonusCurrencySB;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderDisclaimer;                                  // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_BaseQuantity;                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_BonusQuantity;                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_2;                                 // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Highlight;                                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       KeyArt;                                            // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MTXCurrency;                                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OverlayGradient;                                   // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OverlayGradientDetails;                            // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlaySalePrice;                                  // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      PurchaseButton;                                    // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBoxDetails;                                  // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SeasonNumber;                                      // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStoreMain_OfferDetailsAttribute_C*     StoreMain_OfferDetailsAttribute;                   // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStoreMain_OfferDetailsAttribute_C*     StoreMain_OfferDetailsAttribute_C_0;               // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextDescription;                                   // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextName;                                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOfferDisplayPrice;                             // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOriginalPrice;                                 // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBoxOfferInfo;                                     // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaDirectAcquisitionMTXDetails(int32 EntryPoint);
	void Destruct();
	void Construct();
	void HandlePurchaseComplete(bool bSuccess);
	void BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_16_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnDeactivated();
	void OnActivated();
	void HandleBack(bool* Passthrough);
	void Init();
	void PopDetails();
	void InitPurchaseButton();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaDirectAcquisitionMTXDetails_C">();
	}
	static class UAthenaDirectAcquisitionMTXDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaDirectAcquisitionMTXDetails_C>();
	}
};
static_assert(alignof(UAthenaDirectAcquisitionMTXDetails_C) == 0x000008, "Wrong alignment on UAthenaDirectAcquisitionMTXDetails_C");
static_assert(sizeof(UAthenaDirectAcquisitionMTXDetails_C) == 0x0004C8, "Wrong size on UAthenaDirectAcquisitionMTXDetails_C");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, UberGraphFrame) == 0x0003F0, "Member 'UAthenaDirectAcquisitionMTXDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, BaseColor) == 0x0003F8, "Member 'UAthenaDirectAcquisitionMTXDetails_C::BaseColor' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, BaseColorDetails) == 0x000400, "Member 'UAthenaDirectAcquisitionMTXDetails_C::BaseColorDetails' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, BattlePassGlow) == 0x000408, "Member 'UAthenaDirectAcquisitionMTXDetails_C::BattlePassGlow' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, BonusCurrencySB) == 0x000410, "Member 'UAthenaDirectAcquisitionMTXDetails_C::BonusCurrencySB' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, BorderDisclaimer) == 0x000418, "Member 'UAthenaDirectAcquisitionMTXDetails_C::BorderDisclaimer' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, CommonText_BaseQuantity) == 0x000420, "Member 'UAthenaDirectAcquisitionMTXDetails_C::CommonText_BaseQuantity' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, CommonText_BonusQuantity) == 0x000428, "Member 'UAthenaDirectAcquisitionMTXDetails_C::CommonText_BonusQuantity' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, CommonTextBlock_2) == 0x000430, "Member 'UAthenaDirectAcquisitionMTXDetails_C::CommonTextBlock_2' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, Highlight) == 0x000438, "Member 'UAthenaDirectAcquisitionMTXDetails_C::Highlight' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, Image_0) == 0x000440, "Member 'UAthenaDirectAcquisitionMTXDetails_C::Image_0' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, KeyArt) == 0x000448, "Member 'UAthenaDirectAcquisitionMTXDetails_C::KeyArt' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, MTXCurrency) == 0x000450, "Member 'UAthenaDirectAcquisitionMTXDetails_C::MTXCurrency' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, OverlayGradient) == 0x000458, "Member 'UAthenaDirectAcquisitionMTXDetails_C::OverlayGradient' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, OverlayGradientDetails) == 0x000460, "Member 'UAthenaDirectAcquisitionMTXDetails_C::OverlayGradientDetails' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, OverlaySalePrice) == 0x000468, "Member 'UAthenaDirectAcquisitionMTXDetails_C::OverlaySalePrice' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, PurchaseButton) == 0x000470, "Member 'UAthenaDirectAcquisitionMTXDetails_C::PurchaseButton' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, SafeZone_0) == 0x000478, "Member 'UAthenaDirectAcquisitionMTXDetails_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, ScrollBoxDetails) == 0x000480, "Member 'UAthenaDirectAcquisitionMTXDetails_C::ScrollBoxDetails' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, SeasonNumber) == 0x000488, "Member 'UAthenaDirectAcquisitionMTXDetails_C::SeasonNumber' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, StoreMain_OfferDetailsAttribute) == 0x000490, "Member 'UAthenaDirectAcquisitionMTXDetails_C::StoreMain_OfferDetailsAttribute' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, StoreMain_OfferDetailsAttribute_C_0) == 0x000498, "Member 'UAthenaDirectAcquisitionMTXDetails_C::StoreMain_OfferDetailsAttribute_C_0' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, TextDescription) == 0x0004A0, "Member 'UAthenaDirectAcquisitionMTXDetails_C::TextDescription' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, TextName) == 0x0004A8, "Member 'UAthenaDirectAcquisitionMTXDetails_C::TextName' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, TextOfferDisplayPrice) == 0x0004B0, "Member 'UAthenaDirectAcquisitionMTXDetails_C::TextOfferDisplayPrice' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, TextOriginalPrice) == 0x0004B8, "Member 'UAthenaDirectAcquisitionMTXDetails_C::TextOriginalPrice' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionMTXDetails_C, VBoxOfferInfo) == 0x0004C0, "Member 'UAthenaDirectAcquisitionMTXDetails_C::VBoxOfferInfo' has a wrong offset!");

}

