#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSeasonLevelConfirmationModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaSeasonLevelConfirmationModal.AthenaSeasonLevelConfirmationModal_C.ExecuteUbergraph_AthenaSeasonLevelConfirmationModal
// 0x00A0 (0x00A0 - 0x0000)
struct AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button6;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button5;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue2;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button4;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button3;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfTiersBuying_ReturnValue;       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue2;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue2;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bSuccess)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetNumberOfTiersBuying_ReturnValue2;      // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOfferPurchaseError                           CallFunc_PurchaseOffer_ReturnValue;                // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue3;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOfferPurchaseError                           CallFunc_CanPurchaseOffer_ReturnValue;             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal) == 0x000008, "Wrong alignment on AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal");
static_assert(sizeof(AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal) == 0x0000A0, "Wrong size on AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal, EntryPoint) == 0x000000, "Member 'AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal, K2Node_ComponentBoundEvent_Button6) == 0x000008, "Member 'AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal::K2Node_ComponentBoundEvent_Button6' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal, K2Node_ComponentBoundEvent_Button5) == 0x000010, "Member 'AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal::K2Node_ComponentBoundEvent_Button5' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000018, "Member 'AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal, K2Node_CustomEvent_bSuccess) == 0x000028, "Member 'AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal::K2Node_CustomEvent_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal, CallFunc_GetUIManagerWidget_ReturnValue2) == 0x000030, "Member 'AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal::CallFunc_GetUIManagerWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal, K2Node_ComponentBoundEvent_Button4) == 0x000038, "Member 'AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal::K2Node_ComponentBoundEvent_Button4' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal, K2Node_ComponentBoundEvent_Button3) == 0x000040, "Member 'AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal, CallFunc_GetNumberOfTiersBuying_ReturnValue) == 0x000048, "Member 'AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal::CallFunc_GetNumberOfTiersBuying_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal, K2Node_ComponentBoundEvent_Button2) == 0x000050, "Member 'AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal, K2Node_ComponentBoundEvent_Button) == 0x000058, "Member 'AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal, CallFunc_GetUINavigationManager_ReturnValue) == 0x000060, "Member 'AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal, CallFunc_GetUINavigationManager_ReturnValue2) == 0x000068, "Member 'AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal::CallFunc_GetUINavigationManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal, CallFunc_GetContext_ReturnValue2) == 0x000070, "Member 'AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal, K2Node_CreateDelegate_OutputDelegate) == 0x000078, "Member 'AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal, CallFunc_GetNumberOfTiersBuying_ReturnValue2) == 0x000088, "Member 'AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal::CallFunc_GetNumberOfTiersBuying_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal, CallFunc_PurchaseOffer_ReturnValue) == 0x00008C, "Member 'AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal::CallFunc_PurchaseOffer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal, CallFunc_GetUIManagerWidget_ReturnValue3) == 0x000090, "Member 'AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal::CallFunc_GetUIManagerWidget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal, CallFunc_CanPurchaseOffer_ReturnValue) == 0x000098, "Member 'AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal::CallFunc_CanPurchaseOffer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000099, "Member 'AthenaSeasonLevelConfirmationModal_C_ExecuteUbergraph_AthenaSeasonLevelConfirmationModal::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function AthenaSeasonLevelConfirmationModal.AthenaSeasonLevelConfirmationModal_C.BndEvt__Less_K2Node_ComponentBoundEvent_355_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonLevelConfirmationModal_C_BndEvt__Less_K2Node_ComponentBoundEvent_355_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonLevelConfirmationModal_C_BndEvt__Less_K2Node_ComponentBoundEvent_355_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaSeasonLevelConfirmationModal_C_BndEvt__Less_K2Node_ComponentBoundEvent_355_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaSeasonLevelConfirmationModal_C_BndEvt__Less_K2Node_ComponentBoundEvent_355_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaSeasonLevelConfirmationModal_C_BndEvt__Less_K2Node_ComponentBoundEvent_355_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_BndEvt__Less_K2Node_ComponentBoundEvent_355_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaSeasonLevelConfirmationModal_C_BndEvt__Less_K2Node_ComponentBoundEvent_355_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaSeasonLevelConfirmationModal.AthenaSeasonLevelConfirmationModal_C.BndEvt__More_K2Node_ComponentBoundEvent_342_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonLevelConfirmationModal_C_BndEvt__More_K2Node_ComponentBoundEvent_342_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonLevelConfirmationModal_C_BndEvt__More_K2Node_ComponentBoundEvent_342_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaSeasonLevelConfirmationModal_C_BndEvt__More_K2Node_ComponentBoundEvent_342_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaSeasonLevelConfirmationModal_C_BndEvt__More_K2Node_ComponentBoundEvent_342_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaSeasonLevelConfirmationModal_C_BndEvt__More_K2Node_ComponentBoundEvent_342_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_BndEvt__More_K2Node_ComponentBoundEvent_342_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaSeasonLevelConfirmationModal_C_BndEvt__More_K2Node_ComponentBoundEvent_342_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaSeasonLevelConfirmationModal.AthenaSeasonLevelConfirmationModal_C.BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_162_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonLevelConfirmationModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_162_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonLevelConfirmationModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_162_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaSeasonLevelConfirmationModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_162_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaSeasonLevelConfirmationModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_162_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaSeasonLevelConfirmationModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_162_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_162_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaSeasonLevelConfirmationModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_162_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaSeasonLevelConfirmationModal.AthenaSeasonLevelConfirmationModal_C.BndEvt__IconTextButton_C_1_K2Node_ComponentBoundEvent_145_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonLevelConfirmationModal_C_BndEvt__IconTextButton_C_1_K2Node_ComponentBoundEvent_145_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonLevelConfirmationModal_C_BndEvt__IconTextButton_C_1_K2Node_ComponentBoundEvent_145_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaSeasonLevelConfirmationModal_C_BndEvt__IconTextButton_C_1_K2Node_ComponentBoundEvent_145_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaSeasonLevelConfirmationModal_C_BndEvt__IconTextButton_C_1_K2Node_ComponentBoundEvent_145_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaSeasonLevelConfirmationModal_C_BndEvt__IconTextButton_C_1_K2Node_ComponentBoundEvent_145_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_BndEvt__IconTextButton_C_1_K2Node_ComponentBoundEvent_145_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaSeasonLevelConfirmationModal_C_BndEvt__IconTextButton_C_1_K2Node_ComponentBoundEvent_145_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaSeasonLevelConfirmationModal.AthenaSeasonLevelConfirmationModal_C.OnPurchaseFinished
// 0x0001 (0x0001 - 0x0000)
struct AthenaSeasonLevelConfirmationModal_C_OnPurchaseFinished final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSeasonLevelConfirmationModal_C_OnPurchaseFinished) == 0x000001, "Wrong alignment on AthenaSeasonLevelConfirmationModal_C_OnPurchaseFinished");
static_assert(sizeof(AthenaSeasonLevelConfirmationModal_C_OnPurchaseFinished) == 0x000001, "Wrong size on AthenaSeasonLevelConfirmationModal_C_OnPurchaseFinished");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_OnPurchaseFinished, bSuccess) == 0x000000, "Member 'AthenaSeasonLevelConfirmationModal_C_OnPurchaseFinished::bSuccess' has a wrong offset!");

// Function AthenaSeasonLevelConfirmationModal.AthenaSeasonLevelConfirmationModal_C.BndEvt__PurchaseBtn_K2Node_ComponentBoundEvent_49_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonLevelConfirmationModal_C_BndEvt__PurchaseBtn_K2Node_ComponentBoundEvent_49_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonLevelConfirmationModal_C_BndEvt__PurchaseBtn_K2Node_ComponentBoundEvent_49_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaSeasonLevelConfirmationModal_C_BndEvt__PurchaseBtn_K2Node_ComponentBoundEvent_49_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaSeasonLevelConfirmationModal_C_BndEvt__PurchaseBtn_K2Node_ComponentBoundEvent_49_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaSeasonLevelConfirmationModal_C_BndEvt__PurchaseBtn_K2Node_ComponentBoundEvent_49_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_BndEvt__PurchaseBtn_K2Node_ComponentBoundEvent_49_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaSeasonLevelConfirmationModal_C_BndEvt__PurchaseBtn_K2Node_ComponentBoundEvent_49_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaSeasonLevelConfirmationModal.AthenaSeasonLevelConfirmationModal_C.BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonLevelConfirmationModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonLevelConfirmationModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaSeasonLevelConfirmationModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaSeasonLevelConfirmationModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaSeasonLevelConfirmationModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaSeasonLevelConfirmationModal_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaSeasonLevelConfirmationModal.AthenaSeasonLevelConfirmationModal_C.InitWidgets
// 0x00A8 (0x00A8 - 0x0000)
struct AthenaSeasonLevelConfirmationModal_C_InitWidgets final
{
public:
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortPrivateAccountInfo                CallFunc_GetLocalAccountInfo_Result;               // 0x0010(0x0038)(NoDestructor)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue2;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOfferPurchaseError                           CallFunc_CanPurchaseOffer_ReturnValue;             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue2;            // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue3;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetVBuckPrice_ReturnValue;                // 0x0078(0x0018)()
	class FText                                   CallFunc_GetHeaderText_Result;                     // 0x0090(0x0018)()
};
static_assert(alignof(AthenaSeasonLevelConfirmationModal_C_InitWidgets) == 0x000008, "Wrong alignment on AthenaSeasonLevelConfirmationModal_C_InitWidgets");
static_assert(sizeof(AthenaSeasonLevelConfirmationModal_C_InitWidgets) == 0x0000A8, "Wrong size on AthenaSeasonLevelConfirmationModal_C_InitWidgets");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_InitWidgets, CallFunc_Add_IntInt_ReturnValue) == 0x000000, "Member 'AthenaSeasonLevelConfirmationModal_C_InitWidgets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_InitWidgets, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000004, "Member 'AthenaSeasonLevelConfirmationModal_C_InitWidgets::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_InitWidgets, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaSeasonLevelConfirmationModal_C_InitWidgets::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_InitWidgets, CallFunc_GetLocalAccountInfo_Result) == 0x000010, "Member 'AthenaSeasonLevelConfirmationModal_C_InitWidgets::CallFunc_GetLocalAccountInfo_Result' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_InitWidgets, CallFunc_GetContext_ReturnValue2) == 0x000048, "Member 'AthenaSeasonLevelConfirmationModal_C_InitWidgets::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_InitWidgets, CallFunc_Add_IntInt_ReturnValue2) == 0x000050, "Member 'AthenaSeasonLevelConfirmationModal_C_InitWidgets::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_InitWidgets, CallFunc_CanPurchaseOffer_ReturnValue) == 0x000054, "Member 'AthenaSeasonLevelConfirmationModal_C_InitWidgets::CallFunc_CanPurchaseOffer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_InitWidgets, CallFunc_Multiply_IntInt_ReturnValue) == 0x000058, "Member 'AthenaSeasonLevelConfirmationModal_C_InitWidgets::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_InitWidgets, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00005C, "Member 'AthenaSeasonLevelConfirmationModal_C_InitWidgets::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_InitWidgets, CallFunc_LessEqual_IntInt_ReturnValue2) == 0x00005D, "Member 'AthenaSeasonLevelConfirmationModal_C_InitWidgets::CallFunc_LessEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_InitWidgets, CallFunc_GetLevel_ReturnValue) == 0x000060, "Member 'AthenaSeasonLevelConfirmationModal_C_InitWidgets::CallFunc_GetLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_InitWidgets, CallFunc_Add_IntInt_ReturnValue3) == 0x000064, "Member 'AthenaSeasonLevelConfirmationModal_C_InitWidgets::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_InitWidgets, CallFunc_Greater_IntInt_ReturnValue) == 0x000068, "Member 'AthenaSeasonLevelConfirmationModal_C_InitWidgets::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_InitWidgets, CallFunc_Add_IntInt_ReturnValue4) == 0x00006C, "Member 'AthenaSeasonLevelConfirmationModal_C_InitWidgets::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_InitWidgets, CallFunc_LessEqual_IntInt_ReturnValue3) == 0x000070, "Member 'AthenaSeasonLevelConfirmationModal_C_InitWidgets::CallFunc_LessEqual_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_InitWidgets, CallFunc_BooleanAND_ReturnValue) == 0x000071, "Member 'AthenaSeasonLevelConfirmationModal_C_InitWidgets::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_InitWidgets, CallFunc_BooleanAND_ReturnValue2) == 0x000072, "Member 'AthenaSeasonLevelConfirmationModal_C_InitWidgets::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_InitWidgets, CallFunc_GetVBuckPrice_ReturnValue) == 0x000078, "Member 'AthenaSeasonLevelConfirmationModal_C_InitWidgets::CallFunc_GetVBuckPrice_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_InitWidgets, CallFunc_GetHeaderText_Result) == 0x000090, "Member 'AthenaSeasonLevelConfirmationModal_C_InitWidgets::CallFunc_GetHeaderText_Result' has a wrong offset!");

// Function AthenaSeasonLevelConfirmationModal.AthenaSeasonLevelConfirmationModal_C.Setup
// 0x0060 (0x0060 - 0x0000)
struct AthenaSeasonLevelConfirmationModal_C_Setup final
{
public:
	class UFortSeasonPassLevelInfo*               Level;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, class UFortSeasonPassLevelInfo*>  AllLevels;                                         // 0x0008(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         MaxLevel;                                          // 0x0058(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonLevelConfirmationModal_C_Setup) == 0x000008, "Wrong alignment on AthenaSeasonLevelConfirmationModal_C_Setup");
static_assert(sizeof(AthenaSeasonLevelConfirmationModal_C_Setup) == 0x000060, "Wrong size on AthenaSeasonLevelConfirmationModal_C_Setup");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_Setup, Level) == 0x000000, "Member 'AthenaSeasonLevelConfirmationModal_C_Setup::Level' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_Setup, AllLevels) == 0x000008, "Member 'AthenaSeasonLevelConfirmationModal_C_Setup::AllLevels' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_Setup, MaxLevel) == 0x000058, "Member 'AthenaSeasonLevelConfirmationModal_C_Setup::MaxLevel' has a wrong offset!");

// Function AthenaSeasonLevelConfirmationModal.AthenaSeasonLevelConfirmationModal_C.GetHeaderText
// 0x0160 (0x0160 - 0x0000)
struct AthenaSeasonLevelConfirmationModal_C_GetHeaderText final
{
public:
	class FText                                   Result;                                            // 0x0000(0x0018)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0070(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_GetLevel_ReturnValue2;                    // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ZeroConstructor, ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData3;             // 0x00C8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0108(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array2;                           // 0x0120(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue2;                      // 0x0130(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0148(0x0018)()
};
static_assert(alignof(AthenaSeasonLevelConfirmationModal_C_GetHeaderText) == 0x000008, "Wrong alignment on AthenaSeasonLevelConfirmationModal_C_GetHeaderText");
static_assert(sizeof(AthenaSeasonLevelConfirmationModal_C_GetHeaderText) == 0x000160, "Wrong size on AthenaSeasonLevelConfirmationModal_C_GetHeaderText");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetHeaderText, Result) == 0x000000, "Member 'AthenaSeasonLevelConfirmationModal_C_GetHeaderText::Result' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetHeaderText, Temp_bool_Variable) == 0x000018, "Member 'AthenaSeasonLevelConfirmationModal_C_GetHeaderText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetHeaderText, CallFunc_GetLevel_ReturnValue) == 0x00001C, "Member 'AthenaSeasonLevelConfirmationModal_C_GetHeaderText::CallFunc_GetLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetHeaderText, CallFunc_Greater_IntInt_ReturnValue) == 0x000020, "Member 'AthenaSeasonLevelConfirmationModal_C_GetHeaderText::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetHeaderText, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'AthenaSeasonLevelConfirmationModal_C_GetHeaderText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetHeaderText, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'AthenaSeasonLevelConfirmationModal_C_GetHeaderText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetHeaderText, K2Node_MakeStruct_FormatArgumentData2) == 0x000070, "Member 'AthenaSeasonLevelConfirmationModal_C_GetHeaderText::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetHeaderText, CallFunc_GetLevel_ReturnValue2) == 0x0000B0, "Member 'AthenaSeasonLevelConfirmationModal_C_GetHeaderText::CallFunc_GetLevel_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetHeaderText, K2Node_MakeArray_Array) == 0x0000B8, "Member 'AthenaSeasonLevelConfirmationModal_C_GetHeaderText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetHeaderText, K2Node_MakeStruct_FormatArgumentData3) == 0x0000C8, "Member 'AthenaSeasonLevelConfirmationModal_C_GetHeaderText::K2Node_MakeStruct_FormatArgumentData3' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetHeaderText, CallFunc_Format_ReturnValue) == 0x000108, "Member 'AthenaSeasonLevelConfirmationModal_C_GetHeaderText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetHeaderText, K2Node_MakeArray_Array2) == 0x000120, "Member 'AthenaSeasonLevelConfirmationModal_C_GetHeaderText::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetHeaderText, CallFunc_Format_ReturnValue2) == 0x000130, "Member 'AthenaSeasonLevelConfirmationModal_C_GetHeaderText::CallFunc_Format_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetHeaderText, K2Node_Select_Default) == 0x000148, "Member 'AthenaSeasonLevelConfirmationModal_C_GetHeaderText::K2Node_Select_Default' has a wrong offset!");

// Function AthenaSeasonLevelConfirmationModal.AthenaSeasonLevelConfirmationModal_C.GetRewards
// 0x0068 (0x0068 - 0x0000)
struct AthenaSeasonLevelConfirmationModal_C_GetRewards final
{
public:
	TArray<class UFortItem*>                      Output_Get;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor)
	TArray<class UFortItem*>                      Rewards;                                           // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSeasonPassLevelInfo*               CallFunc_Map_Find_Value;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortItem*>                      CallFunc_GetRewardItems_ReturnValue;               // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UFortItem*>                      CallFunc_GetRewardItems_ReturnValue2;              // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(AthenaSeasonLevelConfirmationModal_C_GetRewards) == 0x000008, "Wrong alignment on AthenaSeasonLevelConfirmationModal_C_GetRewards");
static_assert(sizeof(AthenaSeasonLevelConfirmationModal_C_GetRewards) == 0x000068, "Wrong size on AthenaSeasonLevelConfirmationModal_C_GetRewards");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetRewards, Output_Get) == 0x000000, "Member 'AthenaSeasonLevelConfirmationModal_C_GetRewards::Output_Get' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetRewards, Rewards) == 0x000010, "Member 'AthenaSeasonLevelConfirmationModal_C_GetRewards::Rewards' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetRewards, Temp_int_Variable) == 0x000020, "Member 'AthenaSeasonLevelConfirmationModal_C_GetRewards::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetRewards, CallFunc_GetLevel_ReturnValue) == 0x000024, "Member 'AthenaSeasonLevelConfirmationModal_C_GetRewards::CallFunc_GetLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetRewards, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'AthenaSeasonLevelConfirmationModal_C_GetRewards::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetRewards, CallFunc_Add_IntInt_ReturnValue2) == 0x00002C, "Member 'AthenaSeasonLevelConfirmationModal_C_GetRewards::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetRewards, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000030, "Member 'AthenaSeasonLevelConfirmationModal_C_GetRewards::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetRewards, CallFunc_Map_Find_Value) == 0x000038, "Member 'AthenaSeasonLevelConfirmationModal_C_GetRewards::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetRewards, CallFunc_Map_Find_ReturnValue) == 0x000040, "Member 'AthenaSeasonLevelConfirmationModal_C_GetRewards::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetRewards, CallFunc_GetRewardItems_ReturnValue) == 0x000048, "Member 'AthenaSeasonLevelConfirmationModal_C_GetRewards::CallFunc_GetRewardItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetRewards, CallFunc_GetRewardItems_ReturnValue2) == 0x000058, "Member 'AthenaSeasonLevelConfirmationModal_C_GetRewards::CallFunc_GetRewardItems_ReturnValue2' has a wrong offset!");

// Function AthenaSeasonLevelConfirmationModal.AthenaSeasonLevelConfirmationModal_C.GetVBuckPrice
// 0x0040 (0x0040 - 0x0000)
struct AthenaSeasonLevelConfirmationModal_C_GetVBuckPrice final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0018)()
};
static_assert(alignof(AthenaSeasonLevelConfirmationModal_C_GetVBuckPrice) == 0x000008, "Wrong alignment on AthenaSeasonLevelConfirmationModal_C_GetVBuckPrice");
static_assert(sizeof(AthenaSeasonLevelConfirmationModal_C_GetVBuckPrice) == 0x000040, "Wrong size on AthenaSeasonLevelConfirmationModal_C_GetVBuckPrice");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetVBuckPrice, ReturnValue) == 0x000000, "Member 'AthenaSeasonLevelConfirmationModal_C_GetVBuckPrice::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetVBuckPrice, CallFunc_MakeLiteralInt_ReturnValue) == 0x000018, "Member 'AthenaSeasonLevelConfirmationModal_C_GetVBuckPrice::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetVBuckPrice, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'AthenaSeasonLevelConfirmationModal_C_GetVBuckPrice::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetVBuckPrice, CallFunc_Multiply_IntInt_ReturnValue) == 0x000020, "Member 'AthenaSeasonLevelConfirmationModal_C_GetVBuckPrice::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetVBuckPrice, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'AthenaSeasonLevelConfirmationModal_C_GetVBuckPrice::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function AthenaSeasonLevelConfirmationModal.AthenaSeasonLevelConfirmationModal_C.GetNumberOfTiersBuying
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonLevelConfirmationModal_C_GetNumberOfTiersBuying final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonLevelConfirmationModal_C_GetNumberOfTiersBuying) == 0x000004, "Wrong alignment on AthenaSeasonLevelConfirmationModal_C_GetNumberOfTiersBuying");
static_assert(sizeof(AthenaSeasonLevelConfirmationModal_C_GetNumberOfTiersBuying) == 0x000008, "Wrong size on AthenaSeasonLevelConfirmationModal_C_GetNumberOfTiersBuying");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetNumberOfTiersBuying, ReturnValue) == 0x000000, "Member 'AthenaSeasonLevelConfirmationModal_C_GetNumberOfTiersBuying::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GetNumberOfTiersBuying, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'AthenaSeasonLevelConfirmationModal_C_GetNumberOfTiersBuying::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaSeasonLevelConfirmationModal.AthenaSeasonLevelConfirmationModal_C.GenerateItemWidgets
// 0x0048 (0x0048 - 0x0000)
struct AthenaSeasonLevelConfirmationModal_C_GenerateItemWidgets final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortItem*>                      CallFunc_GetRewards_Output_Get;                    // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaSeasonReward_C*                  CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonLevelConfirmationModal_C_GenerateItemWidgets) == 0x000008, "Wrong alignment on AthenaSeasonLevelConfirmationModal_C_GenerateItemWidgets");
static_assert(sizeof(AthenaSeasonLevelConfirmationModal_C_GenerateItemWidgets) == 0x000048, "Wrong size on AthenaSeasonLevelConfirmationModal_C_GenerateItemWidgets");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GenerateItemWidgets, Temp_int_Array_Index_Variable) == 0x000000, "Member 'AthenaSeasonLevelConfirmationModal_C_GenerateItemWidgets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GenerateItemWidgets, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'AthenaSeasonLevelConfirmationModal_C_GenerateItemWidgets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GenerateItemWidgets, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaSeasonLevelConfirmationModal_C_GenerateItemWidgets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GenerateItemWidgets, CallFunc_GetRewards_Output_Get) == 0x000010, "Member 'AthenaSeasonLevelConfirmationModal_C_GenerateItemWidgets::CallFunc_GetRewards_Output_Get' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GenerateItemWidgets, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'AthenaSeasonLevelConfirmationModal_C_GenerateItemWidgets::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GenerateItemWidgets, CallFunc_Array_Get_Item) == 0x000028, "Member 'AthenaSeasonLevelConfirmationModal_C_GenerateItemWidgets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GenerateItemWidgets, CallFunc_Create_ReturnValue) == 0x000030, "Member 'AthenaSeasonLevelConfirmationModal_C_GenerateItemWidgets::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GenerateItemWidgets, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'AthenaSeasonLevelConfirmationModal_C_GenerateItemWidgets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GenerateItemWidgets, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'AthenaSeasonLevelConfirmationModal_C_GenerateItemWidgets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_GenerateItemWidgets, CallFunc_AddChild_ReturnValue) == 0x000040, "Member 'AthenaSeasonLevelConfirmationModal_C_GenerateItemWidgets::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function AthenaSeasonLevelConfirmationModal.AthenaSeasonLevelConfirmationModal_C.ModifyNumberOfTiersToBuy
// 0x0010 (0x0010 - 0x0000)
struct AthenaSeasonLevelConfirmationModal_C_ModifyNumberOfTiersToBuy final
{
public:
	int32                                         Delta;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonLevelConfirmationModal_C_ModifyNumberOfTiersToBuy) == 0x000004, "Wrong alignment on AthenaSeasonLevelConfirmationModal_C_ModifyNumberOfTiersToBuy");
static_assert(sizeof(AthenaSeasonLevelConfirmationModal_C_ModifyNumberOfTiersToBuy) == 0x000010, "Wrong size on AthenaSeasonLevelConfirmationModal_C_ModifyNumberOfTiersToBuy");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_ModifyNumberOfTiersToBuy, Delta) == 0x000000, "Member 'AthenaSeasonLevelConfirmationModal_C_ModifyNumberOfTiersToBuy::Delta' has a wrong offset!");
static_assert(offsetof(AthenaSeasonLevelConfirmationModal_C_ModifyNumberOfTiersToBuy, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'AthenaSeasonLevelConfirmationModal_C_ModifyNumberOfTiersToBuy::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
