#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDirectAcquisitionOfferDetailsWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaDirectAcquisitionOfferDetailsWidget.AthenaDirectAcquisitionOfferDetailsWidget_C.ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget
// 0x0138 (0x0138 - 0x0000)
struct AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             K2Node_CustomEvent_Result;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               Temp_byte_Variable2;                               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortDirectAcquisitionOfferInfo*        CallFunc_GetOfferInfo_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUnique_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAccountItemDefinition*             CallFunc_GetFirstGrantItemDefinition_ReturnValue;  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button3;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0050(0x0010)(NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate2;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0090(0x0040)(HasGetValueTypeHash)
	EFrontEndCamera                               Temp_byte_Variable3;                               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0018)()
	class UFortDirectAcquisitionOfferInfo*        CallFunc_GetOfferInfo_ReturnValue2;                // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItemDefinition*             CallFunc_GetCurrencyItemDefinition_ReturnValue;    // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemIcon*                          CallFunc_SpawnObject_ReturnValue;                  // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               K2Node_Select_Default;                             // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0133(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget");
static_assert(sizeof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget) == 0x000138, "Wrong size on AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, EntryPoint) == 0x000000, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, K2Node_CustomEvent_Result) == 0x000004, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, K2Node_CustomEvent_ResultName) == 0x000008, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::K2Node_CustomEvent_ResultName' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, Temp_name_Variable) == 0x000020, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, Temp_byte_Variable) == 0x000028, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, Temp_byte_Variable2) == 0x000029, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, CallFunc_GetOfferInfo_ReturnValue) == 0x000030, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, CallFunc_IsUnique_ReturnValue) == 0x000038, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::CallFunc_IsUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, CallFunc_GetFirstGrantItemDefinition_ReturnValue) == 0x000040, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::CallFunc_GetFirstGrantItemDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, K2Node_ComponentBoundEvent_Button3) == 0x000048, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, K2Node_MakeStruct_DataTableRowHandle) == 0x000050, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, K2Node_CreateDelegate_OutputDelegate2) == 0x000060, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, CallFunc_GetUINavigationManager_ReturnValue) == 0x000070, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, K2Node_ComponentBoundEvent_Button2) == 0x000078, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, K2Node_ComponentBoundEvent_Button) == 0x000080, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000088, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, CallFunc_Subtract_IntInt_ReturnValue) == 0x00008C, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, K2Node_MakeStruct_FormatArgumentData) == 0x000090, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, Temp_byte_Variable3) == 0x0000D0, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, K2Node_MakeArray_Array) == 0x0000D8, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, CallFunc_GetOfferInfo_ReturnValue2) == 0x000100, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::CallFunc_GetOfferInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, CallFunc_GetContext_ReturnValue) == 0x000108, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, CallFunc_GetCurrencyItemDefinition_ReturnValue) == 0x000110, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::CallFunc_GetCurrencyItemDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, CallFunc_SpawnObject_ReturnValue) == 0x000118, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, Temp_bool_Variable) == 0x000120, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue) == 0x000128, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, K2Node_Select_Default) == 0x000130, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, CallFunc_IsValid_ReturnValue) == 0x000131, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, CallFunc_BooleanAND_ReturnValue) == 0x000132, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget, CallFunc_BooleanAND_ReturnValue2) == 0x000133, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferDetailsWidget.AthenaDirectAcquisitionOfferDetailsWidget_C.BndEvt__QuantityToPurchaseRight_K2Node_ComponentBoundEvent_794_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaDirectAcquisitionOfferDetailsWidget_C_BndEvt__QuantityToPurchaseRight_K2Node_ComponentBoundEvent_794_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferDetailsWidget_C_BndEvt__QuantityToPurchaseRight_K2Node_ComponentBoundEvent_794_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferDetailsWidget_C_BndEvt__QuantityToPurchaseRight_K2Node_ComponentBoundEvent_794_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaDirectAcquisitionOfferDetailsWidget_C_BndEvt__QuantityToPurchaseRight_K2Node_ComponentBoundEvent_794_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaDirectAcquisitionOfferDetailsWidget_C_BndEvt__QuantityToPurchaseRight_K2Node_ComponentBoundEvent_794_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_BndEvt__QuantityToPurchaseRight_K2Node_ComponentBoundEvent_794_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_BndEvt__QuantityToPurchaseRight_K2Node_ComponentBoundEvent_794_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferDetailsWidget.AthenaDirectAcquisitionOfferDetailsWidget_C.BndEvt__QuantityToPurchaseLeft_K2Node_ComponentBoundEvent_777_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaDirectAcquisitionOfferDetailsWidget_C_BndEvt__QuantityToPurchaseLeft_K2Node_ComponentBoundEvent_777_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferDetailsWidget_C_BndEvt__QuantityToPurchaseLeft_K2Node_ComponentBoundEvent_777_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferDetailsWidget_C_BndEvt__QuantityToPurchaseLeft_K2Node_ComponentBoundEvent_777_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaDirectAcquisitionOfferDetailsWidget_C_BndEvt__QuantityToPurchaseLeft_K2Node_ComponentBoundEvent_777_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaDirectAcquisitionOfferDetailsWidget_C_BndEvt__QuantityToPurchaseLeft_K2Node_ComponentBoundEvent_777_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_BndEvt__QuantityToPurchaseLeft_K2Node_ComponentBoundEvent_777_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_BndEvt__QuantityToPurchaseLeft_K2Node_ComponentBoundEvent_777_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferDetailsWidget.AthenaDirectAcquisitionOfferDetailsWidget_C.BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaDirectAcquisitionOfferDetailsWidget_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferDetailsWidget_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferDetailsWidget_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaDirectAcquisitionOfferDetailsWidget_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaDirectAcquisitionOfferDetailsWidget_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferDetailsWidget.AthenaDirectAcquisitionOfferDetailsWidget_C.DialogResult_9E262B7A4CA17B2146A54B8A29CFC473
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) AthenaDirectAcquisitionOfferDetailsWidget_C_DialogResult_9E262B7A4CA17B2146A54B8A29CFC473 final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferDetailsWidget_C_DialogResult_9E262B7A4CA17B2146A54B8A29CFC473) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferDetailsWidget_C_DialogResult_9E262B7A4CA17B2146A54B8A29CFC473");
static_assert(sizeof(AthenaDirectAcquisitionOfferDetailsWidget_C_DialogResult_9E262B7A4CA17B2146A54B8A29CFC473) == 0x000010, "Wrong size on AthenaDirectAcquisitionOfferDetailsWidget_C_DialogResult_9E262B7A4CA17B2146A54B8A29CFC473");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_DialogResult_9E262B7A4CA17B2146A54B8A29CFC473, Result) == 0x000000, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_DialogResult_9E262B7A4CA17B2146A54B8A29CFC473::Result' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_DialogResult_9E262B7A4CA17B2146A54B8A29CFC473, ResultName) == 0x000008, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_DialogResult_9E262B7A4CA17B2146A54B8A29CFC473::ResultName' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferDetailsWidget.AthenaDirectAcquisitionOfferDetailsWidget_C.UpdateFromOffer
// 0x0260 (0x0260 - 0x0000)
struct AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortDirectAcquisitionOfferInfo*        CallFunc_GetOfferInfo_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUnique_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortDirectAcquisitionOfferInfo*        CallFunc_GetOfferInfo_ReturnValue2;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItem*                       CallFunc_CreatePreviewItem_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortDirectAcquisitionOfferInfo*        CallFunc_GetOfferInfo_ReturnValue3;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExclusive_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortDirectAcquisitionOfferInfo*        CallFunc_GetOfferInfo_ReturnValue4;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItemDefinition*             CallFunc_GetFirstGrantItemDefinition_ReturnValue;  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaGliderItemDefinition*            K2Node_DynamicCast_AsAthena_Glider_Item_Definition; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue2;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateSizeRule                                Temp_byte_Variable3;                               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue2;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateSizeRule                                Temp_byte_Variable4;                               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateSizeRule                                Temp_byte_Variable5;                               // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateSizeRule                                K2Node_Select2_Default;                            // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateSizeRule                                Temp_byte_Variable6;                               // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x00AC(0x0008)(NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateSizeRule                                K2Node_Select3_Default;                            // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable8;                               // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize2;                 // 0x00B8(0x0008)(NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable9;                               // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select4_Default;                            // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable10;                              // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable5;                               // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select5_Default;                            // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable2;                              // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortDirectAcquisitionOfferInfo*        CallFunc_GetOfferInfo_ReturnValue5;                // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetShortDescription_ReturnValue;          // 0x00D8(0x0018)()
	class FText                                   CallFunc_GetDescription_ReturnValue;               // 0x00F0(0x0018)()
	class FText                                   CallFunc_GetName_ReturnValue;                      // 0x0108(0x0018)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0128(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortDirectAcquisitionOfferInfo*        CallFunc_GetOfferInfo_ReturnValue6;                // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortDirectAcquisitionOfferInfo*        CallFunc_GetOfferInfo_ReturnValue7;                // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFirstGrantQuantity_ReturnValue;        // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasDisplayAsset_ReturnValue;              // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortMtxDetailsAttribute>       CallFunc_GetDetailsAttributes_ReturnValue;         // 0x0160(0x0010)(ZeroConstructor, ReferenceParm)
	struct FFortMtxDetailsAttribute               CallFunc_Array_Get_Item;                           // 0x0170(0x0030)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAccountItemDefinition*             CallFunc_GetFirstGrantItemDefinition_ReturnValue2; // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   CallFunc_GetRarity_ReturnValue;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x01C0(0x0080)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStoreMain_OfferDetailsAttribute_C*     CallFunc_Create_ReturnValue;                       // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable6;                               // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select6_Default;                            // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer");
static_assert(sizeof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer) == 0x000260, "Wrong size on AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, Temp_int_Array_Index_Variable) == 0x000000, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_GetOfferInfo_ReturnValue) == 0x000008, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_IsUnique_ReturnValue) == 0x000010, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_IsUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, Temp_byte_Variable) == 0x000011, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_GetOfferInfo_ReturnValue2) == 0x000018, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_GetOfferInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_CreatePreviewItem_ReturnValue) == 0x000020, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_CreatePreviewItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000028, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000030, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_GetOfferInfo_ReturnValue3) == 0x000038, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_GetOfferInfo_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_IsExclusive_ReturnValue) == 0x000040, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_IsExclusive_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, Temp_byte_Variable2) == 0x000041, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_GetOfferInfo_ReturnValue4) == 0x000048, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_GetOfferInfo_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_GetFirstGrantItemDefinition_ReturnValue) == 0x000050, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_GetFirstGrantItemDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, K2Node_DynamicCast_AsAthena_Glider_Item_Definition) == 0x000058, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::K2Node_DynamicCast_AsAthena_Glider_Item_Definition' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, Temp_bool_Variable) == 0x000061, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000068, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, K2Node_Select_Default) == 0x000070, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_MakeLiteralName_ReturnValue) == 0x000078, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_MakeLiteralName_ReturnValue2) == 0x000080, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_MakeLiteralName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, Temp_byte_Variable3) == 0x000088, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_GetDynamicMaterial_ReturnValue2) == 0x000090, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_GetDynamicMaterial_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, Temp_byte_Variable4) == 0x000098, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x0000A0, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, Temp_bool_Variable2) == 0x0000A8, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, Temp_byte_Variable5) == 0x0000A9, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, K2Node_Select2_Default) == 0x0000AA, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, Temp_byte_Variable6) == 0x0000AB, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, K2Node_MakeStruct_SlateChildSize) == 0x0000AC, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, Temp_bool_Variable3) == 0x0000B4, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, Temp_byte_Variable7) == 0x0000B5, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, K2Node_Select3_Default) == 0x0000B6, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, Temp_byte_Variable8) == 0x0000B7, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, K2Node_MakeStruct_SlateChildSize2) == 0x0000B8, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::K2Node_MakeStruct_SlateChildSize2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, Temp_bool_Variable4) == 0x0000C0, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, Temp_byte_Variable9) == 0x0000C1, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::Temp_byte_Variable9' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, K2Node_Select4_Default) == 0x0000C2, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, Temp_byte_Variable10) == 0x0000C3, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::Temp_byte_Variable10' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, Temp_bool_Variable5) == 0x0000C4, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, K2Node_Select5_Default) == 0x0000C5, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::K2Node_Select5_Default' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, Temp_float_Variable) == 0x0000C8, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, Temp_float_Variable2) == 0x0000CC, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_GetOfferInfo_ReturnValue5) == 0x0000D0, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_GetOfferInfo_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_GetShortDescription_ReturnValue) == 0x0000D8, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_GetShortDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_GetDescription_ReturnValue) == 0x0000F0, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_GetDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_GetName_ReturnValue) == 0x000108, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_GetName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, Temp_int_Loop_Counter_Variable) == 0x000120, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_TextToUpper_ReturnValue) == 0x000128, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_Add_IntInt_ReturnValue) == 0x000140, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_GetOfferInfo_ReturnValue6) == 0x000148, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_GetOfferInfo_ReturnValue6' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_GetOfferInfo_ReturnValue7) == 0x000150, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_GetOfferInfo_ReturnValue7' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_GetFirstGrantQuantity_ReturnValue) == 0x000158, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_GetFirstGrantQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_HasDisplayAsset_ReturnValue) == 0x00015C, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_HasDisplayAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_GetDetailsAttributes_ReturnValue) == 0x000160, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_GetDetailsAttributes_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_Array_Get_Item) == 0x000170, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_Array_Length_ReturnValue) == 0x0001A0, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_Less_IntInt_ReturnValue) == 0x0001A4, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_GetFirstGrantItemDefinition_ReturnValue2) == 0x0001A8, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_GetFirstGrantItemDefinition_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_CreateTemporaryItemInstanceBP_ReturnValue) == 0x0001B0, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_CreateTemporaryItemInstanceBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_GetRarity_ReturnValue) == 0x0001B8, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_BPGetRarityData_ReturnValue) == 0x0001C0, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_GetOwningPlayer_ReturnValue) == 0x000240, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_Create_ReturnValue) == 0x000248, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000250, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, Temp_bool_Variable6) == 0x000258, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer, K2Node_Select6_Default) == 0x00025C, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_UpdateFromOffer::K2Node_Select6_Default' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferDetailsWidget.AthenaDirectAcquisitionOfferDetailsWidget_C.HandleBack
// 0x0028 (0x0028 - 0x0000)
struct AthenaDirectAcquisitionOfferDetailsWidget_C_HandleBack final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue2;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputManager*                    CallFunc_GetInputManager_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPanelOnStack_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferDetailsWidget_C_HandleBack) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferDetailsWidget_C_HandleBack");
static_assert(sizeof(AthenaDirectAcquisitionOfferDetailsWidget_C_HandleBack) == 0x000028, "Wrong size on AthenaDirectAcquisitionOfferDetailsWidget_C_HandleBack");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_HandleBack, Passthrough) == 0x000000, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_HandleBack::Passthrough' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_HandleBack, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_HandleBack::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_HandleBack, CallFunc_GetContext_ReturnValue2) == 0x000010, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_HandleBack::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_HandleBack, CallFunc_GetInputManager_ReturnValue) == 0x000018, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_HandleBack::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferDetailsWidget_C_HandleBack, CallFunc_IsPanelOnStack_ReturnValue) == 0x000020, "Member 'AthenaDirectAcquisitionOfferDetailsWidget_C_HandleBack::CallFunc_IsPanelOnStack_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferDetailsWidget.AthenaDirectAcquisitionOfferDetailsWidget_C.PopDetails
// 0x0008 (0x0008 - 0x0000)
struct AthenaDirectAcquisitionOfferDetailsWidget_C_PopDetails final
{
public:
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferDetailsWidget_C_PopDetails) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferDetailsWidget_C_PopDetails");
