#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaNewsModal

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaNewsModal.AthenaNewsModal_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaNewsModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaNewsModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaNewsModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaNewsModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaNewsModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaNewsModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaNewsModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaNewsModal.AthenaNewsModal_C.ExecuteUbergraph_AthenaNewsModal
// 0x0028 (0x0028 - 0x0000)
struct AthenaNewsModal_C_ExecuteUbergraph_AthenaNewsModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCMSContext*                            CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaNewsModal_C_ExecuteUbergraph_AthenaNewsModal) == 0x000008, "Wrong alignment on AthenaNewsModal_C_ExecuteUbergraph_AthenaNewsModal");
static_assert(sizeof(AthenaNewsModal_C_ExecuteUbergraph_AthenaNewsModal) == 0x000028, "Wrong size on AthenaNewsModal_C_ExecuteUbergraph_AthenaNewsModal");
static_assert(offsetof(AthenaNewsModal_C_ExecuteUbergraph_AthenaNewsModal, EntryPoint) == 0x000000, "Member 'AthenaNewsModal_C_ExecuteUbergraph_AthenaNewsModal::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaNewsModal_C_ExecuteUbergraph_AthenaNewsModal, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaNewsModal_C_ExecuteUbergraph_AthenaNewsModal::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaNewsModal_C_ExecuteUbergraph_AthenaNewsModal, K2Node_ComponentBoundEvent_Button) == 0x000010, "Member 'AthenaNewsModal_C_ExecuteUbergraph_AthenaNewsModal::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaNewsModal_C_ExecuteUbergraph_AthenaNewsModal, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000018, "Member 'AthenaNewsModal_C_ExecuteUbergraph_AthenaNewsModal::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaNewsModal_C_ExecuteUbergraph_AthenaNewsModal, CallFunc_GetUINavigationManager_ReturnValue) == 0x000020, "Member 'AthenaNewsModal_C_ExecuteUbergraph_AthenaNewsModal::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

}

