#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLobbyPlayerPanelDetails

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaLobbyPlayerPanelDetails.AthenaLobbyPlayerPanelDetails_C.ExecuteUbergraph_AthenaLobbyPlayerPanelDetails
// 0x0080 (0x0080 - 0x0000)
struct AthenaLobbyPlayerPanelDetails_C_ExecuteUbergraph_AthenaLobbyPlayerPanelDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable2;                             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable3;                             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable4;                             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0018)()
};
static_assert(alignof(AthenaLobbyPlayerPanelDetails_C_ExecuteUbergraph_AthenaLobbyPlayerPanelDetails) == 0x000008, "Wrong alignment on AthenaLobbyPlayerPanelDetails_C_ExecuteUbergraph_AthenaLobbyPlayerPanelDetails");
static_assert(sizeof(AthenaLobbyPlayerPanelDetails_C_ExecuteUbergraph_AthenaLobbyPlayerPanelDetails) == 0x000080, "Wrong size on AthenaLobbyPlayerPanelDetails_C_ExecuteUbergraph_AthenaLobbyPlayerPanelDetails");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_ExecuteUbergraph_AthenaLobbyPlayerPanelDetails, EntryPoint) == 0x000000, "Member 'AthenaLobbyPlayerPanelDetails_C_ExecuteUbergraph_AthenaLobbyPlayerPanelDetails::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_ExecuteUbergraph_AthenaLobbyPlayerPanelDetails, CallFunc_RandomInteger_ReturnValue) == 0x000004, "Member 'AthenaLobbyPlayerPanelDetails_C_ExecuteUbergraph_AthenaLobbyPlayerPanelDetails::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_ExecuteUbergraph_AthenaLobbyPlayerPanelDetails, Temp_int_Variable) == 0x000008, "Member 'AthenaLobbyPlayerPanelDetails_C_ExecuteUbergraph_AthenaLobbyPlayerPanelDetails::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_ExecuteUbergraph_AthenaLobbyPlayerPanelDetails, Temp_string_Variable) == 0x000010, "Member 'AthenaLobbyPlayerPanelDetails_C_ExecuteUbergraph_AthenaLobbyPlayerPanelDetails::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_ExecuteUbergraph_AthenaLobbyPlayerPanelDetails, Temp_string_Variable2) == 0x000020, "Member 'AthenaLobbyPlayerPanelDetails_C_ExecuteUbergraph_AthenaLobbyPlayerPanelDetails::Temp_string_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_ExecuteUbergraph_AthenaLobbyPlayerPanelDetails, Temp_string_Variable3) == 0x000030, "Member 'AthenaLobbyPlayerPanelDetails_C_ExecuteUbergraph_AthenaLobbyPlayerPanelDetails::Temp_string_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_ExecuteUbergraph_AthenaLobbyPlayerPanelDetails, Temp_string_Variable4) == 0x000040, "Member 'AthenaLobbyPlayerPanelDetails_C_ExecuteUbergraph_AthenaLobbyPlayerPanelDetails::Temp_string_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_ExecuteUbergraph_AthenaLobbyPlayerPanelDetails, K2Node_Event_IsDesignTime) == 0x000050, "Member 'AthenaLobbyPlayerPanelDetails_C_ExecuteUbergraph_AthenaLobbyPlayerPanelDetails::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_ExecuteUbergraph_AthenaLobbyPlayerPanelDetails, K2Node_Select_Default) == 0x000058, "Member 'AthenaLobbyPlayerPanelDetails_C_ExecuteUbergraph_AthenaLobbyPlayerPanelDetails::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_ExecuteUbergraph_AthenaLobbyPlayerPanelDetails, CallFunc_Conv_StringToText_ReturnValue) == 0x000068, "Member 'AthenaLobbyPlayerPanelDetails_C_ExecuteUbergraph_AthenaLobbyPlayerPanelDetails::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function AthenaLobbyPlayerPanelDetails.AthenaLobbyPlayerPanelDetails_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaLobbyPlayerPanelDetails_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLobbyPlayerPanelDetails_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaLobbyPlayerPanelDetails_C_PreConstruct");
static_assert(sizeof(AthenaLobbyPlayerPanelDetails_C_PreConstruct) == 0x000001, "Wrong size on AthenaLobbyPlayerPanelDetails_C_PreConstruct");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaLobbyPlayerPanelDetails_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaLobbyPlayerPanelDetails.AthenaLobbyPlayerPanelDetails_C.RefreshPendingInvite
// 0x0005 (0x0005 - 0x0000)
struct AthenaLobbyPlayerPanelDetails_C_RefreshPendingInvite final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInvitationPending_bIsInvitationPending; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobbyPlayerPanelDetails_C_RefreshPendingInvite) == 0x000001, "Wrong alignment on AthenaLobbyPlayerPanelDetails_C_RefreshPendingInvite");
static_assert(sizeof(AthenaLobbyPlayerPanelDetails_C_RefreshPendingInvite) == 0x000005, "Wrong size on AthenaLobbyPlayerPanelDetails_C_RefreshPendingInvite");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_RefreshPendingInvite, Temp_bool_Variable) == 0x000000, "Member 'AthenaLobbyPlayerPanelDetails_C_RefreshPendingInvite::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_RefreshPendingInvite, Temp_byte_Variable) == 0x000001, "Member 'AthenaLobbyPlayerPanelDetails_C_RefreshPendingInvite::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_RefreshPendingInvite, Temp_byte_Variable2) == 0x000002, "Member 'AthenaLobbyPlayerPanelDetails_C_RefreshPendingInvite::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_RefreshPendingInvite, CallFunc_IsInvitationPending_bIsInvitationPending) == 0x000003, "Member 'AthenaLobbyPlayerPanelDetails_C_RefreshPendingInvite::CallFunc_IsInvitationPending_bIsInvitationPending' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_RefreshPendingInvite, K2Node_Select_Default) == 0x000004, "Member 'AthenaLobbyPlayerPanelDetails_C_RefreshPendingInvite::K2Node_Select_Default' has a wrong offset!");

// Function AthenaLobbyPlayerPanelDetails.AthenaLobbyPlayerPanelDetails_C.IsInvitationPending
// 0x0078 (0x0078 - 0x0000)
struct AthenaLobbyPlayerPanelDetails_C_IsInvitationPending final
{
public:
	bool                                          bIsInvitationPending;                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       PlayerUniqueId;                                    // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidNetID_ReturnValue;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasPendingPartyInvitation_ReturnValue;    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortFriendRequestStatus                      CallFunc_GetFriendRequestStatusForPlayer_ReturnValue; // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortFriendRequestStatus                      Temp_byte_Variable;                                // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable5;                               // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable6;                               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable7;                               // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable8;                               // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select2_Default;                            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidNetID_ReturnValue2;                // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       K2Node_Select3_Default;                            // 0x0050(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobbyPlayerPanelDetails_C_IsInvitationPending) == 0x000008, "Wrong alignment on AthenaLobbyPlayerPanelDetails_C_IsInvitationPending");
static_assert(sizeof(AthenaLobbyPlayerPanelDetails_C_IsInvitationPending) == 0x000078, "Wrong size on AthenaLobbyPlayerPanelDetails_C_IsInvitationPending");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_IsInvitationPending, bIsInvitationPending) == 0x000000, "Member 'AthenaLobbyPlayerPanelDetails_C_IsInvitationPending::bIsInvitationPending' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_IsInvitationPending, PlayerUniqueId) == 0x000008, "Member 'AthenaLobbyPlayerPanelDetails_C_IsInvitationPending::PlayerUniqueId' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_IsInvitationPending, Temp_bool_Variable) == 0x000030, "Member 'AthenaLobbyPlayerPanelDetails_C_IsInvitationPending::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_IsInvitationPending, CallFunc_GetContext_ReturnValue) == 0x000038, "Member 'AthenaLobbyPlayerPanelDetails_C_IsInvitationPending::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_IsInvitationPending, CallFunc_IsValidNetID_ReturnValue) == 0x000040, "Member 'AthenaLobbyPlayerPanelDetails_C_IsInvitationPending::CallFunc_IsValidNetID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_IsInvitationPending, CallFunc_HasPendingPartyInvitation_ReturnValue) == 0x000041, "Member 'AthenaLobbyPlayerPanelDetails_C_IsInvitationPending::CallFunc_HasPendingPartyInvitation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_IsInvitationPending, CallFunc_GetFriendRequestStatusForPlayer_ReturnValue) == 0x000042, "Member 'AthenaLobbyPlayerPanelDetails_C_IsInvitationPending::CallFunc_GetFriendRequestStatusForPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_IsInvitationPending, Temp_byte_Variable) == 0x000043, "Member 'AthenaLobbyPlayerPanelDetails_C_IsInvitationPending::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_IsInvitationPending, Temp_bool_Variable2) == 0x000044, "Member 'AthenaLobbyPlayerPanelDetails_C_IsInvitationPending::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_IsInvitationPending, Temp_bool_Variable3) == 0x000045, "Member 'AthenaLobbyPlayerPanelDetails_C_IsInvitationPending::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_IsInvitationPending, Temp_bool_Variable4) == 0x000046, "Member 'AthenaLobbyPlayerPanelDetails_C_IsInvitationPending::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_IsInvitationPending, Temp_bool_Variable5) == 0x000047, "Member 'AthenaLobbyPlayerPanelDetails_C_IsInvitationPending::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_IsInvitationPending, Temp_bool_Variable6) == 0x000048, "Member 'AthenaLobbyPlayerPanelDetails_C_IsInvitationPending::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_IsInvitationPending, Temp_bool_Variable7) == 0x000049, "Member 'AthenaLobbyPlayerPanelDetails_C_IsInvitationPending::Temp_bool_Variable7' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_IsInvitationPending, K2Node_Select_Default) == 0x00004A, "Member 'AthenaLobbyPlayerPanelDetails_C_IsInvitationPending::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_IsInvitationPending, Temp_bool_Variable8) == 0x00004B, "Member 'AthenaLobbyPlayerPanelDetails_C_IsInvitationPending::Temp_bool_Variable8' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_IsInvitationPending, K2Node_Select2_Default) == 0x00004C, "Member 'AthenaLobbyPlayerPanelDetails_C_IsInvitationPending::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_IsInvitationPending, CallFunc_BooleanOR_ReturnValue) == 0x00004D, "Member 'AthenaLobbyPlayerPanelDetails_C_IsInvitationPending::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_IsInvitationPending, CallFunc_IsValidNetID_ReturnValue2) == 0x00004E, "Member 'AthenaLobbyPlayerPanelDetails_C_IsInvitationPending::CallFunc_IsValidNetID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_IsInvitationPending, K2Node_Select3_Default) == 0x000050, "Member 'AthenaLobbyPlayerPanelDetails_C_IsInvitationPending::K2Node_Select3_Default' has a wrong offset!");

// Function AthenaLobbyPlayerPanelDetails.AthenaLobbyPlayerPanelDetails_C.OnPartyInvitesCountChanged
// 0x0004 (0x0004 - 0x0000)
struct AthenaLobbyPlayerPanelDetails_C_OnPartyInvitesCountChanged final
{
public:
	int32                                         InvitesCount;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobbyPlayerPanelDetails_C_OnPartyInvitesCountChanged) == 0x000004, "Wrong alignment on AthenaLobbyPlayerPanelDetails_C_OnPartyInvitesCountChanged");
static_assert(sizeof(AthenaLobbyPlayerPanelDetails_C_OnPartyInvitesCountChanged) == 0x000004, "Wrong size on AthenaLobbyPlayerPanelDetails_C_OnPartyInvitesCountChanged");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_OnPartyInvitesCountChanged, InvitesCount) == 0x000000, "Member 'AthenaLobbyPlayerPanelDetails_C_OnPartyInvitesCountChanged::InvitesCount' has a wrong offset!");

// Function AthenaLobbyPlayerPanelDetails.AthenaLobbyPlayerPanelDetails_C.OnActiveFriendsCountUpdated
// 0x0004 (0x0004 - 0x0000)
struct AthenaLobbyPlayerPanelDetails_C_OnActiveFriendsCountUpdated final
{
public:
	int32                                         ActiveFriendsCount;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobbyPlayerPanelDetails_C_OnActiveFriendsCountUpdated) == 0x000004, "Wrong alignment on AthenaLobbyPlayerPanelDetails_C_OnActiveFriendsCountUpdated");
static_assert(sizeof(AthenaLobbyPlayerPanelDetails_C_OnActiveFriendsCountUpdated) == 0x000004, "Wrong size on AthenaLobbyPlayerPanelDetails_C_OnActiveFriendsCountUpdated");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_OnActiveFriendsCountUpdated, ActiveFriendsCount) == 0x000000, "Member 'AthenaLobbyPlayerPanelDetails_C_OnActiveFriendsCountUpdated::ActiveFriendsCount' has a wrong offset!");

// Function AthenaLobbyPlayerPanelDetails.AthenaLobbyPlayerPanelDetails_C.InitializeContextEvents
// 0x0030 (0x0030 - 0x0000)
struct AthenaLobbyPlayerPanelDetails_C_InitializeContextEvents final
{
public:
	TDelegate<void(int32 ActiveFriendsCount)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 PartyInvitesCount)>      K2Node_CreateDelegate_OutputDelegate2;             // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue2;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobbyPlayerPanelDetails_C_InitializeContextEvents) == 0x000008, "Wrong alignment on AthenaLobbyPlayerPanelDetails_C_InitializeContextEvents");
static_assert(sizeof(AthenaLobbyPlayerPanelDetails_C_InitializeContextEvents) == 0x000030, "Wrong size on AthenaLobbyPlayerPanelDetails_C_InitializeContextEvents");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AthenaLobbyPlayerPanelDetails_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_InitializeContextEvents, K2Node_CreateDelegate_OutputDelegate2) == 0x000010, "Member 'AthenaLobbyPlayerPanelDetails_C_InitializeContextEvents::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_InitializeContextEvents, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'AthenaLobbyPlayerPanelDetails_C_InitializeContextEvents::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_InitializeContextEvents, CallFunc_GetContext_ReturnValue2) == 0x000028, "Member 'AthenaLobbyPlayerPanelDetails_C_InitializeContextEvents::CallFunc_GetContext_ReturnValue2' has a wrong offset!");

// Function AthenaLobbyPlayerPanelDetails.AthenaLobbyPlayerPanelDetails_C.SetTeamMemberInfo
// 0x01A8 (0x01A8 - 0x0000)
struct AthenaLobbyPlayerPanelDetails_C_SetTeamMemberInfo final
{
public:
	struct FFortTeamMemberInfo                    Param_TeamMemberInfo;                              // 0x0000(0x01A8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AthenaLobbyPlayerPanelDetails_C_SetTeamMemberInfo) == 0x000008, "Wrong alignment on AthenaLobbyPlayerPanelDetails_C_SetTeamMemberInfo");
static_assert(sizeof(AthenaLobbyPlayerPanelDetails_C_SetTeamMemberInfo) == 0x0001A8, "Wrong size on AthenaLobbyPlayerPanelDetails_C_SetTeamMemberInfo");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_SetTeamMemberInfo, Param_TeamMemberInfo) == 0x000000, "Member 'AthenaLobbyPlayerPanelDetails_C_SetTeamMemberInfo::Param_TeamMemberInfo' has a wrong offset!");

// Function AthenaLobbyPlayerPanelDetails.AthenaLobbyPlayerPanelDetails_C.RefreshBattlePassBoost
// 0x01A0 (0x01A0 - 0x0000)
struct AthenaLobbyPlayerPanelDetails_C_RefreshBattlePassBoost final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue2;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue2;              // 0x0038(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0090(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array2;                           // 0x00E0(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F0(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0110(0x0018)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable2;                               // 0x0130(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x014B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select3_Default;                            // 0x0150(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue2;                      // 0x0168(0x0018)()
	ESlateVisibility                              Temp_byte_Variable8;                               // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select4_Default;                            // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable5;                               // 0x0183(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTeamMemberFriend_ReturnValue;           // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select5_Default;                            // 0x0185(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayersUniqueID_ReturnValue;       // 0x0186(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_187[0x1];                                      // 0x0187(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortBattlePassInfo                    CallFunc_GetBattlePassInfoForPlayer_Result;        // 0x0188(0x0014)(NoDestructor)
};
static_assert(alignof(AthenaLobbyPlayerPanelDetails_C_RefreshBattlePassBoost) == 0x000008, "Wrong alignment on AthenaLobbyPlayerPanelDetails_C_RefreshBattlePassBoost");
static_assert(sizeof(AthenaLobbyPlayerPanelDetails_C_RefreshBattlePassBoost) == 0x0001A0, "Wrong size on AthenaLobbyPlayerPanelDetails_C_RefreshBattlePassBoost");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_RefreshBattlePassBoost, Temp_bool_Variable) == 0x000000, "Member 'AthenaLobbyPlayerPanelDetails_C_RefreshBattlePassBoost::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelDetails_C_RefreshBattlePassBoost, Temp_byte_Variable) == 0x000001, "Member 'AthenaLobbyPlayerPanelDetails_C_RefreshBattlePassBoost::Temp_byte_Variable' has a wrong offset!");
