#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchmakingOptionsDisplay_v2

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2
// 0x0078 (0x0078 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAthena_Matchmaking_GameModeButton_C*> K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	class UAthena_Matchmaking_GameModeButton_C*   K2Node_CustomEvent_SelectedGameModeButton;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetCurrentPlaylist_ReturnValue;           // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthena_Matchmaking_GameModeButton_C*   K2Node_CustomEvent_HoveredButton;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortAthenaPlaylist>                   CallFunc_GetActivePlaylists_ReturnValue;           // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthena_Matchmaking_GameModeButton_C*   CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2) == 0x000078, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2, EntryPoint) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2, CallFunc_GetUINavigationManager_ReturnValue) == 0x000008, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2, K2Node_MakeArray_Array) == 0x000010, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2, K2Node_CustomEvent_SelectedGameModeButton) == 0x000020, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2::K2Node_CustomEvent_SelectedGameModeButton' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2, CallFunc_IsValid_ReturnValue2) == 0x000029, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2, CallFunc_SetCurrentPlaylist_ReturnValue) == 0x00002A, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2::CallFunc_SetCurrentPlaylist_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2, CallFunc_GetEndTime_ReturnValue) == 0x00002C, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2, K2Node_CustomEvent_HoveredButton) == 0x000030, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2::K2Node_CustomEvent_HoveredButton' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2, CallFunc_IsValid_ReturnValue3) == 0x000048, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2, CallFunc_GetActivePlaylists_ReturnValue) == 0x000050, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2::CallFunc_GetActivePlaylists_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2, K2Node_ComponentBoundEvent_Button) == 0x000060, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2, CallFunc_Array_Get_Item) == 0x000068, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2, CallFunc_IsValid_ReturnValue4) == 0x000070, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2::CallFunc_IsValid_ReturnValue4' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.OnModeButtonHovered
// 0x0008 (0x0008 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_OnModeButtonHovered final
{
public:
	class UAthena_Matchmaking_GameModeButton_C*   HoveredButton;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_OnModeButtonHovered) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_OnModeButtonHovered");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_OnModeButtonHovered) == 0x000008, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_OnModeButtonHovered");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_OnModeButtonHovered, HoveredButton) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_OnModeButtonHovered::HoveredButton' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.OnGameModeButtonSelected
// 0x0008 (0x0008 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_OnGameModeButtonSelected final
{
public:
	class UAthena_Matchmaking_GameModeButton_C*   SelectedGameModeButton;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_OnGameModeButtonSelected) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_OnGameModeButtonSelected");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_OnGameModeButtonSelected) == 0x000008, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_OnGameModeButtonSelected");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_OnGameModeButtonSelected, SelectedGameModeButton) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_OnGameModeButtonSelected::SelectedGameModeButton' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.BndEvt__IconTextButton_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.SetupInput
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) AthenaMatchmakingOptionsDisplay_v2_C_SetupInput final
{
public:
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_SetupInput) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_SetupInput");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_SetupInput) == 0x000010, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_SetupInput");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_SetupInput, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_SetupInput::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.Handle_InputAction_Cancel
// 0x0001 (0x0001 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_Handle_InputAction_Cancel final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_InputAction_Cancel) == 0x000001, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_Handle_InputAction_Cancel");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_InputAction_Cancel) == 0x000001, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_Handle_InputAction_Cancel");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_InputAction_Cancel, Passthrough) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_InputAction_Cancel::Passthrough' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.CloseMatchmakingOptions
// 0x0008 (0x0008 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_CloseMatchmakingOptions final
{
public:
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_CloseMatchmakingOptions) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_CloseMatchmakingOptions");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_CloseMatchmakingOptions) == 0x000008, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_CloseMatchmakingOptions");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_CloseMatchmakingOptions, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_CloseMatchmakingOptions::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.AddStandardGameModes
// 0x0050 (0x0050 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_AddStandardGameModes final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthena_Matchmaking_GameModeButton_C*   CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0018)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_AddStandardGameModes) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_AddStandardGameModes");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_AddStandardGameModes) == 0x000050, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_AddStandardGameModes");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_AddStandardGameModes, Temp_int_Array_Index_Variable) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_AddStandardGameModes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_AddStandardGameModes, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_AddStandardGameModes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_AddStandardGameModes, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_AddStandardGameModes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_AddStandardGameModes, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_AddStandardGameModes::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_AddStandardGameModes, CallFunc_Create_ReturnValue) == 0x000018, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_AddStandardGameModes::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_AddStandardGameModes, CallFunc_Array_Get_Item) == 0x000020, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_AddStandardGameModes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_AddStandardGameModes, CallFunc_Array_Add_ReturnValue) == 0x000038, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_AddStandardGameModes::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_AddStandardGameModes, CallFunc_AddChild_ReturnValue) == 0x000040, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_AddStandardGameModes::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_AddStandardGameModes, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_AddStandardGameModes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_AddStandardGameModes, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_AddStandardGameModes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.AddLTM
// 0x0028 (0x0028 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_AddLTM final
{
public:
	EFortAthenaPlaylist                           Param_LTMPlaylist;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AddSpecialStyle;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthena_Matchmaking_GameModeButton_C*   CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_AddLTM) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_AddLTM");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_AddLTM) == 0x000028, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_AddLTM");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_AddLTM, Param_LTMPlaylist) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_AddLTM::Param_LTMPlaylist' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_AddLTM, AddSpecialStyle) == 0x000001, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_AddLTM::AddSpecialStyle' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_AddLTM, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_AddLTM::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_AddLTM, CallFunc_Create_ReturnValue) == 0x000010, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_AddLTM::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_AddLTM, CallFunc_Array_Add_ReturnValue) == 0x000018, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_AddLTM::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_AddLTM, CallFunc_AddChild_ReturnValue) == 0x000020, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_AddLTM::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.Handle_Navigate_Right
// 0x0050 (0x0050 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Right final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUINavigation                                 Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable2;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable3;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable4;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable5;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable6;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Right) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Right");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Right) == 0x000050, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Right");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Right, Param_Navigation) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Right::Param_Navigation' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Right, ReturnValue) == 0x000008, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Right::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Right, Temp_byte_Variable) == 0x000010, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Right::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Right, Temp_object_Variable) == 0x000018, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Right::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Right, Temp_object_Variable2) == 0x000020, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Right::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Right, Temp_object_Variable3) == 0x000028, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Right::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Right, Temp_object_Variable4) == 0x000030, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Right::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Right, Temp_object_Variable5) == 0x000038, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Right::Temp_object_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Right, Temp_object_Variable6) == 0x000040, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Right::Temp_object_Variable6' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Right, K2Node_Select_Default) == 0x000048, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Right::K2Node_Select_Default' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.Handle_Navigate_Left
// 0x0060 (0x0060 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUINavigation                                 Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable2;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable3;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable4;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable5;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthena_Matchmaking_GameModeButton_C*   CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select2_Default;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left) == 0x000060, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left, Param_Navigation) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left::Param_Navigation' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left, ReturnValue) == 0x000008, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left, Temp_bool_Variable) == 0x000010, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left, Temp_byte_Variable) == 0x000011, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left, Temp_object_Variable) == 0x000018, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left, Temp_object_Variable2) == 0x000020, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left, Temp_object_Variable3) == 0x000028, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left, Temp_object_Variable4) == 0x000030, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left, Temp_object_Variable5) == 0x000038, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left::Temp_object_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left, CallFunc_Array_Get_Item) == 0x000040, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left, K2Node_Select_Default) == 0x000050, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left, K2Node_Select2_Default) == 0x000058, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_Left::K2Node_Select2_Default' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.SetupButtonBindings
// 0x0040 (0x0040 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_SetupButtonBindings final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAthena_Matchmaking_GameModeButton_C* HoveredButton)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UAthena_Matchmaking_GameModeButton_C* SelectedGameModeButton)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UAthena_Matchmaking_GameModeButton_C*   CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_SetupButtonBindings) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_SetupButtonBindings");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_SetupButtonBindings) == 0x000040, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_SetupButtonBindings");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_SetupButtonBindings, Temp_int_Array_Index_Variable) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_SetupButtonBindings::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_SetupButtonBindings, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_SetupButtonBindings::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_SetupButtonBindings, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_SetupButtonBindings::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_SetupButtonBindings, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_SetupButtonBindings::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_SetupButtonBindings, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_SetupButtonBindings::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_SetupButtonBindings, CallFunc_Array_Get_Item) == 0x000030, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_SetupButtonBindings::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_SetupButtonBindings, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_SetupButtonBindings::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_SetupButtonBindings, CallFunc_IsValid_ReturnValue) == 0x00003C, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_SetupButtonBindings::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_SetupButtonBindings, CallFunc_Less_IntInt_ReturnValue) == 0x00003D, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_SetupButtonBindings::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.UpdateStandardGameModeButtonAvailibilty
// 0x0060 (0x0060 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthena_Matchmaking_GameModeButton_C*   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthena_Matchmaking_GameModeButton_C*   CallFunc_Array_Get_Item2;                          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthena_Matchmaking_GameModeButton_C*   CallFunc_Array_Get_Item3;                          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty) == 0x000060, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty, Temp_int_Variable) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty, Temp_int_Variable2) == 0x000004, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty, CallFunc_Add_IntInt_ReturnValue2) == 0x00000C, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty, Temp_int_Array_Index_Variable) == 0x000010, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty, CallFunc_Add_IntInt_ReturnValue3) == 0x000018, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty, CallFunc_Array_Get_Item) == 0x000020, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty, CallFunc_Subtract_IntInt_ReturnValue) == 0x00002C, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty, CallFunc_Array_Length_ReturnValue2) == 0x000030, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty, CallFunc_Array_Get_Item2) == 0x000038, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty, CallFunc_Array_Get_Item3) == 0x000040, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty, CallFunc_Array_Add_ReturnValue) == 0x000048, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty, CallFunc_Array_Length_ReturnValue3) == 0x00004C, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty, CallFunc_Less_IntInt_ReturnValue2) == 0x000050, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty, CallFunc_Array_Length_ReturnValue4) == 0x000054, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty, CallFunc_Less_IntInt_ReturnValue3) == 0x000058, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_UpdateStandardGameModeButtonAvailibilty::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.Handle_Navigate_StandardModes_Up
// 0x0058 (0x0058 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUINavigation                                 Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable2;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable3;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable4;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable5;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_HandleStandardModeButtonIndex_NewIndex;   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthena_Matchmaking_GameModeButton_C*   CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up) == 0x000058, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up, Param_Navigation) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up::Param_Navigation' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up, ReturnValue) == 0x000008, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up, Temp_byte_Variable) == 0x000010, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up, Temp_object_Variable) == 0x000018, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up, Temp_object_Variable2) == 0x000020, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up, Temp_object_Variable3) == 0x000028, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up, Temp_object_Variable4) == 0x000030, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up, Temp_object_Variable5) == 0x000038, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up::Temp_object_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up, CallFunc_HandleStandardModeButtonIndex_NewIndex) == 0x000040, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up::CallFunc_HandleStandardModeButtonIndex_NewIndex' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up, CallFunc_Array_Get_Item) == 0x000048, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up, K2Node_Select_Default) == 0x000050, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Up::K2Node_Select_Default' has a wrong offset!");

// Function AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C.Handle_Navigate_StandardModes_Down
// 0x0058 (0x0058 - 0x0000)
struct AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Down final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUINavigation                                 Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable2;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable3;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable4;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable5;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_HandleStandardModeButtonIndex_NewIndex;   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthena_Matchmaking_GameModeButton_C*   CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Down) == 0x000008, "Wrong alignment on AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Down");
static_assert(sizeof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Down) == 0x000058, "Wrong size on AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Down");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Down, Param_Navigation) == 0x000000, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Down::Param_Navigation' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Down, ReturnValue) == 0x000008, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Down::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Down, Temp_byte_Variable) == 0x000010, "Member 'AthenaMatchmakingOptionsDisplay_v2_C_Handle_Navigate_StandardModes_Down::Temp_byte_Variable' has a wrong offset!");
