#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLobby

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaLobby.AthenaLobby_C
// 0x00D8 (0x0528 - 0x0450)
class UAthenaLobby_C final : public UAthenaLobbyBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(Transient, DuplicateTransient)
	class UAthenaMatchmakingPlay_C*               AthenaMatchmakingPlay;                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ButtonGamepadSelect;                               // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDailyQuestsPanel_C*                    DailyQuestsPanel;                                  // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerEmblemAndXp_C*                   PlayerEmblemAndXp;                                 // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaLobbyPlayerPanel_C*              PlayerPanel;                                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RegionWatermark;                                   // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ShadowPlayHighlights;                              // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    InputCancel;                                       // 0x0490(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	int32                                         SwitcherDetailsActiveIndex;                        // 0x04A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A4[0x4];                                      // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortTeamMemberInfo>            TeamMembersInfo;                                   // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         HoveredPlayerIndex;                                // 0x04B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    InputScroll;                                       // 0x04C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	int32                                         SelectedPlayerIndex;                               // 0x04D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 NavigationOrderToPlayerIndex;                      // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FDataTableRowHandle                    PlaylistChange;                                    // 0x04E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    FillChange;                                        // 0x04F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    InputNews;                                         // 0x0508(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    InputCustomMatchmaking;                            // 0x0518(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_AthenaLobby(int32 EntryPoint);
	void BndEvt__ShadowPlayHighlights_K2Node_ComponentBoundEvent_116_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnActivated();
	void BndEvt__PlayerPanel_K2Node_ComponentBoundEvent_308_OnClosed__DelegateSignature();
	void OnBeginCursorOverPlayer(int32 PlayerIndex);
	void OnPlayerClicked(int32 PlayerIndex);
	void Construct();
	void BndEvt__ButtonTMPTEST_K2Node_ComponentBoundEvent_198_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnNavigationRight();
	void OnNavigationLeft();
	void Event_Abandon();
	void OnEndCursorOverPlayer(int32 PlayerIndex);
	void BndEvt__SwitcherDetails_K2Node_ComponentBoundEvent_0_OnActiveWidgetChanged__DelegateSignature(class UWidget* ActiveWidget, int32 ActiveWidgetIndex);
	void OnSuccess_DA5E62624D068772EA890193344BA4AE();
	void OnFailure_DA5E62624D068772EA890193344BA4AE();
	void DialogResult_156754AE468EF93DCA2009A412591BA7(EFortDialogResult Result, class FName ResultName);
	void Initialize();
	void Refresh();
	void OnTeamMemberAdded(const struct FFortTeamMemberInfo& TeamMemberInfo);
	void OnTeamMemberRemoved(int32 EmptySlot);
	void OnTeamMemberStateChanged(const struct FFortTeamMemberInfo& TeamMemberInfo);
	void RefreshPlayerHeroes();
	void OnInputCancel(bool* bCommited);
	void Focus();
	void InitializeContextEvents();
	void OnInputAbandon(bool* bCommited);
	void RefreshInput();
	void ShouldAddCancel(bool* bShouldAdd);
	void ShouldAddScroll(bool* bShouldAdd);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent);
	void RefreshLaunch();
	void OnLobbyDisconnected();
	void OnLobbyEmptyPlayerClicked(int32 PlayerIndex);
	void OnLobbyPlayerGadgetsClicked(int32 PlayerIndex);
	void OnLobbyPlayerPadHovered(int32 PlayerIndex);
	void OnLobbyPlayerPadUnhovered(int32 PlayerIndex);
	void InitializeInput();
	void ShouldAddPlay(bool* bShouldAdd);
	void StartMusic();
	void HoverPreviousPlayer();
	void HoverNextPlayer();
	void SetHoveredPlayer(int32 PlayerIndex);
	void CanNavigatePlayers(bool* bCanNavigatePlayers);
	void OnSelect(int32 PlayerIndex);
	void IsLocalPlayer(int32 PlayerIndex, bool* Param_IsLocalPlayer);
	void OnInputPlaylistChangeGamepad(bool* bCommited);
	void OnInputFillChangeGamepad(bool* bCommited);
	void OnInputNews(bool* bPassThrough);
	void ShowModalNews();
	void HighlightsCountChanged(int32 NewParam);
	void OnInputCustomMatchmaking(bool* bPassThrough);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaLobby_C">();
	}
	static class UAthenaLobby_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLobby_C>();
	}
};
static_assert(alignof(UAthenaLobby_C) == 0x000008, "Wrong alignment on UAthenaLobby_C");
static_assert(sizeof(UAthenaLobby_C) == 0x000528, "Wrong size on UAthenaLobby_C");
static_assert(offsetof(UAthenaLobby_C, UberGraphFrame) == 0x000450, "Member 'UAthenaLobby_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, AthenaMatchmakingPlay) == 0x000458, "Member 'UAthenaLobby_C::AthenaMatchmakingPlay' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, ButtonGamepadSelect) == 0x000460, "Member 'UAthenaLobby_C::ButtonGamepadSelect' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, DailyQuestsPanel) == 0x000468, "Member 'UAthenaLobby_C::DailyQuestsPanel' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, PlayerEmblemAndXp) == 0x000470, "Member 'UAthenaLobby_C::PlayerEmblemAndXp' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, PlayerPanel) == 0x000478, "Member 'UAthenaLobby_C::PlayerPanel' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, RegionWatermark) == 0x000480, "Member 'UAthenaLobby_C::RegionWatermark' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, ShadowPlayHighlights) == 0x000488, "Member 'UAthenaLobby_C::ShadowPlayHighlights' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, InputCancel) == 0x000490, "Member 'UAthenaLobby_C::InputCancel' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, SwitcherDetailsActiveIndex) == 0x0004A0, "Member 'UAthenaLobby_C::SwitcherDetailsActiveIndex' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, TeamMembersInfo) == 0x0004A8, "Member 'UAthenaLobby_C::TeamMembersInfo' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, HoveredPlayerIndex) == 0x0004B8, "Member 'UAthenaLobby_C::HoveredPlayerIndex' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, InputScroll) == 0x0004C0, "Member 'UAthenaLobby_C::InputScroll' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, SelectedPlayerIndex) == 0x0004D0, "Member 'UAthenaLobby_C::SelectedPlayerIndex' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, NavigationOrderToPlayerIndex) == 0x0004D8, "Member 'UAthenaLobby_C::NavigationOrderToPlayerIndex' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, PlaylistChange) == 0x0004E8, "Member 'UAthenaLobby_C::PlaylistChange' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, FillChange) == 0x0004F8, "Member 'UAthenaLobby_C::FillChange' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, InputNews) == 0x000508, "Member 'UAthenaLobby_C::InputNews' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, InputCustomMatchmaking) == 0x000518, "Member 'UAthenaLobby_C::InputCustomMatchmaking' has a wrong offset!");

}

