#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaTeamInfo

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaTeamInfo.AthenaTeamInfo_C.ExecuteUbergraph_AthenaTeamInfo
// 0x01B8 (0x01B8 - 0x0000)
struct AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaTeamMemberInfo_C*                CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<bool>                                  CallFunc_GetSquadMuted_MutedStates;                // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<bool>                                  CallFunc_GetSquadTalking_TalkingStates;            // 0x0070(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<bool>                                  CallFunc_GetSquadReviving_RevivingStates;          // 0x0080(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<bool>                                  CallFunc_GetSquadDBNO_DBNOStates;                  // 0x0090(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<bool>                                  CallFunc_GetSquadDead_DeadStates;                  // 0x00A0(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<float>                                 CallFunc_GetSquadHitPointFractions_HealthFractions; // 0x00B0(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<float>                                 CallFunc_GetSquadHitPointFractions_ShieldFractions; // 0x00C0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TArray<bool>& DBNOStates)>     K2Node_CreateDelegate_OutputDelegate3;             // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TArray<bool>& DeadStates)>     K2Node_CreateDelegate_OutputDelegate4;             // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TArray<bool>& RevivingStates)> K2Node_CreateDelegate_OutputDelegate5;             // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TArray<float>& HealthFractions, TArray<float>& ShieldFractions)> K2Node_CreateDelegate_OutputDelegate7;             // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TArray<bool>& TalkingStates)>  K2Node_CreateDelegate_OutputDelegate8;             // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TArray<bool>& MutedStates)>    K2Node_CreateDelegate_OutputDelegate9;             // 0x0150(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaTeamMemberInfo_C*                CallFunc_Array_Get_Item;                           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerStateAthena*                 CallFunc_Array_Get_Item2;                          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaTeamMemberInfo_C*                CallFunc_Array_Get_Item3;                          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A6[0x2];                                      // 0x01A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo) == 0x000008, "Wrong alignment on AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo");
static_assert(sizeof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo) == 0x0001B8, "Wrong size on AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, EntryPoint) == 0x000000, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_Create_ReturnValue) == 0x000008, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, Temp_int_Array_Index_Variable) == 0x000018, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, Temp_int_Loop_Counter_Variable2) == 0x00001C, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_Add_IntInt_ReturnValue2) == 0x000020, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, K2Node_Event_IsDesignTime) == 0x000024, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_AddChild_ReturnValue) == 0x000028, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_GetOwningPlayer_ReturnValue) == 0x000030, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000048, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_GetContext_ReturnValue) == 0x000058, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_GetSquadMuted_MutedStates) == 0x000060, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_GetSquadMuted_MutedStates' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_GetSquadTalking_TalkingStates) == 0x000070, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_GetSquadTalking_TalkingStates' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_GetSquadReviving_RevivingStates) == 0x000080, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_GetSquadReviving_RevivingStates' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_GetSquadDBNO_DBNOStates) == 0x000090, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_GetSquadDBNO_DBNOStates' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_GetSquadDead_DeadStates) == 0x0000A0, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_GetSquadDead_DeadStates' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_GetSquadHitPointFractions_HealthFractions) == 0x0000B0, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_GetSquadHitPointFractions_HealthFractions' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_GetSquadHitPointFractions_ShieldFractions) == 0x0000C0, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_GetSquadHitPointFractions_ShieldFractions' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_Array_Length_ReturnValue) == 0x0000D0, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_Less_IntInt_ReturnValue) == 0x0000D4, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, K2Node_CreateDelegate_OutputDelegate2) == 0x0000D8, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, Temp_int_Array_Index_Variable2) == 0x0000E8, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, K2Node_CreateDelegate_OutputDelegate3) == 0x0000F0, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, K2Node_CreateDelegate_OutputDelegate4) == 0x000100, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, K2Node_CreateDelegate_OutputDelegate5) == 0x000110, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, K2Node_CreateDelegate_OutputDelegate6) == 0x000120, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, K2Node_CreateDelegate_OutputDelegate7) == 0x000130, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, K2Node_CreateDelegate_OutputDelegate8) == 0x000140, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, K2Node_CreateDelegate_OutputDelegate9) == 0x000150, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, Temp_int_Loop_Counter_Variable3) == 0x000160, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_Add_IntInt_ReturnValue3) == 0x000164, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, Temp_int_Array_Index_Variable3) == 0x000168, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_Array_Get_Item) == 0x000170, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_Array_Get_Item2) == 0x000178, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_IsValid_ReturnValue) == 0x000180, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_Array_Length_ReturnValue2) == 0x000184, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_Less_IntInt_ReturnValue2) == 0x000188, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_Array_Length_ReturnValue3) == 0x00018C, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_Greater_IntInt_ReturnValue) == 0x000190, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_Array_Get_Item3) == 0x000198, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_Array_Length_ReturnValue4) == 0x0001A0, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_Less_IntInt_ReturnValue3) == 0x0001A4, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_IsValid_ReturnValue2) == 0x0001A5, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, Temp_int_Variable) == 0x0001A8, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_Add_IntInt_ReturnValue4) == 0x0001AC, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001B0, "Member 'AthenaTeamInfo_C_ExecuteUbergraph_AthenaTeamInfo::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaTeamInfo.AthenaTeamInfo_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaTeamInfo_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTeamInfo_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaTeamInfo_C_PreConstruct");
static_assert(sizeof(AthenaTeamInfo_C_PreConstruct) == 0x000001, "Wrong size on AthenaTeamInfo_C_PreConstruct");
static_assert(offsetof(AthenaTeamInfo_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaTeamInfo_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaTeamInfo.AthenaTeamInfo_C.AppendSquadMember
// 0x0060 (0x0060 - 0x0000)
struct AthenaTeamInfo_C_AppendSquadMember final
{
public:
	class AFortPlayerStateAthena*                 PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerIndex;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0018(0x0010)(NoDestructor)
	class UAthenaTeamMemberInfo_C*                CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BuildString_Int_ReturnValue;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTeamInfo_C_AppendSquadMember) == 0x000008, "Wrong alignment on AthenaTeamInfo_C_AppendSquadMember");
static_assert(sizeof(AthenaTeamInfo_C_AppendSquadMember) == 0x000060, "Wrong size on AthenaTeamInfo_C_AppendSquadMember");
static_assert(offsetof(AthenaTeamInfo_C_AppendSquadMember, PlayerState) == 0x000000, "Member 'AthenaTeamInfo_C_AppendSquadMember::PlayerState' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_AppendSquadMember, PlayerIndex) == 0x000008, "Member 'AthenaTeamInfo_C_AppendSquadMember::PlayerIndex' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_AppendSquadMember, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'AthenaTeamInfo_C_AppendSquadMember::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_AppendSquadMember, K2Node_MakeStruct_Margin) == 0x000018, "Member 'AthenaTeamInfo_C_AppendSquadMember::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_AppendSquadMember, CallFunc_Create_ReturnValue) == 0x000028, "Member 'AthenaTeamInfo_C_AppendSquadMember::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_AppendSquadMember, CallFunc_Conv_IntToString_ReturnValue) == 0x000030, "Member 'AthenaTeamInfo_C_AppendSquadMember::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_AppendSquadMember, CallFunc_BuildString_Int_ReturnValue) == 0x000040, "Member 'AthenaTeamInfo_C_AppendSquadMember::CallFunc_BuildString_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_AppendSquadMember, CallFunc_Array_Add_ReturnValue) == 0x000050, "Member 'AthenaTeamInfo_C_AppendSquadMember::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_AppendSquadMember, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000058, "Member 'AthenaTeamInfo_C_AppendSquadMember::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function AthenaTeamInfo.AthenaTeamInfo_C.HandleSquadHitInfoChanged
// 0x0048 (0x0048 - 0x0000)
struct AthenaTeamInfo_C_HandleSquadHitInfoChanged final
{
public:
	TArray<float>                                 HealthFractions;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<float>                                 ShieldFractions;                                   // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item;                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaTeamMemberInfo_C*                CallFunc_Array_Get_Item2;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item3;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTeamInfo_C_HandleSquadHitInfoChanged) == 0x000008, "Wrong alignment on AthenaTeamInfo_C_HandleSquadHitInfoChanged");
static_assert(sizeof(AthenaTeamInfo_C_HandleSquadHitInfoChanged) == 0x000048, "Wrong size on AthenaTeamInfo_C_HandleSquadHitInfoChanged");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadHitInfoChanged, HealthFractions) == 0x000000, "Member 'AthenaTeamInfo_C_HandleSquadHitInfoChanged::HealthFractions' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadHitInfoChanged, ShieldFractions) == 0x000010, "Member 'AthenaTeamInfo_C_HandleSquadHitInfoChanged::ShieldFractions' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadHitInfoChanged, CallFunc_Array_LastIndex_ReturnValue) == 0x000020, "Member 'AthenaTeamInfo_C_HandleSquadHitInfoChanged::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadHitInfoChanged, Temp_int_Variable) == 0x000024, "Member 'AthenaTeamInfo_C_HandleSquadHitInfoChanged::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadHitInfoChanged, CallFunc_Array_Get_Item) == 0x000028, "Member 'AthenaTeamInfo_C_HandleSquadHitInfoChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadHitInfoChanged, CallFunc_Array_Get_Item2) == 0x000030, "Member 'AthenaTeamInfo_C_HandleSquadHitInfoChanged::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadHitInfoChanged, CallFunc_Array_Get_Item3) == 0x000038, "Member 'AthenaTeamInfo_C_HandleSquadHitInfoChanged::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadHitInfoChanged, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00003C, "Member 'AthenaTeamInfo_C_HandleSquadHitInfoChanged::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadHitInfoChanged, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'AthenaTeamInfo_C_HandleSquadHitInfoChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaTeamInfo.AthenaTeamInfo_C.HandleSquadMemberAdded
// 0x0058 (0x0058 - 0x0000)
struct AthenaTeamInfo_C_HandleSquadMemberAdded final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 CallFunc_GetSquadHitPointFractions_HealthFractions; // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<float>                                 CallFunc_GetSquadHitPointFractions_ShieldFractions; // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	class AFortPlayerStateAthena*                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTeamInfo_C_HandleSquadMemberAdded) == 0x000008, "Wrong alignment on AthenaTeamInfo_C_HandleSquadMemberAdded");
static_assert(sizeof(AthenaTeamInfo_C_HandleSquadMemberAdded) == 0x000058, "Wrong size on AthenaTeamInfo_C_HandleSquadMemberAdded");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadMemberAdded, Temp_int_Array_Index_Variable) == 0x000000, "Member 'AthenaTeamInfo_C_HandleSquadMemberAdded::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadMemberAdded, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'AthenaTeamInfo_C_HandleSquadMemberAdded::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadMemberAdded, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaTeamInfo_C_HandleSquadMemberAdded::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadMemberAdded, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'AthenaTeamInfo_C_HandleSquadMemberAdded::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadMemberAdded, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000018, "Member 'AthenaTeamInfo_C_HandleSquadMemberAdded::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadMemberAdded, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AthenaTeamInfo_C_HandleSquadMemberAdded::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadMemberAdded, CallFunc_GetSquadHitPointFractions_HealthFractions) == 0x000028, "Member 'AthenaTeamInfo_C_HandleSquadMemberAdded::CallFunc_GetSquadHitPointFractions_HealthFractions' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadMemberAdded, CallFunc_GetSquadHitPointFractions_ShieldFractions) == 0x000038, "Member 'AthenaTeamInfo_C_HandleSquadMemberAdded::CallFunc_GetSquadHitPointFractions_ShieldFractions' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadMemberAdded, CallFunc_Array_Get_Item) == 0x000048, "Member 'AthenaTeamInfo_C_HandleSquadMemberAdded::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadMemberAdded, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'AthenaTeamInfo_C_HandleSquadMemberAdded::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadMemberAdded, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'AthenaTeamInfo_C_HandleSquadMemberAdded::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaTeamInfo.AthenaTeamInfo_C.HandleSquadDBNOChanged
// 0x0030 (0x0030 - 0x0000)
struct AthenaTeamInfo_C_HandleSquadDBNOChanged final
{
public:
	TArray<bool>                                  TeamDBNO;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaTeamMemberInfo_C*                CallFunc_Array_Get_Item2;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTeamInfo_C_HandleSquadDBNOChanged) == 0x000008, "Wrong alignment on AthenaTeamInfo_C_HandleSquadDBNOChanged");
static_assert(sizeof(AthenaTeamInfo_C_HandleSquadDBNOChanged) == 0x000030, "Wrong size on AthenaTeamInfo_C_HandleSquadDBNOChanged");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadDBNOChanged, TeamDBNO) == 0x000000, "Member 'AthenaTeamInfo_C_HandleSquadDBNOChanged::TeamDBNO' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadDBNOChanged, CallFunc_Array_LastIndex_ReturnValue) == 0x000010, "Member 'AthenaTeamInfo_C_HandleSquadDBNOChanged::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadDBNOChanged, Temp_int_Variable) == 0x000014, "Member 'AthenaTeamInfo_C_HandleSquadDBNOChanged::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadDBNOChanged, CallFunc_Array_Get_Item) == 0x000018, "Member 'AthenaTeamInfo_C_HandleSquadDBNOChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadDBNOChanged, CallFunc_Array_Get_Item2) == 0x000020, "Member 'AthenaTeamInfo_C_HandleSquadDBNOChanged::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadDBNOChanged, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'AthenaTeamInfo_C_HandleSquadDBNOChanged::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadDBNOChanged, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'AthenaTeamInfo_C_HandleSquadDBNOChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaTeamInfo.AthenaTeamInfo_C.HandleSquadDeadChanged
// 0x0030 (0x0030 - 0x0000)
struct AthenaTeamInfo_C_HandleSquadDeadChanged final
{
public:
	TArray<bool>                                  TeamDead;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaTeamMemberInfo_C*                CallFunc_Array_Get_Item2;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTeamInfo_C_HandleSquadDeadChanged) == 0x000008, "Wrong alignment on AthenaTeamInfo_C_HandleSquadDeadChanged");
static_assert(sizeof(AthenaTeamInfo_C_HandleSquadDeadChanged) == 0x000030, "Wrong size on AthenaTeamInfo_C_HandleSquadDeadChanged");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadDeadChanged, TeamDead) == 0x000000, "Member 'AthenaTeamInfo_C_HandleSquadDeadChanged::TeamDead' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadDeadChanged, CallFunc_Array_LastIndex_ReturnValue) == 0x000010, "Member 'AthenaTeamInfo_C_HandleSquadDeadChanged::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadDeadChanged, Temp_int_Variable) == 0x000014, "Member 'AthenaTeamInfo_C_HandleSquadDeadChanged::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadDeadChanged, CallFunc_Array_Get_Item) == 0x000018, "Member 'AthenaTeamInfo_C_HandleSquadDeadChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadDeadChanged, CallFunc_Array_Get_Item2) == 0x000020, "Member 'AthenaTeamInfo_C_HandleSquadDeadChanged::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadDeadChanged, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'AthenaTeamInfo_C_HandleSquadDeadChanged::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadDeadChanged, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'AthenaTeamInfo_C_HandleSquadDeadChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaTeamInfo.AthenaTeamInfo_C.HandleSquadMemberPlayerNamesChanged
// 0x0020 (0x0020 - 0x0000)
struct AthenaTeamInfo_C_HandleSquadMemberPlayerNamesChanged final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaTeamMemberInfo_C*                CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTeamInfo_C_HandleSquadMemberPlayerNamesChanged) == 0x000008, "Wrong alignment on AthenaTeamInfo_C_HandleSquadMemberPlayerNamesChanged");
static_assert(sizeof(AthenaTeamInfo_C_HandleSquadMemberPlayerNamesChanged) == 0x000020, "Wrong size on AthenaTeamInfo_C_HandleSquadMemberPlayerNamesChanged");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadMemberPlayerNamesChanged, Temp_int_Variable) == 0x000000, "Member 'AthenaTeamInfo_C_HandleSquadMemberPlayerNamesChanged::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadMemberPlayerNamesChanged, CallFunc_Array_Get_Item) == 0x000008, "Member 'AthenaTeamInfo_C_HandleSquadMemberPlayerNamesChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadMemberPlayerNamesChanged, CallFunc_Array_LastIndex_ReturnValue) == 0x000010, "Member 'AthenaTeamInfo_C_HandleSquadMemberPlayerNamesChanged::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadMemberPlayerNamesChanged, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000014, "Member 'AthenaTeamInfo_C_HandleSquadMemberPlayerNamesChanged::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadMemberPlayerNamesChanged, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'AthenaTeamInfo_C_HandleSquadMemberPlayerNamesChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaTeamInfo.AthenaTeamInfo_C.HandleSquadRevivingChanged
// 0x0038 (0x0038 - 0x0000)
struct AthenaTeamInfo_C_HandleSquadRevivingChanged final
{
public:
	TArray<bool>                                  TeamReviving;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaTeamMemberInfo_C*                CallFunc_Array_Get_Item2;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTeamInfo_C_HandleSquadRevivingChanged) == 0x000008, "Wrong alignment on AthenaTeamInfo_C_HandleSquadRevivingChanged");
static_assert(sizeof(AthenaTeamInfo_C_HandleSquadRevivingChanged) == 0x000038, "Wrong size on AthenaTeamInfo_C_HandleSquadRevivingChanged");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadRevivingChanged, TeamReviving) == 0x000000, "Member 'AthenaTeamInfo_C_HandleSquadRevivingChanged::TeamReviving' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadRevivingChanged, Temp_int_Array_Index_Variable) == 0x000010, "Member 'AthenaTeamInfo_C_HandleSquadRevivingChanged::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadRevivingChanged, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'AthenaTeamInfo_C_HandleSquadRevivingChanged::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadRevivingChanged, CallFunc_Array_Get_Item) == 0x000018, "Member 'AthenaTeamInfo_C_HandleSquadRevivingChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadRevivingChanged, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'AthenaTeamInfo_C_HandleSquadRevivingChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadRevivingChanged, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'AthenaTeamInfo_C_HandleSquadRevivingChanged::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadRevivingChanged, CallFunc_Array_Get_Item2) == 0x000028, "Member 'AthenaTeamInfo_C_HandleSquadRevivingChanged::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadRevivingChanged, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'AthenaTeamInfo_C_HandleSquadRevivingChanged::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaTeamInfo.AthenaTeamInfo_C.HandleSquadMemberRemoved
// 0x00A8 (0x00A8 - 0x0000)
struct AthenaTeamInfo_C_HandleSquadMemberRemoved final
{
public:
	bool                                          FoundTeamMember;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable2;         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaTeamMemberInfo_C*                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 CallFunc_GetSquadHitPointFractions_HealthFractions; // 0x0068(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<float>                                 CallFunc_GetSquadHitPointFractions_ShieldFractions; // 0x0078(0x0010)(ZeroConstructor, ReferenceParm)
	class AFortPlayerStateAthena*                 CallFunc_Array_Get_Item2;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerStateAthena*                 CallFunc_Array_Get_Item3;                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTeamInfo_C_HandleSquadMemberRemoved) == 0x000008, "Wrong alignment on AthenaTeamInfo_C_HandleSquadMemberRemoved");
static_assert(sizeof(AthenaTeamInfo_C_HandleSquadMemberRemoved) == 0x0000A8, "Wrong size on AthenaTeamInfo_C_HandleSquadMemberRemoved");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadMemberRemoved, FoundTeamMember) == 0x000000, "Member 'AthenaTeamInfo_C_HandleSquadMemberRemoved::FoundTeamMember' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadMemberRemoved, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'AthenaTeamInfo_C_HandleSquadMemberRemoved::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadMemberRemoved, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaTeamInfo_C_HandleSquadMemberRemoved::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadMemberRemoved, Temp_bool_True_if_break_was_hit_Variable) == 0x00000C, "Member 'AthenaTeamInfo_C_HandleSquadMemberRemoved::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadMemberRemoved, Temp_int_Array_Index_Variable) == 0x000010, "Member 'AthenaTeamInfo_C_HandleSquadMemberRemoved::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadMemberRemoved, CallFunc_Not_PreBool_ReturnValue) == 0x000014, "Member 'AthenaTeamInfo_C_HandleSquadMemberRemoved::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadMemberRemoved, Temp_int_Array_Index_Variable2) == 0x000018, "Member 'AthenaTeamInfo_C_HandleSquadMemberRemoved::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadMemberRemoved, Temp_bool_True_if_break_was_hit_Variable2) == 0x00001C, "Member 'AthenaTeamInfo_C_HandleSquadMemberRemoved::Temp_bool_True_if_break_was_hit_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaTeamInfo_C_HandleSquadMemberRemoved, CallFunc_Not_PreBool_ReturnValue2) == 0x00001D, "Member 'AthenaTeamInfo_C_HandleSquadMemberRemoved::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
