#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLobbyPlayerPanelActions

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function AthenaLobbyPlayerPanelActions.AthenaLobbyPlayerPanelActions_C.ExecuteUbergraph_AthenaLobbyPlayerPanelActions
// 0x00F0 (0x00F0 - 0x0000)
struct AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidNetID_ReturnValue;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_CustomEvent_Button;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button4;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue2;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue3;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFullPartyMemberConnected_C*            CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue4;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_ShowPartyDialog*       CallFunc_ShowPartyLeaderManageDialog_ReturnValue;  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerPartyLeader_ReturnValue;     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_ShowPartyDialog*       CallFunc_ShowPartyMemberManageDialog_ReturnValue;  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button3;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidNetID_ReturnValue2;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidNetID_ReturnValue3;                // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       K2Node_Select_Default;                             // 0x0090(0x0028)(HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_Select2_Default;                            // 0x00B8(0x0028)(HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerInOurParty_ReturnValue;           // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions) == 0x000008, "Wrong alignment on AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions");
static_assert(sizeof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions) == 0x0000F0, "Wrong size on AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, EntryPoint) == 0x000000, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, Temp_bool_Variable) == 0x000004, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, Temp_bool_Variable2) == 0x000005, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, CallFunc_IsValidNetID_ReturnValue) == 0x000006, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::CallFunc_IsValidNetID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, K2Node_CustomEvent_Button) == 0x000010, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, K2Node_ComponentBoundEvent_Button4) == 0x000018, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::K2Node_ComponentBoundEvent_Button4' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, K2Node_DynamicCast_AsIcon_Text_Button) == 0x000020, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::K2Node_DynamicCast_AsIcon_Text_Button' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, CallFunc_GetContext_ReturnValue2) == 0x000030, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, CallFunc_GetContext_ReturnValue3) == 0x000038, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, CallFunc_GetOwningLocalPlayer_ReturnValue) == 0x000040, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::CallFunc_GetOwningLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, CallFunc_Create_ReturnValue) == 0x000048, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, CallFunc_GetContext_ReturnValue4) == 0x000050, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, CallFunc_ShowPartyLeaderManageDialog_ReturnValue) == 0x000058, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::CallFunc_ShowPartyLeaderManageDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, CallFunc_IsLocalPlayerPartyLeader_ReturnValue) == 0x000060, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::CallFunc_IsLocalPlayerPartyLeader_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, CallFunc_IsValid_ReturnValue) == 0x000061, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, CallFunc_ShowPartyMemberManageDialog_ReturnValue) == 0x000068, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::CallFunc_ShowPartyMemberManageDialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, CallFunc_IsValid_ReturnValue2) == 0x000070, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, K2Node_ComponentBoundEvent_Button3) == 0x000078, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, K2Node_ComponentBoundEvent_Button2) == 0x000080, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, CallFunc_IsValidNetID_ReturnValue2) == 0x000088, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::CallFunc_IsValidNetID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, CallFunc_IsValidNetID_ReturnValue3) == 0x000089, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::CallFunc_IsValidNetID_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, K2Node_Select_Default) == 0x000090, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, K2Node_Select2_Default) == 0x0000B8, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, K2Node_ComponentBoundEvent_Button) == 0x0000E0, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, CallFunc_IsPlayerInOurParty_ReturnValue) == 0x0000E8, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::CallFunc_IsPlayerInOurParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions, CallFunc_BooleanAND_ReturnValue) == 0x0000E9, "Member 'AthenaLobbyPlayerPanelActions_C_ExecuteUbergraph_AthenaLobbyPlayerPanelActions::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function AthenaLobbyPlayerPanelActions.AthenaLobbyPlayerPanelActions_C.BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_51_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaLobbyPlayerPanelActions_C_BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_51_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobbyPlayerPanelActions_C_BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_51_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaLobbyPlayerPanelActions_C_BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_51_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaLobbyPlayerPanelActions_C_BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_51_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaLobbyPlayerPanelActions_C_BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_51_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_51_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaLobbyPlayerPanelActions_C_BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_51_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaLobbyPlayerPanelActions.AthenaLobbyPlayerPanelActions_C.BndEvt__ButtonInviteParty_K2Node_ComponentBoundEvent_121_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaLobbyPlayerPanelActions_C_BndEvt__ButtonInviteParty_K2Node_ComponentBoundEvent_121_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobbyPlayerPanelActions_C_BndEvt__ButtonInviteParty_K2Node_ComponentBoundEvent_121_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaLobbyPlayerPanelActions_C_BndEvt__ButtonInviteParty_K2Node_ComponentBoundEvent_121_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaLobbyPlayerPanelActions_C_BndEvt__ButtonInviteParty_K2Node_ComponentBoundEvent_121_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaLobbyPlayerPanelActions_C_BndEvt__ButtonInviteParty_K2Node_ComponentBoundEvent_121_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_BndEvt__ButtonInviteParty_K2Node_ComponentBoundEvent_121_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaLobbyPlayerPanelActions_C_BndEvt__ButtonInviteParty_K2Node_ComponentBoundEvent_121_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaLobbyPlayerPanelActions.AthenaLobbyPlayerPanelActions_C.BndEvt__ButtonAddFriend_K2Node_ComponentBoundEvent_103_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaLobbyPlayerPanelActions_C_BndEvt__ButtonAddFriend_K2Node_ComponentBoundEvent_103_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobbyPlayerPanelActions_C_BndEvt__ButtonAddFriend_K2Node_ComponentBoundEvent_103_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaLobbyPlayerPanelActions_C_BndEvt__ButtonAddFriend_K2Node_ComponentBoundEvent_103_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaLobbyPlayerPanelActions_C_BndEvt__ButtonAddFriend_K2Node_ComponentBoundEvent_103_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaLobbyPlayerPanelActions_C_BndEvt__ButtonAddFriend_K2Node_ComponentBoundEvent_103_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_BndEvt__ButtonAddFriend_K2Node_ComponentBoundEvent_103_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaLobbyPlayerPanelActions_C_BndEvt__ButtonAddFriend_K2Node_ComponentBoundEvent_103_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaLobbyPlayerPanelActions.AthenaLobbyPlayerPanelActions_C.BndEvt__ButtonManage_K2Node_ComponentBoundEvent_86_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaLobbyPlayerPanelActions_C_BndEvt__ButtonManage_K2Node_ComponentBoundEvent_86_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobbyPlayerPanelActions_C_BndEvt__ButtonManage_K2Node_ComponentBoundEvent_86_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaLobbyPlayerPanelActions_C_BndEvt__ButtonManage_K2Node_ComponentBoundEvent_86_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaLobbyPlayerPanelActions_C_BndEvt__ButtonManage_K2Node_ComponentBoundEvent_86_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaLobbyPlayerPanelActions_C_BndEvt__ButtonManage_K2Node_ComponentBoundEvent_86_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_BndEvt__ButtonManage_K2Node_ComponentBoundEvent_86_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaLobbyPlayerPanelActions_C_BndEvt__ButtonManage_K2Node_ComponentBoundEvent_86_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaLobbyPlayerPanelActions.AthenaLobbyPlayerPanelActions_C.OnButtonHovered
// 0x0008 (0x0008 - 0x0000)
struct AthenaLobbyPlayerPanelActions_C_OnButtonHovered final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLobbyPlayerPanelActions_C_OnButtonHovered) == 0x000008, "Wrong alignment on AthenaLobbyPlayerPanelActions_C_OnButtonHovered");
static_assert(sizeof(AthenaLobbyPlayerPanelActions_C_OnButtonHovered) == 0x000008, "Wrong size on AthenaLobbyPlayerPanelActions_C_OnButtonHovered");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_OnButtonHovered, Button) == 0x000000, "Member 'AthenaLobbyPlayerPanelActions_C_OnButtonHovered::Button' has a wrong offset!");

// Function AthenaLobbyPlayerPanelActions.AthenaLobbyPlayerPanelActions_C.Initialize
// 0x0048 (0x0048 - 0x0000)
struct AthenaLobbyPlayerPanelActions_C_Initialize final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCommonButton* Button)>  K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class UIconTextButton_C*>              K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTextButton_C*                      CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLobbyPlayerPanelActions_C_Initialize) == 0x000008, "Wrong alignment on AthenaLobbyPlayerPanelActions_C_Initialize");
static_assert(sizeof(AthenaLobbyPlayerPanelActions_C_Initialize) == 0x000048, "Wrong size on AthenaLobbyPlayerPanelActions_C_Initialize");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Initialize, Temp_int_Array_Index_Variable) == 0x000000, "Member 'AthenaLobbyPlayerPanelActions_C_Initialize::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Initialize, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'AthenaLobbyPlayerPanelActions_C_Initialize::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Initialize, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaLobbyPlayerPanelActions_C_Initialize::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Initialize, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'AthenaLobbyPlayerPanelActions_C_Initialize::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Initialize, K2Node_MakeArray_Array) == 0x000020, "Member 'AthenaLobbyPlayerPanelActions_C_Initialize::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Initialize, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'AthenaLobbyPlayerPanelActions_C_Initialize::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Initialize, CallFunc_Array_Get_Item) == 0x000038, "Member 'AthenaLobbyPlayerPanelActions_C_Initialize::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Initialize, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'AthenaLobbyPlayerPanelActions_C_Initialize::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaLobbyPlayerPanelActions.AthenaLobbyPlayerPanelActions_C.Refresh
// 0x0015 (0x0015 - 0x0000)
struct AthenaLobbyPlayerPanelActions_C_Refresh final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable8;                               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanViewProfile_CanView;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanManage_bCanManage;                     // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanInviteToParty_bCanInviteToParty;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanFriend_bCanFriend;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select4_Default;                            // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayer_bIsLocalPlayer;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLobbyPlayerPanelActions_C_Refresh) == 0x000001, "Wrong alignment on AthenaLobbyPlayerPanelActions_C_Refresh");
static_assert(sizeof(AthenaLobbyPlayerPanelActions_C_Refresh) == 0x000015, "Wrong size on AthenaLobbyPlayerPanelActions_C_Refresh");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Refresh, Temp_bool_Variable) == 0x000000, "Member 'AthenaLobbyPlayerPanelActions_C_Refresh::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Refresh, Temp_byte_Variable) == 0x000001, "Member 'AthenaLobbyPlayerPanelActions_C_Refresh::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Refresh, Temp_byte_Variable2) == 0x000002, "Member 'AthenaLobbyPlayerPanelActions_C_Refresh::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Refresh, Temp_bool_Variable2) == 0x000003, "Member 'AthenaLobbyPlayerPanelActions_C_Refresh::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Refresh, Temp_byte_Variable3) == 0x000004, "Member 'AthenaLobbyPlayerPanelActions_C_Refresh::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Refresh, Temp_byte_Variable4) == 0x000005, "Member 'AthenaLobbyPlayerPanelActions_C_Refresh::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Refresh, Temp_bool_Variable3) == 0x000006, "Member 'AthenaLobbyPlayerPanelActions_C_Refresh::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Refresh, Temp_byte_Variable5) == 0x000007, "Member 'AthenaLobbyPlayerPanelActions_C_Refresh::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Refresh, Temp_byte_Variable6) == 0x000008, "Member 'AthenaLobbyPlayerPanelActions_C_Refresh::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Refresh, Temp_bool_Variable4) == 0x000009, "Member 'AthenaLobbyPlayerPanelActions_C_Refresh::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Refresh, Temp_byte_Variable7) == 0x00000A, "Member 'AthenaLobbyPlayerPanelActions_C_Refresh::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Refresh, Temp_byte_Variable8) == 0x00000B, "Member 'AthenaLobbyPlayerPanelActions_C_Refresh::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Refresh, CallFunc_CanViewProfile_CanView) == 0x00000C, "Member 'AthenaLobbyPlayerPanelActions_C_Refresh::CallFunc_CanViewProfile_CanView' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Refresh, K2Node_Select_Default) == 0x00000D, "Member 'AthenaLobbyPlayerPanelActions_C_Refresh::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Refresh, CallFunc_CanManage_bCanManage) == 0x00000E, "Member 'AthenaLobbyPlayerPanelActions_C_Refresh::CallFunc_CanManage_bCanManage' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Refresh, K2Node_Select2_Default) == 0x00000F, "Member 'AthenaLobbyPlayerPanelActions_C_Refresh::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Refresh, CallFunc_CanInviteToParty_bCanInviteToParty) == 0x000010, "Member 'AthenaLobbyPlayerPanelActions_C_Refresh::CallFunc_CanInviteToParty_bCanInviteToParty' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Refresh, CallFunc_CanFriend_bCanFriend) == 0x000011, "Member 'AthenaLobbyPlayerPanelActions_C_Refresh::CallFunc_CanFriend_bCanFriend' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Refresh, K2Node_Select3_Default) == 0x000012, "Member 'AthenaLobbyPlayerPanelActions_C_Refresh::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Refresh, K2Node_Select4_Default) == 0x000013, "Member 'AthenaLobbyPlayerPanelActions_C_Refresh::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_Refresh, CallFunc_IsLocalPlayer_bIsLocalPlayer) == 0x000014, "Member 'AthenaLobbyPlayerPanelActions_C_Refresh::CallFunc_IsLocalPlayer_bIsLocalPlayer' has a wrong offset!");

// Function AthenaLobbyPlayerPanelActions.AthenaLobbyPlayerPanelActions_C.IsLocalPlayer
// 0x01C0 (0x01C0 - 0x0000)
struct AthenaLobbyPlayerPanelActions_C_IsLocalPlayer final
{
public:
	bool                                          bIsLocalPlayer;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortTeamMemberInfo                    CallFunc_GetLocalPlayerTeamMemberInfo_LocalPlayerInfo; // 0x0010(0x01A8)()
	bool                                          CallFunc_AreUniqueIDsIdentical_ReturnValue;        // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLobbyPlayerPanelActions_C_IsLocalPlayer) == 0x000008, "Wrong alignment on AthenaLobbyPlayerPanelActions_C_IsLocalPlayer");
static_assert(sizeof(AthenaLobbyPlayerPanelActions_C_IsLocalPlayer) == 0x0001C0, "Wrong size on AthenaLobbyPlayerPanelActions_C_IsLocalPlayer");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsLocalPlayer, bIsLocalPlayer) == 0x000000, "Member 'AthenaLobbyPlayerPanelActions_C_IsLocalPlayer::bIsLocalPlayer' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsLocalPlayer, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaLobbyPlayerPanelActions_C_IsLocalPlayer::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsLocalPlayer, CallFunc_GetLocalPlayerTeamMemberInfo_LocalPlayerInfo) == 0x000010, "Member 'AthenaLobbyPlayerPanelActions_C_IsLocalPlayer::CallFunc_GetLocalPlayerTeamMemberInfo_LocalPlayerInfo' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsLocalPlayer, CallFunc_AreUniqueIDsIdentical_ReturnValue) == 0x0001B8, "Member 'AthenaLobbyPlayerPanelActions_C_IsLocalPlayer::CallFunc_AreUniqueIDsIdentical_ReturnValue' has a wrong offset!");

// Function AthenaLobbyPlayerPanelActions.AthenaLobbyPlayerPanelActions_C.IsMissionLocalPlayersOutpost
// 0x0190 (0x0190 - 0x0000)
struct AthenaLobbyPlayerPanelActions_C_IsMissionLocalPlayersOutpost final
{
public:
	bool                                          IsLocalPlayersOutpost;                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortMissionDetails                    CallFunc_GetActiveTileMissionDetails_MissionDetails; // 0x0010(0x0168)()
	bool                                          CallFunc_GetActiveTileMissionDetails_ReturnValue;  // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue2;                  // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerPartyLeader_ReturnValue;     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLobbyPlayerPanelActions_C_IsMissionLocalPlayersOutpost) == 0x000008, "Wrong alignment on AthenaLobbyPlayerPanelActions_C_IsMissionLocalPlayersOutpost");
static_assert(sizeof(AthenaLobbyPlayerPanelActions_C_IsMissionLocalPlayersOutpost) == 0x000190, "Wrong size on AthenaLobbyPlayerPanelActions_C_IsMissionLocalPlayersOutpost");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsMissionLocalPlayersOutpost, IsLocalPlayersOutpost) == 0x000000, "Member 'AthenaLobbyPlayerPanelActions_C_IsMissionLocalPlayersOutpost::IsLocalPlayersOutpost' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsMissionLocalPlayersOutpost, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaLobbyPlayerPanelActions_C_IsMissionLocalPlayersOutpost::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsMissionLocalPlayersOutpost, CallFunc_GetActiveTileMissionDetails_MissionDetails) == 0x000010, "Member 'AthenaLobbyPlayerPanelActions_C_IsMissionLocalPlayersOutpost::CallFunc_GetActiveTileMissionDetails_MissionDetails' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsMissionLocalPlayersOutpost, CallFunc_GetActiveTileMissionDetails_ReturnValue) == 0x000178, "Member 'AthenaLobbyPlayerPanelActions_C_IsMissionLocalPlayersOutpost::CallFunc_GetActiveTileMissionDetails_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsMissionLocalPlayersOutpost, CallFunc_GetContext_ReturnValue2) == 0x000180, "Member 'AthenaLobbyPlayerPanelActions_C_IsMissionLocalPlayersOutpost::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsMissionLocalPlayersOutpost, CallFunc_IsLocalPlayerPartyLeader_ReturnValue) == 0x000188, "Member 'AthenaLobbyPlayerPanelActions_C_IsMissionLocalPlayersOutpost::CallFunc_IsLocalPlayerPartyLeader_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsMissionLocalPlayersOutpost, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000189, "Member 'AthenaLobbyPlayerPanelActions_C_IsMissionLocalPlayersOutpost::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsMissionLocalPlayersOutpost, CallFunc_BooleanAND_ReturnValue) == 0x00018A, "Member 'AthenaLobbyPlayerPanelActions_C_IsMissionLocalPlayersOutpost::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function AthenaLobbyPlayerPanelActions.AthenaLobbyPlayerPanelActions_C.CanFriend
// 0x0028 (0x0028 - 0x0000)
struct AthenaLobbyPlayerPanelActions_C_CanFriend final
{
public:
	bool                                          bCanFriend;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortFriendRequestStatus                      Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable5;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable6;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable7;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDesktopPlatform_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortFriendRequestStatus                      CallFunc_GetFriendRequestStatusForPlayer_ReturnValue; // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select2_Default;                            // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLobbyPlayerPanelActions_C_CanFriend) == 0x000008, "Wrong alignment on AthenaLobbyPlayerPanelActions_C_CanFriend");
static_assert(sizeof(AthenaLobbyPlayerPanelActions_C_CanFriend) == 0x000028, "Wrong size on AthenaLobbyPlayerPanelActions_C_CanFriend");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_CanFriend, bCanFriend) == 0x000000, "Member 'AthenaLobbyPlayerPanelActions_C_CanFriend::bCanFriend' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_CanFriend, Temp_byte_Variable) == 0x000001, "Member 'AthenaLobbyPlayerPanelActions_C_CanFriend::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_CanFriend, Temp_bool_Variable) == 0x000002, "Member 'AthenaLobbyPlayerPanelActions_C_CanFriend::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_CanFriend, Temp_bool_Variable2) == 0x000003, "Member 'AthenaLobbyPlayerPanelActions_C_CanFriend::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_CanFriend, Temp_bool_Variable3) == 0x000004, "Member 'AthenaLobbyPlayerPanelActions_C_CanFriend::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_CanFriend, Temp_bool_Variable4) == 0x000005, "Member 'AthenaLobbyPlayerPanelActions_C_CanFriend::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_CanFriend, Temp_bool_Variable5) == 0x000006, "Member 'AthenaLobbyPlayerPanelActions_C_CanFriend::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_CanFriend, Temp_bool_Variable6) == 0x000007, "Member 'AthenaLobbyPlayerPanelActions_C_CanFriend::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_CanFriend, Temp_bool_Variable7) == 0x000008, "Member 'AthenaLobbyPlayerPanelActions_C_CanFriend::Temp_bool_Variable7' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_CanFriend, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'AthenaLobbyPlayerPanelActions_C_CanFriend::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_CanFriend, CallFunc_GetContext_ReturnValue2) == 0x000018, "Member 'AthenaLobbyPlayerPanelActions_C_CanFriend::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_CanFriend, CallFunc_IsDesktopPlatform_ReturnValue) == 0x000020, "Member 'AthenaLobbyPlayerPanelActions_C_CanFriend::CallFunc_IsDesktopPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_CanFriend, CallFunc_GetFriendRequestStatusForPlayer_ReturnValue) == 0x000021, "Member 'AthenaLobbyPlayerPanelActions_C_CanFriend::CallFunc_GetFriendRequestStatusForPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_CanFriend, K2Node_Select_Default) == 0x000022, "Member 'AthenaLobbyPlayerPanelActions_C_CanFriend::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_CanFriend, K2Node_Select2_Default) == 0x000023, "Member 'AthenaLobbyPlayerPanelActions_C_CanFriend::K2Node_Select2_Default' has a wrong offset!");

// Function AthenaLobbyPlayerPanelActions.AthenaLobbyPlayerPanelActions_C.CanInviteToParty
// 0x0018 (0x0018 - 0x0000)
struct AthenaLobbyPlayerPanelActions_C_CanInviteToParty final
{
public:
	bool                                          bCanInviteToParty;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInvitationPending_bIsInvitationPending; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortPartyRestriction                         CallFunc_CanBeInvitedNetID_FailReason;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBeInvitedNetID_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLobbyPlayerPanelActions_C_CanInviteToParty) == 0x000008, "Wrong alignment on AthenaLobbyPlayerPanelActions_C_CanInviteToParty");
static_assert(sizeof(AthenaLobbyPlayerPanelActions_C_CanInviteToParty) == 0x000018, "Wrong size on AthenaLobbyPlayerPanelActions_C_CanInviteToParty");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_CanInviteToParty, bCanInviteToParty) == 0x000000, "Member 'AthenaLobbyPlayerPanelActions_C_CanInviteToParty::bCanInviteToParty' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_CanInviteToParty, CallFunc_IsInvitationPending_bIsInvitationPending) == 0x000001, "Member 'AthenaLobbyPlayerPanelActions_C_CanInviteToParty::CallFunc_IsInvitationPending_bIsInvitationPending' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_CanInviteToParty, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaLobbyPlayerPanelActions_C_CanInviteToParty::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_CanInviteToParty, CallFunc_CanBeInvitedNetID_FailReason) == 0x000010, "Member 'AthenaLobbyPlayerPanelActions_C_CanInviteToParty::CallFunc_CanBeInvitedNetID_FailReason' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_CanInviteToParty, CallFunc_CanBeInvitedNetID_ReturnValue) == 0x000011, "Member 'AthenaLobbyPlayerPanelActions_C_CanInviteToParty::CallFunc_CanBeInvitedNetID_ReturnValue' has a wrong offset!");

// Function AthenaLobbyPlayerPanelActions.AthenaLobbyPlayerPanelActions_C.IsInvitationPending
// 0x0080 (0x0080 - 0x0000)
struct AthenaLobbyPlayerPanelActions_C_IsInvitationPending final
{
public:
	bool                                          bIsInvitationPending;                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       PlayerUniqueId;                                    // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortFriendRequestStatus                      Temp_byte_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable5;                               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable6;                               // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable7;                               // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable8;                               // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortFriendRequestStatus                      CallFunc_GetFriendRequestStatusForPlayer_ReturnValue; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidNetID_ReturnValue;                 // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       K2Node_Select2_Default;                            // 0x0050(0x0028)(HasGetValueTypeHash)
	bool                                          K2Node_Select3_Default;                            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasPendingPartyInvitation_ReturnValue;    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidNetID_ReturnValue2;                // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLobbyPlayerPanelActions_C_IsInvitationPending) == 0x000008, "Wrong alignment on AthenaLobbyPlayerPanelActions_C_IsInvitationPending");
static_assert(sizeof(AthenaLobbyPlayerPanelActions_C_IsInvitationPending) == 0x000080, "Wrong size on AthenaLobbyPlayerPanelActions_C_IsInvitationPending");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsInvitationPending, bIsInvitationPending) == 0x000000, "Member 'AthenaLobbyPlayerPanelActions_C_IsInvitationPending::bIsInvitationPending' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsInvitationPending, PlayerUniqueId) == 0x000008, "Member 'AthenaLobbyPlayerPanelActions_C_IsInvitationPending::PlayerUniqueId' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsInvitationPending, Temp_bool_Variable) == 0x000030, "Member 'AthenaLobbyPlayerPanelActions_C_IsInvitationPending::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsInvitationPending, CallFunc_GetContext_ReturnValue) == 0x000038, "Member 'AthenaLobbyPlayerPanelActions_C_IsInvitationPending::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsInvitationPending, Temp_byte_Variable) == 0x000040, "Member 'AthenaLobbyPlayerPanelActions_C_IsInvitationPending::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsInvitationPending, Temp_bool_Variable2) == 0x000041, "Member 'AthenaLobbyPlayerPanelActions_C_IsInvitationPending::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsInvitationPending, Temp_bool_Variable3) == 0x000042, "Member 'AthenaLobbyPlayerPanelActions_C_IsInvitationPending::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsInvitationPending, Temp_bool_Variable4) == 0x000043, "Member 'AthenaLobbyPlayerPanelActions_C_IsInvitationPending::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsInvitationPending, Temp_bool_Variable5) == 0x000044, "Member 'AthenaLobbyPlayerPanelActions_C_IsInvitationPending::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsInvitationPending, Temp_bool_Variable6) == 0x000045, "Member 'AthenaLobbyPlayerPanelActions_C_IsInvitationPending::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsInvitationPending, Temp_bool_Variable7) == 0x000046, "Member 'AthenaLobbyPlayerPanelActions_C_IsInvitationPending::Temp_bool_Variable7' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsInvitationPending, Temp_bool_Variable8) == 0x000047, "Member 'AthenaLobbyPlayerPanelActions_C_IsInvitationPending::Temp_bool_Variable8' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsInvitationPending, CallFunc_GetFriendRequestStatusForPlayer_ReturnValue) == 0x000048, "Member 'AthenaLobbyPlayerPanelActions_C_IsInvitationPending::CallFunc_GetFriendRequestStatusForPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsInvitationPending, CallFunc_IsValidNetID_ReturnValue) == 0x000049, "Member 'AthenaLobbyPlayerPanelActions_C_IsInvitationPending::CallFunc_IsValidNetID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsInvitationPending, K2Node_Select_Default) == 0x00004A, "Member 'AthenaLobbyPlayerPanelActions_C_IsInvitationPending::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsInvitationPending, K2Node_Select2_Default) == 0x000050, "Member 'AthenaLobbyPlayerPanelActions_C_IsInvitationPending::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsInvitationPending, K2Node_Select3_Default) == 0x000078, "Member 'AthenaLobbyPlayerPanelActions_C_IsInvitationPending::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsInvitationPending, CallFunc_HasPendingPartyInvitation_ReturnValue) == 0x000079, "Member 'AthenaLobbyPlayerPanelActions_C_IsInvitationPending::CallFunc_HasPendingPartyInvitation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsInvitationPending, CallFunc_IsValidNetID_ReturnValue2) == 0x00007A, "Member 'AthenaLobbyPlayerPanelActions_C_IsInvitationPending::CallFunc_IsValidNetID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaLobbyPlayerPanelActions_C_IsInvitationPending, CallFunc_BooleanOR_ReturnValue) == 0x00007B, "Member 'AthenaLobbyPlayerPanelActions_C_IsInvitationPending::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function AthenaLobbyPlayerPanelActions.AthenaLobbyPlayerPanelActions_C.CanManage
// 0x0018 (0x0018 - 0x0000)
struct AthenaLobbyPlayerPanelActions_C_CanManage final
{
public:
	bool                                          bCanManage;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInLocalPlayersParty_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidNetID_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLobbyPlayerPanelActions_C_CanManage) == 0x000008, "Wrong alignment on AthenaLobbyPlayerPanelActions_C_CanManage");
static_assert(sizeof(AthenaLobbyPlayerPanelActions_C_CanManage) == 0x000018, "Wrong size on AthenaLobbyPlayerPanelActions_C_CanManage");
