#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaBannerSelectModal

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaBannerSelectModal.AthenaBannerSelectModal_C.ExecuteUbergraph_AthenaBannerSelectModal
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_IconId;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_ColorId;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleCloseAction_PassThrough;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleCloseAction_PassThrough2;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal) == 0x000008, "Wrong alignment on AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal");
static_assert(sizeof(AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal) == 0x000020, "Wrong size on AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal");
static_assert(offsetof(AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal, EntryPoint) == 0x000000, "Member 'AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal, K2Node_ComponentBoundEvent_IconId) == 0x000008, "Member 'AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal::K2Node_ComponentBoundEvent_IconId' has a wrong offset!");
static_assert(offsetof(AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal, K2Node_ComponentBoundEvent_ColorId) == 0x000010, "Member 'AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal::K2Node_ComponentBoundEvent_ColorId' has a wrong offset!");
static_assert(offsetof(AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal, CallFunc_HandleCloseAction_PassThrough) == 0x000018, "Member 'AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal::CallFunc_HandleCloseAction_PassThrough' has a wrong offset!");
static_assert(offsetof(AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal, CallFunc_HandleCloseAction_PassThrough2) == 0x000019, "Member 'AthenaBannerSelectModal_C_ExecuteUbergraph_AthenaBannerSelectModal::CallFunc_HandleCloseAction_PassThrough2' has a wrong offset!");

// Function AthenaBannerSelectModal.AthenaBannerSelectModal_C.BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) AthenaBannerSelectModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature final
{
public:
	class FName                                   IconId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ColorId;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBannerSelectModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature) == 0x000008, "Wrong alignment on AthenaBannerSelectModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature");
static_assert(sizeof(AthenaBannerSelectModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature) == 0x000010, "Wrong size on AthenaBannerSelectModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature");
static_assert(offsetof(AthenaBannerSelectModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature, IconId) == 0x000000, "Member 'AthenaBannerSelectModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature::IconId' has a wrong offset!");
static_assert(offsetof(AthenaBannerSelectModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature, ColorId) == 0x000008, "Member 'AthenaBannerSelectModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature::ColorId' has a wrong offset!");

// Function AthenaBannerSelectModal.AthenaBannerSelectModal_C.HandleCloseAction
// 0x0010 (0x0010 - 0x0000)
struct AthenaBannerSelectModal_C_HandleCloseAction final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaBannerSelectModal_C_HandleCloseAction) == 0x000008, "Wrong alignment on AthenaBannerSelectModal_C_HandleCloseAction");
static_assert(sizeof(AthenaBannerSelectModal_C_HandleCloseAction) == 0x000010, "Wrong size on AthenaBannerSelectModal_C_HandleCloseAction");
static_assert(offsetof(AthenaBannerSelectModal_C_HandleCloseAction, Passthrough) == 0x000000, "Member 'AthenaBannerSelectModal_C_HandleCloseAction::Passthrough' has a wrong offset!");
static_assert(offsetof(AthenaBannerSelectModal_C_HandleCloseAction, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000008, "Member 'AthenaBannerSelectModal_C_HandleCloseAction::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function AthenaBannerSelectModal.AthenaBannerSelectModal_C.Setup Input Action Handlers
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) AthenaBannerSelectModal_C_Setup_Input_Action_Handlers final
{
public:
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate2;             // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate3;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AthenaBannerSelectModal_C_Setup_Input_Action_Handlers) == 0x000008, "Wrong alignment on AthenaBannerSelectModal_C_Setup_Input_Action_Handlers");
static_assert(sizeof(AthenaBannerSelectModal_C_Setup_Input_Action_Handlers) == 0x000030, "Wrong size on AthenaBannerSelectModal_C_Setup_Input_Action_Handlers");
static_assert(offsetof(AthenaBannerSelectModal_C_Setup_Input_Action_Handlers, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AthenaBannerSelectModal_C_Setup_Input_Action_Handlers::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaBannerSelectModal_C_Setup_Input_Action_Handlers, K2Node_CreateDelegate_OutputDelegate2) == 0x000010, "Member 'AthenaBannerSelectModal_C_Setup_Input_Action_Handlers::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AthenaBannerSelectModal_C_Setup_Input_Action_Handlers, K2Node_CreateDelegate_OutputDelegate3) == 0x000020, "Member 'AthenaBannerSelectModal_C_Setup_Input_Action_Handlers::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");

// Function AthenaBannerSelectModal.AthenaBannerSelectModal_C.HandlePreviousAction
// 0x0001 (0x0001 - 0x0000)
struct AthenaBannerSelectModal_C_HandlePreviousAction final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaBannerSelectModal_C_HandlePreviousAction) == 0x000001, "Wrong alignment on AthenaBannerSelectModal_C_HandlePreviousAction");
static_assert(sizeof(AthenaBannerSelectModal_C_HandlePreviousAction) == 0x000001, "Wrong size on AthenaBannerSelectModal_C_HandlePreviousAction");
static_assert(offsetof(AthenaBannerSelectModal_C_HandlePreviousAction, Passthrough) == 0x000000, "Member 'AthenaBannerSelectModal_C_HandlePreviousAction::Passthrough' has a wrong offset!");

// Function AthenaBannerSelectModal.AthenaBannerSelectModal_C.HandleNextAction
// 0x0001 (0x0001 - 0x0000)
struct AthenaBannerSelectModal_C_HandleNextAction final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaBannerSelectModal_C_HandleNextAction) == 0x000001, "Wrong alignment on AthenaBannerSelectModal_C_HandleNextAction");
static_assert(sizeof(AthenaBannerSelectModal_C_HandleNextAction) == 0x000001, "Wrong size on AthenaBannerSelectModal_C_HandleNextAction");
static_assert(offsetof(AthenaBannerSelectModal_C_HandleNextAction, Passthrough) == 0x000000, "Member 'AthenaBannerSelectModal_C_HandleNextAction::Passthrough' has a wrong offset!");

}

