#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaTeamMemberIndicator

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaTeamMemberIndicator.AthenaTeamMemberIndicator_C.ExecuteUbergraph_AthenaTeamMemberIndicator
// 0x00E0 (0x00E0 - 0x0000)
struct AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TArray<bool>& DBNOStates)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
	TDelegate<void(TArray<bool>& RevivingStates)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0058(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class AFortPlayerPawn*                        CallFunc_GetCurrentPawn_ReturnValue;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TArray<bool>& TalkingStates)>  K2Node_CreateDelegate_OutputDelegate4;             // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDBNO_ReturnValue;                       // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator) == 0x000008, "Wrong alignment on AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator");
static_assert(sizeof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator) == 0x0000E0, "Wrong size on AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, EntryPoint) == 0x000000, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, CallFunc_GetPlayerName_ReturnValue) == 0x000020, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, K2Node_CreateDelegate_OutputDelegate2) == 0x000048, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, K2Node_Event_MyGeometry) == 0x000058, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, K2Node_Event_InDeltaTime) == 0x000090, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, K2Node_CreateDelegate_OutputDelegate3) == 0x000098, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, CallFunc_GetCurrentPawn_ReturnValue) == 0x0000A8, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::CallFunc_GetCurrentPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, K2Node_CreateDelegate_OutputDelegate4) == 0x0000B0, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x0000C0, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, CallFunc_IsDBNO_ReturnValue) == 0x0000C9, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::CallFunc_IsDBNO_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator, K2Node_CreateDelegate_OutputDelegate5) == 0x0000D0, "Member 'AthenaTeamMemberIndicator_C_ExecuteUbergraph_AthenaTeamMemberIndicator::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");

// Function AthenaTeamMemberIndicator.AthenaTeamMemberIndicator_C.Tick
// 0x003C (0x003C - 0x0000)
struct AthenaTeamMemberIndicator_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTeamMemberIndicator_C_Tick) == 0x000004, "Wrong alignment on AthenaTeamMemberIndicator_C_Tick");
static_assert(sizeof(AthenaTeamMemberIndicator_C_Tick) == 0x00003C, "Wrong size on AthenaTeamMemberIndicator_C_Tick");
static_assert(offsetof(AthenaTeamMemberIndicator_C_Tick, MyGeometry) == 0x000000, "Member 'AthenaTeamMemberIndicator_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_Tick, InDeltaTime) == 0x000038, "Member 'AthenaTeamMemberIndicator_C_Tick::InDeltaTime' has a wrong offset!");

// Function AthenaTeamMemberIndicator.AthenaTeamMemberIndicator_C.On Team DBNO Changed
// 0x0018 (0x0018 - 0x0000)
struct AthenaTeamMemberIndicator_C_On_Team_DBNO_Changed final
{
public:
	TArray<bool>                                  DBNOStates;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTeamMemberIndicator_C_On_Team_DBNO_Changed) == 0x000008, "Wrong alignment on AthenaTeamMemberIndicator_C_On_Team_DBNO_Changed");
static_assert(sizeof(AthenaTeamMemberIndicator_C_On_Team_DBNO_Changed) == 0x000018, "Wrong size on AthenaTeamMemberIndicator_C_On_Team_DBNO_Changed");
static_assert(offsetof(AthenaTeamMemberIndicator_C_On_Team_DBNO_Changed, DBNOStates) == 0x000000, "Member 'AthenaTeamMemberIndicator_C_On_Team_DBNO_Changed::DBNOStates' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_On_Team_DBNO_Changed, CallFunc_Array_Get_Item) == 0x000010, "Member 'AthenaTeamMemberIndicator_C_On_Team_DBNO_Changed::CallFunc_Array_Get_Item' has a wrong offset!");

// Function AthenaTeamMemberIndicator.AthenaTeamMemberIndicator_C.On Team Reviving Changed
// 0x0018 (0x0018 - 0x0000)
struct AthenaTeamMemberIndicator_C_On_Team_Reviving_Changed final
{
public:
	TArray<bool>                                  Team_Reviving;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTeamMemberIndicator_C_On_Team_Reviving_Changed) == 0x000008, "Wrong alignment on AthenaTeamMemberIndicator_C_On_Team_Reviving_Changed");
static_assert(sizeof(AthenaTeamMemberIndicator_C_On_Team_Reviving_Changed) == 0x000018, "Wrong size on AthenaTeamMemberIndicator_C_On_Team_Reviving_Changed");
static_assert(offsetof(AthenaTeamMemberIndicator_C_On_Team_Reviving_Changed, Team_Reviving) == 0x000000, "Member 'AthenaTeamMemberIndicator_C_On_Team_Reviving_Changed::Team_Reviving' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_On_Team_Reviving_Changed, CallFunc_Array_Get_Item) == 0x000010, "Member 'AthenaTeamMemberIndicator_C_On_Team_Reviving_Changed::CallFunc_Array_Get_Item' has a wrong offset!");

// Function AthenaTeamMemberIndicator.AthenaTeamMemberIndicator_C.On Team Talking Changed
// 0x0020 (0x0020 - 0x0000)
struct AthenaTeamMemberIndicator_C_On_Team_Talking_Changed final
{
public:
	TArray<bool>                                  Team_Talking;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTeamMemberIndicator_C_On_Team_Talking_Changed) == 0x000008, "Wrong alignment on AthenaTeamMemberIndicator_C_On_Team_Talking_Changed");
static_assert(sizeof(AthenaTeamMemberIndicator_C_On_Team_Talking_Changed) == 0x000020, "Wrong size on AthenaTeamMemberIndicator_C_On_Team_Talking_Changed");
static_assert(offsetof(AthenaTeamMemberIndicator_C_On_Team_Talking_Changed, Team_Talking) == 0x000000, "Member 'AthenaTeamMemberIndicator_C_On_Team_Talking_Changed::Team_Talking' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_On_Team_Talking_Changed, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000010, "Member 'AthenaTeamMemberIndicator_C_On_Team_Talking_Changed::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_On_Team_Talking_Changed, CallFunc_Array_Get_Item) == 0x000018, "Member 'AthenaTeamMemberIndicator_C_On_Team_Talking_Changed::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberIndicator_C_On_Team_Talking_Changed, CallFunc_SelectFloat_ReturnValue) == 0x00001C, "Member 'AthenaTeamMemberIndicator_C_On_Team_Talking_Changed::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");

}

