#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Matchmaking_GameModeButton

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Athena_Matchmaking_GameModeButton.Athena_Matchmaking_GameModeButton_C
// 0x00E8 (0x02F0 - 0x0208)
class UAthena_Matchmaking_GameModeButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UCommonBorder*                          CB_ExtraInfo;                                      // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CB_ModeDescription;                                // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      PlayButton;                                        // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       T_ExtraInfo;                                       // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonLabel;                                       // 0x0230(0x0018)(Edit, BlueprintVisible)
	bool                                          bShowExtraInformation;                             // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ButtonMinWidth;                                    // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonMinHeight;                                   // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   GameModeSelected;                                  // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	EFortAthenaPlaylist                           MyGameMode;                                        // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bStandardGameMode;                                 // 0x0269(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bGameModeDisabled;                                 // 0x026A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26B[0x5];                                      // 0x026B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 OverrideButtonClass;                               // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOverrideButtonStyle;                              // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ModeDescription;                                   // 0x0280(0x0018)(Edit, BlueprintVisible)
	bool                                          bShowModeDescription;                              // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   ButtonHovered;                                     // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UAthenaMatchmakingOptionsDisplay_v2_C*  MyOwningDisplay;                                   // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 MyMissionGen;                                      // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   MyModeTitle;                                       // 0x02C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   MyModeDescription;                                 // 0x02D8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void GameModeSelected__DelegateSignature(class UAthena_Matchmaking_GameModeButton_C* SelectedGameModeButton);
	void ButtonHovered__DelegateSignature(class UAthena_Matchmaking_GameModeButton_C* HoveredButton);
	void ExecuteUbergraph_Athena_Matchmaking_GameModeButton(int32 EntryPoint);
	void Construct();
	void OnModeButtonHovered(class UCommonButton* Button);
	void BndEvt__PlayButton_K2Node_ComponentBoundEvent_191_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void PreConstruct(bool IsDesignTime);
	void SetupGameModeButton(const class FText& ModeDisplayName, bool bHasExtraInfo, bool Param_bIsEnabled, const class FText& ExtraInfoText);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void IsGameModeAvailable(EFortAthenaPlaylist InMode, bool* Available);
	void DisableGameModeButton();
	void ShowDisabledMessage(bool Show);
	void UpdateGameModeAvailibilty();
	void SetOwningDisplayWidget(class UAthenaMatchmakingOptionsDisplay_v2_C* OwningDisplay);
	void SetMissionGenData(bool* Success);
	void ConfigButtonWithMissionGen(class UClass* InMission);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Matchmaking_GameModeButton_C">();
	}
	static class UAthena_Matchmaking_GameModeButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthena_Matchmaking_GameModeButton_C>();
	}
};
static_assert(alignof(UAthena_Matchmaking_GameModeButton_C) == 0x000008, "Wrong alignment on UAthena_Matchmaking_GameModeButton_C");
static_assert(sizeof(UAthena_Matchmaking_GameModeButton_C) == 0x0002F0, "Wrong size on UAthena_Matchmaking_GameModeButton_C");
static_assert(offsetof(UAthena_Matchmaking_GameModeButton_C, UberGraphFrame) == 0x000208, "Member 'UAthena_Matchmaking_GameModeButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_GameModeButton_C, CB_ExtraInfo) == 0x000210, "Member 'UAthena_Matchmaking_GameModeButton_C::CB_ExtraInfo' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_GameModeButton_C, CB_ModeDescription) == 0x000218, "Member 'UAthena_Matchmaking_GameModeButton_C::CB_ModeDescription' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_GameModeButton_C, PlayButton) == 0x000220, "Member 'UAthena_Matchmaking_GameModeButton_C::PlayButton' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_GameModeButton_C, T_ExtraInfo) == 0x000228, "Member 'UAthena_Matchmaking_GameModeButton_C::T_ExtraInfo' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_GameModeButton_C, ButtonLabel) == 0x000230, "Member 'UAthena_Matchmaking_GameModeButton_C::ButtonLabel' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_GameModeButton_C, bShowExtraInformation) == 0x000248, "Member 'UAthena_Matchmaking_GameModeButton_C::bShowExtraInformation' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_GameModeButton_C, ButtonMinWidth) == 0x00024C, "Member 'UAthena_Matchmaking_GameModeButton_C::ButtonMinWidth' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_GameModeButton_C, ButtonMinHeight) == 0x000250, "Member 'UAthena_Matchmaking_GameModeButton_C::ButtonMinHeight' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_GameModeButton_C, GameModeSelected) == 0x000258, "Member 'UAthena_Matchmaking_GameModeButton_C::GameModeSelected' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_GameModeButton_C, MyGameMode) == 0x000268, "Member 'UAthena_Matchmaking_GameModeButton_C::MyGameMode' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_GameModeButton_C, bStandardGameMode) == 0x000269, "Member 'UAthena_Matchmaking_GameModeButton_C::bStandardGameMode' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_GameModeButton_C, bGameModeDisabled) == 0x00026A, "Member 'UAthena_Matchmaking_GameModeButton_C::bGameModeDisabled' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_GameModeButton_C, OverrideButtonClass) == 0x000270, "Member 'UAthena_Matchmaking_GameModeButton_C::OverrideButtonClass' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_GameModeButton_C, bOverrideButtonStyle) == 0x000278, "Member 'UAthena_Matchmaking_GameModeButton_C::bOverrideButtonStyle' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_GameModeButton_C, ModeDescription) == 0x000280, "Member 'UAthena_Matchmaking_GameModeButton_C::ModeDescription' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_GameModeButton_C, bShowModeDescription) == 0x000298, "Member 'UAthena_Matchmaking_GameModeButton_C::bShowModeDescription' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_GameModeButton_C, ButtonHovered) == 0x0002A0, "Member 'UAthena_Matchmaking_GameModeButton_C::ButtonHovered' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_GameModeButton_C, MyOwningDisplay) == 0x0002B0, "Member 'UAthena_Matchmaking_GameModeButton_C::MyOwningDisplay' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_GameModeButton_C, MyMissionGen) == 0x0002B8, "Member 'UAthena_Matchmaking_GameModeButton_C::MyMissionGen' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_GameModeButton_C, MyModeTitle) == 0x0002C0, "Member 'UAthena_Matchmaking_GameModeButton_C::MyModeTitle' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_GameModeButton_C, MyModeDescription) == 0x0002D8, "Member 'UAthena_Matchmaking_GameModeButton_C::MyModeDescription' has a wrong offset!");

}

