#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaInventoryPanel

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AthenaInventoryPanel.AthenaInventoryPanel_C.ExecuteUbergraph_AthenaInventoryPanel
// 0x00F8 (0x00F8 - 0x0000)
struct AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortQuickBars                                K2Node_Event_QuickBarType;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UFortItem* Item)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	struct FPointerEvent                          K2Node_Event_PointerEvent;                         // 0x0028(0x0070)()
	class UDragDropOperation*                     K2Node_Event_Operation;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAthenaInventoryEquipSlot_C*>    K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ZeroConstructor, ReferenceParm)
	class UAthenaInventoryDragDrop_C*             K2Node_DynamicCast_AsAthena_Inventory_Drag_Drop;   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaInventoryEquipSlot_C*            CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              K2Node_Event_Item;                                 // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue2;                  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetType_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleClose_PassThrough;                  // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EB[0x5];                                       // 0x00EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue3;                  // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel) == 0x000008, "Wrong alignment on AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel");
static_assert(sizeof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel) == 0x0000F8, "Wrong size on AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, EntryPoint) == 0x000000, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, Temp_int_Array_Index_Variable) == 0x000010, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_Event_QuickBarType) == 0x000014, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_Event_QuickBarType' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000015, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_Event_PointerEvent) == 0x000028, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_Event_PointerEvent' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_Event_Operation) == 0x000098, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_Event_Operation' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_MakeArray_Array) == 0x0000A0, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_DynamicCast_AsAthena_Inventory_Drag_Drop) == 0x0000B0, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_DynamicCast_AsAthena_Inventory_Drag_Drop' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_Array_Length_ReturnValue) == 0x0000C8, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, Temp_int_Loop_Counter_Variable) == 0x0000CC, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_Less_IntInt_ReturnValue) == 0x0000D0, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_Add_IntInt_ReturnValue) == 0x0000D4, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, K2Node_Event_Item) == 0x0000D8, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::K2Node_Event_Item' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_GetContext_ReturnValue2) == 0x0000E0, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_GetType_ReturnValue) == 0x0000E8, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_GetType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x0000E9, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_HandleClose_PassThrough) == 0x0000EA, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_HandleClose_PassThrough' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel, CallFunc_GetContext_ReturnValue3) == 0x0000F0, "Member 'AthenaInventoryPanel_C_ExecuteUbergraph_AthenaInventoryPanel::CallFunc_GetContext_ReturnValue3' has a wrong offset!");

// Function AthenaInventoryPanel.AthenaInventoryPanel_C.RequestEquip
// 0x0008 (0x0008 - 0x0000)
struct AthenaInventoryPanel_C_RequestEquip final
{
public:
	class UFortItem*                              Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryPanel_C_RequestEquip) == 0x000008, "Wrong alignment on AthenaInventoryPanel_C_RequestEquip");
static_assert(sizeof(AthenaInventoryPanel_C_RequestEquip) == 0x000008, "Wrong size on AthenaInventoryPanel_C_RequestEquip");
static_assert(offsetof(AthenaInventoryPanel_C_RequestEquip, Item) == 0x000000, "Member 'AthenaInventoryPanel_C_RequestEquip::Item' has a wrong offset!");

// Function AthenaInventoryPanel.AthenaInventoryPanel_C.OnDragLeave
// 0x0078 (0x0078 - 0x0000)
struct AthenaInventoryPanel_C_OnDragLeave final
{
public:
	struct FPointerEvent                          PointerEvent;                                      // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryPanel_C_OnDragLeave) == 0x000008, "Wrong alignment on AthenaInventoryPanel_C_OnDragLeave");
static_assert(sizeof(AthenaInventoryPanel_C_OnDragLeave) == 0x000078, "Wrong size on AthenaInventoryPanel_C_OnDragLeave");
static_assert(offsetof(AthenaInventoryPanel_C_OnDragLeave, PointerEvent) == 0x000000, "Member 'AthenaInventoryPanel_C_OnDragLeave::PointerEvent' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_OnDragLeave, Operation) == 0x000070, "Member 'AthenaInventoryPanel_C_OnDragLeave::Operation' has a wrong offset!");

// Function AthenaInventoryPanel.AthenaInventoryPanel_C.HandleQuickBarChangedBP
// 0x0001 (0x0001 - 0x0000)
struct AthenaInventoryPanel_C_HandleQuickBarChangedBP final
{
public:
	EFortQuickBars                                QuickBarType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryPanel_C_HandleQuickBarChangedBP) == 0x000001, "Wrong alignment on AthenaInventoryPanel_C_HandleQuickBarChangedBP");
static_assert(sizeof(AthenaInventoryPanel_C_HandleQuickBarChangedBP) == 0x000001, "Wrong size on AthenaInventoryPanel_C_HandleQuickBarChangedBP");
static_assert(offsetof(AthenaInventoryPanel_C_HandleQuickBarChangedBP, QuickBarType) == 0x000000, "Member 'AthenaInventoryPanel_C_HandleQuickBarChangedBP::QuickBarType' has a wrong offset!");

// Function AthenaInventoryPanel.AthenaInventoryPanel_C.HandleClose
// 0x0030 (0x0030 - 0x0000)
struct AthenaInventoryPanel_C_HandleClose final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue2;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSwapping_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue3;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryPanel_C_HandleClose) == 0x000008, "Wrong alignment on AthenaInventoryPanel_C_HandleClose");
static_assert(sizeof(AthenaInventoryPanel_C_HandleClose) == 0x000030, "Wrong size on AthenaInventoryPanel_C_HandleClose");
static_assert(offsetof(AthenaInventoryPanel_C_HandleClose, Passthrough) == 0x000000, "Member 'AthenaInventoryPanel_C_HandleClose::Passthrough' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_HandleClose, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaInventoryPanel_C_HandleClose::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_HandleClose, CallFunc_GetContext_ReturnValue2) == 0x000010, "Member 'AthenaInventoryPanel_C_HandleClose::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_HandleClose, CallFunc_IsSwapping_ReturnValue) == 0x000018, "Member 'AthenaInventoryPanel_C_HandleClose::CallFunc_IsSwapping_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_HandleClose, CallFunc_GetUINavigationManager_ReturnValue) == 0x000020, "Member 'AthenaInventoryPanel_C_HandleClose::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_HandleClose, CallFunc_GetContext_ReturnValue3) == 0x000028, "Member 'AthenaInventoryPanel_C_HandleClose::CallFunc_GetContext_ReturnValue3' has a wrong offset!");

// Function AthenaInventoryPanel.AthenaInventoryPanel_C.RegisterBack
// 0x0020 (0x0020 - 0x0000)
struct AthenaInventoryPanel_C_RegisterBack final
{
public:
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0010(0x0010)(NoDestructor)
};
static_assert(alignof(AthenaInventoryPanel_C_RegisterBack) == 0x000008, "Wrong alignment on AthenaInventoryPanel_C_RegisterBack");
static_assert(sizeof(AthenaInventoryPanel_C_RegisterBack) == 0x000020, "Wrong size on AthenaInventoryPanel_C_RegisterBack");
static_assert(offsetof(AthenaInventoryPanel_C_RegisterBack, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AthenaInventoryPanel_C_RegisterBack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_RegisterBack, K2Node_MakeStruct_DataTableRowHandle) == 0x000010, "Member 'AthenaInventoryPanel_C_RegisterBack::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");

// Function AthenaInventoryPanel.AthenaInventoryPanel_C.RegisterLeaveInventory
// 0x0020 (0x0020 - 0x0000)
struct AthenaInventoryPanel_C_RegisterLeaveInventory final
{
public:
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0010(0x0010)(NoDestructor)
};
static_assert(alignof(AthenaInventoryPanel_C_RegisterLeaveInventory) == 0x000008, "Wrong alignment on AthenaInventoryPanel_C_RegisterLeaveInventory");
static_assert(sizeof(AthenaInventoryPanel_C_RegisterLeaveInventory) == 0x000020, "Wrong size on AthenaInventoryPanel_C_RegisterLeaveInventory");
static_assert(offsetof(AthenaInventoryPanel_C_RegisterLeaveInventory, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AthenaInventoryPanel_C_RegisterLeaveInventory::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_RegisterLeaveInventory, K2Node_MakeStruct_DataTableRowHandle) == 0x000010, "Member 'AthenaInventoryPanel_C_RegisterLeaveInventory::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");

// Function AthenaInventoryPanel.AthenaInventoryPanel_C.RegisterDrop
// 0x0038 (0x0038 - 0x0000)
struct AthenaInventoryPanel_C_RegisterDrop final
{
public:
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UFortItem*                              CallFunc_GetSelectedInventoryItem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0020(0x0010)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaInventoryPanel_C_RegisterDrop) == 0x000008, "Wrong alignment on AthenaInventoryPanel_C_RegisterDrop");
static_assert(sizeof(AthenaInventoryPanel_C_RegisterDrop) == 0x000038, "Wrong size on AthenaInventoryPanel_C_RegisterDrop");
static_assert(offsetof(AthenaInventoryPanel_C_RegisterDrop, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'AthenaInventoryPanel_C_RegisterDrop::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_RegisterDrop, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'AthenaInventoryPanel_C_RegisterDrop::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_RegisterDrop, CallFunc_GetSelectedInventoryItem_ReturnValue) == 0x000018, "Member 'AthenaInventoryPanel_C_RegisterDrop::CallFunc_GetSelectedInventoryItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_RegisterDrop, K2Node_MakeStruct_DataTableRowHandle) == 0x000020, "Member 'AthenaInventoryPanel_C_RegisterDrop::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_RegisterDrop, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'AthenaInventoryPanel_C_RegisterDrop::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AthenaInventoryPanel.AthenaInventoryPanel_C.HandleDrop
// 0x0040 (0x0040 - 0x0000)
struct AthenaInventoryPanel_C_HandleDrop final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 ChosenValue, class UFortItem* FortItem)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_GetSelectedInventoryItem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItem*                         K2Node_DynamicCast_AsFort_World_Item;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumInStack_ReturnValue;                // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaInventoryPanel_C_HandleDrop) == 0x000008, "Wrong alignment on AthenaInventoryPanel_C_HandleDrop");
static_assert(sizeof(AthenaInventoryPanel_C_HandleDrop) == 0x000040, "Wrong size on AthenaInventoryPanel_C_HandleDrop");
static_assert(offsetof(AthenaInventoryPanel_C_HandleDrop, Passthrough) == 0x000000, "Member 'AthenaInventoryPanel_C_HandleDrop::Passthrough' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_HandleDrop, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'AthenaInventoryPanel_C_HandleDrop::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_HandleDrop, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'AthenaInventoryPanel_C_HandleDrop::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_HandleDrop, CallFunc_GetSelectedInventoryItem_ReturnValue) == 0x000020, "Member 'AthenaInventoryPanel_C_HandleDrop::CallFunc_GetSelectedInventoryItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_HandleDrop, K2Node_DynamicCast_AsFort_World_Item) == 0x000028, "Member 'AthenaInventoryPanel_C_HandleDrop::K2Node_DynamicCast_AsFort_World_Item' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_HandleDrop, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AthenaInventoryPanel_C_HandleDrop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_HandleDrop, CallFunc_GetNumInStack_ReturnValue) == 0x000034, "Member 'AthenaInventoryPanel_C_HandleDrop::CallFunc_GetNumInStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_HandleDrop, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'AthenaInventoryPanel_C_HandleDrop::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaInventoryPanel.AthenaInventoryPanel_C.DropItem
// 0x0030 (0x0030 - 0x0000)
struct AthenaInventoryPanel_C_DropItem final
{
public:
	class UFortWorldItem*                         Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Quantity;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemTileView*                      CallFunc_GetTileViewForItem_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemTileView*                      CallFunc_GetTileViewForItem_ReturnValue2;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumInStack_ReturnValue;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaInventoryPanel_C_DropItem) == 0x000008, "Wrong alignment on AthenaInventoryPanel_C_DropItem");
static_assert(sizeof(AthenaInventoryPanel_C_DropItem) == 0x000030, "Wrong size on AthenaInventoryPanel_C_DropItem");
static_assert(offsetof(AthenaInventoryPanel_C_DropItem, Item) == 0x000000, "Member 'AthenaInventoryPanel_C_DropItem::Item' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_DropItem, Quantity) == 0x000008, "Member 'AthenaInventoryPanel_C_DropItem::Quantity' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_DropItem, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'AthenaInventoryPanel_C_DropItem::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_DropItem, CallFunc_GetTileViewForItem_ReturnValue) == 0x000018, "Member 'AthenaInventoryPanel_C_DropItem::CallFunc_GetTileViewForItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_DropItem, CallFunc_GetTileViewForItem_ReturnValue2) == 0x000020, "Member 'AthenaInventoryPanel_C_DropItem::CallFunc_GetTileViewForItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_DropItem, CallFunc_GetNumInStack_ReturnValue) == 0x000028, "Member 'AthenaInventoryPanel_C_DropItem::CallFunc_GetNumInStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_DropItem, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00002C, "Member 'AthenaInventoryPanel_C_DropItem::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaInventoryPanel.AthenaInventoryPanel_C.CreateQuantitySelectorWidget
// 0x0048 (0x0048 - 0x0000)
struct AthenaInventoryPanel_C_CreateQuantitySelectorWidget final
{
public:
	class UFortWorldItem*                         Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ConfirmationText;                                  // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         CallFunc_GetNumInStack_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuantitySelector_C*                    CallFunc_Create_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryPanel_C_CreateQuantitySelectorWidget) == 0x000008, "Wrong alignment on AthenaInventoryPanel_C_CreateQuantitySelectorWidget");
static_assert(sizeof(AthenaInventoryPanel_C_CreateQuantitySelectorWidget) == 0x000048, "Wrong size on AthenaInventoryPanel_C_CreateQuantitySelectorWidget");
static_assert(offsetof(AthenaInventoryPanel_C_CreateQuantitySelectorWidget, Item) == 0x000000, "Member 'AthenaInventoryPanel_C_CreateQuantitySelectorWidget::Item' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_CreateQuantitySelectorWidget, ConfirmationText) == 0x000008, "Member 'AthenaInventoryPanel_C_CreateQuantitySelectorWidget::ConfirmationText' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_CreateQuantitySelectorWidget, CallFunc_GetNumInStack_ReturnValue) == 0x000020, "Member 'AthenaInventoryPanel_C_CreateQuantitySelectorWidget::CallFunc_GetNumInStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_CreateQuantitySelectorWidget, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000028, "Member 'AthenaInventoryPanel_C_CreateQuantitySelectorWidget::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_CreateQuantitySelectorWidget, CallFunc_Divide_IntInt_ReturnValue) == 0x000030, "Member 'AthenaInventoryPanel_C_CreateQuantitySelectorWidget::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_CreateQuantitySelectorWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000038, "Member 'AthenaInventoryPanel_C_CreateQuantitySelectorWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_CreateQuantitySelectorWidget, CallFunc_Create_ReturnValue) == 0x000040, "Member 'AthenaInventoryPanel_C_CreateQuantitySelectorWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function AthenaInventoryPanel.AthenaInventoryPanel_C.DestroyQuantitySelectorWidget
// 0x0001 (0x0001 - 0x0000)
struct AthenaInventoryPanel_C_DestroyQuantitySelectorWidget final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaInventoryPanel_C_DestroyQuantitySelectorWidget) == 0x000001, "Wrong alignment on AthenaInventoryPanel_C_DestroyQuantitySelectorWidget");
static_assert(sizeof(AthenaInventoryPanel_C_DestroyQuantitySelectorWidget) == 0x000001, "Wrong size on AthenaInventoryPanel_C_DestroyQuantitySelectorWidget");
static_assert(offsetof(AthenaInventoryPanel_C_DestroyQuantitySelectorWidget, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'AthenaInventoryPanel_C_DestroyQuantitySelectorWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function AthenaInventoryPanel.AthenaInventoryPanel_C.HandleDropItemConfirmationCallback
// 0x0020 (0x0020 - 0x0000)
struct AthenaInventoryPanel_C_HandleDropItemConfirmationCallback final
{
public:
	int32                                         ChosenQuantity;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              Item;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItem*                         K2Node_DynamicCast_AsFort_World_Item;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaInventoryPanel_C_HandleDropItemConfirmationCallback) == 0x000008, "Wrong alignment on AthenaInventoryPanel_C_HandleDropItemConfirmationCallback");
static_assert(sizeof(AthenaInventoryPanel_C_HandleDropItemConfirmationCallback) == 0x000020, "Wrong size on AthenaInventoryPanel_C_HandleDropItemConfirmationCallback");
static_assert(offsetof(AthenaInventoryPanel_C_HandleDropItemConfirmationCallback, ChosenQuantity) == 0x000000, "Member 'AthenaInventoryPanel_C_HandleDropItemConfirmationCallback::ChosenQuantity' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_HandleDropItemConfirmationCallback, Item) == 0x000008, "Member 'AthenaInventoryPanel_C_HandleDropItemConfirmationCallback::Item' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_HandleDropItemConfirmationCallback, K2Node_DynamicCast_AsFort_World_Item) == 0x000010, "Member 'AthenaInventoryPanel_C_HandleDropItemConfirmationCallback::K2Node_DynamicCast_AsFort_World_Item' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_HandleDropItemConfirmationCallback, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AthenaInventoryPanel_C_HandleDropItemConfirmationCallback::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AthenaInventoryPanel.AthenaInventoryPanel_C.NavEquipment
// 0x00B8 (0x00B8 - 0x0000)
struct AthenaInventoryPanel_C_NavEquipment final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemTileView*                      Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemTileView*                      Temp_object_Variable2;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUINavigation                                 Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Temp_object_Variable3;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable4;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable5;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable6;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSwapping_ReturnValue;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumItems_ReturnValue2;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumItems_ReturnValue3;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemTileView*                      K2Node_Select_Default;                             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue3;              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemTileView*                      K2Node_Select2_Default;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemTileView*                      K2Node_Select3_Default;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue4;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue4;              // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select4_Default;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select5_Default;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryPanel_C_NavEquipment) == 0x000008, "Wrong alignment on AthenaInventoryPanel_C_NavEquipment");
static_assert(sizeof(AthenaInventoryPanel_C_NavEquipment) == 0x0000B8, "Wrong size on AthenaInventoryPanel_C_NavEquipment");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, Param_Navigation) == 0x000000, "Member 'AthenaInventoryPanel_C_NavEquipment::Param_Navigation' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, ReturnValue) == 0x000008, "Member 'AthenaInventoryPanel_C_NavEquipment::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, Temp_bool_Variable) == 0x000010, "Member 'AthenaInventoryPanel_C_NavEquipment::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, Temp_object_Variable) == 0x000018, "Member 'AthenaInventoryPanel_C_NavEquipment::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, Temp_bool_Variable2) == 0x000020, "Member 'AthenaInventoryPanel_C_NavEquipment::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, Temp_bool_Variable3) == 0x000021, "Member 'AthenaInventoryPanel_C_NavEquipment::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, Temp_object_Variable2) == 0x000028, "Member 'AthenaInventoryPanel_C_NavEquipment::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, Temp_byte_Variable) == 0x000030, "Member 'AthenaInventoryPanel_C_NavEquipment::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, Temp_object_Variable3) == 0x000038, "Member 'AthenaInventoryPanel_C_NavEquipment::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, Temp_object_Variable4) == 0x000040, "Member 'AthenaInventoryPanel_C_NavEquipment::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, Temp_object_Variable5) == 0x000048, "Member 'AthenaInventoryPanel_C_NavEquipment::Temp_object_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, Temp_object_Variable6) == 0x000050, "Member 'AthenaInventoryPanel_C_NavEquipment::Temp_object_Variable6' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, Temp_bool_Variable4) == 0x000058, "Member 'AthenaInventoryPanel_C_NavEquipment::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, CallFunc_GetContext_ReturnValue) == 0x000060, "Member 'AthenaInventoryPanel_C_NavEquipment::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, CallFunc_IsSwapping_ReturnValue) == 0x000068, "Member 'AthenaInventoryPanel_C_NavEquipment::CallFunc_IsSwapping_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, CallFunc_GetNumItems_ReturnValue) == 0x00006C, "Member 'AthenaInventoryPanel_C_NavEquipment::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, CallFunc_Greater_IntInt_ReturnValue) == 0x000070, "Member 'AthenaInventoryPanel_C_NavEquipment::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, CallFunc_GetNumItems_ReturnValue2) == 0x000074, "Member 'AthenaInventoryPanel_C_NavEquipment::CallFunc_GetNumItems_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, CallFunc_Greater_IntInt_ReturnValue2) == 0x000078, "Member 'AthenaInventoryPanel_C_NavEquipment::CallFunc_Greater_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, CallFunc_GetNumItems_ReturnValue3) == 0x00007C, "Member 'AthenaInventoryPanel_C_NavEquipment::CallFunc_GetNumItems_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, K2Node_Select_Default) == 0x000080, "Member 'AthenaInventoryPanel_C_NavEquipment::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, CallFunc_Greater_IntInt_ReturnValue3) == 0x000088, "Member 'AthenaInventoryPanel_C_NavEquipment::CallFunc_Greater_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, K2Node_Select2_Default) == 0x000090, "Member 'AthenaInventoryPanel_C_NavEquipment::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, K2Node_Select3_Default) == 0x000098, "Member 'AthenaInventoryPanel_C_NavEquipment::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, CallFunc_GetNumItems_ReturnValue4) == 0x0000A0, "Member 'AthenaInventoryPanel_C_NavEquipment::CallFunc_GetNumItems_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, CallFunc_Greater_IntInt_ReturnValue4) == 0x0000A4, "Member 'AthenaInventoryPanel_C_NavEquipment::CallFunc_Greater_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, K2Node_Select4_Default) == 0x0000A8, "Member 'AthenaInventoryPanel_C_NavEquipment::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavEquipment, K2Node_Select5_Default) == 0x0000B0, "Member 'AthenaInventoryPanel_C_NavEquipment::K2Node_Select5_Default' has a wrong offset!");

// Function AthenaInventoryPanel.AthenaInventoryPanel_C.NavResources
// 0x0050 (0x0050 - 0x0000)
struct AthenaInventoryPanel_C_NavResources final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUINavigation                                 Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable2;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable3;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable4;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select2_Default;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryPanel_C_NavResources) == 0x000008, "Wrong alignment on AthenaInventoryPanel_C_NavResources");
static_assert(sizeof(AthenaInventoryPanel_C_NavResources) == 0x000050, "Wrong size on AthenaInventoryPanel_C_NavResources");
static_assert(offsetof(AthenaInventoryPanel_C_NavResources, Param_Navigation) == 0x000000, "Member 'AthenaInventoryPanel_C_NavResources::Param_Navigation' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavResources, ReturnValue) == 0x000008, "Member 'AthenaInventoryPanel_C_NavResources::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavResources, Temp_bool_Variable) == 0x000010, "Member 'AthenaInventoryPanel_C_NavResources::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavResources, Temp_byte_Variable) == 0x000011, "Member 'AthenaInventoryPanel_C_NavResources::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavResources, Temp_object_Variable) == 0x000018, "Member 'AthenaInventoryPanel_C_NavResources::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavResources, Temp_object_Variable2) == 0x000020, "Member 'AthenaInventoryPanel_C_NavResources::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavResources, Temp_object_Variable3) == 0x000028, "Member 'AthenaInventoryPanel_C_NavResources::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavResources, Temp_object_Variable4) == 0x000030, "Member 'AthenaInventoryPanel_C_NavResources::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavResources, CallFunc_GetNumItems_ReturnValue) == 0x000038, "Member 'AthenaInventoryPanel_C_NavResources::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavResources, CallFunc_Greater_IntInt_ReturnValue) == 0x00003C, "Member 'AthenaInventoryPanel_C_NavResources::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavResources, K2Node_Select_Default) == 0x000040, "Member 'AthenaInventoryPanel_C_NavResources::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavResources, K2Node_Select2_Default) == 0x000048, "Member 'AthenaInventoryPanel_C_NavResources::K2Node_Select2_Default' has a wrong offset!");

// Function AthenaInventoryPanel.AthenaInventoryPanel_C.NavAmmo
// 0x0050 (0x0050 - 0x0000)
struct AthenaInventoryPanel_C_NavAmmo final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUINavigation                                 Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable2;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable3;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Temp_object_Variable4;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select2_Default;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryPanel_C_NavAmmo) == 0x000008, "Wrong alignment on AthenaInventoryPanel_C_NavAmmo");
static_assert(sizeof(AthenaInventoryPanel_C_NavAmmo) == 0x000050, "Wrong size on AthenaInventoryPanel_C_NavAmmo");
static_assert(offsetof(AthenaInventoryPanel_C_NavAmmo, Param_Navigation) == 0x000000, "Member 'AthenaInventoryPanel_C_NavAmmo::Param_Navigation' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavAmmo, ReturnValue) == 0x000008, "Member 'AthenaInventoryPanel_C_NavAmmo::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavAmmo, Temp_bool_Variable) == 0x000010, "Member 'AthenaInventoryPanel_C_NavAmmo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavAmmo, Temp_byte_Variable) == 0x000011, "Member 'AthenaInventoryPanel_C_NavAmmo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavAmmo, Temp_object_Variable) == 0x000018, "Member 'AthenaInventoryPanel_C_NavAmmo::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavAmmo, Temp_object_Variable2) == 0x000020, "Member 'AthenaInventoryPanel_C_NavAmmo::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavAmmo, Temp_object_Variable3) == 0x000028, "Member 'AthenaInventoryPanel_C_NavAmmo::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavAmmo, Temp_object_Variable4) == 0x000030, "Member 'AthenaInventoryPanel_C_NavAmmo::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavAmmo, CallFunc_GetNumItems_ReturnValue) == 0x000038, "Member 'AthenaInventoryPanel_C_NavAmmo::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavAmmo, CallFunc_Greater_IntInt_ReturnValue) == 0x00003C, "Member 'AthenaInventoryPanel_C_NavAmmo::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavAmmo, K2Node_Select_Default) == 0x000040, "Member 'AthenaInventoryPanel_C_NavAmmo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaInventoryPanel_C_NavAmmo, K2Node_Select2_Default) == 0x000048, "Member 'AthenaInventoryPanel_C_NavAmmo::K2Node_Select2_Default' has a wrong offset!");

// Function AthenaInventoryPanel.AthenaInventoryPanel_C.FocusFirstEquipSlot
// 0x0010 (0x0010 - 0x0000)
struct AthenaInventoryPanel_C_FocusFirstEquipSlot final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryPanel_C_FocusFirstEquipSlot) == 0x000008, "Wrong alignment on AthenaInventoryPanel_C_FocusFirstEquipSlot");
static_assert(sizeof(AthenaInventoryPanel_C_FocusFirstEquipSlot) == 0x000010, "Wrong size on AthenaInventoryPanel_C_FocusFirstEquipSlot");
