#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaTalkingList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaTalkingList.AthenaTalkingList_C
// 0x0088 (0x02C0 - 0x0238)
class UAthenaTalkingList_C final : public UFortHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UVerticalBox*                           _Vertical_Box__Team_Members;                       // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_101;                                         // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_102;                                         // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_103;                                         // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_104;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PlayerName0;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PlayerName1;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PlayerName2;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PlayerName3;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PlayerName4;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TalkingPlayer0;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TalkingPlayer1;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TalkingPlayer2;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TalkingPlayer3;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TalkingPlayer4;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaTalkingList(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void TalkingPlayersChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaTalkingList_C">();
	}
	static class UAthenaTalkingList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaTalkingList_C>();
	}
};
static_assert(alignof(UAthenaTalkingList_C) == 0x000008, "Wrong alignment on UAthenaTalkingList_C");
static_assert(sizeof(UAthenaTalkingList_C) == 0x0002C0, "Wrong size on UAthenaTalkingList_C");
static_assert(offsetof(UAthenaTalkingList_C, UberGraphFrame) == 0x000238, "Member 'UAthenaTalkingList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaTalkingList_C, _Vertical_Box__Team_Members) == 0x000240, "Member 'UAthenaTalkingList_C::_Vertical_Box__Team_Members' has a wrong offset!");
static_assert(offsetof(UAthenaTalkingList_C, Image_0) == 0x000248, "Member 'UAthenaTalkingList_C::Image_0' has a wrong offset!");
static_assert(offsetof(UAthenaTalkingList_C, Image_101) == 0x000250, "Member 'UAthenaTalkingList_C::Image_101' has a wrong offset!");
static_assert(offsetof(UAthenaTalkingList_C, Image_102) == 0x000258, "Member 'UAthenaTalkingList_C::Image_102' has a wrong offset!");
static_assert(offsetof(UAthenaTalkingList_C, Image_103) == 0x000260, "Member 'UAthenaTalkingList_C::Image_103' has a wrong offset!");
static_assert(offsetof(UAthenaTalkingList_C, Image_104) == 0x000268, "Member 'UAthenaTalkingList_C::Image_104' has a wrong offset!");
static_assert(offsetof(UAthenaTalkingList_C, PlayerName0) == 0x000270, "Member 'UAthenaTalkingList_C::PlayerName0' has a wrong offset!");
static_assert(offsetof(UAthenaTalkingList_C, PlayerName1) == 0x000278, "Member 'UAthenaTalkingList_C::PlayerName1' has a wrong offset!");
static_assert(offsetof(UAthenaTalkingList_C, PlayerName2) == 0x000280, "Member 'UAthenaTalkingList_C::PlayerName2' has a wrong offset!");
static_assert(offsetof(UAthenaTalkingList_C, PlayerName3) == 0x000288, "Member 'UAthenaTalkingList_C::PlayerName3' has a wrong offset!");
static_assert(offsetof(UAthenaTalkingList_C, PlayerName4) == 0x000290, "Member 'UAthenaTalkingList_C::PlayerName4' has a wrong offset!");
static_assert(offsetof(UAthenaTalkingList_C, TalkingPlayer0) == 0x000298, "Member 'UAthenaTalkingList_C::TalkingPlayer0' has a wrong offset!");
static_assert(offsetof(UAthenaTalkingList_C, TalkingPlayer1) == 0x0002A0, "Member 'UAthenaTalkingList_C::TalkingPlayer1' has a wrong offset!");
static_assert(offsetof(UAthenaTalkingList_C, TalkingPlayer2) == 0x0002A8, "Member 'UAthenaTalkingList_C::TalkingPlayer2' has a wrong offset!");
static_assert(offsetof(UAthenaTalkingList_C, TalkingPlayer3) == 0x0002B0, "Member 'UAthenaTalkingList_C::TalkingPlayer3' has a wrong offset!");
static_assert(offsetof(UAthenaTalkingList_C, TalkingPlayer4) == 0x0002B8, "Member 'UAthenaTalkingList_C::TalkingPlayer4' has a wrong offset!");

}

