#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_DtB_LightningZap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_DtB_LightningZap.B_DtB_LightningZap_C
// 0x0030 (0x0398 - 0x0368)
class AB_DtB_LightningZap_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_DtBRiftLightningZap;                             // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RiftLocation;                                      // 0x0380(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TickDuration;                                      // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TickCounter;                                       // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_DtB_LightningZap(int32 EntryPoint);
	void FireLightning();
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_DtB_LightningZap_C">();
	}
	static class AB_DtB_LightningZap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_DtB_LightningZap_C>();
	}
};
static_assert(alignof(AB_DtB_LightningZap_C) == 0x000008, "Wrong alignment on AB_DtB_LightningZap_C");
static_assert(sizeof(AB_DtB_LightningZap_C) == 0x000398, "Wrong size on AB_DtB_LightningZap_C");
static_assert(offsetof(AB_DtB_LightningZap_C, UberGraphFrame) == 0x000368, "Member 'AB_DtB_LightningZap_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_DtB_LightningZap_C, P_DtBRiftLightningZap) == 0x000370, "Member 'AB_DtB_LightningZap_C::P_DtBRiftLightningZap' has a wrong offset!");
static_assert(offsetof(AB_DtB_LightningZap_C, DefaultSceneRoot) == 0x000378, "Member 'AB_DtB_LightningZap_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AB_DtB_LightningZap_C, RiftLocation) == 0x000380, "Member 'AB_DtB_LightningZap_C::RiftLocation' has a wrong offset!");
static_assert(offsetof(AB_DtB_LightningZap_C, TickDuration) == 0x00038C, "Member 'AB_DtB_LightningZap_C::TickDuration' has a wrong offset!");
static_assert(offsetof(AB_DtB_LightningZap_C, TickCounter) == 0x000390, "Member 'AB_DtB_LightningZap_C::TickCounter' has a wrong offset!");

}

