#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_GoinCommandoWeapon

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "B_Ranged_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_GoinCommandoWeapon.B_GoinCommandoWeapon_C
// 0x00B8 (0x0EB0 - 0x0DF8)
class AB_GoinCommandoWeapon_C final : public AB_Ranged_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_GoinCommandoWeapon_C;             // 0x0DF8(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_GoingCommando_ChargeUp_01;                       // 0x0E00(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SpinDownSound;                                     // 0x0E08(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SpinUpSound;                                       // 0x0E10(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ChargeUp_ChargingTime_46AF3CCF4ABF9B1069FB7989793B0F32; // 0x0E18(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ChargeUp__Direction_46AF3CCF4ABF9B1069FB7989793B0F32; // 0x0E1C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1D[0x3];                                      // 0x0E1D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ChargeUp;                                          // 0x0E20(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Boomstick;                                         // 0x0E28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E29[0x7];                                      // 0x0E29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        BulletImpact_Lvl0Minus4;                           // 0x0E30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        BulletImpact_Lvl5;                                 // 0x0E38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     DecalMaterialLvl0Minus4;                           // 0x0E40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     DecalMaterialLvl5;                                 // 0x0E48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        MuzzleLvl5;                                        // 0x0E50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        MuzzleLvl0Minus4;                                  // 0x0E58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TracerLvl5;                                        // 0x0E60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TracerLvl0Minus4;                                  // 0x0E68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  TC_Boomstick;                                      // 0x0E70(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UParticleSystemComponent*               Effect_GoingCommando_WeaponArcs;                   // 0x0E90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        ChargeupLvl0Minus4;                                // 0x0E98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        ChargeupLvl5;                                      // 0x0EA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentChargeTime;                                 // 0x0EA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_GoinCommandoWeapon(int32 EntryPoint);
	void OnInitCosmeticAlterations(const struct FFortCosmeticModification& CosmeticMod, class UMaterialInstanceDynamic* DynamicMaterialInstance);
	void OnChargeDown();
	void OnChargeUp();
	void OnPlayImpactFX(const struct FHitResult& HitResult, EPhysicalSurface ImpactPhysicalSurface, class UParticleSystemComponent* SpawnedPSC);
	void OnPlayWeaponFireFX(bool bPersistentFire, bool bSecondaryFire);
	void ChargeUp__FinishedFunc();
	void ChargeUp__UpdateFunc();
	void ReceiveBeginPlay();
	void SetUpgradeLevel();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_GoinCommandoWeapon_C">();
	}
	static class AB_GoinCommandoWeapon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_GoinCommandoWeapon_C>();
	}
};
static_assert(alignof(AB_GoinCommandoWeapon_C) == 0x000008, "Wrong alignment on AB_GoinCommandoWeapon_C");
static_assert(sizeof(AB_GoinCommandoWeapon_C) == 0x000EB0, "Wrong size on AB_GoinCommandoWeapon_C");
static_assert(offsetof(AB_GoinCommandoWeapon_C, UberGraphFrame_B_GoinCommandoWeapon_C) == 0x000DF8, "Member 'AB_GoinCommandoWeapon_C::UberGraphFrame_B_GoinCommandoWeapon_C' has a wrong offset!");
static_assert(offsetof(AB_GoinCommandoWeapon_C, P_GoingCommando_ChargeUp_01) == 0x000E00, "Member 'AB_GoinCommandoWeapon_C::P_GoingCommando_ChargeUp_01' has a wrong offset!");
static_assert(offsetof(AB_GoinCommandoWeapon_C, SpinDownSound) == 0x000E08, "Member 'AB_GoinCommandoWeapon_C::SpinDownSound' has a wrong offset!");
static_assert(offsetof(AB_GoinCommandoWeapon_C, SpinUpSound) == 0x000E10, "Member 'AB_GoinCommandoWeapon_C::SpinUpSound' has a wrong offset!");
static_assert(offsetof(AB_GoinCommandoWeapon_C, ChargeUp_ChargingTime_46AF3CCF4ABF9B1069FB7989793B0F32) == 0x000E18, "Member 'AB_GoinCommandoWeapon_C::ChargeUp_ChargingTime_46AF3CCF4ABF9B1069FB7989793B0F32' has a wrong offset!");
static_assert(offsetof(AB_GoinCommandoWeapon_C, ChargeUp__Direction_46AF3CCF4ABF9B1069FB7989793B0F32) == 0x000E1C, "Member 'AB_GoinCommandoWeapon_C::ChargeUp__Direction_46AF3CCF4ABF9B1069FB7989793B0F32' has a wrong offset!");
static_assert(offsetof(AB_GoinCommandoWeapon_C, ChargeUp) == 0x000E20, "Member 'AB_GoinCommandoWeapon_C::ChargeUp' has a wrong offset!");
static_assert(offsetof(AB_GoinCommandoWeapon_C, Boomstick) == 0x000E28, "Member 'AB_GoinCommandoWeapon_C::Boomstick' has a wrong offset!");
static_assert(offsetof(AB_GoinCommandoWeapon_C, BulletImpact_Lvl0Minus4) == 0x000E30, "Member 'AB_GoinCommandoWeapon_C::BulletImpact_Lvl0Minus4' has a wrong offset!");
static_assert(offsetof(AB_GoinCommandoWeapon_C, BulletImpact_Lvl5) == 0x000E38, "Member 'AB_GoinCommandoWeapon_C::BulletImpact_Lvl5' has a wrong offset!");
static_assert(offsetof(AB_GoinCommandoWeapon_C, DecalMaterialLvl0Minus4) == 0x000E40, "Member 'AB_GoinCommandoWeapon_C::DecalMaterialLvl0Minus4' has a wrong offset!");
static_assert(offsetof(AB_GoinCommandoWeapon_C, DecalMaterialLvl5) == 0x000E48, "Member 'AB_GoinCommandoWeapon_C::DecalMaterialLvl5' has a wrong offset!");
static_assert(offsetof(AB_GoinCommandoWeapon_C, MuzzleLvl5) == 0x000E50, "Member 'AB_GoinCommandoWeapon_C::MuzzleLvl5' has a wrong offset!");
static_assert(offsetof(AB_GoinCommandoWeapon_C, MuzzleLvl0Minus4) == 0x000E58, "Member 'AB_GoinCommandoWeapon_C::MuzzleLvl0Minus4' has a wrong offset!");
static_assert(offsetof(AB_GoinCommandoWeapon_C, TracerLvl5) == 0x000E60, "Member 'AB_GoinCommandoWeapon_C::TracerLvl5' has a wrong offset!");
static_assert(offsetof(AB_GoinCommandoWeapon_C, TracerLvl0Minus4) == 0x000E68, "Member 'AB_GoinCommandoWeapon_C::TracerLvl0Minus4' has a wrong offset!");
static_assert(offsetof(AB_GoinCommandoWeapon_C, TC_Boomstick) == 0x000E70, "Member 'AB_GoinCommandoWeapon_C::TC_Boomstick' has a wrong offset!");
static_assert(offsetof(AB_GoinCommandoWeapon_C, Effect_GoingCommando_WeaponArcs) == 0x000E90, "Member 'AB_GoinCommandoWeapon_C::Effect_GoingCommando_WeaponArcs' has a wrong offset!");
static_assert(offsetof(AB_GoinCommandoWeapon_C, ChargeupLvl0Minus4) == 0x000E98, "Member 'AB_GoinCommandoWeapon_C::ChargeupLvl0Minus4' has a wrong offset!");
static_assert(offsetof(AB_GoinCommandoWeapon_C, ChargeupLvl5) == 0x000EA0, "Member 'AB_GoinCommandoWeapon_C::ChargeupLvl5' has a wrong offset!");
static_assert(offsetof(AB_GoinCommandoWeapon_C, CurrentChargeTime) == 0x000EA8, "Member 'AB_GoinCommandoWeapon_C::CurrentChargeTime' has a wrong offset!");

}

