#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Pickups

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Pickups.B_Pickups_C.ExecuteUbergraph_B_Pickups
// 0x03E0 (0x03E0 - 0x0000)
struct B_Pickups_C_ExecuteUbergraph_B_Pickups final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0010(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_Event_PickupTarget;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Array_Get_Item;                           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue2;          // 0x0050(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Array_Get_Item2;                          // 0x005C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0080(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortResourceItemDefinition*            K2Node_DynamicCast_AsFort_Resource_Item_Definition; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         K2Node_DynamicCast_AsMesh_Component;               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_ApplyCosmeticOverridesToMaterial_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue2;              // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB[0x1];                                       // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_SelectRotator_ReturnValue;                // 0x00CC(0x000C)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x00E0(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0160(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable2;                              // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPickupBackpack*                    K2Node_DynamicCast_AsFort_Pickup_Backpack;         // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue2;        // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FA[0x2];                                      // 0x01FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01FC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue2;     // 0x0208(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0214(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0220(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0230(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x023C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0250(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue2;             // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      K2Node_DynamicCast_AsMaterial_Instance;            // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EA[0x6];                                      // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x02F0(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item3;                          // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item4;                          // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item5;                          // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue2; // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39A[0x2];                                      // 0x039A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue3;              // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue4;              // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9[0x3];                                      // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNumericCVar_OutValue;                  // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNumericCVar_ReturnValue;               // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C5[0x3];                                      // 0x03C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable2;                                // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item6;                          // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue2;            // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9[0x3];                                      // 0x03D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_C_ExecuteUbergraph_B_Pickups) == 0x000008, "Wrong alignment on B_Pickups_C_ExecuteUbergraph_B_Pickups");
static_assert(sizeof(B_Pickups_C_ExecuteUbergraph_B_Pickups) == 0x0003E0, "Wrong size on B_Pickups_C_ExecuteUbergraph_B_Pickups");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, EntryPoint) == 0x000000, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetFloatValue_ReturnValue) == 0x000004, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_IsActive_ReturnValue) == 0x00000C, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000010, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_Event_PickupTarget) == 0x000020, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_Event_PickupTarget' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_IsLocallyControlled_ReturnValue) == 0x000028, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetController_ReturnValue) == 0x000030, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000040, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_Get_Item) == 0x00004C, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Conv_FloatToVector_ReturnValue2) == 0x000050, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Conv_FloatToVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_Get_Item2) == 0x00005C, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_LastIndex_ReturnValue) == 0x00006C, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_BooleanAND_ReturnValue) == 0x000070, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_int_Variable) == 0x000074, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_IsValid_ReturnValue2) == 0x00007C, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00007D, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000080, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000090, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_Event_DeltaSeconds) == 0x000098, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Add_FloatFloat_ReturnValue) == 0x00009C, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_AsFort_Resource_Item_Definition) == 0x0000A0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_AsFort_Resource_Item_Definition' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_bSuccess2) == 0x0000A8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000A9, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x0000AA, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_BooleanOR_ReturnValue) == 0x0000AB, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_AsMesh_Component) == 0x0000B0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_AsMesh_Component' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_bSuccess3) == 0x0000B8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_ApplyCosmeticOverridesToMaterial_ReturnValue) == 0x0000C0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_ApplyCosmeticOverridesToMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_Contains_ReturnValue) == 0x0000C8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_Contains_ReturnValue2) == 0x0000C9, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_Contains_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_BooleanOR_ReturnValue2) == 0x0000CA, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_SelectRotator_ReturnValue) == 0x0000CC, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_SelectRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0000D8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_float_Variable) == 0x0000DC, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0000E0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000160, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetOwner_ReturnValue) == 0x0001E0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_float_Variable2) == 0x0001E8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_AsFort_Pickup_Backpack) == 0x0001F0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_AsFort_Pickup_Backpack' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_bSuccess4) == 0x0001F8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_K2_AttachToComponent_ReturnValue2) == 0x0001F9, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_K2_AttachToComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001FC, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_K2_GetComponentLocation_ReturnValue2) == 0x000208, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_K2_GetComponentLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetComponentBounds_Origin) == 0x000214, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetComponentBounds_BoxExtent) == 0x000220, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetComponentBounds_SphereRadius) == 0x00022C, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000230, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Add_VectorVector_ReturnValue) == 0x00023C, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetMaterial_ReturnValue) == 0x000248, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000250, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetNumMaterials_ReturnValue) == 0x0002D0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_LastIndex_ReturnValue2) == 0x0002D4, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_LastIndex_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0002D8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_AsMaterial_Instance) == 0x0002E0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_AsMaterial_Instance' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_bSuccess5) == 0x0002E8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0002E9, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x0002F0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_Get_Item3) == 0x000370, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_Get_Item4) == 0x000378, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000380, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_Get_Item5) == 0x000388, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_CreateDynamicMaterialInstance_ReturnValue2) == 0x000390, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_CreateDynamicMaterialInstance_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000398, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_bool_Variable) == 0x000399, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Add_FloatFloat_ReturnValue2) == 0x00039C, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Add_FloatFloat_ReturnValue3) == 0x0003A0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Add_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Add_FloatFloat_ReturnValue4) == 0x0003A4, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Add_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetGameState_ReturnValue) == 0x0003A8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x0003B0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_DynamicCast_bSuccess6) == 0x0003B8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, K2Node_Select_Default) == 0x0003BC, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetNumericCVar_OutValue) == 0x0003C0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetNumericCVar_OutValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_GetNumericCVar_ReturnValue) == 0x0003C4, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_GetNumericCVar_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, Temp_int_Variable2) == 0x0003C8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0003CC, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Array_Get_Item6) == 0x0003D0, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Array_Get_Item6' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_LessEqual_IntInt_ReturnValue2) == 0x0003D8, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_LessEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_ExecuteUbergraph_B_Pickups, CallFunc_Add_IntInt_ReturnValue2) == 0x0003DC, "Member 'B_Pickups_C_ExecuteUbergraph_B_Pickups::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");

// Function B_Pickups.B_Pickups_C.OnAboutToEnterBackpack
// 0x0008 (0x0008 - 0x0000)
struct B_Pickups_C_OnAboutToEnterBackpack final
{
public:
	class AFortPawn*                              PickupTarget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_C_OnAboutToEnterBackpack) == 0x000008, "Wrong alignment on B_Pickups_C_OnAboutToEnterBackpack");
static_assert(sizeof(B_Pickups_C_OnAboutToEnterBackpack) == 0x000008, "Wrong size on B_Pickups_C_OnAboutToEnterBackpack");
static_assert(offsetof(B_Pickups_C_OnAboutToEnterBackpack, PickupTarget) == 0x000000, "Member 'B_Pickups_C_OnAboutToEnterBackpack::PickupTarget' has a wrong offset!");

// Function B_Pickups.B_Pickups_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct B_Pickups_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_C_ReceiveTick) == 0x000004, "Wrong alignment on B_Pickups_C_ReceiveTick");
static_assert(sizeof(B_Pickups_C_ReceiveTick) == 0x000004, "Wrong size on B_Pickups_C_ReceiveTick");
static_assert(offsetof(B_Pickups_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'B_Pickups_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function B_Pickups.B_Pickups_C.UserConstructionScript
// 0x0190 (0x0190 - 0x0000)
struct B_Pickups_C_UserConstructionScript final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable2;                             // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_AddComponent_ReturnValue2;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0090(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x009C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable3;                             // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_AddComponent_ReturnValue3;                // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable4;                             // 0x00F0(0x0030)(IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue4;                // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable5;                             // 0x0130(0x0030)(IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_AddComponent_ReturnValue5;                // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16A[0x2];                                      // 0x016A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Select_Default;                             // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Select2_Default;                            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue2;               // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Pickups_C_UserConstructionScript) == 0x000010, "Wrong alignment on B_Pickups_C_UserConstructionScript");
static_assert(sizeof(B_Pickups_C_UserConstructionScript) == 0x000190, "Wrong size on B_Pickups_C_UserConstructionScript");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, Temp_bool_Variable) == 0x000000, "Member 'B_Pickups_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, Temp_struct_Variable) == 0x000010, "Member 'B_Pickups_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000040, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, Temp_struct_Variable2) == 0x000050, "Member 'B_Pickups_C_UserConstructionScript::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, Temp_bool_Variable2) == 0x000080, "Member 'B_Pickups_C_UserConstructionScript::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue2) == 0x000088, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_GetComponentBounds_Origin) == 0x000090, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_GetComponentBounds_BoxExtent) == 0x00009C, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_GetComponentBounds_SphereRadius) == 0x0000A8, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000AC, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, Temp_struct_Variable3) == 0x0000B0, "Member 'B_Pickups_C_UserConstructionScript::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_FClamp_ReturnValue) == 0x0000E0, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue3) == 0x0000E8, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, Temp_struct_Variable4) == 0x0000F0, "Member 'B_Pickups_C_UserConstructionScript::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue4) == 0x000120, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, Temp_struct_Variable5) == 0x000130, "Member 'B_Pickups_C_UserConstructionScript::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue5) == 0x000160, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue5' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000168, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000169, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00016C, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, K2Node_Select_Default) == 0x000170, "Member 'B_Pickups_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, K2Node_Select2_Default) == 0x000178, "Member 'B_Pickups_C_UserConstructionScript::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000180, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000181, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue2) == 0x000182, "Member 'B_Pickups_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue2' has a wrong offset!");

// Function B_Pickups.B_Pickups_C.SetRarityColor
// 0x00E0 (0x00E0 - 0x0000)
struct B_Pickups_C_SetRarityColor final
{
public:
	EFortRarity                                   Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable4;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable5;                                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable6;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable7;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable8;                                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable9;                                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable10;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Array_Get_Item;                           // 0x002C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortRarity                                   CallFunc_GetRarity_ReturnValue;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x004C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x0060(0x0080)()
};
static_assert(alignof(B_Pickups_C_SetRarityColor) == 0x000008, "Wrong alignment on B_Pickups_C_SetRarityColor");
static_assert(sizeof(B_Pickups_C_SetRarityColor) == 0x0000E0, "Wrong size on B_Pickups_C_SetRarityColor");
static_assert(offsetof(B_Pickups_C_SetRarityColor, Temp_byte_Variable) == 0x000000, "Member 'B_Pickups_C_SetRarityColor::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, Temp_int_Variable) == 0x000004, "Member 'B_Pickups_C_SetRarityColor::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, Temp_int_Variable2) == 0x000008, "Member 'B_Pickups_C_SetRarityColor::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, Temp_int_Variable3) == 0x00000C, "Member 'B_Pickups_C_SetRarityColor::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, Temp_int_Variable4) == 0x000010, "Member 'B_Pickups_C_SetRarityColor::Temp_int_Variable4' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, Temp_int_Variable5) == 0x000014, "Member 'B_Pickups_C_SetRarityColor::Temp_int_Variable5' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, Temp_int_Variable6) == 0x000018, "Member 'B_Pickups_C_SetRarityColor::Temp_int_Variable6' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, Temp_int_Variable7) == 0x00001C, "Member 'B_Pickups_C_SetRarityColor::Temp_int_Variable7' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, Temp_int_Variable8) == 0x000020, "Member 'B_Pickups_C_SetRarityColor::Temp_int_Variable8' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, Temp_int_Variable9) == 0x000024, "Member 'B_Pickups_C_SetRarityColor::Temp_int_Variable9' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, Temp_int_Variable10) == 0x000028, "Member 'B_Pickups_C_SetRarityColor::Temp_int_Variable10' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, CallFunc_Array_Get_Item) == 0x00002C, "Member 'B_Pickups_C_SetRarityColor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, CallFunc_CreateTemporaryItemInstanceBP_ReturnValue) == 0x000040, "Member 'B_Pickups_C_SetRarityColor::CallFunc_CreateTemporaryItemInstanceBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000048, "Member 'B_Pickups_C_SetRarityColor::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, CallFunc_GetRarity_ReturnValue) == 0x000049, "Member 'B_Pickups_C_SetRarityColor::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, CallFunc_SelectColor_ReturnValue) == 0x00004C, "Member 'B_Pickups_C_SetRarityColor::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, K2Node_Select_Default) == 0x00005C, "Member 'B_Pickups_C_SetRarityColor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SetRarityColor, CallFunc_BPGetRarityData_ReturnValue) == 0x000060, "Member 'B_Pickups_C_SetRarityColor::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");

// Function B_Pickups.B_Pickups_C.SpawnPickedUpTrailPS
// 0x0028 (0x0028 - 0x0000)
struct B_Pickups_C_SpawnPickedUpTrailPS final
{
public:
	class UParticleSystemComponent*               TrailPS;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item2;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0010(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Pickups_C_SpawnPickedUpTrailPS) == 0x000008, "Wrong alignment on B_Pickups_C_SpawnPickedUpTrailPS");
static_assert(sizeof(B_Pickups_C_SpawnPickedUpTrailPS) == 0x000028, "Wrong size on B_Pickups_C_SpawnPickedUpTrailPS");
static_assert(offsetof(B_Pickups_C_SpawnPickedUpTrailPS, TrailPS) == 0x000000, "Member 'B_Pickups_C_SpawnPickedUpTrailPS::TrailPS' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SpawnPickedUpTrailPS, CallFunc_Array_Get_Item) == 0x000008, "Member 'B_Pickups_C_SpawnPickedUpTrailPS::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SpawnPickedUpTrailPS, CallFunc_Array_Get_Item2) == 0x00000C, "Member 'B_Pickups_C_SpawnPickedUpTrailPS::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SpawnPickedUpTrailPS, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000010, "Member 'B_Pickups_C_SpawnPickedUpTrailPS::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Pickups_C_SpawnPickedUpTrailPS, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000020, "Member 'B_Pickups_C_SpawnPickedUpTrailPS::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");

// Function B_Pickups.B_Pickups_C.SetHologramPickedUpParams
// 0x0070 (0x0070 - 0x0000)
struct B_Pickups_C_SetHologramPickedUpParams final
{
public:
	bool                                          Tier_0_or_1;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Fraction_ReturnValue;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
