#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Post_SupplyDrop_Impact

#include "Basic.hpp"

#include "B_Post_Explosion_Generic_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Post_SupplyDrop_Impact.B_Post_SupplyDrop_Impact_C
// 0x0020 (0x08E0 - 0x08C0)
class AB_Post_SupplyDrop_Impact_C final : public AB_Post_Explosion_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08C0(0x0008)(Transient, DuplicateTransient)
	float                                         Timeline_0_BlendWeight_69D06A67407476376496A4814EB654AE; // 0x08C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_69D06A67407476376496A4814EB654AE; // 0x08CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CD[0x3];                                      // 0x08CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x08D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Post_SupplyDrop_Impact(int32 EntryPoint);
	void SpawnPostFX(float PostFX_BoxScaleDyn, const struct FVector& PostFX_CamShakeLoc, bool PostFX_UseCamShake, float PostFX_DeactivateDelay, bool PostFX_UseForceFeedback);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Post_SupplyDrop_Impact_C">();
	}
	static class AB_Post_SupplyDrop_Impact_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Post_SupplyDrop_Impact_C>();
	}
};
static_assert(alignof(AB_Post_SupplyDrop_Impact_C) == 0x000010, "Wrong alignment on AB_Post_SupplyDrop_Impact_C");
static_assert(sizeof(AB_Post_SupplyDrop_Impact_C) == 0x0008E0, "Wrong size on AB_Post_SupplyDrop_Impact_C");
static_assert(offsetof(AB_Post_SupplyDrop_Impact_C, UberGraphFrame) == 0x0008C0, "Member 'AB_Post_SupplyDrop_Impact_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Post_SupplyDrop_Impact_C, Timeline_0_BlendWeight_69D06A67407476376496A4814EB654AE) == 0x0008C8, "Member 'AB_Post_SupplyDrop_Impact_C::Timeline_0_BlendWeight_69D06A67407476376496A4814EB654AE' has a wrong offset!");
static_assert(offsetof(AB_Post_SupplyDrop_Impact_C, Timeline_0__Direction_69D06A67407476376496A4814EB654AE) == 0x0008CC, "Member 'AB_Post_SupplyDrop_Impact_C::Timeline_0__Direction_69D06A67407476376496A4814EB654AE' has a wrong offset!");
static_assert(offsetof(AB_Post_SupplyDrop_Impact_C, Timeline_0) == 0x0008D0, "Member 'AB_Post_SupplyDrop_Impact_C::Timeline_0' has a wrong offset!");

}

