#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BasicInteractionWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function BasicInteractionWidget.BasicInteractionWidget_C.ExecuteUbergraph_BasicInteractionWidget
// 0x0004 (0x0004 - 0x0000)
struct BasicInteractionWidget_C_ExecuteUbergraph_BasicInteractionWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BasicInteractionWidget_C_ExecuteUbergraph_BasicInteractionWidget) == 0x000004, "Wrong alignment on BasicInteractionWidget_C_ExecuteUbergraph_BasicInteractionWidget");
static_assert(sizeof(BasicInteractionWidget_C_ExecuteUbergraph_BasicInteractionWidget) == 0x000004, "Wrong size on BasicInteractionWidget_C_ExecuteUbergraph_BasicInteractionWidget");
static_assert(offsetof(BasicInteractionWidget_C_ExecuteUbergraph_BasicInteractionWidget, EntryPoint) == 0x000000, "Member 'BasicInteractionWidget_C_ExecuteUbergraph_BasicInteractionWidget::EntryPoint' has a wrong offset!");

// Function BasicInteractionWidget.BasicInteractionWidget_C.UpdateDescription
// 0x0018 (0x0018 - 0x0000)
struct BasicInteractionWidget_C_UpdateDescription final
{
public:
	class FText                                   Param_Description;                                 // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BasicInteractionWidget_C_UpdateDescription) == 0x000008, "Wrong alignment on BasicInteractionWidget_C_UpdateDescription");
static_assert(sizeof(BasicInteractionWidget_C_UpdateDescription) == 0x000018, "Wrong size on BasicInteractionWidget_C_UpdateDescription");
static_assert(offsetof(BasicInteractionWidget_C_UpdateDescription, Param_Description) == 0x000000, "Member 'BasicInteractionWidget_C_UpdateDescription::Param_Description' has a wrong offset!");

}

