#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BluGloManager

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BluGloManager.BluGloManager_C.ExecuteUbergraph_BluGloManager
// 0x03A0 (0x03A0 - 0x0000)
struct BluGloManager_C_ExecuteUbergraph_BluGloManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  K2Node_HandleMissionEvent_MissionGuid;             // 0x0008(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_HandleMissionEvent_ObjectiveHandle;         // 0x0018(0x0020)()
	class UFortMissionEventParams*                K2Node_HandleMissionEvent_Params;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_HandleMissionEvent_EventFocus;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataAsset*                             K2Node_HandleMissionEvent_EventContent;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_HandleMissionEvent_EventInstigator;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_HandleMissionEvent_GenericInt;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_HandleMissionEvent_GenericFloat;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_HandleMissionEvent_GenericText;             // 0x0068(0x0018)()
	struct FGameplayTagContainer                  K2Node_HandleMissionEvent_GameplayTags;            // 0x0080(0x0020)()
	struct FFortMissionEvent                      K2Node_HandleMissionEvent_MissionEvent;            // 0x00A0(0x0098)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_On_off;                         // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATiered_BluGlo_Parent_C*>        CallFunc_GetAllActorsOfClass_OutActors;            // 0x0148(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATiered_BluGlo_Parent_C*                CallFunc_Array_Get_Item;                           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0188(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_ActorToSpawnFrom;               // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_LocationToSpawnFromIfActorInvalid; // 0x01A0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnvQueryStatus                               K2Node_CustomEvent_QueryStatus;                    // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQueryInstanceBlueprintWrapper*      K2Node_CustomEvent_QueryInstance;                  // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NumBluGloToSpawn;               // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               K2Node_CustomEvent_PSystem;                        // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x01C8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_SpawnCenter;                    // 0x01D8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATiered_BluGlo_Parent_C*                CallFunc_Array_Get_Item2;                          // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_StartSpawnFXAndAudio_SpawnFXEmitter;      // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x01FC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0210(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABluGlo_Node_C*                         CallFunc_FinishSpawningActor_ReturnValue;          // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UParticleSystemComponent* PSystem)> K2Node_CreateDelegate_OutputDelegate;              // 0x0250(0x0010)(ZeroConstructor, NoDestructor)
	class AFortMission*                           K2Node_CustomEvent_Mission;                        // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_HandleMissionEvent_MissionGuid2;            // 0x0268(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_HandleMissionEvent_ObjectiveHandle2;        // 0x0278(0x0020)()
	class UFortMissionEventParams*                K2Node_HandleMissionEvent_Params2;                 // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW2; // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_HandleMissionEvent_EventFocus2;             // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataAsset*                             K2Node_HandleMissionEvent_EventContent2;           // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_HandleMissionEvent_EventInstigator2;        // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_HandleMissionEvent_GenericInt2;             // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_HandleMissionEvent_GenericFloat2;           // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_HandleMissionEvent_GenericText2;            // 0x02C8(0x0018)()
	struct FGameplayTagContainer                  K2Node_HandleMissionEvent_GameplayTags2;           // 0x02E0(0x0020)()
	struct FFortMissionEvent                      K2Node_HandleMissionEvent_MissionEvent2;           // 0x0300(0x0098)()
};
static_assert(alignof(BluGloManager_C_ExecuteUbergraph_BluGloManager) == 0x000010, "Wrong alignment on BluGloManager_C_ExecuteUbergraph_BluGloManager");
static_assert(sizeof(BluGloManager_C_ExecuteUbergraph_BluGloManager) == 0x0003A0, "Wrong size on BluGloManager_C_ExecuteUbergraph_BluGloManager");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, EntryPoint) == 0x000000, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, Temp_bool_True_if_break_was_hit_Variable) == 0x000004, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_HandleMissionEvent_MissionGuid) == 0x000008, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_HandleMissionEvent_MissionGuid' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_HandleMissionEvent_ObjectiveHandle) == 0x000018, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_HandleMissionEvent_ObjectiveHandle' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_HandleMissionEvent_Params) == 0x000038, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_HandleMissionEvent_Params' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW) == 0x000040, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_HandleMissionEvent_EventFocus) == 0x000048, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_HandleMissionEvent_EventFocus' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_HandleMissionEvent_EventContent) == 0x000050, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_HandleMissionEvent_EventContent' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_HandleMissionEvent_EventInstigator) == 0x000058, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_HandleMissionEvent_EventInstigator' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_HandleMissionEvent_GenericInt) == 0x000060, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_HandleMissionEvent_GenericInt' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_HandleMissionEvent_GenericFloat) == 0x000064, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_HandleMissionEvent_GenericFloat' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_HandleMissionEvent_GenericText) == 0x000068, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_HandleMissionEvent_GenericText' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_HandleMissionEvent_GameplayTags) == 0x000080, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_HandleMissionEvent_GameplayTags' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_HandleMissionEvent_MissionEvent) == 0x0000A0, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_HandleMissionEvent_MissionEvent' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, Temp_int_Array_Index_Variable) == 0x000138, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_CustomEvent_On_off) == 0x00013C, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_CustomEvent_On_off' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, CallFunc_Array_Length_ReturnValue) == 0x000140, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, CallFunc_GetAllActorsOfClass_OutActors) == 0x000148, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, Temp_int_Loop_Counter_Variable) == 0x000158, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, CallFunc_Array_Get_Item) == 0x000160, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, CallFunc_Less_IntInt_ReturnValue) == 0x000168, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, CallFunc_Add_IntInt_ReturnValue) == 0x00016C, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, CallFunc_BooleanAND_ReturnValue) == 0x000170, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, CallFunc_Array_Length_ReturnValue2) == 0x000174, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, Temp_int_Loop_Counter_Variable2) == 0x000178, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, CallFunc_Array_Add_ReturnValue) == 0x00017C, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, CallFunc_Less_IntInt_ReturnValue2) == 0x000180, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, CallFunc_Add_IntInt_ReturnValue2) == 0x000184, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000188, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_CustomEvent_ActorToSpawnFrom) == 0x000198, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_CustomEvent_ActorToSpawnFrom' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_CustomEvent_LocationToSpawnFromIfActorInvalid) == 0x0001A0, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_CustomEvent_LocationToSpawnFromIfActorInvalid' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_CustomEvent_QueryStatus) == 0x0001AC, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_CustomEvent_QueryStatus' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_CustomEvent_QueryInstance) == 0x0001B0, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_CustomEvent_QueryInstance' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_CustomEvent_NumBluGloToSpawn) == 0x0001B8, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_CustomEvent_NumBluGloToSpawn' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_CustomEvent_PSystem) == 0x0001C0, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_CustomEvent_PSystem' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0001C8, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, Temp_int_Array_Index_Variable2) == 0x0001D4, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_CustomEvent_SpawnCenter) == 0x0001D8, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_CustomEvent_SpawnCenter' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, CallFunc_Array_Get_Item2) == 0x0001E8, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, CallFunc_StartSpawnFXAndAudio_SpawnFXEmitter) == 0x0001F0, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::CallFunc_StartSpawnFXAndAudio_SpawnFXEmitter' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, CallFunc_Array_Add_ReturnValue2) == 0x0001F8, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x0001FC, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, CallFunc_Less_IntInt_ReturnValue3) == 0x000208, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000210, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000240, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, CallFunc_FinishSpawningActor_ReturnValue) == 0x000248, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_CreateDelegate_OutputDelegate) == 0x000250, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_CustomEvent_Mission) == 0x000260, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_CustomEvent_Mission' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_HandleMissionEvent_MissionGuid2) == 0x000268, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_HandleMissionEvent_MissionGuid2' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_HandleMissionEvent_ObjectiveHandle2) == 0x000278, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_HandleMissionEvent_ObjectiveHandle2' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_HandleMissionEvent_Params2) == 0x000298, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_HandleMissionEvent_Params2' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW2) == 0x0002A0, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_HandleMissionEvent_DO_NOT_USE_THIS_OR_VARIABLES_BELOW2' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_HandleMissionEvent_EventFocus2) == 0x0002A8, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_HandleMissionEvent_EventFocus2' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_HandleMissionEvent_EventContent2) == 0x0002B0, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_HandleMissionEvent_EventContent2' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_HandleMissionEvent_EventInstigator2) == 0x0002B8, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_HandleMissionEvent_EventInstigator2' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_HandleMissionEvent_GenericInt2) == 0x0002C0, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_HandleMissionEvent_GenericInt2' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_HandleMissionEvent_GenericFloat2) == 0x0002C4, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_HandleMissionEvent_GenericFloat2' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_HandleMissionEvent_GenericText2) == 0x0002C8, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_HandleMissionEvent_GenericText2' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_HandleMissionEvent_GameplayTags2) == 0x0002E0, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_HandleMissionEvent_GameplayTags2' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_ExecuteUbergraph_BluGloManager, K2Node_HandleMissionEvent_MissionEvent2) == 0x000300, "Member 'BluGloManager_C_ExecuteUbergraph_BluGloManager::K2Node_HandleMissionEvent_MissionEvent2' has a wrong offset!");

// Function BluGloManager.BluGloManager_C.AddMoreBluGloInWorld
// 0x0008 (0x0008 - 0x0000)
struct BluGloManager_C_AddMoreBluGloInWorld final
{
public:
	class AFortMission*                           Mission;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BluGloManager_C_AddMoreBluGloInWorld) == 0x000008, "Wrong alignment on BluGloManager_C_AddMoreBluGloInWorld");
static_assert(sizeof(BluGloManager_C_AddMoreBluGloInWorld) == 0x000008, "Wrong size on BluGloManager_C_AddMoreBluGloInWorld");
static_assert(offsetof(BluGloManager_C_AddMoreBluGloInWorld, Mission) == 0x000000, "Member 'BluGloManager_C_AddMoreBluGloInWorld::Mission' has a wrong offset!");

// Function BluGloManager.BluGloManager_C.SpawnBluGloGroupEvent
// 0x000C (0x000C - 0x0000)
struct BluGloManager_C_SpawnBluGloGroupEvent final
{
public:
	struct FVector                                SpawnCenter;                                       // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BluGloManager_C_SpawnBluGloGroupEvent) == 0x000004, "Wrong alignment on BluGloManager_C_SpawnBluGloGroupEvent");
static_assert(sizeof(BluGloManager_C_SpawnBluGloGroupEvent) == 0x00000C, "Wrong size on BluGloManager_C_SpawnBluGloGroupEvent");
static_assert(offsetof(BluGloManager_C_SpawnBluGloGroupEvent, SpawnCenter) == 0x000000, "Member 'BluGloManager_C_SpawnBluGloGroupEvent::SpawnCenter' has a wrong offset!");

// Function BluGloManager.BluGloManager_C.SpawnFXComplete
// 0x0008 (0x0008 - 0x0000)
struct BluGloManager_C_SpawnFXComplete final
{
public:
	class UParticleSystemComponent*               PSystem;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BluGloManager_C_SpawnFXComplete) == 0x000008, "Wrong alignment on BluGloManager_C_SpawnFXComplete");
static_assert(sizeof(BluGloManager_C_SpawnFXComplete) == 0x000008, "Wrong size on BluGloManager_C_SpawnFXComplete");
static_assert(offsetof(BluGloManager_C_SpawnFXComplete, PSystem) == 0x000000, "Member 'BluGloManager_C_SpawnFXComplete::PSystem' has a wrong offset!");

// Function BluGloManager.BluGloManager_C.OnBluGloQueryFinished
// 0x0028 (0x0028 - 0x0000)
struct BluGloManager_C_OnBluGloQueryFinished final
{
public:
	class AActor*                                 ActorToSpawnFrom;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocationToSpawnFromIfActorInvalid;                 // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnvQueryStatus                               QueryStatus;                                       // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQueryInstanceBlueprintWrapper*      QueryInstance;                                     // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumBluGloToSpawn;                                  // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BluGloManager_C_OnBluGloQueryFinished) == 0x000008, "Wrong alignment on BluGloManager_C_OnBluGloQueryFinished");
static_assert(sizeof(BluGloManager_C_OnBluGloQueryFinished) == 0x000028, "Wrong size on BluGloManager_C_OnBluGloQueryFinished");
static_assert(offsetof(BluGloManager_C_OnBluGloQueryFinished, ActorToSpawnFrom) == 0x000000, "Member 'BluGloManager_C_OnBluGloQueryFinished::ActorToSpawnFrom' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_OnBluGloQueryFinished, LocationToSpawnFromIfActorInvalid) == 0x000008, "Member 'BluGloManager_C_OnBluGloQueryFinished::LocationToSpawnFromIfActorInvalid' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_OnBluGloQueryFinished, QueryStatus) == 0x000014, "Member 'BluGloManager_C_OnBluGloQueryFinished::QueryStatus' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_OnBluGloQueryFinished, QueryInstance) == 0x000018, "Member 'BluGloManager_C_OnBluGloQueryFinished::QueryInstance' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_OnBluGloQueryFinished, NumBluGloToSpawn) == 0x000020, "Member 'BluGloManager_C_OnBluGloQueryFinished::NumBluGloToSpawn' has a wrong offset!");

// Function BluGloManager.BluGloManager_C.HandleMissionEvent_RequestBluGloSpawnUseActor
// 0x0130 (0x0130 - 0x0000)
struct BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor final
{
public:
	struct FGuid                                  MissionGuid;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ObjectiveHandle;                                   // 0x0010(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UFortMissionEventParams*                Params_0;                                          // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DO_NOT_USE_THIS_OR_VARIABLES_BELOW;                // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                EventFocus;                                        // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDataAsset*                       EventContent;                                      // 0x0048(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 EventInstigator;                                   // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GenericInt;                                        // 0x0058(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GenericFloat;                                      // 0x005C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   GenericText;                                       // 0x0060(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTagContainer                  GameplayTags;                                      // 0x0078(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FFortMissionEvent                      MissionEvent;                                      // 0x0098(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor) == 0x000008, "Wrong alignment on BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor");
static_assert(sizeof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor) == 0x000130, "Wrong size on BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor");
static_assert(offsetof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor, MissionGuid) == 0x000000, "Member 'BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor::MissionGuid' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor, ObjectiveHandle) == 0x000010, "Member 'BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor::ObjectiveHandle' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor, Params_0) == 0x000030, "Member 'BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor::Params_0' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor, DO_NOT_USE_THIS_OR_VARIABLES_BELOW) == 0x000038, "Member 'BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor::DO_NOT_USE_THIS_OR_VARIABLES_BELOW' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor, EventFocus) == 0x000040, "Member 'BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor::EventFocus' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor, EventContent) == 0x000048, "Member 'BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor::EventContent' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor, EventInstigator) == 0x000050, "Member 'BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor::EventInstigator' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor, GenericInt) == 0x000058, "Member 'BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor::GenericInt' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor, GenericFloat) == 0x00005C, "Member 'BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor::GenericFloat' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor, GenericText) == 0x000060, "Member 'BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor::GenericText' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor, GameplayTags) == 0x000078, "Member 'BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor::GameplayTags' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor, MissionEvent) == 0x000098, "Member 'BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseActor::MissionEvent' has a wrong offset!");

// Function BluGloManager.BluGloManager_C.StopSpawnFX
// 0x0001 (0x0001 - 0x0000)
struct BluGloManager_C_StopSpawnFX final
{
public:
	bool                                          Off;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BluGloManager_C_StopSpawnFX) == 0x000001, "Wrong alignment on BluGloManager_C_StopSpawnFX");
static_assert(sizeof(BluGloManager_C_StopSpawnFX) == 0x000001, "Wrong size on BluGloManager_C_StopSpawnFX");
static_assert(offsetof(BluGloManager_C_StopSpawnFX, Off) == 0x000000, "Member 'BluGloManager_C_StopSpawnFX::Off' has a wrong offset!");

// Function BluGloManager.BluGloManager_C.HandleMissionEvent_RequestBluGloSpawnUseEQS
// 0x0130 (0x0130 - 0x0000)
struct BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS final
{
public:
	struct FGuid                                  MissionGuid;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ObjectiveHandle;                                   // 0x0010(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UFortMissionEventParams*                Params_0;                                          // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DO_NOT_USE_THIS_OR_VARIABLES_BELOW;                // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                EventFocus;                                        // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDataAsset*                       EventContent;                                      // 0x0048(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 EventInstigator;                                   // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GenericInt;                                        // 0x0058(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GenericFloat;                                      // 0x005C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   GenericText;                                       // 0x0060(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTagContainer                  GameplayTags;                                      // 0x0078(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FFortMissionEvent                      MissionEvent;                                      // 0x0098(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS) == 0x000008, "Wrong alignment on BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS");
static_assert(sizeof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS) == 0x000130, "Wrong size on BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS");
static_assert(offsetof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS, MissionGuid) == 0x000000, "Member 'BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS::MissionGuid' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS, ObjectiveHandle) == 0x000010, "Member 'BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS::ObjectiveHandle' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS, Params_0) == 0x000030, "Member 'BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS::Params_0' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS, DO_NOT_USE_THIS_OR_VARIABLES_BELOW) == 0x000038, "Member 'BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS::DO_NOT_USE_THIS_OR_VARIABLES_BELOW' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS, EventFocus) == 0x000040, "Member 'BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS::EventFocus' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS, EventContent) == 0x000048, "Member 'BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS::EventContent' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS, EventInstigator) == 0x000050, "Member 'BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS::EventInstigator' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS, GenericInt) == 0x000058, "Member 'BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS::GenericInt' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS, GenericFloat) == 0x00005C, "Member 'BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS::GenericFloat' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS, GenericText) == 0x000060, "Member 'BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS::GenericText' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS, GameplayTags) == 0x000078, "Member 'BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS::GameplayTags' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS, MissionEvent) == 0x000098, "Member 'BluGloManager_C_HandleMissionEvent_RequestBluGloSpawnUseEQS::MissionEvent' has a wrong offset!");

// Function BluGloManager.BluGloManager_C.RequestedBluGo
// 0x0028 (0x0028 - 0x0000)
struct BluGloManager_C_RequestedBluGo final
{
public:
	class AFortMission*                           Mission;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EQS_Start_Location;                                // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentBluGloRewards_ReturnValue;      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BluGloManager_C_RequestedBluGo) == 0x000008, "Wrong alignment on BluGloManager_C_RequestedBluGo");
static_assert(sizeof(BluGloManager_C_RequestedBluGo) == 0x000028, "Wrong size on BluGloManager_C_RequestedBluGo");
static_assert(offsetof(BluGloManager_C_RequestedBluGo, Mission) == 0x000000, "Member 'BluGloManager_C_RequestedBluGo::Mission' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_RequestedBluGo, EQS_Start_Location) == 0x000008, "Member 'BluGloManager_C_RequestedBluGo::EQS_Start_Location' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_RequestedBluGo, Actor) == 0x000018, "Member 'BluGloManager_C_RequestedBluGo::Actor' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_RequestedBluGo, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BluGloManager_C_RequestedBluGo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_RequestedBluGo, CallFunc_GetCurrentBluGloRewards_ReturnValue) == 0x000024, "Member 'BluGloManager_C_RequestedBluGo::CallFunc_GetCurrentBluGloRewards_ReturnValue' has a wrong offset!");

// Function BluGloManager.BluGloManager_C.RemoveOccupiedNodes
// 0x0020 (0x0020 - 0x0000)
struct BluGloManager_C_RemoveOccupiedNodes final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATiered_BluGlo_Parent_C*                CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BluGloManager_C_RemoveOccupiedNodes) == 0x000008, "Wrong alignment on BluGloManager_C_RemoveOccupiedNodes");
static_assert(sizeof(BluGloManager_C_RemoveOccupiedNodes) == 0x000020, "Wrong size on BluGloManager_C_RemoveOccupiedNodes");
static_assert(offsetof(BluGloManager_C_RemoveOccupiedNodes, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BluGloManager_C_RemoveOccupiedNodes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_RemoveOccupiedNodes, CallFunc_Array_Get_Item) == 0x000008, "Member 'BluGloManager_C_RemoveOccupiedNodes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_RemoveOccupiedNodes, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BluGloManager_C_RemoveOccupiedNodes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_RemoveOccupiedNodes, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BluGloManager_C_RemoveOccupiedNodes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_RemoveOccupiedNodes, CallFunc_Array_RemoveItem_ReturnValue) == 0x000018, "Member 'BluGloManager_C_RemoveOccupiedNodes::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_RemoveOccupiedNodes, CallFunc_Less_IntInt_ReturnValue) == 0x000019, "Member 'BluGloManager_C_RemoveOccupiedNodes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_RemoveOccupiedNodes, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BluGloManager_C_RemoveOccupiedNodes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BluGloManager.BluGloManager_C.SpawnBluGlo
// 0x0060 (0x0060 - 0x0000)
struct BluGloManager_C_SpawnBluGlo final
{
public:
	struct FVector                                SpawnLocation;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnFromLocation;                                 // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABluGlo_Node_C*                         CallFunc_FinishSpawningActor_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BluGloManager_C_SpawnBluGlo) == 0x000010, "Wrong alignment on BluGloManager_C_SpawnBluGlo");
static_assert(sizeof(BluGloManager_C_SpawnBluGlo) == 0x000060, "Wrong size on BluGloManager_C_SpawnBluGlo");
static_assert(offsetof(BluGloManager_C_SpawnBluGlo, SpawnLocation) == 0x000000, "Member 'BluGloManager_C_SpawnBluGlo::SpawnLocation' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_SpawnBluGlo, SpawnFromLocation) == 0x00000C, "Member 'BluGloManager_C_SpawnBluGlo::SpawnFromLocation' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_SpawnBluGlo, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000020, "Member 'BluGloManager_C_SpawnBluGlo::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_SpawnBluGlo, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000050, "Member 'BluGloManager_C_SpawnBluGlo::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_SpawnBluGlo, CallFunc_FinishSpawningActor_ReturnValue) == 0x000058, "Member 'BluGloManager_C_SpawnBluGlo::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BluGloManager.BluGloManager_C.IssueBluGloRequest
// 0x0048 (0x0048 - 0x0000)
struct BluGloManager_C_IssueBluGloRequest final
{
public:
	int32                                         NumBluGloToSpawn;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ActorToSpawnFrom;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocationToSpawnFromIfActorInvalid;                 // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQueryInstanceBlueprintWrapper*      CallFunc_RunEQSQuery_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* ActorToSpawnFrom, const struct FVector& LocationToSpawnFromIfActorInvalid, EEnvQueryStatus QueryStatus, class UEnvQueryInstanceBlueprintWrapper* QueryInstance, int32 NumBluGloToSpawn)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class UBluGloRequestHandler_C*                K2Node_DynamicCast_AsBlu_Glo_Request_Handler;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BluGloManager_C_IssueBluGloRequest) == 0x000008, "Wrong alignment on BluGloManager_C_IssueBluGloRequest");
static_assert(sizeof(BluGloManager_C_IssueBluGloRequest) == 0x000048, "Wrong size on BluGloManager_C_IssueBluGloRequest");
static_assert(offsetof(BluGloManager_C_IssueBluGloRequest, NumBluGloToSpawn) == 0x000000, "Member 'BluGloManager_C_IssueBluGloRequest::NumBluGloToSpawn' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_IssueBluGloRequest, ActorToSpawnFrom) == 0x000008, "Member 'BluGloManager_C_IssueBluGloRequest::ActorToSpawnFrom' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_IssueBluGloRequest, LocationToSpawnFromIfActorInvalid) == 0x000010, "Member 'BluGloManager_C_IssueBluGloRequest::LocationToSpawnFromIfActorInvalid' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_IssueBluGloRequest, CallFunc_RunEQSQuery_ReturnValue) == 0x000020, "Member 'BluGloManager_C_IssueBluGloRequest::CallFunc_RunEQSQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_IssueBluGloRequest, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'BluGloManager_C_IssueBluGloRequest::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_IssueBluGloRequest, K2Node_DynamicCast_AsBlu_Glo_Request_Handler) == 0x000038, "Member 'BluGloManager_C_IssueBluGloRequest::K2Node_DynamicCast_AsBlu_Glo_Request_Handler' has a wrong offset!");
static_assert(offsetof(BluGloManager_C_IssueBluGloRequest, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BluGloManager_C_IssueBluGloRequest::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BluGloManager.BluGloManager_C.BuildSpawnLocations
// 0x0070 (0x0070 - 0x0000)
struct BluGloManager_C_BuildSpawnLocations final
{
public:
	EEnvQueryStatus                               QueryStatus;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQueryInstanceBlueprintWrapper*      QueryInstance;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumBluGloToSpawn;                                  // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SpawnCenter;                                       // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        LocationsForSpawningBluGlo;                        // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        CallFunc_BuildSpawnLocationsRandomly_LocationsForSpawningBluGlo; // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FVector>                        CallFunc_GetResultsAsLocations_ReturnValue;        // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FVector>                        CallFunc_BuildSpawnLocationsFromQueryLocations_LocationsForSpawningBluGlo; // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
