#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FortExpeditionListView

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_FortExpeditionListView.BP_FortExpeditionListView_C.OnItemClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_FortExpeditionListView_C_OnItemClicked__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FortExpeditionListView_C_OnItemClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_FortExpeditionListView_C_OnItemClicked__DelegateSignature");
static_assert(sizeof(BP_FortExpeditionListView_C_OnItemClicked__DelegateSignature) == 0x000008, "Wrong size on BP_FortExpeditionListView_C_OnItemClicked__DelegateSignature");
static_assert(offsetof(BP_FortExpeditionListView_C_OnItemClicked__DelegateSignature, Item) == 0x000000, "Member 'BP_FortExpeditionListView_C_OnItemClicked__DelegateSignature::Item' has a wrong offset!");

// Function BP_FortExpeditionListView.BP_FortExpeditionListView_C.OnItemHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_FortExpeditionListView_C_OnItemHovered__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FortExpeditionListView_C_OnItemHovered__DelegateSignature) == 0x000008, "Wrong alignment on BP_FortExpeditionListView_C_OnItemHovered__DelegateSignature");
static_assert(sizeof(BP_FortExpeditionListView_C_OnItemHovered__DelegateSignature) == 0x000008, "Wrong size on BP_FortExpeditionListView_C_OnItemHovered__DelegateSignature");
static_assert(offsetof(BP_FortExpeditionListView_C_OnItemHovered__DelegateSignature, Item) == 0x000000, "Member 'BP_FortExpeditionListView_C_OnItemHovered__DelegateSignature::Item' has a wrong offset!");

// Function BP_FortExpeditionListView.BP_FortExpeditionListView_C.ExecuteUbergraph_BP_FortExpeditionListView
// 0x0050 (0x0050 - 0x0000)
struct BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item3;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item2;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue2;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileApp_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue3;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue2;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView) == 0x000008, "Wrong alignment on BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView");
static_assert(sizeof(BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView) == 0x000050, "Wrong size on BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView");
static_assert(offsetof(BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView, EntryPoint) == 0x000000, "Member 'BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView, K2Node_ComponentBoundEvent_Item) == 0x000008, "Member 'BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView, K2Node_ComponentBoundEvent_Item3) == 0x000010, "Member 'BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView::K2Node_ComponentBoundEvent_Item3' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView, K2Node_ComponentBoundEvent_Item2) == 0x000018, "Member 'BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView::K2Node_ComponentBoundEvent_Item2' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView, CallFunc_GetUINavigationManager_ReturnValue) == 0x000020, "Member 'BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView, CallFunc_GetContext_ReturnValue) == 0x000028, "Member 'BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView, CallFunc_GetContext_ReturnValue2) == 0x000030, "Member 'BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView, CallFunc_IsMobileApp_ReturnValue) == 0x000038, "Member 'BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView::CallFunc_IsMobileApp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView, CallFunc_IsUsingGamepad_ReturnValue) == 0x000039, "Member 'BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView, CallFunc_GetContext_ReturnValue3) == 0x000040, "Member 'BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView, CallFunc_IsUsingGamepad_ReturnValue2) == 0x000048, "Member 'BP_FortExpeditionListView_C_ExecuteUbergraph_BP_FortExpeditionListView::CallFunc_IsUsingGamepad_ReturnValue2' has a wrong offset!");

// Function BP_FortExpeditionListView.BP_FortExpeditionListView_C.BndEvt__ExpeditionListView_K2Node_ComponentBoundEvent_10_OnListViewItemClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_FortExpeditionListView_C_BndEvt__ExpeditionListView_K2Node_ComponentBoundEvent_10_OnListViewItemClicked__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FortExpeditionListView_C_BndEvt__ExpeditionListView_K2Node_ComponentBoundEvent_10_OnListViewItemClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_FortExpeditionListView_C_BndEvt__ExpeditionListView_K2Node_ComponentBoundEvent_10_OnListViewItemClicked__DelegateSignature");
static_assert(sizeof(BP_FortExpeditionListView_C_BndEvt__ExpeditionListView_K2Node_ComponentBoundEvent_10_OnListViewItemClicked__DelegateSignature) == 0x000008, "Wrong size on BP_FortExpeditionListView_C_BndEvt__ExpeditionListView_K2Node_ComponentBoundEvent_10_OnListViewItemClicked__DelegateSignature");
static_assert(offsetof(BP_FortExpeditionListView_C_BndEvt__ExpeditionListView_K2Node_ComponentBoundEvent_10_OnListViewItemClicked__DelegateSignature, Item) == 0x000000, "Member 'BP_FortExpeditionListView_C_BndEvt__ExpeditionListView_K2Node_ComponentBoundEvent_10_OnListViewItemClicked__DelegateSignature::Item' has a wrong offset!");

// Function BP_FortExpeditionListView.BP_FortExpeditionListView_C.BndEvt__ExpeditionListView_K2Node_ComponentBoundEvent_52_OnListViewItemClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_FortExpeditionListView_C_BndEvt__ExpeditionListView_K2Node_ComponentBoundEvent_52_OnListViewItemClicked__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FortExpeditionListView_C_BndEvt__ExpeditionListView_K2Node_ComponentBoundEvent_52_OnListViewItemClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_FortExpeditionListView_C_BndEvt__ExpeditionListView_K2Node_ComponentBoundEvent_52_OnListViewItemClicked__DelegateSignature");
static_assert(sizeof(BP_FortExpeditionListView_C_BndEvt__ExpeditionListView_K2Node_ComponentBoundEvent_52_OnListViewItemClicked__DelegateSignature) == 0x000008, "Wrong size on BP_FortExpeditionListView_C_BndEvt__ExpeditionListView_K2Node_ComponentBoundEvent_52_OnListViewItemClicked__DelegateSignature");
static_assert(offsetof(BP_FortExpeditionListView_C_BndEvt__ExpeditionListView_K2Node_ComponentBoundEvent_52_OnListViewItemClicked__DelegateSignature, Item) == 0x000000, "Member 'BP_FortExpeditionListView_C_BndEvt__ExpeditionListView_K2Node_ComponentBoundEvent_52_OnListViewItemClicked__DelegateSignature::Item' has a wrong offset!");

// Function BP_FortExpeditionListView.BP_FortExpeditionListView_C.BndEvt__ExpeditionListView_K2Node_ComponentBoundEvent_6_OnListViewItemClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_FortExpeditionListView_C_BndEvt__ExpeditionListView_K2Node_ComponentBoundEvent_6_OnListViewItemClicked__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FortExpeditionListView_C_BndEvt__ExpeditionListView_K2Node_ComponentBoundEvent_6_OnListViewItemClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_FortExpeditionListView_C_BndEvt__ExpeditionListView_K2Node_ComponentBoundEvent_6_OnListViewItemClicked__DelegateSignature");
static_assert(sizeof(BP_FortExpeditionListView_C_BndEvt__ExpeditionListView_K2Node_ComponentBoundEvent_6_OnListViewItemClicked__DelegateSignature) == 0x000008, "Wrong size on BP_FortExpeditionListView_C_BndEvt__ExpeditionListView_K2Node_ComponentBoundEvent_6_OnListViewItemClicked__DelegateSignature");
static_assert(offsetof(BP_FortExpeditionListView_C_BndEvt__ExpeditionListView_K2Node_ComponentBoundEvent_6_OnListViewItemClicked__DelegateSignature, Item) == 0x000000, "Member 'BP_FortExpeditionListView_C_BndEvt__ExpeditionListView_K2Node_ComponentBoundEvent_6_OnListViewItemClicked__DelegateSignature::Item' has a wrong offset!");

}

