#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FortniteLobbyLightSwitcher

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_FortniteLobbyLightSwitcher.BP_FortniteLobbyLightSwitcher_C.ExecuteUbergraph_BP_FortniteLobbyLightSwitcher
// 0x0028 (0x0028 - 0x0000)
struct BP_FortniteLobbyLightSwitcher_C_ExecuteUbergraph_BP_FortniteLobbyLightSwitcher final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShadowQuality_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FortniteLobbyLightSwitcher_C_ExecuteUbergraph_BP_FortniteLobbyLightSwitcher) == 0x000008, "Wrong alignment on BP_FortniteLobbyLightSwitcher_C_ExecuteUbergraph_BP_FortniteLobbyLightSwitcher");
static_assert(sizeof(BP_FortniteLobbyLightSwitcher_C_ExecuteUbergraph_BP_FortniteLobbyLightSwitcher) == 0x000028, "Wrong size on BP_FortniteLobbyLightSwitcher_C_ExecuteUbergraph_BP_FortniteLobbyLightSwitcher");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_ExecuteUbergraph_BP_FortniteLobbyLightSwitcher, EntryPoint) == 0x000000, "Member 'BP_FortniteLobbyLightSwitcher_C_ExecuteUbergraph_BP_FortniteLobbyLightSwitcher::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_ExecuteUbergraph_BP_FortniteLobbyLightSwitcher, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_FortniteLobbyLightSwitcher_C_ExecuteUbergraph_BP_FortniteLobbyLightSwitcher::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_ExecuteUbergraph_BP_FortniteLobbyLightSwitcher, CallFunc_GetGameUserSettings_ReturnValue) == 0x000018, "Member 'BP_FortniteLobbyLightSwitcher_C_ExecuteUbergraph_BP_FortniteLobbyLightSwitcher::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_ExecuteUbergraph_BP_FortniteLobbyLightSwitcher, CallFunc_GetShadowQuality_ReturnValue) == 0x000020, "Member 'BP_FortniteLobbyLightSwitcher_C_ExecuteUbergraph_BP_FortniteLobbyLightSwitcher::CallFunc_GetShadowQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_ExecuteUbergraph_BP_FortniteLobbyLightSwitcher, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000024, "Member 'BP_FortniteLobbyLightSwitcher_C_ExecuteUbergraph_BP_FortniteLobbyLightSwitcher::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_FortniteLobbyLightSwitcher.BP_FortniteLobbyLightSwitcher_C.SetVisiblityofSceneLighting
// 0x0068 (0x0068 - 0x0000)
struct BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting final
{
public:
	bool                                          Activate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetShadowQuality_ReturnValue;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AEmitter*                               CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APointLight*                            CallFunc_Array_Get_Item2;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting) == 0x000008, "Wrong alignment on BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting");
static_assert(sizeof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting) == 0x000068, "Wrong size on BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, Activate) == 0x000000, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::Activate' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, Temp_int_Loop_Counter_Variable2) == 0x00000C, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_Add_IntInt_ReturnValue2) == 0x000010, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, Temp_int_Array_Index_Variable2) == 0x000018, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue2) == 0x00001D, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue3) == 0x00001E, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue4) == 0x00001F, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue5) == 0x000020, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_GetGameUserSettings_ReturnValue) == 0x000028, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue6) == 0x000030, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_GetShadowQuality_ReturnValue) == 0x000034, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_GetShadowQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000038, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_BooleanAND_ReturnValue) == 0x000039, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue7) == 0x000048, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_Array_Get_Item2) == 0x000058, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_Array_Length_ReturnValue2) == 0x000060, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_Less_IntInt_ReturnValue2) == 0x000064, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue8) == 0x000065, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting, CallFunc_IsValid_ReturnValue9) == 0x000066, "Member 'BP_FortniteLobbyLightSwitcher_C_SetVisiblityofSceneLighting::CallFunc_IsValid_ReturnValue9' has a wrong offset!");

}

