#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FortExpeditionIconTabButton

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_FortExpeditionIconTabButton.BP_FortExpeditionIconTabButton_C.ExecuteUbergraph_BP_FortExpeditionIconTabButton
// 0x01E0 (0x01E0 - 0x0000)
struct BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	class UClass*                                 CallFunc_GetCurrentTextStyleClass_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetCurrentTextStyleClass_ReturnValue2;    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                K2Node_Event_TabLabelInfo;                         // 0x0048(0x0090)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_Basic_Tooltip_Output;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSelected_ReturnValue2;                 // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor2;                     // 0x00F0(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor3;                     // 0x0118(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor4;                     // 0x0140(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor5;                     // 0x0168(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor6;                     // 0x0190(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor7;                     // 0x01B8(0x0028)()
};
static_assert(alignof(BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton) == 0x000008, "Wrong alignment on BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton");
static_assert(sizeof(BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton) == 0x0001E0, "Wrong size on BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton, EntryPoint) == 0x000000, "Member 'BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton, CallFunc_GetCurrentTextStyleClass_ReturnValue) == 0x000030, "Member 'BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton::CallFunc_GetCurrentTextStyleClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton, CallFunc_GetCurrentTextStyleClass_ReturnValue2) == 0x000038, "Member 'BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton::CallFunc_GetCurrentTextStyleClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton, K2Node_Event_IsDesignTime) == 0x000040, "Member 'BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton, K2Node_Event_TabLabelInfo) == 0x000048, "Member 'BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton::K2Node_Event_TabLabelInfo' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000D8, "Member 'BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton, CallFunc_Create_Basic_Tooltip_Output) == 0x0000E0, "Member 'BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton::CallFunc_Create_Basic_Tooltip_Output' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton, CallFunc_GetSelected_ReturnValue) == 0x0000E8, "Member 'BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton::CallFunc_GetSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton, CallFunc_GetSelected_ReturnValue2) == 0x0000E9, "Member 'BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton::CallFunc_GetSelected_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton, K2Node_MakeStruct_SlateColor2) == 0x0000F0, "Member 'BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton::K2Node_MakeStruct_SlateColor2' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton, K2Node_MakeStruct_SlateColor3) == 0x000118, "Member 'BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton::K2Node_MakeStruct_SlateColor3' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton, K2Node_MakeStruct_SlateColor4) == 0x000140, "Member 'BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton::K2Node_MakeStruct_SlateColor4' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton, K2Node_MakeStruct_SlateColor5) == 0x000168, "Member 'BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton::K2Node_MakeStruct_SlateColor5' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton, K2Node_MakeStruct_SlateColor6) == 0x000190, "Member 'BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton::K2Node_MakeStruct_SlateColor6' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton, K2Node_MakeStruct_SlateColor7) == 0x0001B8, "Member 'BP_FortExpeditionIconTabButton_C_ExecuteUbergraph_BP_FortExpeditionIconTabButton::K2Node_MakeStruct_SlateColor7' has a wrong offset!");

// Function BP_FortExpeditionIconTabButton.BP_FortExpeditionIconTabButton_C.SetTabLabelInfo
// 0x0090 (0x0090 - 0x0000)
struct BP_FortExpeditionIconTabButton_C_SetTabLabelInfo final
{
public:
	struct FFortTabButtonLabelInfo                TabLabelInfo;                                      // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_FortExpeditionIconTabButton_C_SetTabLabelInfo) == 0x000008, "Wrong alignment on BP_FortExpeditionIconTabButton_C_SetTabLabelInfo");
static_assert(sizeof(BP_FortExpeditionIconTabButton_C_SetTabLabelInfo) == 0x000090, "Wrong size on BP_FortExpeditionIconTabButton_C_SetTabLabelInfo");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_SetTabLabelInfo, TabLabelInfo) == 0x000000, "Member 'BP_FortExpeditionIconTabButton_C_SetTabLabelInfo::TabLabelInfo' has a wrong offset!");

// Function BP_FortExpeditionIconTabButton.BP_FortExpeditionIconTabButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_FortExpeditionIconTabButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FortExpeditionIconTabButton_C_PreConstruct) == 0x000001, "Wrong alignment on BP_FortExpeditionIconTabButton_C_PreConstruct");
static_assert(sizeof(BP_FortExpeditionIconTabButton_C_PreConstruct) == 0x000001, "Wrong size on BP_FortExpeditionIconTabButton_C_PreConstruct");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_FortExpeditionIconTabButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_FortExpeditionIconTabButton.BP_FortExpeditionIconTabButton_C.Set Text
// 0x0028 (0x0028 - 0x0000)
struct BP_FortExpeditionIconTabButton_C_Set_Text final
{
public:
	class FText                                   Param_ButtonText;                                  // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_Basic_Tooltip_Output;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FortExpeditionIconTabButton_C_Set_Text) == 0x000008, "Wrong alignment on BP_FortExpeditionIconTabButton_C_Set_Text");
static_assert(sizeof(BP_FortExpeditionIconTabButton_C_Set_Text) == 0x000028, "Wrong size on BP_FortExpeditionIconTabButton_C_Set_Text");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Set_Text, Param_ButtonText) == 0x000000, "Member 'BP_FortExpeditionIconTabButton_C_Set_Text::Param_ButtonText' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Set_Text, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'BP_FortExpeditionIconTabButton_C_Set_Text::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Set_Text, CallFunc_Create_Basic_Tooltip_Output) == 0x000020, "Member 'BP_FortExpeditionIconTabButton_C_Set_Text::CallFunc_Create_Basic_Tooltip_Output' has a wrong offset!");

// Function BP_FortExpeditionIconTabButton.BP_FortExpeditionIconTabButton_C.Set Icon
// 0x0078 (0x0078 - 0x0000)
struct BP_FortExpeditionIconTabButton_C_Set_Icon final
{
public:
	struct FSlateBrush                            Param_IconBrush;                                   // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_FortExpeditionIconTabButton_C_Set_Icon) == 0x000008, "Wrong alignment on BP_FortExpeditionIconTabButton_C_Set_Icon");
static_assert(sizeof(BP_FortExpeditionIconTabButton_C_Set_Icon) == 0x000078, "Wrong size on BP_FortExpeditionIconTabButton_C_Set_Icon");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Set_Icon, Param_IconBrush) == 0x000000, "Member 'BP_FortExpeditionIconTabButton_C_Set_Icon::Param_IconBrush' has a wrong offset!");

// Function BP_FortExpeditionIconTabButton.BP_FortExpeditionIconTabButton_C.Refresh Bang State
// 0x000C (0x000C - 0x0000)
struct BP_FortExpeditionIconTabButton_C_Refresh_Bang_State final
{
public:
	int32                                         NumUnseen;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_TotalUnseenExpeditionsForTab_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FortExpeditionIconTabButton_C_Refresh_Bang_State) == 0x000004, "Wrong alignment on BP_FortExpeditionIconTabButton_C_Refresh_Bang_State");
static_assert(sizeof(BP_FortExpeditionIconTabButton_C_Refresh_Bang_State) == 0x00000C, "Wrong size on BP_FortExpeditionIconTabButton_C_Refresh_Bang_State");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Refresh_Bang_State, NumUnseen) == 0x000000, "Member 'BP_FortExpeditionIconTabButton_C_Refresh_Bang_State::NumUnseen' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Refresh_Bang_State, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'BP_FortExpeditionIconTabButton_C_Refresh_Bang_State::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Refresh_Bang_State, CallFunc_TotalUnseenExpeditionsForTab_ReturnValue) == 0x000008, "Member 'BP_FortExpeditionIconTabButton_C_Refresh_Bang_State::CallFunc_TotalUnseenExpeditionsForTab_ReturnValue' has a wrong offset!");

// Function BP_FortExpeditionIconTabButton.BP_FortExpeditionIconTabButton_C.Set Tab Id
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) BP_FortExpeditionIconTabButton_C_Set_Tab_Id final
{
public:
	class FName                                   Param_TabId;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FortExpeditionIconTabButton_C_Set_Tab_Id) == 0x000008, "Wrong alignment on BP_FortExpeditionIconTabButton_C_Set_Tab_Id");
static_assert(sizeof(BP_FortExpeditionIconTabButton_C_Set_Tab_Id) == 0x000008, "Wrong size on BP_FortExpeditionIconTabButton_C_Set_Tab_Id");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Set_Tab_Id, Param_TabId) == 0x000000, "Member 'BP_FortExpeditionIconTabButton_C_Set_Tab_Id::Param_TabId' has a wrong offset!");

// Function BP_FortExpeditionIconTabButton.BP_FortExpeditionIconTabButton_C.Update Available Vehicles
// 0x0030 (0x0030 - 0x0000)
struct BP_FortExpeditionIconTabButton_C_Update_Available_Vehicles final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTotalExpeditionVehiclesAvailable_OutLandVehicles; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalExpeditionVehiclesAvailable_OutLandVehiclesAvailable; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalExpeditionVehiclesAvailable_OutSeaVehicles; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalExpeditionVehiclesAvailable_OutSeaVehiclesAvailable; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalExpeditionVehiclesAvailable_OutAirVehicles; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalExpeditionVehiclesAvailable_OutAirVehiclesAvailable; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FortExpeditionIconTabButton_C_Update_Available_Vehicles) == 0x000008, "Wrong alignment on BP_FortExpeditionIconTabButton_C_Update_Available_Vehicles");
static_assert(sizeof(BP_FortExpeditionIconTabButton_C_Update_Available_Vehicles) == 0x000030, "Wrong size on BP_FortExpeditionIconTabButton_C_Update_Available_Vehicles");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_Available_Vehicles, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'BP_FortExpeditionIconTabButton_C_Update_Available_Vehicles::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_Available_Vehicles, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000008, "Member 'BP_FortExpeditionIconTabButton_C_Update_Available_Vehicles::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_Available_Vehicles, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_FortExpeditionIconTabButton_C_Update_Available_Vehicles::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_Available_Vehicles, CallFunc_GetTotalExpeditionVehiclesAvailable_OutLandVehicles) == 0x000014, "Member 'BP_FortExpeditionIconTabButton_C_Update_Available_Vehicles::CallFunc_GetTotalExpeditionVehiclesAvailable_OutLandVehicles' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_Available_Vehicles, CallFunc_GetTotalExpeditionVehiclesAvailable_OutLandVehiclesAvailable) == 0x000018, "Member 'BP_FortExpeditionIconTabButton_C_Update_Available_Vehicles::CallFunc_GetTotalExpeditionVehiclesAvailable_OutLandVehiclesAvailable' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_Available_Vehicles, CallFunc_GetTotalExpeditionVehiclesAvailable_OutSeaVehicles) == 0x00001C, "Member 'BP_FortExpeditionIconTabButton_C_Update_Available_Vehicles::CallFunc_GetTotalExpeditionVehiclesAvailable_OutSeaVehicles' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_Available_Vehicles, CallFunc_GetTotalExpeditionVehiclesAvailable_OutSeaVehiclesAvailable) == 0x000020, "Member 'BP_FortExpeditionIconTabButton_C_Update_Available_Vehicles::CallFunc_GetTotalExpeditionVehiclesAvailable_OutSeaVehiclesAvailable' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_Available_Vehicles, CallFunc_GetTotalExpeditionVehiclesAvailable_OutAirVehicles) == 0x000024, "Member 'BP_FortExpeditionIconTabButton_C_Update_Available_Vehicles::CallFunc_GetTotalExpeditionVehiclesAvailable_OutAirVehicles' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_Available_Vehicles, CallFunc_GetTotalExpeditionVehiclesAvailable_OutAirVehiclesAvailable) == 0x000028, "Member 'BP_FortExpeditionIconTabButton_C_Update_Available_Vehicles::CallFunc_GetTotalExpeditionVehiclesAvailable_OutAirVehiclesAvailable' has a wrong offset!");

// Function BP_FortExpeditionIconTabButton.BP_FortExpeditionIconTabButton_C.Update All Vehicles
// 0x0018 (0x0018 - 0x0000)
struct BP_FortExpeditionIconTabButton_C_Update_All_Vehicles final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FortExpeditionIconTabButton_C_Update_All_Vehicles) == 0x000004, "Wrong alignment on BP_FortExpeditionIconTabButton_C_Update_All_Vehicles");
static_assert(sizeof(BP_FortExpeditionIconTabButton_C_Update_All_Vehicles) == 0x000018, "Wrong size on BP_FortExpeditionIconTabButton_C_Update_All_Vehicles");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_All_Vehicles, Temp_byte_Variable) == 0x000000, "Member 'BP_FortExpeditionIconTabButton_C_Update_All_Vehicles::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_All_Vehicles, Temp_byte_Variable2) == 0x000001, "Member 'BP_FortExpeditionIconTabButton_C_Update_All_Vehicles::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_All_Vehicles, Temp_bool_Variable) == 0x000002, "Member 'BP_FortExpeditionIconTabButton_C_Update_All_Vehicles::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_All_Vehicles, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_FortExpeditionIconTabButton_C_Update_All_Vehicles::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_All_Vehicles, CallFunc_Add_IntInt_ReturnValue2) == 0x000008, "Member 'BP_FortExpeditionIconTabButton_C_Update_All_Vehicles::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_All_Vehicles, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00000C, "Member 'BP_FortExpeditionIconTabButton_C_Update_All_Vehicles::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_All_Vehicles, CallFunc_Greater_IntInt_ReturnValue) == 0x00000D, "Member 'BP_FortExpeditionIconTabButton_C_Update_All_Vehicles::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_All_Vehicles, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000010, "Member 'BP_FortExpeditionIconTabButton_C_Update_All_Vehicles::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_All_Vehicles, K2Node_Select_Default) == 0x000014, "Member 'BP_FortExpeditionIconTabButton_C_Update_All_Vehicles::K2Node_Select_Default' has a wrong offset!");

// Function BP_FortExpeditionIconTabButton.BP_FortExpeditionIconTabButton_C.Update Land Vehicles
// 0x000C (0x000C - 0x0000)
struct BP_FortExpeditionIconTabButton_C_Update_Land_Vehicles final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FortExpeditionIconTabButton_C_Update_Land_Vehicles) == 0x000004, "Wrong alignment on BP_FortExpeditionIconTabButton_C_Update_Land_Vehicles");
static_assert(sizeof(BP_FortExpeditionIconTabButton_C_Update_Land_Vehicles) == 0x00000C, "Wrong size on BP_FortExpeditionIconTabButton_C_Update_Land_Vehicles");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_Land_Vehicles, Temp_byte_Variable) == 0x000000, "Member 'BP_FortExpeditionIconTabButton_C_Update_Land_Vehicles::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_Land_Vehicles, Temp_byte_Variable2) == 0x000001, "Member 'BP_FortExpeditionIconTabButton_C_Update_Land_Vehicles::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_Land_Vehicles, Temp_bool_Variable) == 0x000002, "Member 'BP_FortExpeditionIconTabButton_C_Update_Land_Vehicles::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_Land_Vehicles, CallFunc_Greater_IntInt_ReturnValue) == 0x000003, "Member 'BP_FortExpeditionIconTabButton_C_Update_Land_Vehicles::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_Land_Vehicles, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'BP_FortExpeditionIconTabButton_C_Update_Land_Vehicles::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_Land_Vehicles, K2Node_Select_Default) == 0x000008, "Member 'BP_FortExpeditionIconTabButton_C_Update_Land_Vehicles::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_Land_Vehicles, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000009, "Member 'BP_FortExpeditionIconTabButton_C_Update_Land_Vehicles::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function BP_FortExpeditionIconTabButton.BP_FortExpeditionIconTabButton_C.Update Sea Vehicles
// 0x000C (0x000C - 0x0000)
struct BP_FortExpeditionIconTabButton_C_Update_Sea_Vehicles final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FortExpeditionIconTabButton_C_Update_Sea_Vehicles) == 0x000004, "Wrong alignment on BP_FortExpeditionIconTabButton_C_Update_Sea_Vehicles");
static_assert(sizeof(BP_FortExpeditionIconTabButton_C_Update_Sea_Vehicles) == 0x00000C, "Wrong size on BP_FortExpeditionIconTabButton_C_Update_Sea_Vehicles");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_Sea_Vehicles, Temp_byte_Variable) == 0x000000, "Member 'BP_FortExpeditionIconTabButton_C_Update_Sea_Vehicles::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_Sea_Vehicles, Temp_byte_Variable2) == 0x000001, "Member 'BP_FortExpeditionIconTabButton_C_Update_Sea_Vehicles::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_Sea_Vehicles, CallFunc_Greater_IntInt_ReturnValue) == 0x000002, "Member 'BP_FortExpeditionIconTabButton_C_Update_Sea_Vehicles::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_Sea_Vehicles, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'BP_FortExpeditionIconTabButton_C_Update_Sea_Vehicles::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_Sea_Vehicles, Temp_bool_Variable) == 0x000008, "Member 'BP_FortExpeditionIconTabButton_C_Update_Sea_Vehicles::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_Sea_Vehicles, K2Node_Select_Default) == 0x000009, "Member 'BP_FortExpeditionIconTabButton_C_Update_Sea_Vehicles::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_Sea_Vehicles, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00000A, "Member 'BP_FortExpeditionIconTabButton_C_Update_Sea_Vehicles::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function BP_FortExpeditionIconTabButton.BP_FortExpeditionIconTabButton_C.Update Air Vehicles
// 0x000C (0x000C - 0x0000)
struct BP_FortExpeditionIconTabButton_C_Update_Air_Vehicles final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FortExpeditionIconTabButton_C_Update_Air_Vehicles) == 0x000004, "Wrong alignment on BP_FortExpeditionIconTabButton_C_Update_Air_Vehicles");
static_assert(sizeof(BP_FortExpeditionIconTabButton_C_Update_Air_Vehicles) == 0x00000C, "Wrong size on BP_FortExpeditionIconTabButton_C_Update_Air_Vehicles");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_Air_Vehicles, Temp_byte_Variable) == 0x000000, "Member 'BP_FortExpeditionIconTabButton_C_Update_Air_Vehicles::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionIconTabButton_C_Update_Air_Vehicles, Temp_byte_Variable2) == 0x000001, "Member 'BP_FortExpeditionIconTabButton_C_Update_Air_Vehicles::Temp_byte_Variable2' has a wrong offset!");
