#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FortExpeditionBuildSquadWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_FortExpeditionBuildSquadWidget.BP_FortExpeditionBuildSquadWidget_C
// 0x0298 (0x06B8 - 0x0420)
class UBP_FortExpeditionBuildSquadWidget_C final : public UFortExpeditionBuildSquadWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(Transient, DuplicateTransient)
	class UBasicRatingWidget_C*                   BasicRatingWidget;                                 // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           BonusSet;                                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_FortExpeditionExpiresWidget_C*      BP_FortExpeditionExpiresWidget;                    // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    ChangeVehicleActionDisplay;                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_5;                                    // 0x0448(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_18;                                   // 0x0450(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_0;                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CostSlots;                                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ExpeditionDescription;                             // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ExpeditionDuration;                                // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ExpeditionName;                                    // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    InfoAction;                                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PreviewBuffArrow_Chance;                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PreviewBuffArrow_Rating;                           // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          RarityBorder;                                      // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           RequirementsSlots;                                 // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           RewardsSet;                                        // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBasicRatingWidget_C*                   SquadRating;                                       // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                SuccessChance;                                     // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBoxBonuses;                                       // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VehicleImage;                                      // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       VehicleName;                                       // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UViewInfoButton_NoText_C*               ViewInfoButton_NoText;                             // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    BackInputAction;                                   // 0x04E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    ChangeVehicleActon;                                // 0x04F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    SlotItemAction;                                    // 0x0508(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    CloseAction;                                       // 0x0518(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    StartExpeditionAction;                             // 0x0528(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FHomebaseSquad                         Current_Squad_Info;                                // 0x0538(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            NoVehicleBrush;                                    // 0x05C0(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 Expedition_Pick_Vehicle_Class;                     // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CancelInputActionName;                             // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectedSlot;                                      // 0x0648(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64C[0x4];                                      // 0x064C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInfoWindow_C*                          RewardInfoWindow;                                  // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortDialogExternalLatentActionHandle  WaitingForDialogHandle;                            // 0x0658(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FLinearColor                           BuffColor;                                         // 0x065C(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DebuffColor;                                       // 0x066C(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67C[0x4];                                      // 0x067C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    PurchaseSlotAction;                                // 0x0680(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    InspectAction;                                     // 0x0690(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UFortItem*                              InspectItem;                                       // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_ExpeditionSquadSlotsView_C*         CachedExpeditionSquadSlotsView;                    // 0x06A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USquadSlotItemPicker_C*                 CachedExpeditionSquadSlotPicker;                   // 0x06B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FortExpeditionBuildSquadWidget(int32 EntryPoint);
	void OnRequestClosePicker();
	void BndEvt__CommonWidgetSwitcher_0_K2Node_ComponentBoundEvent_20_OnActiveWidgetChanged__DelegateSignature(class UWidget* ActiveWidget, int32 ActiveWidgetIndex);
	void OnStartExpeditionCompleted();
	void OnGamepadStateChanged(bool bUsingGamepad);
	void BndEvt__ExpeditionSquadSlotsView_K2Node_ComponentBoundEvent_77_OnSquadSlotSelected__DelegateSignature(int32 SquadSlotIndex);
	void BndEvt__ExpeditionSquadSlotsView_K2Node_ComponentBoundEvent_45_OnSquadSlotOpened__DelegateSignature();
	void OnStartExpedition();
	void BndEvt__SquadSlotItemPicker_K2Node_ComponentBoundEvent_20_OnItemSelectionEvent__DelegateSignature(class UFortItem* SelectedItem);
	void BndEvt__ViewInfoButton_NoText_K2Node_ComponentBoundEvent_35_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnRefreshBuildSquadWidget();
	void HACK_Select_Item_in_Picker();
	void OnActivated();
	void Destruct();
	void BndEvt__SquadSlotItemPicker_K2Node_ComponentBoundEvent_9_OnSelectionCommitted__DelegateSignature(class UFortItem* SelectedItem);
	void HandleVechicleSelected(class FName SquadId);
	void SetData(class UFortExpeditionItem* InItem);
	void Construct();
	void DialogResult_B738291040F33B805332A7B633B3ACBD(EFortDialogResult Result, class FName ResultName, bool bWaitingForLatentActionCompletion, const struct FFortDialogExternalLatentActionHandle& WaitingDialogHandle);
	void Handle_Back(bool* Passthrough);
	void Setup_Input_Action_Handlers();
	void Set_Name(class UFortItem* Param_Item);
	void Set_Description(class UFortItem* Param_Item);
	void Set_Rating(class UFortExpeditionItem* Param_Item);
	void Refresh_Item_Data();
	void Get_Expedition_Item_Definition(class UFortExpeditionItem* Param_Item, class UFortExpeditionItemDefinition** ItemDef);
	void Set_Duration(class UFortExpeditionItemDefinition* ItemDef);
	void Set_Rarity(class UFortItem* Param_Item);
	void Set_Rewards(class UFortExpeditionItemDefinition* ItemDef);
	void Handle_Change_Vehicle(bool* Passthrough);
	void Refresh_Squad_Widgets();
	void Set_Vehicle_Name(struct FHomebaseSquad& HomebaseSquad);
	void Clear_Vehicle_Widgets();
	void Set_Remaining_Expiration_Time(class UFortExpeditionItem* Param_Item);
	void Set_Requirements(class UFortExpeditionItemDefinition* ItemDef);
	void Set_Expedition_Costs(class UFortExpeditionItemDefinition* ItemDef);
	void Update_Squad_Slot_Pickers(int32 SelectedSquadIndex);
	void Update_Expedition_Power();
	void Set_Bonus_Criteria(class UFortExpeditionItem* Param_Item, TArray<class UFortItem*>& SlottedItems);
	void HACK_SetCursorToSquadSlotSlotted();
	void Get_Picker_List_View(class UFortItemTileView** PickerTileView);
	class UObject* Get_Selected_Item();
	void Try_to_Auto_Select_First_Vehicle();
	void Handle_Expedition_Expired();
	void Update_Start_Expedition_Widget_State();
	void Handle_Slot_Item_Action(bool* Passthrough);
	void Handle_Close_Picker_Action(bool* Passthrough);
	void Handle_Selected_Item_Committed();
	void Handle_Squad_Slot_Selected();
	void Handle_Squad_Picker_Closed();
	void Handle_Start_Expedition(bool* Passthrough);
	void Handle_Open_Picker(bool* Passthrough);
	void Update_Vehicle_Selected(class FName Param_CurrentSquadId);
	EInputActionState Get_Slot_Item_State();
	void Handle_Back_with_Squad_Clear(bool* Passthrough);
	void Update_For_Preview(class UFortItem* Param_Item);
	void Determine_Preview_State(float Preview, float Current, EFortBuffState* State);
	void Update_Power_and_Rating_for_Preview(class UFortItem* Param_Item, TArray<class UFortItem*>* SlottedItems1);
	class UClass* Determine_Text_Style_from_Preview_State(EFortBuffState Param_Index);
	ESlateVisibility Determine_Buff_Arrow_Visiblity_From_Preview_State(EFortBuffState Param_Index);
	void Update_Rating_Buff_Arrow_for_Preview(EFortBuffState Param_Index);
	void Update_Chance_Buff_Arrow_for_Preview(EFortBuffState Param_Index);
	struct FLinearColor Determine_Buff_Arrow_Color_for_Preview_State(EFortBuffState Param_Index);
	float Determine_Buff_Arrow_Angle_for_Preview_State(EFortBuffState Param_Index);
	void Handle_Purchase_Slot(bool* Passthrough);
	EInputActionState Get_Purchase_Slot_State();
	int32 Get_Selected_Slot__SAFE_();
	void Handle_Inspect(bool* Passthrough);
	void Determine_Inspect_Item_for_Squad_Slot();
	void HACK_SetCursorToSquadPicker();
	class UFortItem* Get_Item_In_Selected_Squad_Slot();
	void Get_Bonus_Display_Name_and_Brush(struct FGameplayTag& Tag, bool Condition, EFortRarity Rarity, struct FSlateBrush* OutBrush_Brush_M, class FText* OutDisplayName, struct FLinearColor* OutRarityColor);
	class UWidget* GetSquadRatingTooltipWidget();
	class UWidget* GetSuccessChanceTooltipWidget();
	void Get_Mcp_Relative_Utc_Now(struct FDateTime* UtcNow);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FortExpeditionBuildSquadWidget_C">();
	}
	static class UBP_FortExpeditionBuildSquadWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FortExpeditionBuildSquadWidget_C>();
	}
};
static_assert(alignof(UBP_FortExpeditionBuildSquadWidget_C) == 0x000008, "Wrong alignment on UBP_FortExpeditionBuildSquadWidget_C");
static_assert(sizeof(UBP_FortExpeditionBuildSquadWidget_C) == 0x0006B8, "Wrong size on UBP_FortExpeditionBuildSquadWidget_C");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, UberGraphFrame) == 0x000420, "Member 'UBP_FortExpeditionBuildSquadWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, BasicRatingWidget) == 0x000428, "Member 'UBP_FortExpeditionBuildSquadWidget_C::BasicRatingWidget' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, BonusSet) == 0x000430, "Member 'UBP_FortExpeditionBuildSquadWidget_C::BonusSet' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, BP_FortExpeditionExpiresWidget) == 0x000438, "Member 'UBP_FortExpeditionBuildSquadWidget_C::BP_FortExpeditionExpiresWidget' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, ChangeVehicleActionDisplay) == 0x000440, "Member 'UBP_FortExpeditionBuildSquadWidget_C::ChangeVehicleActionDisplay' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, CommonBorder_5) == 0x000448, "Member 'UBP_FortExpeditionBuildSquadWidget_C::CommonBorder_5' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, CommonBorder_18) == 0x000450, "Member 'UBP_FortExpeditionBuildSquadWidget_C::CommonBorder_18' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, CommonWidgetSwitcher_0) == 0x000458, "Member 'UBP_FortExpeditionBuildSquadWidget_C::CommonWidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, CostSlots) == 0x000460, "Member 'UBP_FortExpeditionBuildSquadWidget_C::CostSlots' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, ExpeditionDescription) == 0x000468, "Member 'UBP_FortExpeditionBuildSquadWidget_C::ExpeditionDescription' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, ExpeditionDuration) == 0x000470, "Member 'UBP_FortExpeditionBuildSquadWidget_C::ExpeditionDuration' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, ExpeditionName) == 0x000478, "Member 'UBP_FortExpeditionBuildSquadWidget_C::ExpeditionName' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, InfoAction) == 0x000480, "Member 'UBP_FortExpeditionBuildSquadWidget_C::InfoAction' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, PreviewBuffArrow_Chance) == 0x000488, "Member 'UBP_FortExpeditionBuildSquadWidget_C::PreviewBuffArrow_Chance' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, PreviewBuffArrow_Rating) == 0x000490, "Member 'UBP_FortExpeditionBuildSquadWidget_C::PreviewBuffArrow_Rating' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, RarityBorder) == 0x000498, "Member 'UBP_FortExpeditionBuildSquadWidget_C::RarityBorder' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, RequirementsSlots) == 0x0004A0, "Member 'UBP_FortExpeditionBuildSquadWidget_C::RequirementsSlots' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, RewardsSet) == 0x0004A8, "Member 'UBP_FortExpeditionBuildSquadWidget_C::RewardsSet' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, SafeZone_0) == 0x0004B0, "Member 'UBP_FortExpeditionBuildSquadWidget_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, SquadRating) == 0x0004B8, "Member 'UBP_FortExpeditionBuildSquadWidget_C::SquadRating' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, SuccessChance) == 0x0004C0, "Member 'UBP_FortExpeditionBuildSquadWidget_C::SuccessChance' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, VBoxBonuses) == 0x0004C8, "Member 'UBP_FortExpeditionBuildSquadWidget_C::VBoxBonuses' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, VehicleImage) == 0x0004D0, "Member 'UBP_FortExpeditionBuildSquadWidget_C::VehicleImage' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, VehicleName) == 0x0004D8, "Member 'UBP_FortExpeditionBuildSquadWidget_C::VehicleName' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, ViewInfoButton_NoText) == 0x0004E0, "Member 'UBP_FortExpeditionBuildSquadWidget_C::ViewInfoButton_NoText' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, BackInputAction) == 0x0004E8, "Member 'UBP_FortExpeditionBuildSquadWidget_C::BackInputAction' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, ChangeVehicleActon) == 0x0004F8, "Member 'UBP_FortExpeditionBuildSquadWidget_C::ChangeVehicleActon' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, SlotItemAction) == 0x000508, "Member 'UBP_FortExpeditionBuildSquadWidget_C::SlotItemAction' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, CloseAction) == 0x000518, "Member 'UBP_FortExpeditionBuildSquadWidget_C::CloseAction' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, StartExpeditionAction) == 0x000528, "Member 'UBP_FortExpeditionBuildSquadWidget_C::StartExpeditionAction' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, Current_Squad_Info) == 0x000538, "Member 'UBP_FortExpeditionBuildSquadWidget_C::Current_Squad_Info' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, NoVehicleBrush) == 0x0005C0, "Member 'UBP_FortExpeditionBuildSquadWidget_C::NoVehicleBrush' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, Expedition_Pick_Vehicle_Class) == 0x000638, "Member 'UBP_FortExpeditionBuildSquadWidget_C::Expedition_Pick_Vehicle_Class' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, CancelInputActionName) == 0x000640, "Member 'UBP_FortExpeditionBuildSquadWidget_C::CancelInputActionName' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, SelectedSlot) == 0x000648, "Member 'UBP_FortExpeditionBuildSquadWidget_C::SelectedSlot' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, RewardInfoWindow) == 0x000650, "Member 'UBP_FortExpeditionBuildSquadWidget_C::RewardInfoWindow' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, WaitingForDialogHandle) == 0x000658, "Member 'UBP_FortExpeditionBuildSquadWidget_C::WaitingForDialogHandle' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, BuffColor) == 0x00065C, "Member 'UBP_FortExpeditionBuildSquadWidget_C::BuffColor' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, DebuffColor) == 0x00066C, "Member 'UBP_FortExpeditionBuildSquadWidget_C::DebuffColor' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, PurchaseSlotAction) == 0x000680, "Member 'UBP_FortExpeditionBuildSquadWidget_C::PurchaseSlotAction' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, InspectAction) == 0x000690, "Member 'UBP_FortExpeditionBuildSquadWidget_C::InspectAction' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, InspectItem) == 0x0006A0, "Member 'UBP_FortExpeditionBuildSquadWidget_C::InspectItem' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, CachedExpeditionSquadSlotsView) == 0x0006A8, "Member 'UBP_FortExpeditionBuildSquadWidget_C::CachedExpeditionSquadSlotsView' has a wrong offset!");
static_assert(offsetof(UBP_FortExpeditionBuildSquadWidget_C, CachedExpeditionSquadSlotPicker) == 0x0006B0, "Member 'UBP_FortExpeditionBuildSquadWidget_C::CachedExpeditionSquadSlotPicker' has a wrong offset!");

}

