#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Hex_OutpostCC_7

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_Hex_PARENT_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Hex_OutpostCC_7.BP_Hex_OutpostCC_7_C
// 0x01B8 (0x08D0 - 0x0718)
class ABP_Hex_OutpostCC_7_C final : public ABP_Hex_PARENT_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Hex_OutpostCC_7_C;               // 0x0718(0x0008)(Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh28;                                      // 0x0720(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh27;                                      // 0x0728(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh26;                                      // 0x0730(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh25;                                      // 0x0738(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Shield;                                            // 0x0740(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x0748(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh24;                                      // 0x0750(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh23;                                      // 0x0758(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh22;                                      // 0x0760(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh21;                                      // 0x0768(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh20;                                      // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh19;                                      // 0x0778(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh18;                                      // 0x0780(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh17;                                      // 0x0788(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh16;                                      // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh15;                                      // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh14;                                      // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh13;                                      // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh12;                                      // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh11;                                      // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh10;                                      // 0x07C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh9;                                       // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh8;                                       // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh7;                                       // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh6;                                       // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh5;                                       // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh4;                                       // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x07F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x0800(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0808(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0810(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HB_Rock_Cliff;                                  // 0x0818(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HB_TreeGroup1;                                  // 0x0820(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HB_TreeGroup2;                                  // 0x0828(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HB_TreeGroup7;                                  // 0x0830(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HB_Rock_Scattered;                              // 0x0838(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HB_Rock_Cliff2;                                 // 0x0840(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   S_Hex_StonewoodOutpostTerrain;                     // 0x0848(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MeshCommandCenterFlag;                             // 0x0850(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MeshSmallRocks01;                                  // 0x0858(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MeshTowerBall;                                     // 0x0860(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MeshFlagpole;                                      // 0x0868(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        FlagParent;                                        // 0x0870(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MeshCommandCenter;                                 // 0x0878(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MeshRockCliff04;                                   // 0x0880(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MeshRockCliff03;                                   // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MeshRockCliff02;                                   // 0x0890(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MeshRockCliff01;                                   // 0x0898(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HB_Mountain;                                    // 0x08A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HB_Center_Command0040;                          // 0x08A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OriginalPos;                                       // 0x08B0(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MovedPos;                                          // 0x08BC(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BannerMID;                                         // 0x08C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Hex_OutpostCC_7(int32 EntryPoint);
	void ActivateOutpost();
	void HandleOnPlayerInfoChanged(const struct FUniqueNetIdRepl& UniqueId);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Hex_OutpostCC_7_C">();
	}
	static class ABP_Hex_OutpostCC_7_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Hex_OutpostCC_7_C>();
	}
};
static_assert(alignof(ABP_Hex_OutpostCC_7_C) == 0x000008, "Wrong alignment on ABP_Hex_OutpostCC_7_C");
static_assert(sizeof(ABP_Hex_OutpostCC_7_C) == 0x0008D0, "Wrong size on ABP_Hex_OutpostCC_7_C");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, UberGraphFrame_BP_Hex_OutpostCC_7_C) == 0x000718, "Member 'ABP_Hex_OutpostCC_7_C::UberGraphFrame_BP_Hex_OutpostCC_7_C' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh28) == 0x000720, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh28' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh27) == 0x000728, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh27' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh26) == 0x000730, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh26' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh25) == 0x000738, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh25' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, Shield) == 0x000740, "Member 'ABP_Hex_OutpostCC_7_C::Shield' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, SpotLight) == 0x000748, "Member 'ABP_Hex_OutpostCC_7_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh24) == 0x000750, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh24' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh23) == 0x000758, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh23' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh22) == 0x000760, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh22' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh21) == 0x000768, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh21' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh20) == 0x000770, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh20' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh19) == 0x000778, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh19' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh18) == 0x000780, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh18' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh17) == 0x000788, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh17' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh16) == 0x000790, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh16' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh15) == 0x000798, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh15' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh14) == 0x0007A0, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh14' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh13) == 0x0007A8, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh13' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh12) == 0x0007B0, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh12' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh11) == 0x0007B8, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh11' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh10) == 0x0007C0, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh10' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh9) == 0x0007C8, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh9' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh8) == 0x0007D0, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh8' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh7) == 0x0007D8, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh7' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh6) == 0x0007E0, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh6' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh5) == 0x0007E8, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh5' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh4) == 0x0007F0, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh4' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh3) == 0x0007F8, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh2) == 0x000800, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh1) == 0x000808, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, StaticMesh) == 0x000810, "Member 'ABP_Hex_OutpostCC_7_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, SM_HB_Rock_Cliff) == 0x000818, "Member 'ABP_Hex_OutpostCC_7_C::SM_HB_Rock_Cliff' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, SM_HB_TreeGroup1) == 0x000820, "Member 'ABP_Hex_OutpostCC_7_C::SM_HB_TreeGroup1' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, SM_HB_TreeGroup2) == 0x000828, "Member 'ABP_Hex_OutpostCC_7_C::SM_HB_TreeGroup2' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, SM_HB_TreeGroup7) == 0x000830, "Member 'ABP_Hex_OutpostCC_7_C::SM_HB_TreeGroup7' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, SM_HB_Rock_Scattered) == 0x000838, "Member 'ABP_Hex_OutpostCC_7_C::SM_HB_Rock_Scattered' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, SM_HB_Rock_Cliff2) == 0x000840, "Member 'ABP_Hex_OutpostCC_7_C::SM_HB_Rock_Cliff2' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, S_Hex_StonewoodOutpostTerrain) == 0x000848, "Member 'ABP_Hex_OutpostCC_7_C::S_Hex_StonewoodOutpostTerrain' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, MeshCommandCenterFlag) == 0x000850, "Member 'ABP_Hex_OutpostCC_7_C::MeshCommandCenterFlag' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, MeshSmallRocks01) == 0x000858, "Member 'ABP_Hex_OutpostCC_7_C::MeshSmallRocks01' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, MeshTowerBall) == 0x000860, "Member 'ABP_Hex_OutpostCC_7_C::MeshTowerBall' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, MeshFlagpole) == 0x000868, "Member 'ABP_Hex_OutpostCC_7_C::MeshFlagpole' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, FlagParent) == 0x000870, "Member 'ABP_Hex_OutpostCC_7_C::FlagParent' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, MeshCommandCenter) == 0x000878, "Member 'ABP_Hex_OutpostCC_7_C::MeshCommandCenter' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, MeshRockCliff04) == 0x000880, "Member 'ABP_Hex_OutpostCC_7_C::MeshRockCliff04' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, MeshRockCliff03) == 0x000888, "Member 'ABP_Hex_OutpostCC_7_C::MeshRockCliff03' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, MeshRockCliff02) == 0x000890, "Member 'ABP_Hex_OutpostCC_7_C::MeshRockCliff02' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, MeshRockCliff01) == 0x000898, "Member 'ABP_Hex_OutpostCC_7_C::MeshRockCliff01' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, SM_HB_Mountain) == 0x0008A0, "Member 'ABP_Hex_OutpostCC_7_C::SM_HB_Mountain' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, SM_HB_Center_Command0040) == 0x0008A8, "Member 'ABP_Hex_OutpostCC_7_C::SM_HB_Center_Command0040' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, OriginalPos) == 0x0008B0, "Member 'ABP_Hex_OutpostCC_7_C::OriginalPos' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, MovedPos) == 0x0008BC, "Member 'ABP_Hex_OutpostCC_7_C::MovedPos' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_7_C, BannerMID) == 0x0008C8, "Member 'ABP_Hex_OutpostCC_7_C::BannerMID' has a wrong offset!");

}

