#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Hex_OutpostCC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_Hex_PARENT_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Hex_OutpostCC.BP_Hex_OutpostCC_C
// 0x0080 (0x0798 - 0x0718)
class ABP_Hex_OutpostCC_C final : public ABP_Hex_PARENT_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Hex_OutpostCC_C;                 // 0x0718(0x0008)(Transient, DuplicateTransient)
	class UStaticMeshComponent*                   MeshCommandCenterFlag;                             // 0x0720(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FlagPole;                                          // 0x0728(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tip2;                                              // 0x0730(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MeshSmallRocks01;                                  // 0x0738(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MeshTowerBall;                                     // 0x0740(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MeshFlagpole;                                      // 0x0748(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        FlagParent;                                        // 0x0750(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Tip;                                               // 0x0758(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HB_Mountain;                                    // 0x0760(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_HB_Center_Command0040;                          // 0x0768(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Outpost_Core;                                   // 0x0770(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OriginalPos;                                       // 0x0778(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MovedPos;                                          // 0x0784(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BannerMID;                                         // 0x0790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Hex_OutpostCC(int32 EntryPoint);
	void ActivateOutpost();
	void HandleOnPlayerInfoChanged(const struct FUniqueNetIdRepl& UniqueId);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Hex_OutpostCC_C">();
	}
	static class ABP_Hex_OutpostCC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Hex_OutpostCC_C>();
	}
};
static_assert(alignof(ABP_Hex_OutpostCC_C) == 0x000008, "Wrong alignment on ABP_Hex_OutpostCC_C");
static_assert(sizeof(ABP_Hex_OutpostCC_C) == 0x000798, "Wrong size on ABP_Hex_OutpostCC_C");
static_assert(offsetof(ABP_Hex_OutpostCC_C, UberGraphFrame_BP_Hex_OutpostCC_C) == 0x000718, "Member 'ABP_Hex_OutpostCC_C::UberGraphFrame_BP_Hex_OutpostCC_C' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_C, MeshCommandCenterFlag) == 0x000720, "Member 'ABP_Hex_OutpostCC_C::MeshCommandCenterFlag' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_C, FlagPole) == 0x000728, "Member 'ABP_Hex_OutpostCC_C::FlagPole' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_C, Tip2) == 0x000730, "Member 'ABP_Hex_OutpostCC_C::Tip2' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_C, MeshSmallRocks01) == 0x000738, "Member 'ABP_Hex_OutpostCC_C::MeshSmallRocks01' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_C, MeshTowerBall) == 0x000740, "Member 'ABP_Hex_OutpostCC_C::MeshTowerBall' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_C, MeshFlagpole) == 0x000748, "Member 'ABP_Hex_OutpostCC_C::MeshFlagpole' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_C, FlagParent) == 0x000750, "Member 'ABP_Hex_OutpostCC_C::FlagParent' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_C, Tip) == 0x000758, "Member 'ABP_Hex_OutpostCC_C::Tip' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_C, SM_HB_Mountain) == 0x000760, "Member 'ABP_Hex_OutpostCC_C::SM_HB_Mountain' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_C, SM_HB_Center_Command0040) == 0x000768, "Member 'ABP_Hex_OutpostCC_C::SM_HB_Center_Command0040' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_C, SM_Outpost_Core) == 0x000770, "Member 'ABP_Hex_OutpostCC_C::SM_Outpost_Core' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_C, OriginalPos) == 0x000778, "Member 'ABP_Hex_OutpostCC_C::OriginalPos' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_C, MovedPos) == 0x000784, "Member 'ABP_Hex_OutpostCC_C::MovedPos' has a wrong offset!");
static_assert(offsetof(ABP_Hex_OutpostCC_C, BannerMID) == 0x000790, "Member 'ABP_Hex_OutpostCC_C::BannerMID' has a wrong offset!");

}

