#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LocalPlayerProfileModal

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_LocalPlayerProfileModal.BP_LocalPlayerProfileModal_C.ExecuteUbergraph_BP_LocalPlayerProfileModal
// 0x0030 (0x0030 - 0x0000)
struct BP_LocalPlayerProfileModal_C_ExecuteUbergraph_BP_LocalPlayerProfileModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bUsingGamepad;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_ComponentBoundEvent_ActiveWidget;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ActiveWidgetIndex;      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_IconId;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_ColorId;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleCloseAction_PassThrough;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleCloseAction_PassThrough2;           // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LocalPlayerProfileModal_C_ExecuteUbergraph_BP_LocalPlayerProfileModal) == 0x000008, "Wrong alignment on BP_LocalPlayerProfileModal_C_ExecuteUbergraph_BP_LocalPlayerProfileModal");
static_assert(sizeof(BP_LocalPlayerProfileModal_C_ExecuteUbergraph_BP_LocalPlayerProfileModal) == 0x000030, "Wrong size on BP_LocalPlayerProfileModal_C_ExecuteUbergraph_BP_LocalPlayerProfileModal");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_ExecuteUbergraph_BP_LocalPlayerProfileModal, EntryPoint) == 0x000000, "Member 'BP_LocalPlayerProfileModal_C_ExecuteUbergraph_BP_LocalPlayerProfileModal::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_ExecuteUbergraph_BP_LocalPlayerProfileModal, K2Node_Event_bUsingGamepad) == 0x000004, "Member 'BP_LocalPlayerProfileModal_C_ExecuteUbergraph_BP_LocalPlayerProfileModal::K2Node_Event_bUsingGamepad' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_ExecuteUbergraph_BP_LocalPlayerProfileModal, K2Node_Event_IsDesignTime) == 0x000005, "Member 'BP_LocalPlayerProfileModal_C_ExecuteUbergraph_BP_LocalPlayerProfileModal::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_ExecuteUbergraph_BP_LocalPlayerProfileModal, K2Node_ComponentBoundEvent_ActiveWidget) == 0x000008, "Member 'BP_LocalPlayerProfileModal_C_ExecuteUbergraph_BP_LocalPlayerProfileModal::K2Node_ComponentBoundEvent_ActiveWidget' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_ExecuteUbergraph_BP_LocalPlayerProfileModal, K2Node_ComponentBoundEvent_ActiveWidgetIndex) == 0x000010, "Member 'BP_LocalPlayerProfileModal_C_ExecuteUbergraph_BP_LocalPlayerProfileModal::K2Node_ComponentBoundEvent_ActiveWidgetIndex' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_ExecuteUbergraph_BP_LocalPlayerProfileModal, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000014, "Member 'BP_LocalPlayerProfileModal_C_ExecuteUbergraph_BP_LocalPlayerProfileModal::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_ExecuteUbergraph_BP_LocalPlayerProfileModal, K2Node_ComponentBoundEvent_IconId) == 0x000018, "Member 'BP_LocalPlayerProfileModal_C_ExecuteUbergraph_BP_LocalPlayerProfileModal::K2Node_ComponentBoundEvent_IconId' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_ExecuteUbergraph_BP_LocalPlayerProfileModal, K2Node_ComponentBoundEvent_ColorId) == 0x000020, "Member 'BP_LocalPlayerProfileModal_C_ExecuteUbergraph_BP_LocalPlayerProfileModal::K2Node_ComponentBoundEvent_ColorId' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_ExecuteUbergraph_BP_LocalPlayerProfileModal, CallFunc_HandleCloseAction_PassThrough) == 0x000028, "Member 'BP_LocalPlayerProfileModal_C_ExecuteUbergraph_BP_LocalPlayerProfileModal::CallFunc_HandleCloseAction_PassThrough' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_ExecuteUbergraph_BP_LocalPlayerProfileModal, CallFunc_HandleCloseAction_PassThrough2) == 0x000029, "Member 'BP_LocalPlayerProfileModal_C_ExecuteUbergraph_BP_LocalPlayerProfileModal::CallFunc_HandleCloseAction_PassThrough2' has a wrong offset!");

// Function BP_LocalPlayerProfileModal.BP_LocalPlayerProfileModal_C.OnInputModeChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_LocalPlayerProfileModal_C_OnInputModeChanged final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LocalPlayerProfileModal_C_OnInputModeChanged) == 0x000001, "Wrong alignment on BP_LocalPlayerProfileModal_C_OnInputModeChanged");
static_assert(sizeof(BP_LocalPlayerProfileModal_C_OnInputModeChanged) == 0x000001, "Wrong size on BP_LocalPlayerProfileModal_C_OnInputModeChanged");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_OnInputModeChanged, bUsingGamepad) == 0x000000, "Member 'BP_LocalPlayerProfileModal_C_OnInputModeChanged::bUsingGamepad' has a wrong offset!");

// Function BP_LocalPlayerProfileModal.BP_LocalPlayerProfileModal_C.BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) BP_LocalPlayerProfileModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature final
{
public:
	class FName                                   IconId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ColorId;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LocalPlayerProfileModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature) == 0x000008, "Wrong alignment on BP_LocalPlayerProfileModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature");
static_assert(sizeof(BP_LocalPlayerProfileModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature) == 0x000010, "Wrong size on BP_LocalPlayerProfileModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature, IconId) == 0x000000, "Member 'BP_LocalPlayerProfileModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature::IconId' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature, ColorId) == 0x000008, "Member 'BP_LocalPlayerProfileModal_C_BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature::ColorId' has a wrong offset!");

// Function BP_LocalPlayerProfileModal.BP_LocalPlayerProfileModal_C.BndEvt__CommonWidgetSwitcher_0_K2Node_ComponentBoundEvent_66_OnActiveWidgetChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_LocalPlayerProfileModal_C_BndEvt__CommonWidgetSwitcher_0_K2Node_ComponentBoundEvent_66_OnActiveWidgetChanged__DelegateSignature final
{
public:
	class UWidget*                                ActiveWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ActiveWidgetIndex;                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LocalPlayerProfileModal_C_BndEvt__CommonWidgetSwitcher_0_K2Node_ComponentBoundEvent_66_OnActiveWidgetChanged__DelegateSignature) == 0x000008, "Wrong alignment on BP_LocalPlayerProfileModal_C_BndEvt__CommonWidgetSwitcher_0_K2Node_ComponentBoundEvent_66_OnActiveWidgetChanged__DelegateSignature");
static_assert(sizeof(BP_LocalPlayerProfileModal_C_BndEvt__CommonWidgetSwitcher_0_K2Node_ComponentBoundEvent_66_OnActiveWidgetChanged__DelegateSignature) == 0x000010, "Wrong size on BP_LocalPlayerProfileModal_C_BndEvt__CommonWidgetSwitcher_0_K2Node_ComponentBoundEvent_66_OnActiveWidgetChanged__DelegateSignature");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_BndEvt__CommonWidgetSwitcher_0_K2Node_ComponentBoundEvent_66_OnActiveWidgetChanged__DelegateSignature, ActiveWidget) == 0x000000, "Member 'BP_LocalPlayerProfileModal_C_BndEvt__CommonWidgetSwitcher_0_K2Node_ComponentBoundEvent_66_OnActiveWidgetChanged__DelegateSignature::ActiveWidget' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_BndEvt__CommonWidgetSwitcher_0_K2Node_ComponentBoundEvent_66_OnActiveWidgetChanged__DelegateSignature, ActiveWidgetIndex) == 0x000008, "Member 'BP_LocalPlayerProfileModal_C_BndEvt__CommonWidgetSwitcher_0_K2Node_ComponentBoundEvent_66_OnActiveWidgetChanged__DelegateSignature::ActiveWidgetIndex' has a wrong offset!");

// Function BP_LocalPlayerProfileModal.BP_LocalPlayerProfileModal_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_LocalPlayerProfileModal_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LocalPlayerProfileModal_C_PreConstruct) == 0x000001, "Wrong alignment on BP_LocalPlayerProfileModal_C_PreConstruct");
static_assert(sizeof(BP_LocalPlayerProfileModal_C_PreConstruct) == 0x000001, "Wrong size on BP_LocalPlayerProfileModal_C_PreConstruct");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_LocalPlayerProfileModal_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_LocalPlayerProfileModal.BP_LocalPlayerProfileModal_C.Activate Widget
// 0x0008 (0x0008 - 0x0000)
struct BP_LocalPlayerProfileModal_C_Activate_Widget final
{
public:
	int32                                         Selection;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LocalPlayerProfileModal_C_Activate_Widget) == 0x000004, "Wrong alignment on BP_LocalPlayerProfileModal_C_Activate_Widget");
static_assert(sizeof(BP_LocalPlayerProfileModal_C_Activate_Widget) == 0x000008, "Wrong size on BP_LocalPlayerProfileModal_C_Activate_Widget");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_Activate_Widget, Selection) == 0x000000, "Member 'BP_LocalPlayerProfileModal_C_Activate_Widget::Selection' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_Activate_Widget, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'BP_LocalPlayerProfileModal_C_Activate_Widget::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function BP_LocalPlayerProfileModal.BP_LocalPlayerProfileModal_C.HandleCloseAction
// 0x0018 (0x0018 - 0x0000)
struct BP_LocalPlayerProfileModal_C_HandleCloseAction final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Attempt_Leave_Picker_Left;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LocalPlayerProfileModal_C_HandleCloseAction) == 0x000008, "Wrong alignment on BP_LocalPlayerProfileModal_C_HandleCloseAction");
static_assert(sizeof(BP_LocalPlayerProfileModal_C_HandleCloseAction) == 0x000018, "Wrong size on BP_LocalPlayerProfileModal_C_HandleCloseAction");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_HandleCloseAction, Passthrough) == 0x000000, "Member 'BP_LocalPlayerProfileModal_C_HandleCloseAction::Passthrough' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_HandleCloseAction, CallFunc_Attempt_Leave_Picker_Left) == 0x000001, "Member 'BP_LocalPlayerProfileModal_C_HandleCloseAction::CallFunc_Attempt_Leave_Picker_Left' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_HandleCloseAction, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000004, "Member 'BP_LocalPlayerProfileModal_C_HandleCloseAction::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_HandleCloseAction, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_LocalPlayerProfileModal_C_HandleCloseAction::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_HandleCloseAction, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000010, "Member 'BP_LocalPlayerProfileModal_C_HandleCloseAction::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function BP_LocalPlayerProfileModal.BP_LocalPlayerProfileModal_C.Setup Input Action Handlers
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) BP_LocalPlayerProfileModal_C_Setup_Input_Action_Handlers final
{
public:
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate2;             // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate3;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_LocalPlayerProfileModal_C_Setup_Input_Action_Handlers) == 0x000008, "Wrong alignment on BP_LocalPlayerProfileModal_C_Setup_Input_Action_Handlers");
static_assert(sizeof(BP_LocalPlayerProfileModal_C_Setup_Input_Action_Handlers) == 0x000030, "Wrong size on BP_LocalPlayerProfileModal_C_Setup_Input_Action_Handlers");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_Setup_Input_Action_Handlers, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'BP_LocalPlayerProfileModal_C_Setup_Input_Action_Handlers::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_Setup_Input_Action_Handlers, K2Node_CreateDelegate_OutputDelegate2) == 0x000010, "Member 'BP_LocalPlayerProfileModal_C_Setup_Input_Action_Handlers::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_Setup_Input_Action_Handlers, K2Node_CreateDelegate_OutputDelegate3) == 0x000020, "Member 'BP_LocalPlayerProfileModal_C_Setup_Input_Action_Handlers::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");

// Function BP_LocalPlayerProfileModal.BP_LocalPlayerProfileModal_C.HandlePreviousAction
// 0x000C (0x000C - 0x0000)
struct BP_LocalPlayerProfileModal_C_HandlePreviousAction final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LocalPlayerProfileModal_C_HandlePreviousAction) == 0x000004, "Wrong alignment on BP_LocalPlayerProfileModal_C_HandlePreviousAction");
static_assert(sizeof(BP_LocalPlayerProfileModal_C_HandlePreviousAction) == 0x00000C, "Wrong size on BP_LocalPlayerProfileModal_C_HandlePreviousAction");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_HandlePreviousAction, Passthrough) == 0x000000, "Member 'BP_LocalPlayerProfileModal_C_HandlePreviousAction::Passthrough' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_HandlePreviousAction, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000004, "Member 'BP_LocalPlayerProfileModal_C_HandlePreviousAction::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_HandlePreviousAction, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_LocalPlayerProfileModal_C_HandlePreviousAction::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_LocalPlayerProfileModal.BP_LocalPlayerProfileModal_C.HandleNextAction
// 0x000C (0x000C - 0x0000)
struct BP_LocalPlayerProfileModal_C_HandleNextAction final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LocalPlayerProfileModal_C_HandleNextAction) == 0x000004, "Wrong alignment on BP_LocalPlayerProfileModal_C_HandleNextAction");
static_assert(sizeof(BP_LocalPlayerProfileModal_C_HandleNextAction) == 0x00000C, "Wrong size on BP_LocalPlayerProfileModal_C_HandleNextAction");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_HandleNextAction, Passthrough) == 0x000000, "Member 'BP_LocalPlayerProfileModal_C_HandleNextAction::Passthrough' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_HandleNextAction, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000004, "Member 'BP_LocalPlayerProfileModal_C_HandleNextAction::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileModal_C_HandleNextAction, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_LocalPlayerProfileModal_C_HandleNextAction::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

}

