#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LocalPlayerProfileModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_LocalPlayerProfileModal.BP_LocalPlayerProfileModal_C
// 0x0068 (0x0458 - 0x03F0)
class UBP_LocalPlayerProfileModal_C final : public UFortPlayerProfileModalWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(Transient, DuplicateTransient)
	class UBP_LocalPlayerBannerEditor_C*          BP_LocalPlayerBannerEditor;                        // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_LocalPlayerProfileManagement_C*     BP_LocalPlayerProfileManagement;                   // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_0;                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    CloseAction;                                       // 0x0418(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class FName                                   LastChosenIcon;                                    // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LastChosenColor;                                   // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    PreviousAction;                                    // 0x0438(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    NextAction;                                        // 0x0448(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_BP_LocalPlayerProfileModal(int32 EntryPoint);
	void OnInputModeChanged(bool bUsingGamepad);
	void OnDeactivated();
	void BndEvt__BP_LocalPlayerBannerEditor_K2Node_ComponentBoundEvent_18_CloseBannerEditor__DelegateSignature(class FName IconId, class FName ColorId);
	void BndEvt__BP_LocalPlayerProfileManagement_K2Node_ComponentBoundEvent_14_CloseProfileModal__DelegateSignature();
	void Construct();
	void OnActivated();
	void BndEvt__CommonWidgetSwitcher_0_K2Node_ComponentBoundEvent_66_OnActiveWidgetChanged__DelegateSignature(class UWidget* ActiveWidget, int32 ActiveWidgetIndex);
	void BndEvt__BP_LocalPlayerProfileManagement_K2Node_ComponentBoundEvent_11_OpenBannerEditor__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void Activate_Widget(int32 Selection);
	void HandleCloseAction(bool* Passthrough);
	void Setup_Input_Action_Handlers();
	void HandlePreviousAction(bool* Passthrough);
	void HandleNextAction(bool* Passthrough);
	void Handle_Leaving_Banner_Editor();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LocalPlayerProfileModal_C">();
	}
	static class UBP_LocalPlayerProfileModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_LocalPlayerProfileModal_C>();
	}
};
static_assert(alignof(UBP_LocalPlayerProfileModal_C) == 0x000008, "Wrong alignment on UBP_LocalPlayerProfileModal_C");
static_assert(sizeof(UBP_LocalPlayerProfileModal_C) == 0x000458, "Wrong size on UBP_LocalPlayerProfileModal_C");
static_assert(offsetof(UBP_LocalPlayerProfileModal_C, UberGraphFrame) == 0x0003F0, "Member 'UBP_LocalPlayerProfileModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_LocalPlayerProfileModal_C, BP_LocalPlayerBannerEditor) == 0x0003F8, "Member 'UBP_LocalPlayerProfileModal_C::BP_LocalPlayerBannerEditor' has a wrong offset!");
static_assert(offsetof(UBP_LocalPlayerProfileModal_C, BP_LocalPlayerProfileManagement) == 0x000400, "Member 'UBP_LocalPlayerProfileModal_C::BP_LocalPlayerProfileManagement' has a wrong offset!");
static_assert(offsetof(UBP_LocalPlayerProfileModal_C, CommonWidgetSwitcher_0) == 0x000408, "Member 'UBP_LocalPlayerProfileModal_C::CommonWidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UBP_LocalPlayerProfileModal_C, Lightbox) == 0x000410, "Member 'UBP_LocalPlayerProfileModal_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UBP_LocalPlayerProfileModal_C, CloseAction) == 0x000418, "Member 'UBP_LocalPlayerProfileModal_C::CloseAction' has a wrong offset!");
static_assert(offsetof(UBP_LocalPlayerProfileModal_C, LastChosenIcon) == 0x000428, "Member 'UBP_LocalPlayerProfileModal_C::LastChosenIcon' has a wrong offset!");
static_assert(offsetof(UBP_LocalPlayerProfileModal_C, LastChosenColor) == 0x000430, "Member 'UBP_LocalPlayerProfileModal_C::LastChosenColor' has a wrong offset!");
static_assert(offsetof(UBP_LocalPlayerProfileModal_C, PreviousAction) == 0x000438, "Member 'UBP_LocalPlayerProfileModal_C::PreviousAction' has a wrong offset!");
static_assert(offsetof(UBP_LocalPlayerProfileModal_C, NextAction) == 0x000448, "Member 'UBP_LocalPlayerProfileModal_C::NextAction' has a wrong offset!");

}

