#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LocalPlayerProfileManagement

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function BP_LocalPlayerProfileManagement.BP_LocalPlayerProfileManagement_C.ExecuteUbergraph_BP_LocalPlayerProfileManagement
// 0x0208 (0x0208 - 0x0000)
struct BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue2;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button4;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button3;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHomeBaseContext*                       CallFunc_GetContext_ReturnValue3;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue4;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortTeamMemberInfo                    CallFunc_GetLocalPlayerTeamMemberInfo_LocalPlayerInfo; // 0x0048(0x01A8)()
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalHomebaseRating_Rating;            // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalHomebaseRating_ProgressFraction;  // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTotalHomebaseRating_ReturnValue;       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement) == 0x000008, "Wrong alignment on BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement");
static_assert(sizeof(BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement) == 0x000208, "Wrong size on BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement, EntryPoint) == 0x000000, "Member 'BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement, CallFunc_GetContext_ReturnValue2) == 0x000010, "Member 'BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement, K2Node_ComponentBoundEvent_Button4) == 0x000018, "Member 'BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement::K2Node_ComponentBoundEvent_Button4' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement, K2Node_ComponentBoundEvent_Button3) == 0x000020, "Member 'BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement, K2Node_ComponentBoundEvent_Button2) == 0x000028, "Member 'BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement, CallFunc_GetContext_ReturnValue3) == 0x000030, "Member 'BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement, K2Node_ComponentBoundEvent_Button) == 0x000038, "Member 'BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement, CallFunc_GetContext_ReturnValue4) == 0x000040, "Member 'BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement, CallFunc_GetLocalPlayerTeamMemberInfo_LocalPlayerInfo) == 0x000048, "Member 'BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement::CallFunc_GetLocalPlayerTeamMemberInfo_LocalPlayerInfo' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement, CallFunc_GetUINavigationManager_ReturnValue) == 0x0001F0, "Member 'BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement, CallFunc_GetTotalHomebaseRating_Rating) == 0x0001F8, "Member 'BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement::CallFunc_GetTotalHomebaseRating_Rating' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement, CallFunc_GetTotalHomebaseRating_ProgressFraction) == 0x0001FC, "Member 'BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement::CallFunc_GetTotalHomebaseRating_ProgressFraction' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement, CallFunc_GetTotalHomebaseRating_ReturnValue) == 0x000200, "Member 'BP_LocalPlayerProfileManagement_C_ExecuteUbergraph_BP_LocalPlayerProfileManagement::CallFunc_GetTotalHomebaseRating_ReturnValue' has a wrong offset!");

// Function BP_LocalPlayerProfileManagement.BP_LocalPlayerProfileManagement_C.BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_126_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_LocalPlayerProfileManagement_C_BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_126_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LocalPlayerProfileManagement_C_BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_126_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_LocalPlayerProfileManagement_C_BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_126_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(BP_LocalPlayerProfileManagement_C_BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_126_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on BP_LocalPlayerProfileManagement_C_BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_126_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_126_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'BP_LocalPlayerProfileManagement_C_BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_126_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function BP_LocalPlayerProfileManagement.BP_LocalPlayerProfileManagement_C.BndEvt__LeavePartyButton_K2Node_ComponentBoundEvent_100_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_LocalPlayerProfileManagement_C_BndEvt__LeavePartyButton_K2Node_ComponentBoundEvent_100_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LocalPlayerProfileManagement_C_BndEvt__LeavePartyButton_K2Node_ComponentBoundEvent_100_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_LocalPlayerProfileManagement_C_BndEvt__LeavePartyButton_K2Node_ComponentBoundEvent_100_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(BP_LocalPlayerProfileManagement_C_BndEvt__LeavePartyButton_K2Node_ComponentBoundEvent_100_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on BP_LocalPlayerProfileManagement_C_BndEvt__LeavePartyButton_K2Node_ComponentBoundEvent_100_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_BndEvt__LeavePartyButton_K2Node_ComponentBoundEvent_100_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'BP_LocalPlayerProfileManagement_C_BndEvt__LeavePartyButton_K2Node_ComponentBoundEvent_100_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function BP_LocalPlayerProfileManagement.BP_LocalPlayerProfileManagement_C.BndEvt__CloseProfileButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_LocalPlayerProfileManagement_C_BndEvt__CloseProfileButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LocalPlayerProfileManagement_C_BndEvt__CloseProfileButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_LocalPlayerProfileManagement_C_BndEvt__CloseProfileButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(BP_LocalPlayerProfileManagement_C_BndEvt__CloseProfileButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on BP_LocalPlayerProfileManagement_C_BndEvt__CloseProfileButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_BndEvt__CloseProfileButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'BP_LocalPlayerProfileManagement_C_BndEvt__CloseProfileButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function BP_LocalPlayerProfileManagement.BP_LocalPlayerProfileManagement_C.BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_LocalPlayerProfileManagement_C_BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LocalPlayerProfileManagement_C_BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on BP_LocalPlayerProfileManagement_C_BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(BP_LocalPlayerProfileManagement_C_BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on BP_LocalPlayerProfileManagement_C_BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'BP_LocalPlayerProfileManagement_C_BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function BP_LocalPlayerProfileManagement.BP_LocalPlayerProfileManagement_C.OnWidgetActivated
// 0x0088 (0x0088 - 0x0000)
struct BP_LocalPlayerProfileManagement_C_OnWidgetActivated final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue2;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInLobby_ReturnValue;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIDataConfigurationContext*        CallFunc_GetContext_ReturnValue3;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetGameAccountId_ReturnValue;             // 0x0048(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_ArePartyFeaturesEnabled_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LocalPlayerProfileManagement_C_OnWidgetActivated) == 0x000008, "Wrong alignment on BP_LocalPlayerProfileManagement_C_OnWidgetActivated");
static_assert(sizeof(BP_LocalPlayerProfileManagement_C_OnWidgetActivated) == 0x000088, "Wrong size on BP_LocalPlayerProfileManagement_C_OnWidgetActivated");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_OnWidgetActivated, Temp_byte_Variable) == 0x000000, "Member 'BP_LocalPlayerProfileManagement_C_OnWidgetActivated::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_OnWidgetActivated, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'BP_LocalPlayerProfileManagement_C_OnWidgetActivated::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_OnWidgetActivated, CallFunc_IsInZone_ReturnValue) == 0x000010, "Member 'BP_LocalPlayerProfileManagement_C_OnWidgetActivated::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_OnWidgetActivated, CallFunc_GetContext_ReturnValue2) == 0x000018, "Member 'BP_LocalPlayerProfileManagement_C_OnWidgetActivated::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_OnWidgetActivated, Temp_byte_Variable2) == 0x000020, "Member 'BP_LocalPlayerProfileManagement_C_OnWidgetActivated::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_OnWidgetActivated, CallFunc_IsInLobby_ReturnValue) == 0x000021, "Member 'BP_LocalPlayerProfileManagement_C_OnWidgetActivated::CallFunc_IsInLobby_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_OnWidgetActivated, CallFunc_BooleanOR_ReturnValue) == 0x000022, "Member 'BP_LocalPlayerProfileManagement_C_OnWidgetActivated::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_OnWidgetActivated, Temp_bool_Variable) == 0x000023, "Member 'BP_LocalPlayerProfileManagement_C_OnWidgetActivated::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_OnWidgetActivated, CallFunc_GetOwningPlayer_ReturnValue) == 0x000028, "Member 'BP_LocalPlayerProfileManagement_C_OnWidgetActivated::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_OnWidgetActivated, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000030, "Member 'BP_LocalPlayerProfileManagement_C_OnWidgetActivated::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_OnWidgetActivated, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_LocalPlayerProfileManagement_C_OnWidgetActivated::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_OnWidgetActivated, CallFunc_GetContext_ReturnValue3) == 0x000040, "Member 'BP_LocalPlayerProfileManagement_C_OnWidgetActivated::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_OnWidgetActivated, CallFunc_GetGameAccountId_ReturnValue) == 0x000048, "Member 'BP_LocalPlayerProfileManagement_C_OnWidgetActivated::CallFunc_GetGameAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_OnWidgetActivated, CallFunc_ArePartyFeaturesEnabled_ReturnValue) == 0x000070, "Member 'BP_LocalPlayerProfileManagement_C_OnWidgetActivated::CallFunc_ArePartyFeaturesEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_OnWidgetActivated, CallFunc_Not_PreBool_ReturnValue) == 0x000071, "Member 'BP_LocalPlayerProfileManagement_C_OnWidgetActivated::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_OnWidgetActivated, CallFunc_BooleanOR_ReturnValue2) == 0x000072, "Member 'BP_LocalPlayerProfileManagement_C_OnWidgetActivated::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_OnWidgetActivated, CallFunc_GetUINavigationManager_ReturnValue) == 0x000078, "Member 'BP_LocalPlayerProfileManagement_C_OnWidgetActivated::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_OnWidgetActivated, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'BP_LocalPlayerProfileManagement_C_OnWidgetActivated::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_OnWidgetActivated, K2Node_Select_Default) == 0x000081, "Member 'BP_LocalPlayerProfileManagement_C_OnWidgetActivated::K2Node_Select_Default' has a wrong offset!");

// Function BP_LocalPlayerProfileManagement.BP_LocalPlayerProfileManagement_C.UpdateBannerIconAndColor
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) BP_LocalPlayerProfileManagement_C_UpdateBannerIconAndColor final
{
public:
	class FName                                   InBannerIconId;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InBannerColorId;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue2;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LocalPlayerProfileManagement_C_UpdateBannerIconAndColor) == 0x000008, "Wrong alignment on BP_LocalPlayerProfileManagement_C_UpdateBannerIconAndColor");
static_assert(sizeof(BP_LocalPlayerProfileManagement_C_UpdateBannerIconAndColor) == 0x000018, "Wrong size on BP_LocalPlayerProfileManagement_C_UpdateBannerIconAndColor");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_UpdateBannerIconAndColor, InBannerIconId) == 0x000000, "Member 'BP_LocalPlayerProfileManagement_C_UpdateBannerIconAndColor::InBannerIconId' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_UpdateBannerIconAndColor, InBannerColorId) == 0x000008, "Member 'BP_LocalPlayerProfileManagement_C_UpdateBannerIconAndColor::InBannerColorId' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_UpdateBannerIconAndColor, CallFunc_NotEqual_NameName_ReturnValue) == 0x000010, "Member 'BP_LocalPlayerProfileManagement_C_UpdateBannerIconAndColor::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_UpdateBannerIconAndColor, CallFunc_NotEqual_NameName_ReturnValue2) == 0x000011, "Member 'BP_LocalPlayerProfileManagement_C_UpdateBannerIconAndColor::CallFunc_NotEqual_NameName_ReturnValue2' has a wrong offset!");

// Function BP_LocalPlayerProfileManagement.BP_LocalPlayerProfileManagement_C.Get_ViewProfileButton_Visibility_0
// 0x0020 (0x0020 - 0x0000)
struct BP_LocalPlayerProfileManagement_C_Get_ViewProfileButton_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue2;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LocalPlayerProfileManagement_C_Get_ViewProfileButton_Visibility_0) == 0x000008, "Wrong alignment on BP_LocalPlayerProfileManagement_C_Get_ViewProfileButton_Visibility_0");
static_assert(sizeof(BP_LocalPlayerProfileManagement_C_Get_ViewProfileButton_Visibility_0) == 0x000020, "Wrong size on BP_LocalPlayerProfileManagement_C_Get_ViewProfileButton_Visibility_0");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_Get_ViewProfileButton_Visibility_0, ReturnValue) == 0x000000, "Member 'BP_LocalPlayerProfileManagement_C_Get_ViewProfileButton_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_Get_ViewProfileButton_Visibility_0, Temp_bool_Variable) == 0x000001, "Member 'BP_LocalPlayerProfileManagement_C_Get_ViewProfileButton_Visibility_0::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_Get_ViewProfileButton_Visibility_0, Temp_byte_Variable) == 0x000002, "Member 'BP_LocalPlayerProfileManagement_C_Get_ViewProfileButton_Visibility_0::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_Get_ViewProfileButton_Visibility_0, Temp_byte_Variable2) == 0x000003, "Member 'BP_LocalPlayerProfileManagement_C_Get_ViewProfileButton_Visibility_0::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_Get_ViewProfileButton_Visibility_0, CallFunc_GetPlatformName_ReturnValue) == 0x000008, "Member 'BP_LocalPlayerProfileManagement_C_Get_ViewProfileButton_Visibility_0::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_Get_ViewProfileButton_Visibility_0, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000018, "Member 'BP_LocalPlayerProfileManagement_C_Get_ViewProfileButton_Visibility_0::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_Get_ViewProfileButton_Visibility_0, CallFunc_EqualEqual_StrStr_ReturnValue2) == 0x000019, "Member 'BP_LocalPlayerProfileManagement_C_Get_ViewProfileButton_Visibility_0::CallFunc_EqualEqual_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_Get_ViewProfileButton_Visibility_0, CallFunc_BooleanOR_ReturnValue) == 0x00001A, "Member 'BP_LocalPlayerProfileManagement_C_Get_ViewProfileButton_Visibility_0::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_Get_ViewProfileButton_Visibility_0, K2Node_Select_Default) == 0x00001B, "Member 'BP_LocalPlayerProfileManagement_C_Get_ViewProfileButton_Visibility_0::K2Node_Select_Default' has a wrong offset!");

// Function BP_LocalPlayerProfileManagement.BP_LocalPlayerProfileManagement_C.Get_LeavePartyButton_Visibility_0
// 0x0030 (0x0030 - 0x0000)
struct BP_LocalPlayerProfileManagement_C_Get_LeavePartyButton_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUITeamInfo*                        CallFunc_GetLocalPlayerTeam_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FUniqueNetIdRepl>               CallFunc_GetTeamMemberIDs_TeamMemberIDs;           // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LocalPlayerProfileManagement_C_Get_LeavePartyButton_Visibility_0) == 0x000008, "Wrong alignment on BP_LocalPlayerProfileManagement_C_Get_LeavePartyButton_Visibility_0");
static_assert(sizeof(BP_LocalPlayerProfileManagement_C_Get_LeavePartyButton_Visibility_0) == 0x000030, "Wrong size on BP_LocalPlayerProfileManagement_C_Get_LeavePartyButton_Visibility_0");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_Get_LeavePartyButton_Visibility_0, ReturnValue) == 0x000000, "Member 'BP_LocalPlayerProfileManagement_C_Get_LeavePartyButton_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_Get_LeavePartyButton_Visibility_0, Temp_bool_Variable) == 0x000001, "Member 'BP_LocalPlayerProfileManagement_C_Get_LeavePartyButton_Visibility_0::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_Get_LeavePartyButton_Visibility_0, Temp_byte_Variable) == 0x000002, "Member 'BP_LocalPlayerProfileManagement_C_Get_LeavePartyButton_Visibility_0::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_Get_LeavePartyButton_Visibility_0, Temp_byte_Variable2) == 0x000003, "Member 'BP_LocalPlayerProfileManagement_C_Get_LeavePartyButton_Visibility_0::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_Get_LeavePartyButton_Visibility_0, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'BP_LocalPlayerProfileManagement_C_Get_LeavePartyButton_Visibility_0::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_Get_LeavePartyButton_Visibility_0, CallFunc_GetLocalPlayerTeam_ReturnValue) == 0x000010, "Member 'BP_LocalPlayerProfileManagement_C_Get_LeavePartyButton_Visibility_0::CallFunc_GetLocalPlayerTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_Get_LeavePartyButton_Visibility_0, CallFunc_GetTeamMemberIDs_TeamMemberIDs) == 0x000018, "Member 'BP_LocalPlayerProfileManagement_C_Get_LeavePartyButton_Visibility_0::CallFunc_GetTeamMemberIDs_TeamMemberIDs' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_Get_LeavePartyButton_Visibility_0, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_LocalPlayerProfileManagement_C_Get_LeavePartyButton_Visibility_0::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_Get_LeavePartyButton_Visibility_0, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'BP_LocalPlayerProfileManagement_C_Get_LeavePartyButton_Visibility_0::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_Get_LeavePartyButton_Visibility_0, K2Node_Select_Default) == 0x00002D, "Member 'BP_LocalPlayerProfileManagement_C_Get_LeavePartyButton_Visibility_0::K2Node_Select_Default' has a wrong offset!");

// Function BP_LocalPlayerProfileManagement.BP_LocalPlayerProfileManagement_C.UpdateBannerEditorButton
// 0x0010 (0x0010 - 0x0000)
struct BP_LocalPlayerProfileManagement_C_UpdateBannerEditorButton final
{
public:
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LocalPlayerProfileManagement_C_UpdateBannerEditorButton) == 0x000008, "Wrong alignment on BP_LocalPlayerProfileManagement_C_UpdateBannerEditorButton");
static_assert(sizeof(BP_LocalPlayerProfileManagement_C_UpdateBannerEditorButton) == 0x000010, "Wrong size on BP_LocalPlayerProfileManagement_C_UpdateBannerEditorButton");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_UpdateBannerEditorButton, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'BP_LocalPlayerProfileManagement_C_UpdateBannerEditorButton::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_UpdateBannerEditorButton, CallFunc_IsInZone_ReturnValue) == 0x000008, "Member 'BP_LocalPlayerProfileManagement_C_UpdateBannerEditorButton::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_UpdateBannerEditorButton, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'BP_LocalPlayerProfileManagement_C_UpdateBannerEditorButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_UpdateBannerEditorButton, CallFunc_Not_PreBool_ReturnValue) == 0x00000A, "Member 'BP_LocalPlayerProfileManagement_C_UpdateBannerEditorButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_LocalPlayerProfileManagement.BP_LocalPlayerProfileManagement_C.Update Bang State
// 0x0070 (0x0070 - 0x0000)
struct BP_LocalPlayerProfileManagement_C_Update_Bang_State final
{
public:
	bool                                          bItemUnseen;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortAccountItem*>               LocalAccountItems;                                 // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAccountItem*                       CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasBeenSeenLocally_ReturnValue;           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue2;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortAccountItem*>               CallFunc_GetAccountItemsByType_Items;              // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UFortAccountItem*>               CallFunc_GetAccountItemsByType_Items2;             // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BP_LocalPlayerProfileManagement_C_Update_Bang_State) == 0x000008, "Wrong alignment on BP_LocalPlayerProfileManagement_C_Update_Bang_State");
static_assert(sizeof(BP_LocalPlayerProfileManagement_C_Update_Bang_State) == 0x000070, "Wrong size on BP_LocalPlayerProfileManagement_C_Update_Bang_State");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_Update_Bang_State, bItemUnseen) == 0x000000, "Member 'BP_LocalPlayerProfileManagement_C_Update_Bang_State::bItemUnseen' has a wrong offset!");
static_assert(offsetof(BP_LocalPlayerProfileManagement_C_Update_Bang_State, LocalAccountItems) == 0x000008, "Member 'BP_LocalPlayerProfileManagement_C_Update_Bang_State::LocalAccountItems' has a wrong offset!");
