#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SimpleItemWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SimpleItemWidget.BP_SimpleItemWidget_C.ExecuteUbergraph_BP_SimpleItemWidget
// 0x0078 (0x0078 - 0x0000)
struct BP_SimpleItemWidget_C_ExecuteUbergraph_BP_SimpleItemWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0060(0x0018)()
};
static_assert(alignof(BP_SimpleItemWidget_C_ExecuteUbergraph_BP_SimpleItemWidget) == 0x000008, "Wrong alignment on BP_SimpleItemWidget_C_ExecuteUbergraph_BP_SimpleItemWidget");
static_assert(sizeof(BP_SimpleItemWidget_C_ExecuteUbergraph_BP_SimpleItemWidget) == 0x000078, "Wrong size on BP_SimpleItemWidget_C_ExecuteUbergraph_BP_SimpleItemWidget");
static_assert(offsetof(BP_SimpleItemWidget_C_ExecuteUbergraph_BP_SimpleItemWidget, EntryPoint) == 0x000000, "Member 'BP_SimpleItemWidget_C_ExecuteUbergraph_BP_SimpleItemWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SimpleItemWidget_C_ExecuteUbergraph_BP_SimpleItemWidget, Temp_bool_Variable) == 0x000004, "Member 'BP_SimpleItemWidget_C_ExecuteUbergraph_BP_SimpleItemWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SimpleItemWidget_C_ExecuteUbergraph_BP_SimpleItemWidget, Temp_byte_Variable) == 0x000005, "Member 'BP_SimpleItemWidget_C_ExecuteUbergraph_BP_SimpleItemWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_SimpleItemWidget_C_ExecuteUbergraph_BP_SimpleItemWidget, Temp_byte_Variable2) == 0x000006, "Member 'BP_SimpleItemWidget_C_ExecuteUbergraph_BP_SimpleItemWidget::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(BP_SimpleItemWidget_C_ExecuteUbergraph_BP_SimpleItemWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x000007, "Member 'BP_SimpleItemWidget_C_ExecuteUbergraph_BP_SimpleItemWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SimpleItemWidget_C_ExecuteUbergraph_BP_SimpleItemWidget, K2Node_Select_Default) == 0x000008, "Member 'BP_SimpleItemWidget_C_ExecuteUbergraph_BP_SimpleItemWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_SimpleItemWidget_C_ExecuteUbergraph_BP_SimpleItemWidget, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'BP_SimpleItemWidget_C_ExecuteUbergraph_BP_SimpleItemWidget::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_SimpleItemWidget_C_ExecuteUbergraph_BP_SimpleItemWidget, K2Node_MakeArray_Array) == 0x000050, "Member 'BP_SimpleItemWidget_C_ExecuteUbergraph_BP_SimpleItemWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SimpleItemWidget_C_ExecuteUbergraph_BP_SimpleItemWidget, CallFunc_Format_ReturnValue) == 0x000060, "Member 'BP_SimpleItemWidget_C_ExecuteUbergraph_BP_SimpleItemWidget::CallFunc_Format_ReturnValue' has a wrong offset!");

}

