#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VictoryDrone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VictoryDrone.BP_VictoryDrone_C
// 0x0048 (0x0410 - 0x03C8)
class ABP_VictoryDrone_C final : public APawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PlayerTeleportEffect;                              // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               SpawnEffect;                                       // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   SpawnOutAnimEndedDispatcher;                       // 0x03F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         AnimPlayRate;                                      // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               StaticMeshMID;                                     // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SpawnOutAnimEndedDispatcher__DelegateSignature(class ABP_VictoryDrone_C* Drone);
	void ExecuteUbergraph_BP_VictoryDrone(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void OnSpawnOutAnimEnded(class UAnimMontage* Montage, bool bInterrupted);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void TriggerPlayerSpawnEffects();
	void InitDrone();
	void PlaySpawnOutAnim();
	void NotifyTeleportFinishedTriggered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VictoryDrone_C">();
	}
	static class ABP_VictoryDrone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VictoryDrone_C>();
	}
};
static_assert(alignof(ABP_VictoryDrone_C) == 0x000008, "Wrong alignment on ABP_VictoryDrone_C");
static_assert(sizeof(ABP_VictoryDrone_C) == 0x000410, "Wrong size on ABP_VictoryDrone_C");
static_assert(offsetof(ABP_VictoryDrone_C, UberGraphFrame) == 0x0003C8, "Member 'ABP_VictoryDrone_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, StaticMesh) == 0x0003D0, "Member 'ABP_VictoryDrone_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, PlayerTeleportEffect) == 0x0003D8, "Member 'ABP_VictoryDrone_C::PlayerTeleportEffect' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, SpawnEffect) == 0x0003E0, "Member 'ABP_VictoryDrone_C::SpawnEffect' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, SkeletalMesh) == 0x0003E8, "Member 'ABP_VictoryDrone_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, SpawnOutAnimEndedDispatcher) == 0x0003F0, "Member 'ABP_VictoryDrone_C::SpawnOutAnimEndedDispatcher' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, AnimPlayRate) == 0x000400, "Member 'ABP_VictoryDrone_C::AnimPlayRate' has a wrong offset!");
static_assert(offsetof(ABP_VictoryDrone_C, StaticMeshMID) == 0x000408, "Member 'ABP_VictoryDrone_C::StaticMeshMID' has a wrong offset!");

}

