#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BuildingInfoIndicator

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BuildingInfoIndicator.BuildingInfoIndicator_C
// 0x01D0 (0x0440 - 0x0270)
class UBuildingInfoIndicator_C final : public UFortActorIndicatorWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(Transient, DuplicateTransient)
	class UHorizontalBox*                         _Horizontal_Box__BuildMinusEdit;                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         _Horizontal_Box__Edit;                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         _Horizontal_Box__Material;                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 _Image__Resource_Type_Icon;                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       _Keybind__BuildMinusEdit;                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       _Keybind__Confirm;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       _Keybind__Edit__standalone_;                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       _Keybind__Material;                                // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               _Size_Box__Confirm;                                // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               _Size_Box__Edit__standalone_;                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           _Vertical_Box__Build_Subset;                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBuildingBar_C*                         _Widget__Building_HP___Trap_Bars;                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_0;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_4;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBoxCycleTrap;                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBoxPlaceTrap;                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBoxUpgradeRepair;                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageResourceTypeIconwithRotate;                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindBuild;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindCycleTrapLeft;                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindEdit;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindPickTrapstandalone;                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindPlaceTrapLeft;                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindPlaceTrapstandalone;                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindReset;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindRotate;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindTrapLower;                                  // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindUpgradeRepair;                              // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxTrapstandalone;                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxTriOption;                                  // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  SwitcherInteractions;                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  SwitcherSideOption1;                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  SwitcherSideOption2;                               // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextInteractionCost;                               // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextInteractionCostwithRotate;                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextInteractionName;                               // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextPickTrap;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextPickTrapBottom;                                // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextPickTrapLabel;                                 // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           TrapOptions;                                       // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBoxBuildWithRotate;                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBoxLowerOption;                            // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBoxPlaceTrapstandalone;                    // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFortFocusedBuildingInfo               BuildingInfo;                                      // 0x03D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Current_Health;                                    // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           HealthFadeTimerHandle;                             // 0x0428(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         Current_Durability;                                // 0x0430(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   UpgradeRepairAction;                               // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BuildingInfoIndicator(int32 EntryPoint);
	void Construct();
	void UpdateBuildingInfo(struct FFortFocusedBuildingInfo& NewBuildingInfo);
	void HandleBuildingFocused(class ABuildingActor* FocusedBuilding);
	void HandleBuildingHealthChanged(float Health);
	void HandleTrapDurabilityChanged(float CurrentDurability, float MaxDurability);
	void Update_Keybinds();
	void HideHealth();
	void HandlePlayerTargetingChanged(bool bIsTargeting);
	void UpdateBuildingRepairCost(int32 NewInteractionCost);
	bool IsCurrentBuildingBeingRepaired();
	void UpdateBuildingInfo_InteractionWidgets(bool Interactable, bool CanBePlayerEdited, bool IsAnyTrapAttached, bool IsTrapAttachedFacingPlayer, bool IsPreviewTrapAttached, EFortBuildingInteraction InteractionType, int32 InteractionCost, EFortResourceType BuildingMaterial);
	void HandleAttachedTrapChanged(class ABuildingTrap* BuildingTrap);
	void HandleQuickbarFocusChanged(EFortQuickBars QuickBar, int32 QuickBarSlot);
	void RefreshBuildingInfo();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BuildingInfoIndicator_C">();
	}
	static class UBuildingInfoIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBuildingInfoIndicator_C>();
	}
};
static_assert(alignof(UBuildingInfoIndicator_C) == 0x000008, "Wrong alignment on UBuildingInfoIndicator_C");
static_assert(sizeof(UBuildingInfoIndicator_C) == 0x000440, "Wrong size on UBuildingInfoIndicator_C");
static_assert(offsetof(UBuildingInfoIndicator_C, UberGraphFrame) == 0x000270, "Member 'UBuildingInfoIndicator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, _Horizontal_Box__BuildMinusEdit) == 0x000278, "Member 'UBuildingInfoIndicator_C::_Horizontal_Box__BuildMinusEdit' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, _Horizontal_Box__Edit) == 0x000280, "Member 'UBuildingInfoIndicator_C::_Horizontal_Box__Edit' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, _Horizontal_Box__Material) == 0x000288, "Member 'UBuildingInfoIndicator_C::_Horizontal_Box__Material' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, _Image__Resource_Type_Icon) == 0x000290, "Member 'UBuildingInfoIndicator_C::_Image__Resource_Type_Icon' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, _Keybind__BuildMinusEdit) == 0x000298, "Member 'UBuildingInfoIndicator_C::_Keybind__BuildMinusEdit' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, _Keybind__Confirm) == 0x0002A0, "Member 'UBuildingInfoIndicator_C::_Keybind__Confirm' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, _Keybind__Edit__standalone_) == 0x0002A8, "Member 'UBuildingInfoIndicator_C::_Keybind__Edit__standalone_' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, _Keybind__Material) == 0x0002B0, "Member 'UBuildingInfoIndicator_C::_Keybind__Material' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, _Size_Box__Confirm) == 0x0002B8, "Member 'UBuildingInfoIndicator_C::_Size_Box__Confirm' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, _Size_Box__Edit__standalone_) == 0x0002C0, "Member 'UBuildingInfoIndicator_C::_Size_Box__Edit__standalone_' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, _Vertical_Box__Build_Subset) == 0x0002C8, "Member 'UBuildingInfoIndicator_C::_Vertical_Box__Build_Subset' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, _Widget__Building_HP___Trap_Bars) == 0x0002D0, "Member 'UBuildingInfoIndicator_C::_Widget__Building_HP___Trap_Bars' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, CommonTextBlock_0) == 0x0002D8, "Member 'UBuildingInfoIndicator_C::CommonTextBlock_0' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, HorizontalBox_4) == 0x0002E0, "Member 'UBuildingInfoIndicator_C::HorizontalBox_4' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, HorizontalBoxCycleTrap) == 0x0002E8, "Member 'UBuildingInfoIndicator_C::HorizontalBoxCycleTrap' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, HorizontalBoxPlaceTrap) == 0x0002F0, "Member 'UBuildingInfoIndicator_C::HorizontalBoxPlaceTrap' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, HorizontalBoxUpgradeRepair) == 0x0002F8, "Member 'UBuildingInfoIndicator_C::HorizontalBoxUpgradeRepair' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, ImageResourceTypeIconwithRotate) == 0x000300, "Member 'UBuildingInfoIndicator_C::ImageResourceTypeIconwithRotate' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, KeybindBuild) == 0x000308, "Member 'UBuildingInfoIndicator_C::KeybindBuild' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, KeybindCycleTrapLeft) == 0x000310, "Member 'UBuildingInfoIndicator_C::KeybindCycleTrapLeft' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, KeybindEdit) == 0x000318, "Member 'UBuildingInfoIndicator_C::KeybindEdit' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, KeybindPickTrapstandalone) == 0x000320, "Member 'UBuildingInfoIndicator_C::KeybindPickTrapstandalone' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, KeybindPlaceTrapLeft) == 0x000328, "Member 'UBuildingInfoIndicator_C::KeybindPlaceTrapLeft' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, KeybindPlaceTrapstandalone) == 0x000330, "Member 'UBuildingInfoIndicator_C::KeybindPlaceTrapstandalone' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, KeybindReset) == 0x000338, "Member 'UBuildingInfoIndicator_C::KeybindReset' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, KeybindRotate) == 0x000340, "Member 'UBuildingInfoIndicator_C::KeybindRotate' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, KeybindTrapLower) == 0x000348, "Member 'UBuildingInfoIndicator_C::KeybindTrapLower' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, KeybindUpgradeRepair) == 0x000350, "Member 'UBuildingInfoIndicator_C::KeybindUpgradeRepair' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, SizeBoxTrapstandalone) == 0x000358, "Member 'UBuildingInfoIndicator_C::SizeBoxTrapstandalone' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, SizeBoxTriOption) == 0x000360, "Member 'UBuildingInfoIndicator_C::SizeBoxTriOption' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, SwitcherInteractions) == 0x000368, "Member 'UBuildingInfoIndicator_C::SwitcherInteractions' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, SwitcherSideOption1) == 0x000370, "Member 'UBuildingInfoIndicator_C::SwitcherSideOption1' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, SwitcherSideOption2) == 0x000378, "Member 'UBuildingInfoIndicator_C::SwitcherSideOption2' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, TextInteractionCost) == 0x000380, "Member 'UBuildingInfoIndicator_C::TextInteractionCost' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, TextInteractionCostwithRotate) == 0x000388, "Member 'UBuildingInfoIndicator_C::TextInteractionCostwithRotate' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, TextInteractionName) == 0x000390, "Member 'UBuildingInfoIndicator_C::TextInteractionName' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, TextPickTrap) == 0x000398, "Member 'UBuildingInfoIndicator_C::TextPickTrap' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, TextPickTrapBottom) == 0x0003A0, "Member 'UBuildingInfoIndicator_C::TextPickTrapBottom' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, TextPickTrapLabel) == 0x0003A8, "Member 'UBuildingInfoIndicator_C::TextPickTrapLabel' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, TrapOptions) == 0x0003B0, "Member 'UBuildingInfoIndicator_C::TrapOptions' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, VerticalBoxBuildWithRotate) == 0x0003B8, "Member 'UBuildingInfoIndicator_C::VerticalBoxBuildWithRotate' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, VerticalBoxLowerOption) == 0x0003C0, "Member 'UBuildingInfoIndicator_C::VerticalBoxLowerOption' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, VerticalBoxPlaceTrapstandalone) == 0x0003C8, "Member 'UBuildingInfoIndicator_C::VerticalBoxPlaceTrapstandalone' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, BuildingInfo) == 0x0003D0, "Member 'UBuildingInfoIndicator_C::BuildingInfo' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, Current_Health) == 0x000420, "Member 'UBuildingInfoIndicator_C::Current_Health' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, HealthFadeTimerHandle) == 0x000428, "Member 'UBuildingInfoIndicator_C::HealthFadeTimerHandle' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, Current_Durability) == 0x000430, "Member 'UBuildingInfoIndicator_C::Current_Durability' has a wrong offset!");
static_assert(offsetof(UBuildingInfoIndicator_C, UpgradeRepairAction) == 0x000438, "Member 'UBuildingInfoIndicator_C::UpgradeRepairAction' has a wrong offset!");

}

