#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BuildWatermark

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BuildWatermark.BuildWatermark_C
// 0x0028 (0x0260 - 0x0238)
class UBuildWatermark_C final : public UFortHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UTextBlock*                             Text;                                              // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Watermark;                                         // 0x0248(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BuildWatermark(int32 EntryPoint);
	void Construct();
	void Update_Watermark();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BuildWatermark_C">();
	}
	static class UBuildWatermark_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBuildWatermark_C>();
	}
};
static_assert(alignof(UBuildWatermark_C) == 0x000008, "Wrong alignment on UBuildWatermark_C");
static_assert(sizeof(UBuildWatermark_C) == 0x000260, "Wrong size on UBuildWatermark_C");
static_assert(offsetof(UBuildWatermark_C, UberGraphFrame) == 0x000238, "Member 'UBuildWatermark_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBuildWatermark_C, Text) == 0x000240, "Member 'UBuildWatermark_C::Text' has a wrong offset!");
static_assert(offsetof(UBuildWatermark_C, Watermark) == 0x000248, "Member 'UBuildWatermark_C::Watermark' has a wrong offset!");

}

