#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CheckExpeditionRewardsAction

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "FrontEndRewards_Definition_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CheckExpeditionRewardsAction.CheckExpeditionRewardsAction_C.ExecuteUbergraph_CheckExpeditionRewardsAction
// 0x0068 (0x0068 - 0x0000)
struct CheckExpeditionRewardsAction_C_ExecuteUbergraph_CheckExpeditionRewardsAction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortScriptedActionParams              K2Node_Event_Params;                               // 0x0008(0x0030)(NoDestructor)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPendingLogout_ReturnValue;              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Is_FrontEndRewards_Running_bRunning;      // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0060(0x0008)(NoDestructor)
};
static_assert(alignof(CheckExpeditionRewardsAction_C_ExecuteUbergraph_CheckExpeditionRewardsAction) == 0x000008, "Wrong alignment on CheckExpeditionRewardsAction_C_ExecuteUbergraph_CheckExpeditionRewardsAction");
static_assert(sizeof(CheckExpeditionRewardsAction_C_ExecuteUbergraph_CheckExpeditionRewardsAction) == 0x000068, "Wrong size on CheckExpeditionRewardsAction_C_ExecuteUbergraph_CheckExpeditionRewardsAction");
static_assert(offsetof(CheckExpeditionRewardsAction_C_ExecuteUbergraph_CheckExpeditionRewardsAction, EntryPoint) == 0x000000, "Member 'CheckExpeditionRewardsAction_C_ExecuteUbergraph_CheckExpeditionRewardsAction::EntryPoint' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_ExecuteUbergraph_CheckExpeditionRewardsAction, K2Node_Event_Params) == 0x000008, "Member 'CheckExpeditionRewardsAction_C_ExecuteUbergraph_CheckExpeditionRewardsAction::K2Node_Event_Params' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_ExecuteUbergraph_CheckExpeditionRewardsAction, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000038, "Member 'CheckExpeditionRewardsAction_C_ExecuteUbergraph_CheckExpeditionRewardsAction::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_ExecuteUbergraph_CheckExpeditionRewardsAction, CallFunc_GetContext_ReturnValue) == 0x000040, "Member 'CheckExpeditionRewardsAction_C_ExecuteUbergraph_CheckExpeditionRewardsAction::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_ExecuteUbergraph_CheckExpeditionRewardsAction, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'CheckExpeditionRewardsAction_C_ExecuteUbergraph_CheckExpeditionRewardsAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_ExecuteUbergraph_CheckExpeditionRewardsAction, CallFunc_IsPendingLogout_ReturnValue) == 0x000049, "Member 'CheckExpeditionRewardsAction_C_ExecuteUbergraph_CheckExpeditionRewardsAction::CallFunc_IsPendingLogout_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_ExecuteUbergraph_CheckExpeditionRewardsAction, CallFunc_Not_PreBool_ReturnValue) == 0x00004A, "Member 'CheckExpeditionRewardsAction_C_ExecuteUbergraph_CheckExpeditionRewardsAction::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_ExecuteUbergraph_CheckExpeditionRewardsAction, CallFunc_Is_FrontEndRewards_Running_bRunning) == 0x00004B, "Member 'CheckExpeditionRewardsAction_C_ExecuteUbergraph_CheckExpeditionRewardsAction::CallFunc_Is_FrontEndRewards_Running_bRunning' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_ExecuteUbergraph_CheckExpeditionRewardsAction, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'CheckExpeditionRewardsAction_C_ExecuteUbergraph_CheckExpeditionRewardsAction::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_ExecuteUbergraph_CheckExpeditionRewardsAction, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000060, "Member 'CheckExpeditionRewardsAction_C_ExecuteUbergraph_CheckExpeditionRewardsAction::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function CheckExpeditionRewardsAction.CheckExpeditionRewardsAction_C.Execute
// 0x0030 (0x0030 - 0x0000)
struct CheckExpeditionRewardsAction_C_Execute final
{
public:
	struct FFortScriptedActionParams              Params_0;                                          // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(CheckExpeditionRewardsAction_C_Execute) == 0x000008, "Wrong alignment on CheckExpeditionRewardsAction_C_Execute");
static_assert(sizeof(CheckExpeditionRewardsAction_C_Execute) == 0x000030, "Wrong size on CheckExpeditionRewardsAction_C_Execute");
static_assert(offsetof(CheckExpeditionRewardsAction_C_Execute, Params_0) == 0x000000, "Member 'CheckExpeditionRewardsAction_C_Execute::Params_0' has a wrong offset!");

// Function CheckExpeditionRewardsAction.CheckExpeditionRewardsAction_C.CompleteRewardsAction
// 0x0010 (0x0010 - 0x0000)
struct CheckExpeditionRewardsAction_C_CompleteRewardsAction final
{
public:
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CheckExpeditionRewardsAction_C_CompleteRewardsAction) == 0x000008, "Wrong alignment on CheckExpeditionRewardsAction_C_CompleteRewardsAction");
static_assert(sizeof(CheckExpeditionRewardsAction_C_CompleteRewardsAction) == 0x000010, "Wrong size on CheckExpeditionRewardsAction_C_CompleteRewardsAction");
static_assert(offsetof(CheckExpeditionRewardsAction_C_CompleteRewardsAction, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'CheckExpeditionRewardsAction_C_CompleteRewardsAction::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_CompleteRewardsAction, CallFunc_GetQuestManager_ReturnValue) == 0x000008, "Member 'CheckExpeditionRewardsAction_C_CompleteRewardsAction::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");

// Function CheckExpeditionRewardsAction.CheckExpeditionRewardsAction_C.GetCompletedQuests
// 0x0030 (0x0030 - 0x0000)
struct CheckExpeditionRewardsAction_C_GetCompletedQuests final
{
public:
	TArray<class UFortQuestItem*>                 Completed_Quests;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortQuestItem*>                 CallFunc_GetCompletedQuests_OutCompletedQuests;    // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(CheckExpeditionRewardsAction_C_GetCompletedQuests) == 0x000008, "Wrong alignment on CheckExpeditionRewardsAction_C_GetCompletedQuests");
static_assert(sizeof(CheckExpeditionRewardsAction_C_GetCompletedQuests) == 0x000030, "Wrong size on CheckExpeditionRewardsAction_C_GetCompletedQuests");
static_assert(offsetof(CheckExpeditionRewardsAction_C_GetCompletedQuests, Completed_Quests) == 0x000000, "Member 'CheckExpeditionRewardsAction_C_GetCompletedQuests::Completed_Quests' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_GetCompletedQuests, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'CheckExpeditionRewardsAction_C_GetCompletedQuests::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_GetCompletedQuests, CallFunc_GetQuestManager_ReturnValue) == 0x000018, "Member 'CheckExpeditionRewardsAction_C_GetCompletedQuests::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_GetCompletedQuests, CallFunc_GetCompletedQuests_OutCompletedQuests) == 0x000020, "Member 'CheckExpeditionRewardsAction_C_GetCompletedQuests::CallFunc_GetCompletedQuests_OutCompletedQuests' has a wrong offset!");

// Function CheckExpeditionRewardsAction.CheckExpeditionRewardsAction_C.PopulateCompletedQuests
// 0x00A0 (0x00A0 - 0x0000)
struct CheckExpeditionRewardsAction_C_PopulateCompletedQuests final
{
public:
	TArray<class UFortQuestItem*>                 TempCompletedQuests;                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UFortQuestItem*>                 TempNewQuests;                                     // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortQuestItem*>                 CallFunc_GetCompletedQuests_Completed_Quests;      // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItem*                         CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFortItemInstanceQuantityPair>  CallFunc_GetPreviewRewards_ReturnValue;            // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_HasVisibleRewards_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortItemInstanceQuantityPair          CallFunc_Array_Get_Item2;                          // 0x0078(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItem*                         K2Node_DynamicCast_AsFort_Quest_Item;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisibleToUser_ReturnValue;              // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CheckExpeditionRewardsAction_C_PopulateCompletedQuests) == 0x000008, "Wrong alignment on CheckExpeditionRewardsAction_C_PopulateCompletedQuests");
static_assert(sizeof(CheckExpeditionRewardsAction_C_PopulateCompletedQuests) == 0x0000A0, "Wrong size on CheckExpeditionRewardsAction_C_PopulateCompletedQuests");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateCompletedQuests, TempCompletedQuests) == 0x000000, "Member 'CheckExpeditionRewardsAction_C_PopulateCompletedQuests::TempCompletedQuests' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateCompletedQuests, TempNewQuests) == 0x000010, "Member 'CheckExpeditionRewardsAction_C_PopulateCompletedQuests::TempNewQuests' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateCompletedQuests, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'CheckExpeditionRewardsAction_C_PopulateCompletedQuests::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateCompletedQuests, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'CheckExpeditionRewardsAction_C_PopulateCompletedQuests::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateCompletedQuests, Temp_int_Array_Index_Variable) == 0x000028, "Member 'CheckExpeditionRewardsAction_C_PopulateCompletedQuests::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateCompletedQuests, Temp_int_Loop_Counter_Variable2) == 0x00002C, "Member 'CheckExpeditionRewardsAction_C_PopulateCompletedQuests::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateCompletedQuests, Temp_int_Array_Index_Variable2) == 0x000030, "Member 'CheckExpeditionRewardsAction_C_PopulateCompletedQuests::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateCompletedQuests, CallFunc_Add_IntInt_ReturnValue2) == 0x000034, "Member 'CheckExpeditionRewardsAction_C_PopulateCompletedQuests::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateCompletedQuests, CallFunc_GetCompletedQuests_Completed_Quests) == 0x000038, "Member 'CheckExpeditionRewardsAction_C_PopulateCompletedQuests::CallFunc_GetCompletedQuests_Completed_Quests' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateCompletedQuests, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'CheckExpeditionRewardsAction_C_PopulateCompletedQuests::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateCompletedQuests, CallFunc_Array_Get_Item) == 0x000050, "Member 'CheckExpeditionRewardsAction_C_PopulateCompletedQuests::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateCompletedQuests, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'CheckExpeditionRewardsAction_C_PopulateCompletedQuests::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateCompletedQuests, CallFunc_Array_Add_ReturnValue) == 0x00005C, "Member 'CheckExpeditionRewardsAction_C_PopulateCompletedQuests::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateCompletedQuests, CallFunc_GetPreviewRewards_ReturnValue) == 0x000060, "Member 'CheckExpeditionRewardsAction_C_PopulateCompletedQuests::CallFunc_GetPreviewRewards_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateCompletedQuests, CallFunc_HasVisibleRewards_ReturnValue) == 0x000070, "Member 'CheckExpeditionRewardsAction_C_PopulateCompletedQuests::CallFunc_HasVisibleRewards_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateCompletedQuests, CallFunc_Array_Get_Item2) == 0x000078, "Member 'CheckExpeditionRewardsAction_C_PopulateCompletedQuests::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateCompletedQuests, CallFunc_Array_Length_ReturnValue2) == 0x000088, "Member 'CheckExpeditionRewardsAction_C_PopulateCompletedQuests::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateCompletedQuests, K2Node_DynamicCast_AsFort_Quest_Item) == 0x000090, "Member 'CheckExpeditionRewardsAction_C_PopulateCompletedQuests::K2Node_DynamicCast_AsFort_Quest_Item' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateCompletedQuests, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'CheckExpeditionRewardsAction_C_PopulateCompletedQuests::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateCompletedQuests, CallFunc_Less_IntInt_ReturnValue2) == 0x000099, "Member 'CheckExpeditionRewardsAction_C_PopulateCompletedQuests::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateCompletedQuests, CallFunc_IsVisibleToUser_ReturnValue) == 0x00009A, "Member 'CheckExpeditionRewardsAction_C_PopulateCompletedQuests::CallFunc_IsVisibleToUser_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateCompletedQuests, CallFunc_Array_Add_ReturnValue2) == 0x00009C, "Member 'CheckExpeditionRewardsAction_C_PopulateCompletedQuests::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");

// Function CheckExpeditionRewardsAction.CheckExpeditionRewardsAction_C.OpenFrontEndRewards
// 0x0060 (0x0060 - 0x0000)
struct CheckExpeditionRewardsAction_C_OpenFrontEndRewards final
{
public:
	class UFrontEndRewards_Widget_C*              RewardsWidget;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UFrontEndRewards_Widget_C* RewardsWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UFrontEndRewards_Widget_C* RewardsWidget)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetCachedWidget_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFrontEndRewards_Widget_C*              K2Node_DynamicCast_AsFront_End_Rewards_Widget;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CheckExpeditionRewardsAction_C_OpenFrontEndRewards) == 0x000008, "Wrong alignment on CheckExpeditionRewardsAction_C_OpenFrontEndRewards");
static_assert(sizeof(CheckExpeditionRewardsAction_C_OpenFrontEndRewards) == 0x000060, "Wrong size on CheckExpeditionRewardsAction_C_OpenFrontEndRewards");
static_assert(offsetof(CheckExpeditionRewardsAction_C_OpenFrontEndRewards, RewardsWidget) == 0x000000, "Member 'CheckExpeditionRewardsAction_C_OpenFrontEndRewards::RewardsWidget' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_OpenFrontEndRewards, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'CheckExpeditionRewardsAction_C_OpenFrontEndRewards::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_OpenFrontEndRewards, CallFunc_GetContext_ReturnValue2) == 0x000010, "Member 'CheckExpeditionRewardsAction_C_OpenFrontEndRewards::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_OpenFrontEndRewards, CallFunc_IsInZone_ReturnValue) == 0x000018, "Member 'CheckExpeditionRewardsAction_C_OpenFrontEndRewards::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_OpenFrontEndRewards, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'CheckExpeditionRewardsAction_C_OpenFrontEndRewards::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_OpenFrontEndRewards, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'CheckExpeditionRewardsAction_C_OpenFrontEndRewards::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_OpenFrontEndRewards, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000040, "Member 'CheckExpeditionRewardsAction_C_OpenFrontEndRewards::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_OpenFrontEndRewards, CallFunc_GetCachedWidget_ReturnValue) == 0x000048, "Member 'CheckExpeditionRewardsAction_C_OpenFrontEndRewards::CallFunc_GetCachedWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_OpenFrontEndRewards, K2Node_DynamicCast_AsFront_End_Rewards_Widget) == 0x000050, "Member 'CheckExpeditionRewardsAction_C_OpenFrontEndRewards::K2Node_DynamicCast_AsFront_End_Rewards_Widget' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_OpenFrontEndRewards, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'CheckExpeditionRewardsAction_C_OpenFrontEndRewards::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function CheckExpeditionRewardsAction.CheckExpeditionRewardsAction_C.PopulateExpeditionRewards
// 0x0088 (0x0088 - 0x0000)
struct CheckExpeditionRewardsAction_C_PopulateExpeditionRewards final
{
public:
	TArray<class UFortExpeditionItem*>            CompletedExpeditions;                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_Find_First_Valid_Player_Controller_FoundPC1; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_GetMcpRelativeUtcNow_ReturnValue;         // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortAccountItem*>               CallFunc_GetAccountItemsByType_Items;              // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	class UFortAccountItem*                       CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortExpeditionItem*                    K2Node_DynamicCast_AsFort_Expedition_Item;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue2;             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExpeditionCompleted_ReturnValue;        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CheckExpeditionRewardsAction_C_PopulateExpeditionRewards) == 0x000008, "Wrong alignment on CheckExpeditionRewardsAction_C_PopulateExpeditionRewards");
static_assert(sizeof(CheckExpeditionRewardsAction_C_PopulateExpeditionRewards) == 0x000088, "Wrong size on CheckExpeditionRewardsAction_C_PopulateExpeditionRewards");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateExpeditionRewards, CompletedExpeditions) == 0x000000, "Member 'CheckExpeditionRewardsAction_C_PopulateExpeditionRewards::CompletedExpeditions' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateExpeditionRewards, Temp_int_Array_Index_Variable) == 0x000010, "Member 'CheckExpeditionRewardsAction_C_PopulateExpeditionRewards::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateExpeditionRewards, CallFunc_Find_First_Valid_Player_Controller_FoundPC1) == 0x000018, "Member 'CheckExpeditionRewardsAction_C_PopulateExpeditionRewards::CallFunc_Find_First_Valid_Player_Controller_FoundPC1' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateExpeditionRewards, CallFunc_GetMcpRelativeUtcNow_ReturnValue) == 0x000020, "Member 'CheckExpeditionRewardsAction_C_PopulateExpeditionRewards::CallFunc_GetMcpRelativeUtcNow_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateExpeditionRewards, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'CheckExpeditionRewardsAction_C_PopulateExpeditionRewards::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateExpeditionRewards, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'CheckExpeditionRewardsAction_C_PopulateExpeditionRewards::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateExpeditionRewards, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'CheckExpeditionRewardsAction_C_PopulateExpeditionRewards::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateExpeditionRewards, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'CheckExpeditionRewardsAction_C_PopulateExpeditionRewards::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateExpeditionRewards, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000038, "Member 'CheckExpeditionRewardsAction_C_PopulateExpeditionRewards::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateExpeditionRewards, CallFunc_GetContext_ReturnValue) == 0x000040, "Member 'CheckExpeditionRewardsAction_C_PopulateExpeditionRewards::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateExpeditionRewards, CallFunc_GetAccountItemsByType_Items) == 0x000048, "Member 'CheckExpeditionRewardsAction_C_PopulateExpeditionRewards::CallFunc_GetAccountItemsByType_Items' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateExpeditionRewards, CallFunc_Array_Get_Item) == 0x000058, "Member 'CheckExpeditionRewardsAction_C_PopulateExpeditionRewards::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateExpeditionRewards, CallFunc_Array_Length_ReturnValue2) == 0x000060, "Member 'CheckExpeditionRewardsAction_C_PopulateExpeditionRewards::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateExpeditionRewards, K2Node_DynamicCast_AsFort_Expedition_Item) == 0x000068, "Member 'CheckExpeditionRewardsAction_C_PopulateExpeditionRewards::K2Node_DynamicCast_AsFort_Expedition_Item' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateExpeditionRewards, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'CheckExpeditionRewardsAction_C_PopulateExpeditionRewards::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateExpeditionRewards, CallFunc_Subtract_IntInt_ReturnValue2) == 0x000074, "Member 'CheckExpeditionRewardsAction_C_PopulateExpeditionRewards::CallFunc_Subtract_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateExpeditionRewards, CallFunc_Array_Add_ReturnValue) == 0x000078, "Member 'CheckExpeditionRewardsAction_C_PopulateExpeditionRewards::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateExpeditionRewards, CallFunc_Max_ReturnValue) == 0x00007C, "Member 'CheckExpeditionRewardsAction_C_PopulateExpeditionRewards::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_PopulateExpeditionRewards, CallFunc_IsExpeditionCompleted_ReturnValue) == 0x000080, "Member 'CheckExpeditionRewardsAction_C_PopulateExpeditionRewards::CallFunc_IsExpeditionCompleted_ReturnValue' has a wrong offset!");

// Function CheckExpeditionRewardsAction.CheckExpeditionRewardsAction_C.HandleRewardsClaimed
// 0x0010 (0x0010 - 0x0000)
struct CheckExpeditionRewardsAction_C_HandleRewardsClaimed final
{
public:
	class UFrontEndRewards_Widget_C*              RewardsWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CheckExpeditionRewardsAction_C_HandleRewardsClaimed) == 0x000008, "Wrong alignment on CheckExpeditionRewardsAction_C_HandleRewardsClaimed");
static_assert(sizeof(CheckExpeditionRewardsAction_C_HandleRewardsClaimed) == 0x000010, "Wrong size on CheckExpeditionRewardsAction_C_HandleRewardsClaimed");
static_assert(offsetof(CheckExpeditionRewardsAction_C_HandleRewardsClaimed, RewardsWidget) == 0x000000, "Member 'CheckExpeditionRewardsAction_C_HandleRewardsClaimed::RewardsWidget' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_HandleRewardsClaimed, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000008, "Member 'CheckExpeditionRewardsAction_C_HandleRewardsClaimed::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function CheckExpeditionRewardsAction.CheckExpeditionRewardsAction_C.Clear
// 0x0088 (0x0088 - 0x0000)
struct CheckExpeditionRewardsAction_C_Clear final
{
public:
	TArray<struct FFortCollectionBookRewards>     K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UFortExpeditionItem*>            K2Node_MakeArray_Array2;                           // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UFortQuestItem*>                 K2Node_MakeArray_Array3;                           // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UFortQuestItem*>                 K2Node_MakeArray_Array4;                           // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	struct FFrontEndRewards_Definition            K2Node_MakeStruct_FrontEndRewards_Definition;      // 0x0040(0x0048)(HasGetValueTypeHash)
};
static_assert(alignof(CheckExpeditionRewardsAction_C_Clear) == 0x000008, "Wrong alignment on CheckExpeditionRewardsAction_C_Clear");
static_assert(sizeof(CheckExpeditionRewardsAction_C_Clear) == 0x000088, "Wrong size on CheckExpeditionRewardsAction_C_Clear");
static_assert(offsetof(CheckExpeditionRewardsAction_C_Clear, K2Node_MakeArray_Array) == 0x000000, "Member 'CheckExpeditionRewardsAction_C_Clear::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_Clear, K2Node_MakeArray_Array2) == 0x000010, "Member 'CheckExpeditionRewardsAction_C_Clear::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_Clear, K2Node_MakeArray_Array3) == 0x000020, "Member 'CheckExpeditionRewardsAction_C_Clear::K2Node_MakeArray_Array3' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_Clear, K2Node_MakeArray_Array4) == 0x000030, "Member 'CheckExpeditionRewardsAction_C_Clear::K2Node_MakeArray_Array4' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_Clear, K2Node_MakeStruct_FrontEndRewards_Definition) == 0x000040, "Member 'CheckExpeditionRewardsAction_C_Clear::K2Node_MakeStruct_FrontEndRewards_Definition' has a wrong offset!");

// Function CheckExpeditionRewardsAction.CheckExpeditionRewardsAction_C.HandleRewardsClaimError
// 0x0008 (0x0008 - 0x0000)
struct CheckExpeditionRewardsAction_C_HandleRewardsClaimError final
{
public:
	class UFrontEndRewards_Widget_C*              RewardsWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CheckExpeditionRewardsAction_C_HandleRewardsClaimError) == 0x000008, "Wrong alignment on CheckExpeditionRewardsAction_C_HandleRewardsClaimError");
static_assert(sizeof(CheckExpeditionRewardsAction_C_HandleRewardsClaimError) == 0x000008, "Wrong size on CheckExpeditionRewardsAction_C_HandleRewardsClaimError");
static_assert(offsetof(CheckExpeditionRewardsAction_C_HandleRewardsClaimError, RewardsWidget) == 0x000000, "Member 'CheckExpeditionRewardsAction_C_HandleRewardsClaimError::RewardsWidget' has a wrong offset!");

// Function CheckExpeditionRewardsAction.CheckExpeditionRewardsAction_C.Is FrontEndRewards Running
// 0x0028 (0x0028 - 0x0000)
struct CheckExpeditionRewardsAction_C_Is_FrontEndRewards_Running final
{
public:
	bool                                          bRunning;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetCachedWidget_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFrontEndRewards_Widget_C*              K2Node_DynamicCast_AsFront_End_Rewards_Widget;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CheckExpeditionRewardsAction_C_Is_FrontEndRewards_Running) == 0x000008, "Wrong alignment on CheckExpeditionRewardsAction_C_Is_FrontEndRewards_Running");
static_assert(sizeof(CheckExpeditionRewardsAction_C_Is_FrontEndRewards_Running) == 0x000028, "Wrong size on CheckExpeditionRewardsAction_C_Is_FrontEndRewards_Running");
static_assert(offsetof(CheckExpeditionRewardsAction_C_Is_FrontEndRewards_Running, bRunning) == 0x000000, "Member 'CheckExpeditionRewardsAction_C_Is_FrontEndRewards_Running::bRunning' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_Is_FrontEndRewards_Running, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000008, "Member 'CheckExpeditionRewardsAction_C_Is_FrontEndRewards_Running::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_Is_FrontEndRewards_Running, CallFunc_GetCachedWidget_ReturnValue) == 0x000010, "Member 'CheckExpeditionRewardsAction_C_Is_FrontEndRewards_Running::CallFunc_GetCachedWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_Is_FrontEndRewards_Running, K2Node_DynamicCast_AsFront_End_Rewards_Widget) == 0x000018, "Member 'CheckExpeditionRewardsAction_C_Is_FrontEndRewards_Running::K2Node_DynamicCast_AsFront_End_Rewards_Widget' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_Is_FrontEndRewards_Running, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'CheckExpeditionRewardsAction_C_Is_FrontEndRewards_Running::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function CheckExpeditionRewardsAction.CheckExpeditionRewardsAction_C.Find First Valid Player Controller
// 0x0050 (0x0050 - 0x0000)
struct CheckExpeditionRewardsAction_C_Find_First_Valid_Player_Controller final
{
public:
	class AFortPlayerController*                  FoundPC1;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  FoundPC;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CheckExpeditionRewardsAction_C_Find_First_Valid_Player_Controller) == 0x000008, "Wrong alignment on CheckExpeditionRewardsAction_C_Find_First_Valid_Player_Controller");
static_assert(sizeof(CheckExpeditionRewardsAction_C_Find_First_Valid_Player_Controller) == 0x000050, "Wrong size on CheckExpeditionRewardsAction_C_Find_First_Valid_Player_Controller");
static_assert(offsetof(CheckExpeditionRewardsAction_C_Find_First_Valid_Player_Controller, FoundPC1) == 0x000000, "Member 'CheckExpeditionRewardsAction_C_Find_First_Valid_Player_Controller::FoundPC1' has a wrong offset!");
static_assert(offsetof(CheckExpeditionRewardsAction_C_Find_First_Valid_Player_Controller, FoundPC) == 0x000008, "Member 'CheckExpeditionRewardsAction_C_Find_First_Valid_Player_Controller::FoundPC' has a wrong offset!");
