#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CollectionBookPageCompletionRewardWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CollectionBookPageCompletionRewardWidget.CollectionBookPageCompletionRewardWidget_C
// 0x0020 (0x0248 - 0x0228)
class UCollectionBookPageCompletionRewardWidget_C final : public UFortCollectionBookPageCompletionRewardWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 ArrowImage;                                        // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CheckImage;                                        // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  RewardStatusSwitcher;                              // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CollectionBookPageCompletionRewardWidget(int32 EntryPoint);
	void OnRewardStatusChanged(ECollectionBookRewardStatus NewStatus);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CollectionBookPageCompletionRewardWidget_C">();
	}
	static class UCollectionBookPageCompletionRewardWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollectionBookPageCompletionRewardWidget_C>();
	}
};
static_assert(alignof(UCollectionBookPageCompletionRewardWidget_C) == 0x000008, "Wrong alignment on UCollectionBookPageCompletionRewardWidget_C");
static_assert(sizeof(UCollectionBookPageCompletionRewardWidget_C) == 0x000248, "Wrong size on UCollectionBookPageCompletionRewardWidget_C");
static_assert(offsetof(UCollectionBookPageCompletionRewardWidget_C, UberGraphFrame) == 0x000228, "Member 'UCollectionBookPageCompletionRewardWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCollectionBookPageCompletionRewardWidget_C, ArrowImage) == 0x000230, "Member 'UCollectionBookPageCompletionRewardWidget_C::ArrowImage' has a wrong offset!");
static_assert(offsetof(UCollectionBookPageCompletionRewardWidget_C, CheckImage) == 0x000238, "Member 'UCollectionBookPageCompletionRewardWidget_C::CheckImage' has a wrong offset!");
static_assert(offsetof(UCollectionBookPageCompletionRewardWidget_C, RewardStatusSwitcher) == 0x000240, "Member 'UCollectionBookPageCompletionRewardWidget_C::RewardStatusSwitcher' has a wrong offset!");

}

