#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CollectionBookItemPicker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CollectionBookItemPicker.CollectionBookItemPicker_C
// 0x0060 (0x02F8 - 0x0298)
class UCollectionBookItemPicker_C final : public UFortCollectionBookPicker
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(Transient, DuplicateTransient)
	struct FDataTableRowHandle                    BackInputActionName;                               // 0x02A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class FText                                   ConfirmSlotItemTitle;                              // 0x02B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   ConfirmSlotItemMessage;                            // 0x02C8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDataTableRowHandle                    ConfirmInputActionName;                            // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UCollectionBookRecycleSlotResultsWidget_C* RecycleSlotItemWidget;                             // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CollectionBookItemPicker(int32 EntryPoint);
	void ShowSlotItemConfirmation(class UFortItem* SelectedItem);
	void Construct();
	void DialogResult_C897FB8741239C9DAE2430AD3D91A030(EFortDialogResult Result, class FName ResultName, bool bWaitingForLatentActionCompletion, const struct FFortDialogExternalLatentActionHandle& WaitingDialogHandle);
	void HandleItemSelected(class UObject* ItemSelected, bool IsSelected);
	void HandleCommitAction(bool* Passthrough);
	void Get_Type_Text(class UFortItem* Item, class FText* Type);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CollectionBookItemPicker_C">();
	}
	static class UCollectionBookItemPicker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollectionBookItemPicker_C>();
	}
};
static_assert(alignof(UCollectionBookItemPicker_C) == 0x000008, "Wrong alignment on UCollectionBookItemPicker_C");
static_assert(sizeof(UCollectionBookItemPicker_C) == 0x0002F8, "Wrong size on UCollectionBookItemPicker_C");
static_assert(offsetof(UCollectionBookItemPicker_C, UberGraphFrame) == 0x000298, "Member 'UCollectionBookItemPicker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCollectionBookItemPicker_C, BackInputActionName) == 0x0002A0, "Member 'UCollectionBookItemPicker_C::BackInputActionName' has a wrong offset!");
static_assert(offsetof(UCollectionBookItemPicker_C, ConfirmSlotItemTitle) == 0x0002B0, "Member 'UCollectionBookItemPicker_C::ConfirmSlotItemTitle' has a wrong offset!");
static_assert(offsetof(UCollectionBookItemPicker_C, ConfirmSlotItemMessage) == 0x0002C8, "Member 'UCollectionBookItemPicker_C::ConfirmSlotItemMessage' has a wrong offset!");
static_assert(offsetof(UCollectionBookItemPicker_C, ConfirmInputActionName) == 0x0002E0, "Member 'UCollectionBookItemPicker_C::ConfirmInputActionName' has a wrong offset!");
static_assert(offsetof(UCollectionBookItemPicker_C, RecycleSlotItemWidget) == 0x0002F0, "Member 'UCollectionBookItemPicker_C::RecycleSlotItemWidget' has a wrong offset!");

}

