#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CollectionBookPageDetailsWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function CollectionBookPageDetailsWidget.CollectionBookPageDetailsWidget_C.ExecuteUbergraph_CollectionBookPageDetailsWidget
// 0x0014 (0x0014 - 0x0000)
struct CollectionBookPageDetailsWidget_C_ExecuteUbergraph_CollectionBookPageDetailsWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_TotalFilledSlots;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_TotalSlots;                           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCollectionBookState                      K2Node_Event_State;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CollectionBookPageDetailsWidget_C_ExecuteUbergraph_CollectionBookPageDetailsWidget) == 0x000004, "Wrong alignment on CollectionBookPageDetailsWidget_C_ExecuteUbergraph_CollectionBookPageDetailsWidget");
static_assert(sizeof(CollectionBookPageDetailsWidget_C_ExecuteUbergraph_CollectionBookPageDetailsWidget) == 0x000014, "Wrong size on CollectionBookPageDetailsWidget_C_ExecuteUbergraph_CollectionBookPageDetailsWidget");
static_assert(offsetof(CollectionBookPageDetailsWidget_C_ExecuteUbergraph_CollectionBookPageDetailsWidget, EntryPoint) == 0x000000, "Member 'CollectionBookPageDetailsWidget_C_ExecuteUbergraph_CollectionBookPageDetailsWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(CollectionBookPageDetailsWidget_C_ExecuteUbergraph_CollectionBookPageDetailsWidget, Temp_byte_Variable) == 0x000004, "Member 'CollectionBookPageDetailsWidget_C_ExecuteUbergraph_CollectionBookPageDetailsWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CollectionBookPageDetailsWidget_C_ExecuteUbergraph_CollectionBookPageDetailsWidget, Temp_byte_Variable2) == 0x000005, "Member 'CollectionBookPageDetailsWidget_C_ExecuteUbergraph_CollectionBookPageDetailsWidget::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(CollectionBookPageDetailsWidget_C_ExecuteUbergraph_CollectionBookPageDetailsWidget, K2Node_Event_TotalFilledSlots) == 0x000008, "Member 'CollectionBookPageDetailsWidget_C_ExecuteUbergraph_CollectionBookPageDetailsWidget::K2Node_Event_TotalFilledSlots' has a wrong offset!");
static_assert(offsetof(CollectionBookPageDetailsWidget_C_ExecuteUbergraph_CollectionBookPageDetailsWidget, K2Node_Event_TotalSlots) == 0x00000C, "Member 'CollectionBookPageDetailsWidget_C_ExecuteUbergraph_CollectionBookPageDetailsWidget::K2Node_Event_TotalSlots' has a wrong offset!");
static_assert(offsetof(CollectionBookPageDetailsWidget_C_ExecuteUbergraph_CollectionBookPageDetailsWidget, K2Node_Event_State) == 0x000010, "Member 'CollectionBookPageDetailsWidget_C_ExecuteUbergraph_CollectionBookPageDetailsWidget::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(CollectionBookPageDetailsWidget_C_ExecuteUbergraph_CollectionBookPageDetailsWidget, Temp_bool_Variable) == 0x000011, "Member 'CollectionBookPageDetailsWidget_C_ExecuteUbergraph_CollectionBookPageDetailsWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CollectionBookPageDetailsWidget_C_ExecuteUbergraph_CollectionBookPageDetailsWidget, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000012, "Member 'CollectionBookPageDetailsWidget_C_ExecuteUbergraph_CollectionBookPageDetailsWidget::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CollectionBookPageDetailsWidget_C_ExecuteUbergraph_CollectionBookPageDetailsWidget, K2Node_Select_Default) == 0x000013, "Member 'CollectionBookPageDetailsWidget_C_ExecuteUbergraph_CollectionBookPageDetailsWidget::K2Node_Select_Default' has a wrong offset!");

// Function CollectionBookPageDetailsWidget.CollectionBookPageDetailsWidget_C.OnPageProgressionUpdated
// 0x000C (0x000C - 0x0000)
struct CollectionBookPageDetailsWidget_C_OnPageProgressionUpdated final
{
public:
	int32                                         TotalFilledSlots;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalSlots;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCollectionBookState                      State;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CollectionBookPageDetailsWidget_C_OnPageProgressionUpdated) == 0x000004, "Wrong alignment on CollectionBookPageDetailsWidget_C_OnPageProgressionUpdated");
static_assert(sizeof(CollectionBookPageDetailsWidget_C_OnPageProgressionUpdated) == 0x00000C, "Wrong size on CollectionBookPageDetailsWidget_C_OnPageProgressionUpdated");
static_assert(offsetof(CollectionBookPageDetailsWidget_C_OnPageProgressionUpdated, TotalFilledSlots) == 0x000000, "Member 'CollectionBookPageDetailsWidget_C_OnPageProgressionUpdated::TotalFilledSlots' has a wrong offset!");
static_assert(offsetof(CollectionBookPageDetailsWidget_C_OnPageProgressionUpdated, TotalSlots) == 0x000004, "Member 'CollectionBookPageDetailsWidget_C_OnPageProgressionUpdated::TotalSlots' has a wrong offset!");
static_assert(offsetof(CollectionBookPageDetailsWidget_C_OnPageProgressionUpdated, State) == 0x000008, "Member 'CollectionBookPageDetailsWidget_C_OnPageProgressionUpdated::State' has a wrong offset!");

}

