#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CollectionBookPageCompletionRewardWidget

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function CollectionBookPageCompletionRewardWidget.CollectionBookPageCompletionRewardWidget_C.ExecuteUbergraph_CollectionBookPageCompletionRewardWidget
// 0x0010 (0x0010 - 0x0000)
struct CollectionBookPageCompletionRewardWidget_C_ExecuteUbergraph_CollectionBookPageCompletionRewardWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollectionBookRewardStatus                   Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollectionBookRewardStatus                   K2Node_Event_NewStatus;                            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CollectionBookPageCompletionRewardWidget_C_ExecuteUbergraph_CollectionBookPageCompletionRewardWidget) == 0x000008, "Wrong alignment on CollectionBookPageCompletionRewardWidget_C_ExecuteUbergraph_CollectionBookPageCompletionRewardWidget");
static_assert(sizeof(CollectionBookPageCompletionRewardWidget_C_ExecuteUbergraph_CollectionBookPageCompletionRewardWidget) == 0x000010, "Wrong size on CollectionBookPageCompletionRewardWidget_C_ExecuteUbergraph_CollectionBookPageCompletionRewardWidget");
static_assert(offsetof(CollectionBookPageCompletionRewardWidget_C_ExecuteUbergraph_CollectionBookPageCompletionRewardWidget, EntryPoint) == 0x000000, "Member 'CollectionBookPageCompletionRewardWidget_C_ExecuteUbergraph_CollectionBookPageCompletionRewardWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(CollectionBookPageCompletionRewardWidget_C_ExecuteUbergraph_CollectionBookPageCompletionRewardWidget, Temp_byte_Variable) == 0x000004, "Member 'CollectionBookPageCompletionRewardWidget_C_ExecuteUbergraph_CollectionBookPageCompletionRewardWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CollectionBookPageCompletionRewardWidget_C_ExecuteUbergraph_CollectionBookPageCompletionRewardWidget, K2Node_Event_NewStatus) == 0x000005, "Member 'CollectionBookPageCompletionRewardWidget_C_ExecuteUbergraph_CollectionBookPageCompletionRewardWidget::K2Node_Event_NewStatus' has a wrong offset!");
static_assert(offsetof(CollectionBookPageCompletionRewardWidget_C_ExecuteUbergraph_CollectionBookPageCompletionRewardWidget, K2Node_Select_Default) == 0x000008, "Member 'CollectionBookPageCompletionRewardWidget_C_ExecuteUbergraph_CollectionBookPageCompletionRewardWidget::K2Node_Select_Default' has a wrong offset!");

// Function CollectionBookPageCompletionRewardWidget.CollectionBookPageCompletionRewardWidget_C.OnRewardStatusChanged
// 0x0001 (0x0001 - 0x0000)
struct CollectionBookPageCompletionRewardWidget_C_OnRewardStatusChanged final
{
public:
	ECollectionBookRewardStatus                   NewStatus;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CollectionBookPageCompletionRewardWidget_C_OnRewardStatusChanged) == 0x000001, "Wrong alignment on CollectionBookPageCompletionRewardWidget_C_OnRewardStatusChanged");
static_assert(sizeof(CollectionBookPageCompletionRewardWidget_C_OnRewardStatusChanged) == 0x000001, "Wrong size on CollectionBookPageCompletionRewardWidget_C_OnRewardStatusChanged");
static_assert(offsetof(CollectionBookPageCompletionRewardWidget_C_OnRewardStatusChanged, NewStatus) == 0x000000, "Member 'CollectionBookPageCompletionRewardWidget_C_OnRewardStatusChanged::NewStatus' has a wrong offset!");

}

