#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DailyRewardsItem

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DailyRewardsItem.DailyRewardsItem_C.ExecuteUbergraph_DailyRewardsItem
// 0x0178 (0x0178 - 0x0000)
struct DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable2;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0014(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable2;                             // 0x001C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable3;                             // 0x0028(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable4;                             // 0x0038(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable5;                               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable5;                             // 0x004C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable6;                             // 0x005C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable6;                               // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select2_Default;                            // 0x0070(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0078(0x0040)(HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select3_Default;                            // 0x00B8(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00D8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F0(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select4_Default;                            // 0x0110(0x0018)()
	struct FLinearColor                           Temp_struct_Variable7;                             // 0x0128(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable8;                             // 0x0138(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable7;                               // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x014B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select5_Default;                            // 0x0150(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select6_Default;                            // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select7_Default;                            // 0x0164(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable8;                               // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select8_Default;                            // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem) == 0x000008, "Wrong alignment on DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem");
static_assert(sizeof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem) == 0x000178, "Wrong size on DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, EntryPoint) == 0x000000, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, Temp_bool_Variable) == 0x000004, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, Temp_byte_Variable) == 0x000005, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, Temp_byte_Variable2) == 0x000006, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, Temp_bool_Variable2) == 0x000007, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, Temp_float_Variable) == 0x000008, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, Temp_float_Variable2) == 0x00000C, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, Temp_bool_Variable3) == 0x000010, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, Temp_struct_Variable) == 0x000014, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, Temp_struct_Variable2) == 0x00001C, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, Temp_bool_Variable4) == 0x000024, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, Temp_struct_Variable3) == 0x000028, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, Temp_struct_Variable4) == 0x000038, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::Temp_struct_Variable4' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, Temp_bool_Variable5) == 0x000048, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, Temp_struct_Variable5) == 0x00004C, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::Temp_struct_Variable5' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, Temp_struct_Variable6) == 0x00005C, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::Temp_struct_Variable6' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, Temp_bool_Variable6) == 0x00006C, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, K2Node_Select_Default) == 0x00006D, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, K2Node_Select2_Default) == 0x000070, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, K2Node_MakeStruct_FormatArgumentData) == 0x000078, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, K2Node_Select3_Default) == 0x0000B8, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, K2Node_MakeArray_Array) == 0x0000C8, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, CallFunc_Conv_IntToText_ReturnValue) == 0x0000D8, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, CallFunc_Format_ReturnValue) == 0x0000F0, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, CallFunc_Greater_IntInt_ReturnValue) == 0x000108, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, K2Node_Select4_Default) == 0x000110, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, Temp_struct_Variable7) == 0x000128, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::Temp_struct_Variable7' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, Temp_struct_Variable8) == 0x000138, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::Temp_struct_Variable8' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, Temp_bool_Variable7) == 0x000148, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::Temp_bool_Variable7' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, Temp_byte_Variable3) == 0x000149, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, CallFunc_BooleanAND_ReturnValue) == 0x00014A, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, CallFunc_BooleanOR_ReturnValue) == 0x00014B, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, Temp_byte_Variable4) == 0x00014C, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, K2Node_Select5_Default) == 0x000150, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::K2Node_Select5_Default' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, K2Node_Select6_Default) == 0x000160, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::K2Node_Select6_Default' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, K2Node_Select7_Default) == 0x000164, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::K2Node_Select7_Default' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, Temp_bool_Variable8) == 0x000174, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::Temp_bool_Variable8' has a wrong offset!");
static_assert(offsetof(DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem, K2Node_Select8_Default) == 0x000175, "Member 'DailyRewardsItem_C_ExecuteUbergraph_DailyRewardsItem::K2Node_Select8_Default' has a wrong offset!");

}

