#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DailyRewardsMissingFoundersPack

#include "Basic.hpp"


namespace SDK::Params
{

// Function DailyRewardsMissingFoundersPack.DailyRewardsMissingFoundersPack_C.ExecuteUbergraph_DailyRewardsMissingFoundersPack
// 0x0078 (0x0078 - 0x0000)
struct DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0020(0x0018)()
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItem*                       CallFunc_GetAccountItemWithDefinition_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0050(0x0018)()
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanUpgradeFoundersPack_CanUpgrade;        // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack) == 0x000008, "Wrong alignment on DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack");
static_assert(sizeof(DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack) == 0x000078, "Wrong size on DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack");
static_assert(offsetof(DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack, EntryPoint) == 0x000000, "Member 'DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack::EntryPoint' has a wrong offset!");
static_assert(offsetof(DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack, Temp_bool_Variable) == 0x000004, "Member 'DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack, Temp_text_Variable) == 0x000008, "Member 'DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack, Temp_text_Variable2) == 0x000020, "Member 'DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack, CallFunc_GetContext_ReturnValue) == 0x000038, "Member 'DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack, CallFunc_GetAccountItemWithDefinition_ReturnValue) == 0x000040, "Member 'DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack::CallFunc_GetAccountItemWithDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack, CallFunc_Not_PreBool_ReturnValue) == 0x000049, "Member 'DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack, K2Node_Select_Default) == 0x000050, "Member 'DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack, CallFunc_CreateTemporaryItemInstanceBP_ReturnValue) == 0x000068, "Member 'DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack::CallFunc_CreateTemporaryItemInstanceBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack, CallFunc_CanUpgradeFoundersPack_CanUpgrade) == 0x000070, "Member 'DailyRewardsMissingFoundersPack_C_ExecuteUbergraph_DailyRewardsMissingFoundersPack::CallFunc_CanUpgradeFoundersPack_CanUpgrade' has a wrong offset!");

// Function DailyRewardsMissingFoundersPack.DailyRewardsMissingFoundersPack_C.CanUpgradeFoundersPack
// 0x0020 (0x0020 - 0x0000)
struct DailyRewardsMissingFoundersPack_C_CanUpgradeFoundersPack final
{
public:
	bool                                          CanUpgrade;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItem*                       CallFunc_GetAccountItemWithDefinition_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DailyRewardsMissingFoundersPack_C_CanUpgradeFoundersPack) == 0x000008, "Wrong alignment on DailyRewardsMissingFoundersPack_C_CanUpgradeFoundersPack");
static_assert(sizeof(DailyRewardsMissingFoundersPack_C_CanUpgradeFoundersPack) == 0x000020, "Wrong size on DailyRewardsMissingFoundersPack_C_CanUpgradeFoundersPack");
static_assert(offsetof(DailyRewardsMissingFoundersPack_C_CanUpgradeFoundersPack, CanUpgrade) == 0x000000, "Member 'DailyRewardsMissingFoundersPack_C_CanUpgradeFoundersPack::CanUpgrade' has a wrong offset!");
static_assert(offsetof(DailyRewardsMissingFoundersPack_C_CanUpgradeFoundersPack, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'DailyRewardsMissingFoundersPack_C_CanUpgradeFoundersPack::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsMissingFoundersPack_C_CanUpgradeFoundersPack, CallFunc_GetAccountItemWithDefinition_ReturnValue) == 0x000010, "Member 'DailyRewardsMissingFoundersPack_C_CanUpgradeFoundersPack::CallFunc_GetAccountItemWithDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsMissingFoundersPack_C_CanUpgradeFoundersPack, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'DailyRewardsMissingFoundersPack_C_CanUpgradeFoundersPack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyRewardsMissingFoundersPack_C_CanUpgradeFoundersPack, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'DailyRewardsMissingFoundersPack_C_CanUpgradeFoundersPack::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

