#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DailyQuestsPanel

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DailyQuestsPanel.DailyQuestsPanel_C
// 0x0068 (0x02B0 - 0x0248)
class UDailyQuestsPanel_C final : public UFortAccountWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(Transient, DuplicateTransient)
	class UCommonBorder*                          BattlePassBorder;                                  // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        BattlePassDailiySwitcher;                          // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BattlePassImage;                                   // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           BattlePassList;                                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ClaimButton;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           DailyQuestList;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           EventQuestList;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          EventQuestsLabel;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ClaimingQuestsInProgress;                          // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EFortQuestType                                QuestTypeToClaim;                                  // 0x0291(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    InspectActionButton;                               // 0x0298(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UAthenaLobby_C*                         ParentPanel;                                       // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DailyQuestsPanel(int32 EntryPoint);
	void OnAccountInfoChanged(const struct FFortPublicAccountInfo& Result);
	void BndEvt__IconTextButton_K2Node_ComponentBoundEvent_66_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void BindEventListeners();
	void OnQuestsUpdated();
	void CreateQuestWidget(class UFortQuestItem* Quest, class UVerticalBox* QuestList, bool* QuestCompleted);
	void OnQuestsGranted(TArray<class UFortQuestItem*>& NewQuests);
	void OnQuestRewardClaimed(class UFortQuestItem* Quest, TArray<struct FFortItemInstanceQuantityPair>& Rewards);
	void OnNoQuestRewardsToClaim();
	void ClaimNextQuestReward();
	void ShowModalQuests(bool* bCommitted);
	void ProcessQuestUpdate(class UFortQuestItem* Quest, class UVerticalBox* QuestList, bool* QuestIsCompleted);
	void SetInputActionHandlers();
	void UpdateBattlePass();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DailyQuestsPanel_C">();
	}
	static class UDailyQuestsPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDailyQuestsPanel_C>();
	}
};
static_assert(alignof(UDailyQuestsPanel_C) == 0x000008, "Wrong alignment on UDailyQuestsPanel_C");
static_assert(sizeof(UDailyQuestsPanel_C) == 0x0002B0, "Wrong size on UDailyQuestsPanel_C");
static_assert(offsetof(UDailyQuestsPanel_C, UberGraphFrame) == 0x000248, "Member 'UDailyQuestsPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDailyQuestsPanel_C, BattlePassBorder) == 0x000250, "Member 'UDailyQuestsPanel_C::BattlePassBorder' has a wrong offset!");
static_assert(offsetof(UDailyQuestsPanel_C, BattlePassDailiySwitcher) == 0x000258, "Member 'UDailyQuestsPanel_C::BattlePassDailiySwitcher' has a wrong offset!");
static_assert(offsetof(UDailyQuestsPanel_C, BattlePassImage) == 0x000260, "Member 'UDailyQuestsPanel_C::BattlePassImage' has a wrong offset!");
static_assert(offsetof(UDailyQuestsPanel_C, BattlePassList) == 0x000268, "Member 'UDailyQuestsPanel_C::BattlePassList' has a wrong offset!");
static_assert(offsetof(UDailyQuestsPanel_C, ClaimButton) == 0x000270, "Member 'UDailyQuestsPanel_C::ClaimButton' has a wrong offset!");
static_assert(offsetof(UDailyQuestsPanel_C, DailyQuestList) == 0x000278, "Member 'UDailyQuestsPanel_C::DailyQuestList' has a wrong offset!");
static_assert(offsetof(UDailyQuestsPanel_C, EventQuestList) == 0x000280, "Member 'UDailyQuestsPanel_C::EventQuestList' has a wrong offset!");
static_assert(offsetof(UDailyQuestsPanel_C, EventQuestsLabel) == 0x000288, "Member 'UDailyQuestsPanel_C::EventQuestsLabel' has a wrong offset!");
static_assert(offsetof(UDailyQuestsPanel_C, ClaimingQuestsInProgress) == 0x000290, "Member 'UDailyQuestsPanel_C::ClaimingQuestsInProgress' has a wrong offset!");
static_assert(offsetof(UDailyQuestsPanel_C, QuestTypeToClaim) == 0x000291, "Member 'UDailyQuestsPanel_C::QuestTypeToClaim' has a wrong offset!");
static_assert(offsetof(UDailyQuestsPanel_C, InspectActionButton) == 0x000298, "Member 'UDailyQuestsPanel_C::InspectActionButton' has a wrong offset!");
static_assert(offsetof(UDailyQuestsPanel_C, ParentPanel) == 0x0002A8, "Member 'UDailyQuestsPanel_C::ParentPanel' has a wrong offset!");

}

