#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DailyRewardsMissingFoundersPack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DailyRewardsMissingFoundersPack.DailyRewardsMissingFoundersPack_C
// 0x0028 (0x02D0 - 0x02A8)
class UDailyRewardsMissingFoundersPack_C final : public UFortDailyRewardsSchedule
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(Transient, DuplicateTransient)
	class UFortMultiSizeItemCard*                 FortItemCard;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MESSAGE;                                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         NumMaxEpicRewards;                                 // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Length_Of_Week;                                    // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    Founder_Item;                                      // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DailyRewardsMissingFoundersPack(int32 EntryPoint);
	void Construct();
	void CanUpgradeFoundersPack(bool* CanUpgrade);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DailyRewardsMissingFoundersPack_C">();
	}
	static class UDailyRewardsMissingFoundersPack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDailyRewardsMissingFoundersPack_C>();
	}
};
static_assert(alignof(UDailyRewardsMissingFoundersPack_C) == 0x000008, "Wrong alignment on UDailyRewardsMissingFoundersPack_C");
static_assert(sizeof(UDailyRewardsMissingFoundersPack_C) == 0x0002D0, "Wrong size on UDailyRewardsMissingFoundersPack_C");
static_assert(offsetof(UDailyRewardsMissingFoundersPack_C, UberGraphFrame) == 0x0002A8, "Member 'UDailyRewardsMissingFoundersPack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDailyRewardsMissingFoundersPack_C, FortItemCard) == 0x0002B0, "Member 'UDailyRewardsMissingFoundersPack_C::FortItemCard' has a wrong offset!");
static_assert(offsetof(UDailyRewardsMissingFoundersPack_C, MESSAGE) == 0x0002B8, "Member 'UDailyRewardsMissingFoundersPack_C::MESSAGE' has a wrong offset!");
static_assert(offsetof(UDailyRewardsMissingFoundersPack_C, NumMaxEpicRewards) == 0x0002C0, "Member 'UDailyRewardsMissingFoundersPack_C::NumMaxEpicRewards' has a wrong offset!");
static_assert(offsetof(UDailyRewardsMissingFoundersPack_C, Length_Of_Week) == 0x0002C4, "Member 'UDailyRewardsMissingFoundersPack_C::Length_Of_Week' has a wrong offset!");
static_assert(offsetof(UDailyRewardsMissingFoundersPack_C, Founder_Item) == 0x0002C8, "Member 'UDailyRewardsMissingFoundersPack_C::Founder_Item' has a wrong offset!");

}

