#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DailyQuestsPanel

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonUI_structs.hpp"


namespace SDK::Params
{

// Function DailyQuestsPanel.DailyQuestsPanel_C.ExecuteUbergraph_DailyQuestsPanel
// 0x0048 (0x0048 - 0x0000)
struct DailyQuestsPanel_C_ExecuteUbergraph_DailyQuestsPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortPublicAccountInfo                 K2Node_Event_Result;                               // 0x0010(0x0034)(NoDestructor)
};
static_assert(alignof(DailyQuestsPanel_C_ExecuteUbergraph_DailyQuestsPanel) == 0x000008, "Wrong alignment on DailyQuestsPanel_C_ExecuteUbergraph_DailyQuestsPanel");
static_assert(sizeof(DailyQuestsPanel_C_ExecuteUbergraph_DailyQuestsPanel) == 0x000048, "Wrong size on DailyQuestsPanel_C_ExecuteUbergraph_DailyQuestsPanel");
static_assert(offsetof(DailyQuestsPanel_C_ExecuteUbergraph_DailyQuestsPanel, EntryPoint) == 0x000000, "Member 'DailyQuestsPanel_C_ExecuteUbergraph_DailyQuestsPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_ExecuteUbergraph_DailyQuestsPanel, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'DailyQuestsPanel_C_ExecuteUbergraph_DailyQuestsPanel::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_ExecuteUbergraph_DailyQuestsPanel, K2Node_Event_Result) == 0x000010, "Member 'DailyQuestsPanel_C_ExecuteUbergraph_DailyQuestsPanel::K2Node_Event_Result' has a wrong offset!");

// Function DailyQuestsPanel.DailyQuestsPanel_C.OnAccountInfoChanged
// 0x0034 (0x0034 - 0x0000)
struct DailyQuestsPanel_C_OnAccountInfoChanged final
{
public:
	struct FFortPublicAccountInfo                 Result;                                            // 0x0000(0x0034)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(DailyQuestsPanel_C_OnAccountInfoChanged) == 0x000004, "Wrong alignment on DailyQuestsPanel_C_OnAccountInfoChanged");
static_assert(sizeof(DailyQuestsPanel_C_OnAccountInfoChanged) == 0x000034, "Wrong size on DailyQuestsPanel_C_OnAccountInfoChanged");
static_assert(offsetof(DailyQuestsPanel_C_OnAccountInfoChanged, Result) == 0x000000, "Member 'DailyQuestsPanel_C_OnAccountInfoChanged::Result' has a wrong offset!");

// Function DailyQuestsPanel.DailyQuestsPanel_C.BndEvt__IconTextButton_K2Node_ComponentBoundEvent_66_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct DailyQuestsPanel_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_66_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DailyQuestsPanel_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_66_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on DailyQuestsPanel_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_66_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(DailyQuestsPanel_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_66_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on DailyQuestsPanel_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_66_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(DailyQuestsPanel_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_66_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'DailyQuestsPanel_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_66_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function DailyQuestsPanel.DailyQuestsPanel_C.BindEventListeners
// 0x0050 (0x0050 - 0x0000)
struct DailyQuestsPanel_C_BindEventListeners final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UFortQuestItem* Quest, TArray<struct FFortItemInstanceQuantityPair>& Rewards)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TArray<class UFortQuestItem*>& Quests)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DailyQuestsPanel_C_BindEventListeners) == 0x000008, "Wrong alignment on DailyQuestsPanel_C_BindEventListeners");
static_assert(sizeof(DailyQuestsPanel_C_BindEventListeners) == 0x000050, "Wrong size on DailyQuestsPanel_C_BindEventListeners");
static_assert(offsetof(DailyQuestsPanel_C_BindEventListeners, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'DailyQuestsPanel_C_BindEventListeners::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_BindEventListeners, K2Node_CreateDelegate_OutputDelegate2) == 0x000010, "Member 'DailyQuestsPanel_C_BindEventListeners::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_BindEventListeners, K2Node_CreateDelegate_OutputDelegate3) == 0x000020, "Member 'DailyQuestsPanel_C_BindEventListeners::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_BindEventListeners, K2Node_CreateDelegate_OutputDelegate4) == 0x000030, "Member 'DailyQuestsPanel_C_BindEventListeners::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_BindEventListeners, CallFunc_GetContext_ReturnValue) == 0x000040, "Member 'DailyQuestsPanel_C_BindEventListeners::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_BindEventListeners, CallFunc_GetQuestManager_ReturnValue) == 0x000048, "Member 'DailyQuestsPanel_C_BindEventListeners::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");

// Function DailyQuestsPanel.DailyQuestsPanel_C.OnQuestsUpdated
// 0x0070 (0x0070 - 0x0000)
struct DailyQuestsPanel_C_OnQuestsUpdated final
{
public:
	bool                                          ClaimQuests;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortQuestItem*>                 CallFunc_GetCurrentQuests_OutCurrentQuests;        // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	class UFortQuestItem*                         CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItemDefinition*               CallFunc_GetQuestDefinitionBP_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortQuestType                                CallFunc_GetQuestType_ReturnValue;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputActionState                             Temp_byte_Variable5;                               // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInputActionState                             Temp_byte_Variable6;                               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyChildren_ReturnValue2;              // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyChildren_ReturnValue3;              // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ProcessQuestUpdate_QuestIsCompleted;      // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyChildren_ReturnValue4;              // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ProcessQuestUpdate_QuestIsCompleted2;     // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProcessQuestUpdate_QuestIsCompleted3;     // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInputActionState                             K2Node_Select3_Default;                            // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DailyQuestsPanel_C_OnQuestsUpdated) == 0x000008, "Wrong alignment on DailyQuestsPanel_C_OnQuestsUpdated");
static_assert(sizeof(DailyQuestsPanel_C_OnQuestsUpdated) == 0x000070, "Wrong size on DailyQuestsPanel_C_OnQuestsUpdated");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, ClaimQuests) == 0x000000, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::ClaimQuests' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, Temp_bool_Variable) == 0x000001, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, Temp_byte_Variable) == 0x000002, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, Temp_byte_Variable2) == 0x000003, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, Temp_bool_Variable2) == 0x000004, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, Temp_byte_Variable3) == 0x000005, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, Temp_byte_Variable4) == 0x000006, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, Temp_int_Array_Index_Variable) == 0x000010, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, CallFunc_GetQuestManager_ReturnValue) == 0x000018, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, CallFunc_GetCurrentQuests_OutCurrentQuests) == 0x000020, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::CallFunc_GetCurrentQuests_OutCurrentQuests' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, CallFunc_Array_Get_Item) == 0x000030, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, CallFunc_GetQuestDefinitionBP_ReturnValue) == 0x000040, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::CallFunc_GetQuestDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, CallFunc_GetQuestType_ReturnValue) == 0x000048, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::CallFunc_GetQuestType_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, Temp_byte_Variable5) == 0x000049, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, K2Node_SwitchEnum_CmpSuccess) == 0x00004A, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, CallFunc_Not_PreBool_ReturnValue) == 0x00004B, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, Temp_byte_Variable6) == 0x00004C, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, CallFunc_HasAnyChildren_ReturnValue) == 0x00004D, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, CallFunc_HasAnyChildren_ReturnValue2) == 0x00004E, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::CallFunc_HasAnyChildren_ReturnValue2' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, CallFunc_HasAnyChildren_ReturnValue3) == 0x00004F, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::CallFunc_HasAnyChildren_ReturnValue3' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, CallFunc_BooleanOR_ReturnValue) == 0x000050, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, CallFunc_BooleanOR_ReturnValue2) == 0x000051, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, CallFunc_ProcessQuestUpdate_QuestIsCompleted) == 0x000052, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::CallFunc_ProcessQuestUpdate_QuestIsCompleted' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, CallFunc_BooleanAND_ReturnValue) == 0x000053, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, CallFunc_HasAnyChildren_ReturnValue4) == 0x000054, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::CallFunc_HasAnyChildren_ReturnValue4' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, CallFunc_ProcessQuestUpdate_QuestIsCompleted2) == 0x000055, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::CallFunc_ProcessQuestUpdate_QuestIsCompleted2' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, K2Node_Select_Default) == 0x000056, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, CallFunc_ProcessQuestUpdate_QuestIsCompleted3) == 0x000057, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::CallFunc_ProcessQuestUpdate_QuestIsCompleted3' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, K2Node_Select2_Default) == 0x000058, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, Temp_bool_Variable3) == 0x000068, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsUpdated, K2Node_Select3_Default) == 0x000069, "Member 'DailyQuestsPanel_C_OnQuestsUpdated::K2Node_Select3_Default' has a wrong offset!");

// Function DailyQuestsPanel.DailyQuestsPanel_C.CreateQuestWidget
// 0x0030 (0x0030 - 0x0000)
struct DailyQuestsPanel_C_CreateQuestWidget final
{
public:
	class UFortQuestItem*                         Quest;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           QuestList;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          QuestCompleted;                                    // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDailyQuestWidget_C*                    CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DailyQuestsPanel_C_CreateQuestWidget) == 0x000008, "Wrong alignment on DailyQuestsPanel_C_CreateQuestWidget");
static_assert(sizeof(DailyQuestsPanel_C_CreateQuestWidget) == 0x000030, "Wrong size on DailyQuestsPanel_C_CreateQuestWidget");
static_assert(offsetof(DailyQuestsPanel_C_CreateQuestWidget, Quest) == 0x000000, "Member 'DailyQuestsPanel_C_CreateQuestWidget::Quest' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_CreateQuestWidget, QuestList) == 0x000008, "Member 'DailyQuestsPanel_C_CreateQuestWidget::QuestList' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_CreateQuestWidget, QuestCompleted) == 0x000010, "Member 'DailyQuestsPanel_C_CreateQuestWidget::QuestCompleted' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_CreateQuestWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'DailyQuestsPanel_C_CreateQuestWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_CreateQuestWidget, CallFunc_Create_ReturnValue) == 0x000020, "Member 'DailyQuestsPanel_C_CreateQuestWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_CreateQuestWidget, CallFunc_AddChild_ReturnValue) == 0x000028, "Member 'DailyQuestsPanel_C_CreateQuestWidget::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function DailyQuestsPanel.DailyQuestsPanel_C.OnQuestsGranted
// 0x0010 (0x0010 - 0x0000)
struct DailyQuestsPanel_C_OnQuestsGranted final
{
public:
	TArray<class UFortQuestItem*>                 NewQuests;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(DailyQuestsPanel_C_OnQuestsGranted) == 0x000008, "Wrong alignment on DailyQuestsPanel_C_OnQuestsGranted");
static_assert(sizeof(DailyQuestsPanel_C_OnQuestsGranted) == 0x000010, "Wrong size on DailyQuestsPanel_C_OnQuestsGranted");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestsGranted, NewQuests) == 0x000000, "Member 'DailyQuestsPanel_C_OnQuestsGranted::NewQuests' has a wrong offset!");

// Function DailyQuestsPanel.DailyQuestsPanel_C.OnQuestRewardClaimed
// 0x0018 (0x0018 - 0x0000)
struct DailyQuestsPanel_C_OnQuestRewardClaimed final
{
public:
	class UFortQuestItem*                         Quest;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFortItemInstanceQuantityPair>  Rewards;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(DailyQuestsPanel_C_OnQuestRewardClaimed) == 0x000008, "Wrong alignment on DailyQuestsPanel_C_OnQuestRewardClaimed");
static_assert(sizeof(DailyQuestsPanel_C_OnQuestRewardClaimed) == 0x000018, "Wrong size on DailyQuestsPanel_C_OnQuestRewardClaimed");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestRewardClaimed, Quest) == 0x000000, "Member 'DailyQuestsPanel_C_OnQuestRewardClaimed::Quest' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_OnQuestRewardClaimed, Rewards) == 0x000008, "Member 'DailyQuestsPanel_C_OnQuestRewardClaimed::Rewards' has a wrong offset!");

// Function DailyQuestsPanel.DailyQuestsPanel_C.OnNoQuestRewardsToClaim
// 0x0001 (0x0001 - 0x0000)
struct DailyQuestsPanel_C_OnNoQuestRewardsToClaim final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DailyQuestsPanel_C_OnNoQuestRewardsToClaim) == 0x000001, "Wrong alignment on DailyQuestsPanel_C_OnNoQuestRewardsToClaim");
static_assert(sizeof(DailyQuestsPanel_C_OnNoQuestRewardsToClaim) == 0x000001, "Wrong size on DailyQuestsPanel_C_OnNoQuestRewardsToClaim");
static_assert(offsetof(DailyQuestsPanel_C_OnNoQuestRewardsToClaim, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'DailyQuestsPanel_C_OnNoQuestRewardsToClaim::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function DailyQuestsPanel.DailyQuestsPanel_C.ClaimNextQuestReward
// 0x0010 (0x0010 - 0x0000)
struct DailyQuestsPanel_C_ClaimNextQuestReward final
{
public:
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DailyQuestsPanel_C_ClaimNextQuestReward) == 0x000008, "Wrong alignment on DailyQuestsPanel_C_ClaimNextQuestReward");
static_assert(sizeof(DailyQuestsPanel_C_ClaimNextQuestReward) == 0x000010, "Wrong size on DailyQuestsPanel_C_ClaimNextQuestReward");
static_assert(offsetof(DailyQuestsPanel_C_ClaimNextQuestReward, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'DailyQuestsPanel_C_ClaimNextQuestReward::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_ClaimNextQuestReward, CallFunc_GetQuestManager_ReturnValue) == 0x000008, "Member 'DailyQuestsPanel_C_ClaimNextQuestReward::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");

// Function DailyQuestsPanel.DailyQuestsPanel_C.ShowModalQuests
// 0x0020 (0x0020 - 0x0000)
struct DailyQuestsPanel_C_ShowModalQuests final
{
public:
	bool                                          bCommitted;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuestsModal_C*                         CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DailyQuestsPanel_C_ShowModalQuests) == 0x000008, "Wrong alignment on DailyQuestsPanel_C_ShowModalQuests");
static_assert(sizeof(DailyQuestsPanel_C_ShowModalQuests) == 0x000020, "Wrong size on DailyQuestsPanel_C_ShowModalQuests");
static_assert(offsetof(DailyQuestsPanel_C_ShowModalQuests, bCommitted) == 0x000000, "Member 'DailyQuestsPanel_C_ShowModalQuests::bCommitted' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_ShowModalQuests, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'DailyQuestsPanel_C_ShowModalQuests::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_ShowModalQuests, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000010, "Member 'DailyQuestsPanel_C_ShowModalQuests::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_ShowModalQuests, CallFunc_Create_ReturnValue) == 0x000018, "Member 'DailyQuestsPanel_C_ShowModalQuests::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function DailyQuestsPanel.DailyQuestsPanel_C.ProcessQuestUpdate
// 0x0018 (0x0018 - 0x0000)
struct DailyQuestsPanel_C_ProcessQuestUpdate final
{
public:
	class UFortQuestItem*                         Quest;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           QuestList;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          QuestIsCompleted;                                  // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          QuestCompleted;                                    // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CreateQuestWidget_QuestCompleted;         // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortQuestState                               CallFunc_GetQuestState_ReturnValue;                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DailyQuestsPanel_C_ProcessQuestUpdate) == 0x000008, "Wrong alignment on DailyQuestsPanel_C_ProcessQuestUpdate");
static_assert(sizeof(DailyQuestsPanel_C_ProcessQuestUpdate) == 0x000018, "Wrong size on DailyQuestsPanel_C_ProcessQuestUpdate");
static_assert(offsetof(DailyQuestsPanel_C_ProcessQuestUpdate, Quest) == 0x000000, "Member 'DailyQuestsPanel_C_ProcessQuestUpdate::Quest' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_ProcessQuestUpdate, QuestList) == 0x000008, "Member 'DailyQuestsPanel_C_ProcessQuestUpdate::QuestList' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_ProcessQuestUpdate, QuestIsCompleted) == 0x000010, "Member 'DailyQuestsPanel_C_ProcessQuestUpdate::QuestIsCompleted' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_ProcessQuestUpdate, QuestCompleted) == 0x000011, "Member 'DailyQuestsPanel_C_ProcessQuestUpdate::QuestCompleted' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_ProcessQuestUpdate, CallFunc_CreateQuestWidget_QuestCompleted) == 0x000012, "Member 'DailyQuestsPanel_C_ProcessQuestUpdate::CallFunc_CreateQuestWidget_QuestCompleted' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_ProcessQuestUpdate, CallFunc_GetQuestState_ReturnValue) == 0x000013, "Member 'DailyQuestsPanel_C_ProcessQuestUpdate::CallFunc_GetQuestState_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_ProcessQuestUpdate, K2Node_SwitchEnum_CmpSuccess) == 0x000014, "Member 'DailyQuestsPanel_C_ProcessQuestUpdate::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function DailyQuestsPanel.DailyQuestsPanel_C.SetInputActionHandlers
// 0x0030 (0x0030 - 0x0000)
struct DailyQuestsPanel_C_SetInputActionHandlers final
{
public:
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UWidget*                                CallFunc_FindParentWidgetOfType_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaLobby_C*                         K2Node_DynamicCast_AsAthena_Lobby;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DailyQuestsPanel_C_SetInputActionHandlers) == 0x000008, "Wrong alignment on DailyQuestsPanel_C_SetInputActionHandlers");
static_assert(sizeof(DailyQuestsPanel_C_SetInputActionHandlers) == 0x000030, "Wrong size on DailyQuestsPanel_C_SetInputActionHandlers");
static_assert(offsetof(DailyQuestsPanel_C_SetInputActionHandlers, CallFunc_GetParent_ReturnValue) == 0x000000, "Member 'DailyQuestsPanel_C_SetInputActionHandlers::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_SetInputActionHandlers, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'DailyQuestsPanel_C_SetInputActionHandlers::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_SetInputActionHandlers, CallFunc_FindParentWidgetOfType_ReturnValue) == 0x000018, "Member 'DailyQuestsPanel_C_SetInputActionHandlers::CallFunc_FindParentWidgetOfType_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_SetInputActionHandlers, K2Node_DynamicCast_AsAthena_Lobby) == 0x000020, "Member 'DailyQuestsPanel_C_SetInputActionHandlers::K2Node_DynamicCast_AsAthena_Lobby' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_SetInputActionHandlers, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'DailyQuestsPanel_C_SetInputActionHandlers::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function DailyQuestsPanel.DailyQuestsPanel_C.UpdateBattlePass
// 0x0038 (0x0038 - 0x0000)
struct DailyQuestsPanel_C_UpdateBattlePass final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpProfileAthena*                  CallFunc_GetAthenaProfile_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPurchasedSeasonBook_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DailyQuestsPanel_C_UpdateBattlePass) == 0x000008, "Wrong alignment on DailyQuestsPanel_C_UpdateBattlePass");
static_assert(sizeof(DailyQuestsPanel_C_UpdateBattlePass) == 0x000038, "Wrong size on DailyQuestsPanel_C_UpdateBattlePass");
static_assert(offsetof(DailyQuestsPanel_C_UpdateBattlePass, Temp_bool_Variable) == 0x000000, "Member 'DailyQuestsPanel_C_UpdateBattlePass::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_UpdateBattlePass, Temp_byte_Variable) == 0x000001, "Member 'DailyQuestsPanel_C_UpdateBattlePass::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(DailyQuestsPanel_C_UpdateBattlePass, Temp_byte_Variable2) == 0x000002, "Member 'DailyQuestsPanel_C_UpdateBattlePass::Temp_byte_Variable2' has a wrong offset!");
