#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DuplicateResOutMesh

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DuplicateResOutMesh.DuplicateResOutMesh_C.ExecuteUbergraph_DuplicateResOutMesh
// 0x0110 (0x0110 - 0x0000)
struct DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	TArray<class UMaterialInstanceDynamic*>       K2Node_CustomEvent_MID_Array;                      // 0x0050(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<class USkeletalMeshComponent*>         K2Node_CustomEvent_External_MEsh_Component_Array;  // 0x0060(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item2;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0078(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh) == 0x000010, "Wrong alignment on DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh");
static_assert(sizeof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh) == 0x000110, "Wrong size on DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, EntryPoint) == 0x000000, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::EntryPoint' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, Temp_int_Array_Index_Variable) == 0x000004, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000008, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_Array_Get_Item) == 0x000010, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000020, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, K2Node_CustomEvent_MID_Array) == 0x000050, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::K2Node_CustomEvent_MID_Array' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, K2Node_CustomEvent_External_MEsh_Component_Array) == 0x000060, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::K2Node_CustomEvent_External_MEsh_Component_Array' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_Array_Get_Item2) == 0x000070, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000078, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, Temp_int_Loop_Counter_Variable) == 0x0000F8, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_Less_IntInt_ReturnValue) == 0x0000FC, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh, CallFunc_Add_IntInt_ReturnValue) == 0x000100, "Member 'DuplicateResOutMesh_C_ExecuteUbergraph_DuplicateResOutMesh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function DuplicateResOutMesh.DuplicateResOutMesh_C.UpdateExternalParameters
// 0x0020 (0x0020 - 0x0000)
struct DuplicateResOutMesh_C_UpdateExternalParameters final
{
public:
	TArray<class UMaterialInstanceDynamic*>       MID_Array;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<class USkeletalMeshComponent*>         External_MEsh_Component_Array;                     // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(DuplicateResOutMesh_C_UpdateExternalParameters) == 0x000008, "Wrong alignment on DuplicateResOutMesh_C_UpdateExternalParameters");
static_assert(sizeof(DuplicateResOutMesh_C_UpdateExternalParameters) == 0x000020, "Wrong size on DuplicateResOutMesh_C_UpdateExternalParameters");
static_assert(offsetof(DuplicateResOutMesh_C_UpdateExternalParameters, MID_Array) == 0x000000, "Member 'DuplicateResOutMesh_C_UpdateExternalParameters::MID_Array' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_UpdateExternalParameters, External_MEsh_Component_Array) == 0x000010, "Member 'DuplicateResOutMesh_C_UpdateExternalParameters::External_MEsh_Component_Array' has a wrong offset!");

// Function DuplicateResOutMesh.DuplicateResOutMesh_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct DuplicateResOutMesh_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DuplicateResOutMesh_C_ReceiveTick) == 0x000004, "Wrong alignment on DuplicateResOutMesh_C_ReceiveTick");
static_assert(sizeof(DuplicateResOutMesh_C_ReceiveTick) == 0x000004, "Wrong size on DuplicateResOutMesh_C_ReceiveTick");
static_assert(offsetof(DuplicateResOutMesh_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'DuplicateResOutMesh_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function DuplicateResOutMesh.DuplicateResOutMesh_C.UserConstructionScript
// 0x0060 (0x0060 - 0x0000)
struct DuplicateResOutMesh_C_UserConstructionScript final
{
public:
	int32                                         NewLocalVar_2;                                     // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Container_Material;                                // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   NewLocalVar_1;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Param_Box_Local_Transform;                         // 0x0020(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FVector                                NewLocalVar_0;                                     // 0x0050(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DuplicateResOutMesh_C_UserConstructionScript) == 0x000010, "Wrong alignment on DuplicateResOutMesh_C_UserConstructionScript");
static_assert(sizeof(DuplicateResOutMesh_C_UserConstructionScript) == 0x000060, "Wrong size on DuplicateResOutMesh_C_UserConstructionScript");
static_assert(offsetof(DuplicateResOutMesh_C_UserConstructionScript, NewLocalVar_2) == 0x000000, "Member 'DuplicateResOutMesh_C_UserConstructionScript::NewLocalVar_2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_UserConstructionScript, Container_Material) == 0x000008, "Member 'DuplicateResOutMesh_C_UserConstructionScript::Container_Material' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_UserConstructionScript, NewLocalVar_1) == 0x000010, "Member 'DuplicateResOutMesh_C_UserConstructionScript::NewLocalVar_1' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_UserConstructionScript, Param_Box_Local_Transform) == 0x000020, "Member 'DuplicateResOutMesh_C_UserConstructionScript::Param_Box_Local_Transform' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_UserConstructionScript, NewLocalVar_0) == 0x000050, "Member 'DuplicateResOutMesh_C_UserConstructionScript::NewLocalVar_0' has a wrong offset!");

// Function DuplicateResOutMesh.DuplicateResOutMesh_C.initializeExternalSkeletalMeshArray
// 0x0040 (0x0040 - 0x0000)
struct DuplicateResOutMesh_C_InitializeExternalSkeletalMeshArray final
{
public:
	class APlayerPawn_Generic_C*                  K2Node_DynamicCast_AsPlayer_Pawn_Generic;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_Generic_Parent_C*    K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic_Parent; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(DuplicateResOutMesh_C_InitializeExternalSkeletalMeshArray) == 0x000008, "Wrong alignment on DuplicateResOutMesh_C_InitializeExternalSkeletalMeshArray");
static_assert(sizeof(DuplicateResOutMesh_C_InitializeExternalSkeletalMeshArray) == 0x000040, "Wrong size on DuplicateResOutMesh_C_InitializeExternalSkeletalMeshArray");
static_assert(offsetof(DuplicateResOutMesh_C_InitializeExternalSkeletalMeshArray, K2Node_DynamicCast_AsPlayer_Pawn_Generic) == 0x000000, "Member 'DuplicateResOutMesh_C_InitializeExternalSkeletalMeshArray::K2Node_DynamicCast_AsPlayer_Pawn_Generic' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_InitializeExternalSkeletalMeshArray, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'DuplicateResOutMesh_C_InitializeExternalSkeletalMeshArray::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_InitializeExternalSkeletalMeshArray, K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic_Parent) == 0x000010, "Member 'DuplicateResOutMesh_C_InitializeExternalSkeletalMeshArray::K2Node_DynamicCast_AsPlayer_Pawn_Athena_Generic_Parent' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_InitializeExternalSkeletalMeshArray, K2Node_DynamicCast_bSuccess2) == 0x000018, "Member 'DuplicateResOutMesh_C_InitializeExternalSkeletalMeshArray::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_InitializeExternalSkeletalMeshArray, K2Node_DynamicCast_AsFort_AIPawn) == 0x000020, "Member 'DuplicateResOutMesh_C_InitializeExternalSkeletalMeshArray::K2Node_DynamicCast_AsFort_AIPawn' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_InitializeExternalSkeletalMeshArray, K2Node_DynamicCast_bSuccess3) == 0x000028, "Member 'DuplicateResOutMesh_C_InitializeExternalSkeletalMeshArray::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_InitializeExternalSkeletalMeshArray, K2Node_MakeArray_Array) == 0x000030, "Member 'DuplicateResOutMesh_C_InitializeExternalSkeletalMeshArray::K2Node_MakeArray_Array' has a wrong offset!");

// Function DuplicateResOutMesh.DuplicateResOutMesh_C.Find Bounds
// 0x01D0 (0x01D0 - 0x0000)
struct DuplicateResOutMesh_C_Find_Bounds final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0004(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0010(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x001C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location2;                 // 0x0028(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation2;                 // 0x0034(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale2;                    // 0x0040(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X2;                           // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y2;                           // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z2;                           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0068(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0074(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakRotIntoAxes_X;                       // 0x0080(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakRotIntoAxes_Y;                       // 0x008C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakRotIntoAxes_Z;                       // 0x0098(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0xC];                                       // 0x00A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotationFromAxes_ReturnValue;         // 0x00E0(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue2;               // 0x00F0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             K2Node_Select_Default;                             // 0x0120(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location3;                 // 0x0150(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation3;                 // 0x015C(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale3;                    // 0x0168(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x0174(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x0180(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0190(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue3;               // 0x01A0(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(DuplicateResOutMesh_C_Find_Bounds) == 0x000010, "Wrong alignment on DuplicateResOutMesh_C_Find_Bounds");
static_assert(sizeof(DuplicateResOutMesh_C_Find_Bounds) == 0x0001D0, "Wrong size on DuplicateResOutMesh_C_Find_Bounds");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, Temp_bool_Variable) == 0x000000, "Member 'DuplicateResOutMesh_C_Find_Bounds::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakTransform_Location) == 0x000004, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakTransform_Rotation) == 0x000010, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakTransform_Scale) == 0x00001C, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakTransform_Location2) == 0x000028, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakTransform_Location2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakTransform_Rotation2) == 0x000034, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakTransform_Rotation2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakTransform_Scale2) == 0x000040, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakTransform_Scale2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakVector_X) == 0x00004C, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakVector_Y) == 0x000050, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakVector_Z) == 0x000054, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakVector_X2) == 0x000058, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakVector_X2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakVector_Y2) == 0x00005C, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakVector_Y2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakVector_Z2) == 0x000060, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakVector_Z2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000064, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_MakeVector_ReturnValue) == 0x000068, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_MakeVector_ReturnValue2) == 0x000074, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakRotIntoAxes_X) == 0x000080, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakRotIntoAxes_X' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakRotIntoAxes_Y) == 0x00008C, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakRotIntoAxes_Y' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakRotIntoAxes_Z) == 0x000098, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakRotIntoAxes_Z' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_MakeTransform_ReturnValue) == 0x0000B0, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_MakeRotationFromAxes_ReturnValue) == 0x0000E0, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_MakeRotationFromAxes_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_MakeTransform_ReturnValue2) == 0x0000F0, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_MakeTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, K2Node_Select_Default) == 0x000120, "Member 'DuplicateResOutMesh_C_Find_Bounds::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakTransform_Location3) == 0x000150, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakTransform_Location3' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakTransform_Rotation3) == 0x00015C, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakTransform_Rotation3' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_BreakTransform_Scale3) == 0x000168, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_BreakTransform_Scale3' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_GetActorBounds_Origin) == 0x000174, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_GetActorBounds_BoxExtent) == 0x000180, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_VSize_ReturnValue) == 0x00018C, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000190, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Find_Bounds, CallFunc_MakeTransform_ReturnValue3) == 0x0001A0, "Member 'DuplicateResOutMesh_C_Find_Bounds::CallFunc_MakeTransform_ReturnValue3' has a wrong offset!");

// Function DuplicateResOutMesh.DuplicateResOutMesh_C.Spawn  Light
// 0x0040 (0x0040 - 0x0000)
struct DuplicateResOutMesh_C_Spawn__Light final
{
public:
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	class UPointLightComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DuplicateResOutMesh_C_Spawn__Light) == 0x000010, "Wrong alignment on DuplicateResOutMesh_C_Spawn__Light");
static_assert(sizeof(DuplicateResOutMesh_C_Spawn__Light) == 0x000040, "Wrong size on DuplicateResOutMesh_C_Spawn__Light");
static_assert(offsetof(DuplicateResOutMesh_C_Spawn__Light, CallFunc_MakeTransform_ReturnValue) == 0x000000, "Member 'DuplicateResOutMesh_C_Spawn__Light::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Spawn__Light, CallFunc_AddComponent_ReturnValue) == 0x000030, "Member 'DuplicateResOutMesh_C_Spawn__Light::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

// Function DuplicateResOutMesh.DuplicateResOutMesh_C.Make and slave internal meshes
// 0x0180 (0x0180 - 0x0000)
struct DuplicateResOutMesh_C_Make_and_slave_internal_meshes final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_AddComponent_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x00C0(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item2;                          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item3;                          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_Select_Default;                             // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item4;                          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes) == 0x000010, "Wrong alignment on DuplicateResOutMesh_C_Make_and_slave_internal_meshes");
static_assert(sizeof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes) == 0x000180, "Wrong size on DuplicateResOutMesh_C_Make_and_slave_internal_meshes");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, Transform) == 0x000000, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::Transform' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, Temp_int_Variable) == 0x000030, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, Temp_int_Array_Index_Variable) == 0x000038, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00003C, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, CallFunc_AddComponent_ReturnValue) == 0x000040, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, CallFunc_Array_Get_Item) == 0x000080, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000090, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x0000C0, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, CallFunc_Array_Get_Item2) == 0x000140, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, CallFunc_Array_Add_ReturnValue) == 0x000148, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, Temp_bool_Variable) == 0x00014C, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, CallFunc_Array_Get_Item3) == 0x000150, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, Temp_int_Loop_Counter_Variable) == 0x000158, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, K2Node_Select_Default) == 0x000160, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, CallFunc_Less_IntInt_ReturnValue) == 0x000168, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, CallFunc_Add_IntInt_ReturnValue2) == 0x00016C, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, CallFunc_Array_Get_Item4) == 0x000170, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, CallFunc_Array_Length_ReturnValue2) == 0x000178, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_and_slave_internal_meshes, CallFunc_Less_IntInt_ReturnValue2) == 0x00017C, "Member 'DuplicateResOutMesh_C_Make_and_slave_internal_meshes::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");

// Function DuplicateResOutMesh.DuplicateResOutMesh_C.Make internal mids and append external and intermal mids to mid array
// 0x0088 (0x0088 - 0x0000)
struct DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array final
{
public:
	class USkeletalMeshComponent*                 CurrentExternalSkeletalMeshComponent;              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      GunOrCharacterMaterialInstance;                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item2;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      Temp_object_Variable2;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item3;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      K2Node_Select_Default;                             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array) == 0x000008, "Wrong alignment on DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array");
static_assert(sizeof(DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array) == 0x000088, "Wrong size on DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array");
static_assert(offsetof(DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array, CurrentExternalSkeletalMeshComponent) == 0x000000, "Member 'DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array::CurrentExternalSkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array, GunOrCharacterMaterialInstance) == 0x000008, "Member 'DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array::GunOrCharacterMaterialInstance' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array, Temp_int_Array_Index_Variable) == 0x000010, "Member 'DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array, Temp_int_Variable) == 0x00001C, "Member 'DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000020, "Member 'DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array, CallFunc_Add_IntInt_ReturnValue2) == 0x000024, "Member 'DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array, CallFunc_Array_Get_Item) == 0x000028, "Member 'DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array, CallFunc_Array_Get_Item2) == 0x000030, "Member 'DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000038, "Member 'DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array, Temp_object_Variable) == 0x000040, "Member 'DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array, CallFunc_Array_Add_ReturnValue) == 0x000048, "Member 'DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array, CallFunc_GetMaterial_ReturnValue) == 0x000050, "Member 'DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array, Temp_object_Variable2) == 0x000058, "Member 'DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array, CallFunc_Array_Get_Item3) == 0x000060, "Member 'DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array, CallFunc_GetNumMaterials_ReturnValue) == 0x00006C, "Member 'DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array::CallFunc_GetNumMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array, CallFunc_Subtract_IntInt_ReturnValue) == 0x000074, "Member 'DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array, Temp_bool_Variable) == 0x000078, "Member 'DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array, K2Node_Select_Default) == 0x000080, "Member 'DuplicateResOutMesh_C_Make_internal_mids_and_append_external_and_intermal_mids_to_mid_array::K2Node_Select_Default' has a wrong offset!");

// Function DuplicateResOutMesh.DuplicateResOutMesh_C.ProcessSpawnInTimeline
// 0x01B0 (0x01B0 - 0x0000)
struct DuplicateResOutMesh_C_ProcessSpawnInTimeline final
{
public:
	float                                         ZHeight;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightIntensity;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DissolveGradientPercentage;                        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DissolveGradientDistance;                          // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DissolveGradientBaseLocation;                      // 0x0010(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DissolveGradientDirectionalColor;                  // 0x0020(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0040(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue2;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x00D8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue2;           // 0x00E4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00F4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0100(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x010C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue2;        // 0x0118(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0124(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue2;            // 0x0130(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x013C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue2;       // 0x0148(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue2;                        // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_Array_Get_Item;                           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue3;        // 0x0170(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x017C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue2;                       // 0x0194(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue2;    // 0x01A0(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DuplicateResOutMesh_C_ProcessSpawnInTimeline) == 0x000008, "Wrong alignment on DuplicateResOutMesh_C_ProcessSpawnInTimeline");
