#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EliminatedOverlay

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function EliminatedOverlay.EliminatedOverlay_C.ExecuteUbergraph_EliminatedOverlay
// 0x00A8 (0x00A8 - 0x0000)
struct EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0010(0x0008)(NoDestructor)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x002C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerStateAthena*                 K2Node_DynamicCast_AsFort_Player_State_Athena;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0018)()
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay) == 0x000008, "Wrong alignment on EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay");
static_assert(sizeof(EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay) == 0x0000A8, "Wrong size on EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay");
static_assert(offsetof(EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay, EntryPoint) == 0x000000, "Member 'EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay::EntryPoint' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay, CallFunc_K2_SetTimer_ReturnValue) == 0x000010, "Member 'EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay, CallFunc_GetViewTarget_ReturnValue) == 0x000018, "Member 'EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000020, "Member 'EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay, K2Node_Event_MyGeometry) == 0x00002C, "Member 'EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay, K2Node_Event_InDeltaTime) == 0x000064, "Member 'EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay, K2Node_DynamicCast_AsFort_Player_State_Athena) == 0x000068, "Member 'EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay::K2Node_DynamicCast_AsFort_Player_State_Athena' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay, K2Node_DynamicCast_bSuccess2) == 0x000070, "Member 'EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay, CallFunc_GetPlayerName_ReturnValue) == 0x000078, "Member 'EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay, CallFunc_IsAnimationPlaying_ReturnValue) == 0x0000A0, "Member 'EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay, CallFunc_Not_PreBool_ReturnValue) == 0x0000A1, "Member 'EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay, CallFunc_BooleanAND_ReturnValue) == 0x0000A2, "Member 'EliminatedOverlay_C_ExecuteUbergraph_EliminatedOverlay::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function EliminatedOverlay.EliminatedOverlay_C.Tick
// 0x003C (0x003C - 0x0000)
struct EliminatedOverlay_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EliminatedOverlay_C_Tick) == 0x000004, "Wrong alignment on EliminatedOverlay_C_Tick");
static_assert(sizeof(EliminatedOverlay_C_Tick) == 0x00003C, "Wrong size on EliminatedOverlay_C_Tick");
static_assert(offsetof(EliminatedOverlay_C_Tick, MyGeometry) == 0x000000, "Member 'EliminatedOverlay_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_Tick, InDeltaTime) == 0x000038, "Member 'EliminatedOverlay_C_Tick::InDeltaTime' has a wrong offset!");

// Function EliminatedOverlay.EliminatedOverlay_C.OnPawnDied
// 0x00C8 (0x00C8 - 0x0000)
struct EliminatedOverlay_C_OnPawnDied final
{
public:
	struct FFortPlayerDeathReport                 Param_DeathReport;                                 // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0058(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0070(0x0018)()
	class AFortPawn*                              CallFunc_ProcessDeathReport_KillerPawn;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProcessDeathReport_DidPlayerKillThemselves; // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_ProcessDeathReport_KillerName;            // 0x0098(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x00B0(0x0018)()
};
static_assert(alignof(EliminatedOverlay_C_OnPawnDied) == 0x000008, "Wrong alignment on EliminatedOverlay_C_OnPawnDied");
static_assert(sizeof(EliminatedOverlay_C_OnPawnDied) == 0x0000C8, "Wrong size on EliminatedOverlay_C_OnPawnDied");
static_assert(offsetof(EliminatedOverlay_C_OnPawnDied, Param_DeathReport) == 0x000000, "Member 'EliminatedOverlay_C_OnPawnDied::Param_DeathReport' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_OnPawnDied, Temp_bool_Variable) == 0x000050, "Member 'EliminatedOverlay_C_OnPawnDied::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_OnPawnDied, Temp_text_Variable) == 0x000058, "Member 'EliminatedOverlay_C_OnPawnDied::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_OnPawnDied, Temp_text_Variable2) == 0x000070, "Member 'EliminatedOverlay_C_OnPawnDied::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_OnPawnDied, CallFunc_ProcessDeathReport_KillerPawn) == 0x000088, "Member 'EliminatedOverlay_C_OnPawnDied::CallFunc_ProcessDeathReport_KillerPawn' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_OnPawnDied, CallFunc_ProcessDeathReport_DidPlayerKillThemselves) == 0x000090, "Member 'EliminatedOverlay_C_OnPawnDied::CallFunc_ProcessDeathReport_DidPlayerKillThemselves' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_OnPawnDied, CallFunc_ProcessDeathReport_KillerName) == 0x000098, "Member 'EliminatedOverlay_C_OnPawnDied::CallFunc_ProcessDeathReport_KillerName' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_OnPawnDied, K2Node_Select_Default) == 0x0000B0, "Member 'EliminatedOverlay_C_OnPawnDied::K2Node_Select_Default' has a wrong offset!");

// Function EliminatedOverlay.EliminatedOverlay_C.UpdatePlace
// 0x00E8 (0x00E8 - 0x0000)
struct EliminatedOverlay_C_UpdatePlace final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0020(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0040)(HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ZeroConstructor, ReferenceParm)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A0(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AnySquadMembersStillAlive_AnyAlive;       // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BE[0x2];                                       // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00C0(0x0018)()
	class AFortPlayerStateAthena*                 K2Node_DynamicCast_AsFort_Player_State_Athena;     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EliminatedOverlay_C_UpdatePlace) == 0x000008, "Wrong alignment on EliminatedOverlay_C_UpdatePlace");
static_assert(sizeof(EliminatedOverlay_C_UpdatePlace) == 0x0000E8, "Wrong size on EliminatedOverlay_C_UpdatePlace");
static_assert(offsetof(EliminatedOverlay_C_UpdatePlace, Temp_bool_Variable) == 0x000000, "Member 'EliminatedOverlay_C_UpdatePlace::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_UpdatePlace, Temp_text_Variable) == 0x000008, "Member 'EliminatedOverlay_C_UpdatePlace::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_UpdatePlace, Temp_text_Variable2) == 0x000020, "Member 'EliminatedOverlay_C_UpdatePlace::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_UpdatePlace, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'EliminatedOverlay_C_UpdatePlace::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_UpdatePlace, CallFunc_GetOwningPlayer_ReturnValue) == 0x000078, "Member 'EliminatedOverlay_C_UpdatePlace::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_UpdatePlace, K2Node_MakeArray_Array) == 0x000080, "Member 'EliminatedOverlay_C_UpdatePlace::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_UpdatePlace, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000090, "Member 'EliminatedOverlay_C_UpdatePlace::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_UpdatePlace, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'EliminatedOverlay_C_UpdatePlace::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_UpdatePlace, CallFunc_Format_ReturnValue) == 0x0000A0, "Member 'EliminatedOverlay_C_UpdatePlace::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_UpdatePlace, CallFunc_Array_Length_ReturnValue) == 0x0000B8, "Member 'EliminatedOverlay_C_UpdatePlace::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_UpdatePlace, CallFunc_AnySquadMembersStillAlive_AnyAlive) == 0x0000BC, "Member 'EliminatedOverlay_C_UpdatePlace::CallFunc_AnySquadMembersStillAlive_AnyAlive' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_UpdatePlace, CallFunc_Greater_IntInt_ReturnValue) == 0x0000BD, "Member 'EliminatedOverlay_C_UpdatePlace::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_UpdatePlace, K2Node_Select_Default) == 0x0000C0, "Member 'EliminatedOverlay_C_UpdatePlace::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_UpdatePlace, K2Node_DynamicCast_AsFort_Player_State_Athena) == 0x0000D8, "Member 'EliminatedOverlay_C_UpdatePlace::K2Node_DynamicCast_AsFort_Player_State_Athena' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_UpdatePlace, K2Node_DynamicCast_bSuccess2) == 0x0000E0, "Member 'EliminatedOverlay_C_UpdatePlace::K2Node_DynamicCast_bSuccess2' has a wrong offset!");

// Function EliminatedOverlay.EliminatedOverlay_C.Winner Announced
// 0x0040 (0x0040 - 0x0000)
struct EliminatedOverlay_C_Winner_Announced final
{
public:
	class FString                                 InString;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EliminatedOverlay_C_Winner_Announced) == 0x000008, "Wrong alignment on EliminatedOverlay_C_Winner_Announced");
static_assert(sizeof(EliminatedOverlay_C_Winner_Announced) == 0x000040, "Wrong size on EliminatedOverlay_C_Winner_Announced");
static_assert(offsetof(EliminatedOverlay_C_Winner_Announced, InString) == 0x000000, "Member 'EliminatedOverlay_C_Winner_Announced::InString' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_Winner_Announced, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'EliminatedOverlay_C_Winner_Announced::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_Winner_Announced, CallFunc_GetGameState_ReturnValue) == 0x000028, "Member 'EliminatedOverlay_C_Winner_Announced::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_Winner_Announced, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000030, "Member 'EliminatedOverlay_C_Winner_Announced::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_Winner_Announced, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'EliminatedOverlay_C_Winner_Announced::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function EliminatedOverlay.EliminatedOverlay_C.UpdateYouPlacedBoxVisibility
// 0x0007 (0x0007 - 0x0000)
struct EliminatedOverlay_C_UpdateYouPlacedBoxVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EliminatedOverlay_C_UpdateYouPlacedBoxVisibility) == 0x000001, "Wrong alignment on EliminatedOverlay_C_UpdateYouPlacedBoxVisibility");
static_assert(sizeof(EliminatedOverlay_C_UpdateYouPlacedBoxVisibility) == 0x000007, "Wrong size on EliminatedOverlay_C_UpdateYouPlacedBoxVisibility");
static_assert(offsetof(EliminatedOverlay_C_UpdateYouPlacedBoxVisibility, Temp_bool_Variable) == 0x000000, "Member 'EliminatedOverlay_C_UpdateYouPlacedBoxVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_UpdateYouPlacedBoxVisibility, Temp_byte_Variable) == 0x000001, "Member 'EliminatedOverlay_C_UpdateYouPlacedBoxVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_UpdateYouPlacedBoxVisibility, Temp_byte_Variable2) == 0x000002, "Member 'EliminatedOverlay_C_UpdateYouPlacedBoxVisibility::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_UpdateYouPlacedBoxVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'EliminatedOverlay_C_UpdateYouPlacedBoxVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_UpdateYouPlacedBoxVisibility, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'EliminatedOverlay_C_UpdateYouPlacedBoxVisibility::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_UpdateYouPlacedBoxVisibility, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'EliminatedOverlay_C_UpdateYouPlacedBoxVisibility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_UpdateYouPlacedBoxVisibility, K2Node_Select_Default) == 0x000006, "Member 'EliminatedOverlay_C_UpdateYouPlacedBoxVisibility::K2Node_Select_Default' has a wrong offset!");

// Function EliminatedOverlay.EliminatedOverlay_C.OnKillFeedUpdated
// 0x0020 (0x0020 - 0x0000)
struct EliminatedOverlay_C_OnKillFeedUpdated final
{
public:
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0000(0x0008)(NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AnySquadMembersStillAlive_AnyAlive;       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EliminatedOverlay_C_OnKillFeedUpdated) == 0x000008, "Wrong alignment on EliminatedOverlay_C_OnKillFeedUpdated");
static_assert(sizeof(EliminatedOverlay_C_OnKillFeedUpdated) == 0x000020, "Wrong size on EliminatedOverlay_C_OnKillFeedUpdated");
static_assert(offsetof(EliminatedOverlay_C_OnKillFeedUpdated, CallFunc_K2_SetTimer_ReturnValue) == 0x000000, "Member 'EliminatedOverlay_C_OnKillFeedUpdated::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_OnKillFeedUpdated, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'EliminatedOverlay_C_OnKillFeedUpdated::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_OnKillFeedUpdated, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000010, "Member 'EliminatedOverlay_C_OnKillFeedUpdated::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_OnKillFeedUpdated, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'EliminatedOverlay_C_OnKillFeedUpdated::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_OnKillFeedUpdated, CallFunc_AnySquadMembersStillAlive_AnyAlive) == 0x000019, "Member 'EliminatedOverlay_C_OnKillFeedUpdated::CallFunc_AnySquadMembersStillAlive_AnyAlive' has a wrong offset!");

// Function EliminatedOverlay.EliminatedOverlay_C.AnySquadMembersStillAlive
// 0x0040 (0x0040 - 0x0000)
struct EliminatedOverlay_C_AnySquadMembersStillAlive final
{
public:
	class AFortPlayerControllerAthena*            Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AnyAlive;                                          // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Any_Alive;                                         // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  CallFunc_GetSquadDead_DeadStates;                  // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EliminatedOverlay_C_AnySquadMembersStillAlive) == 0x000008, "Wrong alignment on EliminatedOverlay_C_AnySquadMembersStillAlive");
static_assert(sizeof(EliminatedOverlay_C_AnySquadMembersStillAlive) == 0x000040, "Wrong size on EliminatedOverlay_C_AnySquadMembersStillAlive");
static_assert(offsetof(EliminatedOverlay_C_AnySquadMembersStillAlive, Player) == 0x000000, "Member 'EliminatedOverlay_C_AnySquadMembersStillAlive::Player' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_AnySquadMembersStillAlive, AnyAlive) == 0x000008, "Member 'EliminatedOverlay_C_AnySquadMembersStillAlive::AnyAlive' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_AnySquadMembersStillAlive, Any_Alive) == 0x000009, "Member 'EliminatedOverlay_C_AnySquadMembersStillAlive::Any_Alive' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_AnySquadMembersStillAlive, CallFunc_GetSquadDead_DeadStates) == 0x000010, "Member 'EliminatedOverlay_C_AnySquadMembersStillAlive::CallFunc_GetSquadDead_DeadStates' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_AnySquadMembersStillAlive, Temp_bool_True_if_break_was_hit_Variable) == 0x000020, "Member 'EliminatedOverlay_C_AnySquadMembersStillAlive::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_AnySquadMembersStillAlive, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'EliminatedOverlay_C_AnySquadMembersStillAlive::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_AnySquadMembersStillAlive, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'EliminatedOverlay_C_AnySquadMembersStillAlive::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_AnySquadMembersStillAlive, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'EliminatedOverlay_C_AnySquadMembersStillAlive::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_AnySquadMembersStillAlive, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'EliminatedOverlay_C_AnySquadMembersStillAlive::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_AnySquadMembersStillAlive, CallFunc_Array_Get_Item) == 0x000034, "Member 'EliminatedOverlay_C_AnySquadMembersStillAlive::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_AnySquadMembersStillAlive, CallFunc_Less_IntInt_ReturnValue) == 0x000035, "Member 'EliminatedOverlay_C_AnySquadMembersStillAlive::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_AnySquadMembersStillAlive, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'EliminatedOverlay_C_AnySquadMembersStillAlive::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_AnySquadMembersStillAlive, CallFunc_BooleanAND_ReturnValue) == 0x00003C, "Member 'EliminatedOverlay_C_AnySquadMembersStillAlive::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function EliminatedOverlay.EliminatedOverlay_C.ProcessDeathReport
// 0x00E0 (0x00E0 - 0x0000)
struct EliminatedOverlay_C_ProcessDeathReport final
{
public:
	struct FFortPlayerDeathReport                 FortPlayerDeathReport;                             // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class AFortPawn*                              KillerPawn;                                        // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DidPlayerKillThemselves;                           // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   KillerName;                                        // 0x0060(0x0018)(Parm, OutParm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0098(0x0018)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue2;               // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue2;           // 0x00C8(0x0018)()
};
static_assert(alignof(EliminatedOverlay_C_ProcessDeathReport) == 0x000008, "Wrong alignment on EliminatedOverlay_C_ProcessDeathReport");
static_assert(sizeof(EliminatedOverlay_C_ProcessDeathReport) == 0x0000E0, "Wrong size on EliminatedOverlay_C_ProcessDeathReport");
static_assert(offsetof(EliminatedOverlay_C_ProcessDeathReport, FortPlayerDeathReport) == 0x000000, "Member 'EliminatedOverlay_C_ProcessDeathReport::FortPlayerDeathReport' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_ProcessDeathReport, KillerPawn) == 0x000050, "Member 'EliminatedOverlay_C_ProcessDeathReport::KillerPawn' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_ProcessDeathReport, DidPlayerKillThemselves) == 0x000058, "Member 'EliminatedOverlay_C_ProcessDeathReport::DidPlayerKillThemselves' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_ProcessDeathReport, KillerName) == 0x000060, "Member 'EliminatedOverlay_C_ProcessDeathReport::KillerName' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_ProcessDeathReport, CallFunc_GetOwningPlayer_ReturnValue) == 0x000078, "Member 'EliminatedOverlay_C_ProcessDeathReport::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_ProcessDeathReport, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'EliminatedOverlay_C_ProcessDeathReport::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_ProcessDeathReport, CallFunc_GetPlayerName_ReturnValue) == 0x000088, "Member 'EliminatedOverlay_C_ProcessDeathReport::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_ProcessDeathReport, CallFunc_Conv_StringToText_ReturnValue) == 0x000098, "Member 'EliminatedOverlay_C_ProcessDeathReport::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_ProcessDeathReport, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000B0, "Member 'EliminatedOverlay_C_ProcessDeathReport::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_ProcessDeathReport, CallFunc_GetPlayerName_ReturnValue2) == 0x0000B8, "Member 'EliminatedOverlay_C_ProcessDeathReport::CallFunc_GetPlayerName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_ProcessDeathReport, CallFunc_Conv_StringToText_ReturnValue2) == 0x0000C8, "Member 'EliminatedOverlay_C_ProcessDeathReport::CallFunc_Conv_StringToText_ReturnValue2' has a wrong offset!");

// Function EliminatedOverlay.EliminatedOverlay_C.SetBannerForKiller
// 0x0060 (0x0060 - 0x0000)
struct EliminatedOverlay_C_SetBannerForKiller final
{
public:
	struct FFortPlayerDeathReport                 FortPlayerDeathReport;                             // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class AFortPlayerStateAthena*                 K2Node_DynamicCast_AsFort_Player_State_Athena;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EliminatedOverlay_C_SetBannerForKiller) == 0x000008, "Wrong alignment on EliminatedOverlay_C_SetBannerForKiller");
static_assert(sizeof(EliminatedOverlay_C_SetBannerForKiller) == 0x000060, "Wrong size on EliminatedOverlay_C_SetBannerForKiller");
static_assert(offsetof(EliminatedOverlay_C_SetBannerForKiller, FortPlayerDeathReport) == 0x000000, "Member 'EliminatedOverlay_C_SetBannerForKiller::FortPlayerDeathReport' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_SetBannerForKiller, K2Node_DynamicCast_AsFort_Player_State_Athena) == 0x000050, "Member 'EliminatedOverlay_C_SetBannerForKiller::K2Node_DynamicCast_AsFort_Player_State_Athena' has a wrong offset!");
static_assert(offsetof(EliminatedOverlay_C_SetBannerForKiller, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'EliminatedOverlay_C_SetBannerForKiller::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

