#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EpicCMSUIFramework

#include "Basic.hpp"


namespace SDK::Params
{

// Function EpicCMSUIFramework.EpicCMSTileCarousel.HandleTilePageAdded
// 0x0008 (0x0008 - 0x0000)
struct EpicCMSTileCarousel_HandleTilePageAdded final
{
public:
	class UWidget*                                TileWidget;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EpicCMSTileCarousel_HandleTilePageAdded) == 0x000008, "Wrong alignment on EpicCMSTileCarousel_HandleTilePageAdded");
static_assert(sizeof(EpicCMSTileCarousel_HandleTilePageAdded) == 0x000008, "Wrong size on EpicCMSTileCarousel_HandleTilePageAdded");
static_assert(offsetof(EpicCMSTileCarousel_HandleTilePageAdded, TileWidget) == 0x000000, "Member 'EpicCMSTileCarousel_HandleTilePageAdded::TileWidget' has a wrong offset!");

// Function EpicCMSUIFramework.EpicCMSTileCarousel.NavigationVisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct EpicCMSTileCarousel_NavigationVisibilityChanged final
{
public:
	bool                                          bShowNavigation;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EpicCMSTileCarousel_NavigationVisibilityChanged) == 0x000001, "Wrong alignment on EpicCMSTileCarousel_NavigationVisibilityChanged");
static_assert(sizeof(EpicCMSTileCarousel_NavigationVisibilityChanged) == 0x000001, "Wrong size on EpicCMSTileCarousel_NavigationVisibilityChanged");
static_assert(offsetof(EpicCMSTileCarousel_NavigationVisibilityChanged, bShowNavigation) == 0x000000, "Member 'EpicCMSTileCarousel_NavigationVisibilityChanged::bShowNavigation' has a wrong offset!");

// Function EpicCMSUIFramework.EpicCMSTileCarousel.SetCurrentPageByIndex
// 0x0004 (0x0004 - 0x0000)
struct EpicCMSTileCarousel_SetCurrentPageByIndex final
{
public:
	int32                                         PageIndex;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EpicCMSTileCarousel_SetCurrentPageByIndex) == 0x000004, "Wrong alignment on EpicCMSTileCarousel_SetCurrentPageByIndex");
static_assert(sizeof(EpicCMSTileCarousel_SetCurrentPageByIndex) == 0x000004, "Wrong size on EpicCMSTileCarousel_SetCurrentPageByIndex");
static_assert(offsetof(EpicCMSTileCarousel_SetCurrentPageByIndex, PageIndex) == 0x000000, "Member 'EpicCMSTileCarousel_SetCurrentPageByIndex::PageIndex' has a wrong offset!");

// Function EpicCMSUIFramework.EpicCMSTileCarousel.GetCurrentPageIndex
// 0x0004 (0x0004 - 0x0000)
struct EpicCMSTileCarousel_GetCurrentPageIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EpicCMSTileCarousel_GetCurrentPageIndex) == 0x000004, "Wrong alignment on EpicCMSTileCarousel_GetCurrentPageIndex");
static_assert(sizeof(EpicCMSTileCarousel_GetCurrentPageIndex) == 0x000004, "Wrong size on EpicCMSTileCarousel_GetCurrentPageIndex");
static_assert(offsetof(EpicCMSTileCarousel_GetCurrentPageIndex, ReturnValue) == 0x000000, "Member 'EpicCMSTileCarousel_GetCurrentPageIndex::ReturnValue' has a wrong offset!");

// Function EpicCMSUIFramework.EpicCMSTileBase.DynamicHandleIconLoadingStateChanged
// 0x0001 (0x0001 - 0x0000)
struct EpicCMSTileBase_DynamicHandleIconLoadingStateChanged final
{
public:
	bool                                          bIsLoading;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EpicCMSTileBase_DynamicHandleIconLoadingStateChanged) == 0x000001, "Wrong alignment on EpicCMSTileBase_DynamicHandleIconLoadingStateChanged");
static_assert(sizeof(EpicCMSTileBase_DynamicHandleIconLoadingStateChanged) == 0x000001, "Wrong size on EpicCMSTileBase_DynamicHandleIconLoadingStateChanged");
static_assert(offsetof(EpicCMSTileBase_DynamicHandleIconLoadingStateChanged, bIsLoading) == 0x000000, "Member 'EpicCMSTileBase_DynamicHandleIconLoadingStateChanged::bIsLoading' has a wrong offset!");

}

