#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ErrorEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ErrorEntry.ErrorEntry_C
// 0x00B0 (0x02C0 - 0x0210)
class UErrorEntry_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UIconTextButton_C*                      IconTextButton;                                    // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MESSAGE;                                           // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	uint8                                         Pad_228[0x8];                                      // 0x0228(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortErrorInfo                         ErrorInfo;                                         // 0x0230(0x0080)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 ErrorUrlBase;                                      // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ErrorEntry(int32 EntryPoint);
	void BndEvt__IconTextButton_K2Node_ComponentBoundEvent_65_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void GetButtonVisibility(ESlateVisibility* NewParam);
	void SetErrorInfo(const struct FFortErrorInfo& Param_ErrorInfo);
	void Center_on_Widget(bool* Did_Center);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ErrorEntry_C">();
	}
	static class UErrorEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UErrorEntry_C>();
	}
};
static_assert(alignof(UErrorEntry_C) == 0x000010, "Wrong alignment on UErrorEntry_C");
static_assert(sizeof(UErrorEntry_C) == 0x0002C0, "Wrong size on UErrorEntry_C");
static_assert(offsetof(UErrorEntry_C, UberGraphFrame) == 0x000210, "Member 'UErrorEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UErrorEntry_C, IconTextButton) == 0x000218, "Member 'UErrorEntry_C::IconTextButton' has a wrong offset!");
static_assert(offsetof(UErrorEntry_C, MESSAGE) == 0x000220, "Member 'UErrorEntry_C::MESSAGE' has a wrong offset!");
static_assert(offsetof(UErrorEntry_C, ErrorInfo) == 0x000230, "Member 'UErrorEntry_C::ErrorInfo' has a wrong offset!");
static_assert(offsetof(UErrorEntry_C, ErrorUrlBase) == 0x0002B0, "Member 'UErrorEntry_C::ErrorUrlBase' has a wrong offset!");

}

