#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Feedback

#include "Basic.hpp"


namespace SDK::Params
{

// Function Feedback.Feedback_C.ExecuteUbergraph_Feedback
// 0x0078 (0x0078 - 0x0000)
struct Feedback_C_ExecuteUbergraph_Feedback final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button4;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button3;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Text;                           // 0x0018(0x0018)(ConstParm)
	bool                                          CallFunc_IsAllTextNotEmpty_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAllTextNotEmpty_ReturnValue2;           // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTextButton_C*                      K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue2;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Selected2;              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSelected_ReturnValue3;                 // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSelected_ReturnValue4;                 // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Selected;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSelected_ReturnValue5;                 // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Feedback_C_ExecuteUbergraph_Feedback) == 0x000008, "Wrong alignment on Feedback_C_ExecuteUbergraph_Feedback");
static_assert(sizeof(Feedback_C_ExecuteUbergraph_Feedback) == 0x000078, "Wrong size on Feedback_C_ExecuteUbergraph_Feedback");
static_assert(offsetof(Feedback_C_ExecuteUbergraph_Feedback, EntryPoint) == 0x000000, "Member 'Feedback_C_ExecuteUbergraph_Feedback::EntryPoint' has a wrong offset!");
static_assert(offsetof(Feedback_C_ExecuteUbergraph_Feedback, Temp_bool_Variable) == 0x000004, "Member 'Feedback_C_ExecuteUbergraph_Feedback::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Feedback_C_ExecuteUbergraph_Feedback, K2Node_ComponentBoundEvent_Button4) == 0x000008, "Member 'Feedback_C_ExecuteUbergraph_Feedback::K2Node_ComponentBoundEvent_Button4' has a wrong offset!");
static_assert(offsetof(Feedback_C_ExecuteUbergraph_Feedback, K2Node_ComponentBoundEvent_Button3) == 0x000010, "Member 'Feedback_C_ExecuteUbergraph_Feedback::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(Feedback_C_ExecuteUbergraph_Feedback, K2Node_CustomEvent_Text) == 0x000018, "Member 'Feedback_C_ExecuteUbergraph_Feedback::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(Feedback_C_ExecuteUbergraph_Feedback, CallFunc_IsAllTextNotEmpty_ReturnValue) == 0x000030, "Member 'Feedback_C_ExecuteUbergraph_Feedback::CallFunc_IsAllTextNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Feedback_C_ExecuteUbergraph_Feedback, CallFunc_IsAllTextNotEmpty_ReturnValue2) == 0x000031, "Member 'Feedback_C_ExecuteUbergraph_Feedback::CallFunc_IsAllTextNotEmpty_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Feedback_C_ExecuteUbergraph_Feedback, CallFunc_GetUINavigationManager_ReturnValue) == 0x000038, "Member 'Feedback_C_ExecuteUbergraph_Feedback::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Feedback_C_ExecuteUbergraph_Feedback, CallFunc_GetSelected_ReturnValue) == 0x000040, "Member 'Feedback_C_ExecuteUbergraph_Feedback::CallFunc_GetSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(Feedback_C_ExecuteUbergraph_Feedback, K2Node_Select_Default) == 0x000048, "Member 'Feedback_C_ExecuteUbergraph_Feedback::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Feedback_C_ExecuteUbergraph_Feedback, CallFunc_GetSelected_ReturnValue2) == 0x000050, "Member 'Feedback_C_ExecuteUbergraph_Feedback::CallFunc_GetSelected_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Feedback_C_ExecuteUbergraph_Feedback, K2Node_ComponentBoundEvent_Button2) == 0x000058, "Member 'Feedback_C_ExecuteUbergraph_Feedback::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(Feedback_C_ExecuteUbergraph_Feedback, K2Node_ComponentBoundEvent_Selected2) == 0x000060, "Member 'Feedback_C_ExecuteUbergraph_Feedback::K2Node_ComponentBoundEvent_Selected2' has a wrong offset!");
static_assert(offsetof(Feedback_C_ExecuteUbergraph_Feedback, CallFunc_GetSelected_ReturnValue3) == 0x000061, "Member 'Feedback_C_ExecuteUbergraph_Feedback::CallFunc_GetSelected_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Feedback_C_ExecuteUbergraph_Feedback, CallFunc_GetSelected_ReturnValue4) == 0x000062, "Member 'Feedback_C_ExecuteUbergraph_Feedback::CallFunc_GetSelected_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Feedback_C_ExecuteUbergraph_Feedback, K2Node_ComponentBoundEvent_Button) == 0x000068, "Member 'Feedback_C_ExecuteUbergraph_Feedback::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(Feedback_C_ExecuteUbergraph_Feedback, K2Node_ComponentBoundEvent_Selected) == 0x000070, "Member 'Feedback_C_ExecuteUbergraph_Feedback::K2Node_ComponentBoundEvent_Selected' has a wrong offset!");
static_assert(offsetof(Feedback_C_ExecuteUbergraph_Feedback, CallFunc_GetSelected_ReturnValue5) == 0x000071, "Member 'Feedback_C_ExecuteUbergraph_Feedback::CallFunc_GetSelected_ReturnValue5' has a wrong offset!");

// Function Feedback.Feedback_C.BndEvt__PopulateName_Killer_Button_K2Node_ComponentBoundEvent_664_CommonSelectedStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Feedback_C_BndEvt__PopulateName_Killer_Button_K2Node_ComponentBoundEvent_664_CommonSelectedStateChanged__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Feedback_C_BndEvt__PopulateName_Killer_Button_K2Node_ComponentBoundEvent_664_CommonSelectedStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on Feedback_C_BndEvt__PopulateName_Killer_Button_K2Node_ComponentBoundEvent_664_CommonSelectedStateChanged__DelegateSignature");
static_assert(sizeof(Feedback_C_BndEvt__PopulateName_Killer_Button_K2Node_ComponentBoundEvent_664_CommonSelectedStateChanged__DelegateSignature) == 0x000010, "Wrong size on Feedback_C_BndEvt__PopulateName_Killer_Button_K2Node_ComponentBoundEvent_664_CommonSelectedStateChanged__DelegateSignature");
static_assert(offsetof(Feedback_C_BndEvt__PopulateName_Killer_Button_K2Node_ComponentBoundEvent_664_CommonSelectedStateChanged__DelegateSignature, Button) == 0x000000, "Member 'Feedback_C_BndEvt__PopulateName_Killer_Button_K2Node_ComponentBoundEvent_664_CommonSelectedStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(Feedback_C_BndEvt__PopulateName_Killer_Button_K2Node_ComponentBoundEvent_664_CommonSelectedStateChanged__DelegateSignature, Selected) == 0x000008, "Member 'Feedback_C_BndEvt__PopulateName_Killer_Button_K2Node_ComponentBoundEvent_664_CommonSelectedStateChanged__DelegateSignature::Selected' has a wrong offset!");

// Function Feedback.Feedback_C.BndEvt__PopulateName_Spectator_Button_K2Node_ComponentBoundEvent_629_CommonSelectedStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Feedback_C_BndEvt__PopulateName_Spectator_Button_K2Node_ComponentBoundEvent_629_CommonSelectedStateChanged__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Feedback_C_BndEvt__PopulateName_Spectator_Button_K2Node_ComponentBoundEvent_629_CommonSelectedStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on Feedback_C_BndEvt__PopulateName_Spectator_Button_K2Node_ComponentBoundEvent_629_CommonSelectedStateChanged__DelegateSignature");
static_assert(sizeof(Feedback_C_BndEvt__PopulateName_Spectator_Button_K2Node_ComponentBoundEvent_629_CommonSelectedStateChanged__DelegateSignature) == 0x000010, "Wrong size on Feedback_C_BndEvt__PopulateName_Spectator_Button_K2Node_ComponentBoundEvent_629_CommonSelectedStateChanged__DelegateSignature");
static_assert(offsetof(Feedback_C_BndEvt__PopulateName_Spectator_Button_K2Node_ComponentBoundEvent_629_CommonSelectedStateChanged__DelegateSignature, Button) == 0x000000, "Member 'Feedback_C_BndEvt__PopulateName_Spectator_Button_K2Node_ComponentBoundEvent_629_CommonSelectedStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(Feedback_C_BndEvt__PopulateName_Spectator_Button_K2Node_ComponentBoundEvent_629_CommonSelectedStateChanged__DelegateSignature, Selected) == 0x000008, "Member 'Feedback_C_BndEvt__PopulateName_Spectator_Button_K2Node_ComponentBoundEvent_629_CommonSelectedStateChanged__DelegateSignature::Selected' has a wrong offset!");

// Function Feedback.Feedback_C.HandleTextChanged
// 0x0018 (0x0018 - 0x0000)
struct Feedback_C_HandleTextChanged final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Feedback_C_HandleTextChanged) == 0x000008, "Wrong alignment on Feedback_C_HandleTextChanged");
static_assert(sizeof(Feedback_C_HandleTextChanged) == 0x000018, "Wrong size on Feedback_C_HandleTextChanged");
static_assert(offsetof(Feedback_C_HandleTextChanged, Text) == 0x000000, "Member 'Feedback_C_HandleTextChanged::Text' has a wrong offset!");

// Function Feedback.Feedback_C.BndEvt__SendButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Feedback_C_BndEvt__SendButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Feedback_C_BndEvt__SendButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on Feedback_C_BndEvt__SendButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(Feedback_C_BndEvt__SendButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on Feedback_C_BndEvt__SendButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(Feedback_C_BndEvt__SendButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'Feedback_C_BndEvt__SendButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function Feedback.Feedback_C.BndEvt__CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Feedback_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Feedback_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on Feedback_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(Feedback_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on Feedback_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(Feedback_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'Feedback_C_BndEvt__CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function Feedback.Feedback_C.BindDelegates
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) Feedback_C_BindDelegates final
{
public:
	TDelegate<void(class FText& Text)>            K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FText& Text)>            K2Node_CreateDelegate_OutputDelegate2;             // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(Feedback_C_BindDelegates) == 0x000008, "Wrong alignment on Feedback_C_BindDelegates");
static_assert(sizeof(Feedback_C_BindDelegates) == 0x000020, "Wrong size on Feedback_C_BindDelegates");
static_assert(offsetof(Feedback_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'Feedback_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Feedback_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate2) == 0x000010, "Member 'Feedback_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");

// Function Feedback.Feedback_C.IsAllTextNotEmpty
// 0x0040 (0x0040 - 0x0000)
struct Feedback_C_IsAllTextNotEmpty final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue2;                     // 0x0020(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue2;                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Feedback_C_IsAllTextNotEmpty) == 0x000008, "Wrong alignment on Feedback_C_IsAllTextNotEmpty");
static_assert(sizeof(Feedback_C_IsAllTextNotEmpty) == 0x000040, "Wrong size on Feedback_C_IsAllTextNotEmpty");
static_assert(offsetof(Feedback_C_IsAllTextNotEmpty, ReturnValue) == 0x000000, "Member 'Feedback_C_IsAllTextNotEmpty::ReturnValue' has a wrong offset!");
static_assert(offsetof(Feedback_C_IsAllTextNotEmpty, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'Feedback_C_IsAllTextNotEmpty::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Feedback_C_IsAllTextNotEmpty, CallFunc_GetText_ReturnValue2) == 0x000020, "Member 'Feedback_C_IsAllTextNotEmpty::CallFunc_GetText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Feedback_C_IsAllTextNotEmpty, CallFunc_TextIsEmpty_ReturnValue) == 0x000038, "Member 'Feedback_C_IsAllTextNotEmpty::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Feedback_C_IsAllTextNotEmpty, CallFunc_TextIsEmpty_ReturnValue2) == 0x000039, "Member 'Feedback_C_IsAllTextNotEmpty::CallFunc_TextIsEmpty_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Feedback_C_IsAllTextNotEmpty, CallFunc_Not_PreBool_ReturnValue) == 0x00003A, "Member 'Feedback_C_IsAllTextNotEmpty::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Feedback_C_IsAllTextNotEmpty, CallFunc_Not_PreBool_ReturnValue2) == 0x00003B, "Member 'Feedback_C_IsAllTextNotEmpty::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Feedback_C_IsAllTextNotEmpty, CallFunc_BooleanAND_ReturnValue) == 0x00003C, "Member 'Feedback_C_IsAllTextNotEmpty::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function Feedback.Feedback_C.Setup For Reporting Player
// 0x0020 (0x0020 - 0x0000)
struct Feedback_C_Setup_For_Reporting_Player final
{
public:
	class FText                                   PlayerName;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Feedback_C_Setup_For_Reporting_Player) == 0x000008, "Wrong alignment on Feedback_C_Setup_For_Reporting_Player");
static_assert(sizeof(Feedback_C_Setup_For_Reporting_Player) == 0x000020, "Wrong size on Feedback_C_Setup_For_Reporting_Player");
static_assert(offsetof(Feedback_C_Setup_For_Reporting_Player, PlayerName) == 0x000000, "Member 'Feedback_C_Setup_For_Reporting_Player::PlayerName' has a wrong offset!");
static_assert(offsetof(Feedback_C_Setup_For_Reporting_Player, CallFunc_TextIsEmpty_ReturnValue) == 0x000018, "Member 'Feedback_C_Setup_For_Reporting_Player::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");

// Function Feedback.Feedback_C.SetupAutoFillPlayerFields
// 0x0038 (0x0038 - 0x0000)
struct Feedback_C_SetupAutoFillPlayerFields final
{
public:
	class FText                                   Param_KillersName;                                 // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Param_SpectatingName;                              // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue2;                 // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Feedback_C_SetupAutoFillPlayerFields) == 0x000008, "Wrong alignment on Feedback_C_SetupAutoFillPlayerFields");
static_assert(sizeof(Feedback_C_SetupAutoFillPlayerFields) == 0x000038, "Wrong size on Feedback_C_SetupAutoFillPlayerFields");
static_assert(offsetof(Feedback_C_SetupAutoFillPlayerFields, Param_KillersName) == 0x000000, "Member 'Feedback_C_SetupAutoFillPlayerFields::Param_KillersName' has a wrong offset!");
static_assert(offsetof(Feedback_C_SetupAutoFillPlayerFields, Param_SpectatingName) == 0x000018, "Member 'Feedback_C_SetupAutoFillPlayerFields::Param_SpectatingName' has a wrong offset!");
static_assert(offsetof(Feedback_C_SetupAutoFillPlayerFields, CallFunc_TextIsEmpty_ReturnValue) == 0x000030, "Member 'Feedback_C_SetupAutoFillPlayerFields::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Feedback_C_SetupAutoFillPlayerFields, CallFunc_Not_PreBool_ReturnValue) == 0x000031, "Member 'Feedback_C_SetupAutoFillPlayerFields::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Feedback_C_SetupAutoFillPlayerFields, CallFunc_TextIsEmpty_ReturnValue2) == 0x000032, "Member 'Feedback_C_SetupAutoFillPlayerFields::CallFunc_TextIsEmpty_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Feedback_C_SetupAutoFillPlayerFields, CallFunc_Not_PreBool_ReturnValue2) == 0x000033, "Member 'Feedback_C_SetupAutoFillPlayerFields::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");

}

