#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteUI

#include "Basic.hpp"

#include "BlueprintContext_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "SocialTypes_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CommonUI_structs.hpp"
#include "CommonUI_classes.hpp"
#include "EpicCMSUIFramework_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "Slate_structs.hpp"
#include "Party_structs.hpp"


namespace SDK
{

// Class FortniteUI.FortSquadSlotsView
// 0x0088 (0x0298 - 0x0210)
class UFortSquadSlotsView : public UCommonUserWidget
{
public:
	uint8                                         Pad_210[0x10];                                     // 0x0210(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnDifferentSquadSlotSelectedEvent;                 // 0x0220(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnRequestOpenSquadSlotEvent;                       // 0x0230(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         IndexOfSelectedSquadSlot;                          // 0x0240(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSlotButtonsRequireSelection;                      // 0x0244(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInPreviewMode;                                    // 0x0245(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_246[0x2];                                      // 0x0246(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCommittableButtonGroup*            SquadSlotButtonGroup;                              // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_250[0x30];                                     // 0x0250(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortItemViewContextInterface> ItemViewContext;                                   // 0x0280(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_290[0x8];                                      // 0x0290(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UFortSquadSlotSelectorButton* CreateAndAddSquadSlotButton(const int32 SquadSlotIndex, const struct FHomebaseSquadSlot& SquadSlotDefinition, class UWidget** OutSquadSlotButtonHost);
	void HandleButtonClicked(class UCommonButton* CommittedButton, int32 ButtonIndex);
	void HandleHoveredButtonChanged(class UCommonButton* HoveredButton, int32 ButtonIndex);
	void HandleSelectedButtonChanged(class UCommonButton* SelectedButton, int32 ButtonIndex);
	void OnDifferentSquadSlotSelected__DelegateSignature(int32 SquadSlotIndex);
	void OnRequestOpenSquadSlot__DelegateSignature(int32 SquadSlotIndex);
	void SelectSlot(int32 SquadSlotIndex);
	void SetIdOfSquadToManageBP(const class FName& SquadId);
	void SetInPreviewMode(const bool bPreview);
	void SetIsSelectionLocked(const bool ShouldSelectionBeLocked);

	class FName GetIdOfSquadToManageBP() const;
	int32 GetIndexOfSelectedSquadSlot() const;
	bool TryGetStaticSquadDataBP(struct FHomebaseSquad* OutSquadData) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSquadSlotsView">();
	}
	static class UFortSquadSlotsView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSquadSlotsView>();
	}
};
static_assert(alignof(UFortSquadSlotsView) == 0x000008, "Wrong alignment on UFortSquadSlotsView");
static_assert(sizeof(UFortSquadSlotsView) == 0x000298, "Wrong size on UFortSquadSlotsView");
static_assert(offsetof(UFortSquadSlotsView, OnDifferentSquadSlotSelectedEvent) == 0x000220, "Member 'UFortSquadSlotsView::OnDifferentSquadSlotSelectedEvent' has a wrong offset!");
static_assert(offsetof(UFortSquadSlotsView, OnRequestOpenSquadSlotEvent) == 0x000230, "Member 'UFortSquadSlotsView::OnRequestOpenSquadSlotEvent' has a wrong offset!");
static_assert(offsetof(UFortSquadSlotsView, IndexOfSelectedSquadSlot) == 0x000240, "Member 'UFortSquadSlotsView::IndexOfSelectedSquadSlot' has a wrong offset!");
static_assert(offsetof(UFortSquadSlotsView, bSlotButtonsRequireSelection) == 0x000244, "Member 'UFortSquadSlotsView::bSlotButtonsRequireSelection' has a wrong offset!");
static_assert(offsetof(UFortSquadSlotsView, bInPreviewMode) == 0x000245, "Member 'UFortSquadSlotsView::bInPreviewMode' has a wrong offset!");
static_assert(offsetof(UFortSquadSlotsView, SquadSlotButtonGroup) == 0x000248, "Member 'UFortSquadSlotsView::SquadSlotButtonGroup' has a wrong offset!");
static_assert(offsetof(UFortSquadSlotsView, ItemViewContext) == 0x000280, "Member 'UFortSquadSlotsView::ItemViewContext' has a wrong offset!");

// Class FortniteUI.FortItemPickerBase
// 0x0068 (0x0278 - 0x0210)
class UFortItemPickerBase : public UCommonUserWidget
{
public:
	UMulticastDelegateProperty_                   OnSelectionChangedEvent;                           // 0x0210(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnSelectionCommittedEvent;                         // 0x0220(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnItemHoveredEvent;                                // 0x0230(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnItemUnhovered;                                   // 0x0240(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UFortItemTileView*                      PickerTileView;                                    // 0x0250(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bConfirmSelectionIfAlreadySelectedAfterOneClick;   // 0x0258(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                NewlySelectedItem;                                 // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TScriptInterface<class IFortItemViewContextInterface> ItemViewContext;                                   // 0x0268(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	bool CanItemBeComitted(const class UFortItem* ItemToCommit);
	void CenterSelectedItemTileWidget();
	void ClearSelection();
	void HandlePickerItemClicked(const class UObject* ObjectOfClickedTile);
	void HandlePickerItemDoubleClicked(const class UObject* ObjectOfClickedTile);
	void HandlePickerItemHovered(const class UObject* ObjectOfHoveredTile);
	void HandlePickerItemSelected(const class UObject* ObjectWhoseSelectionChanged, bool bIsSelected);
	void HandlePickerTileCreated(class UUserWidget* Widget);
	void HandlePickerTileDestroyed(class UUserWidget* Widget);
	void OnItemSelectionEvent__DelegateSignature(class UFortItem* SelectedItem);
	bool SetSelectedIndex(int32 Param_Index);
	void SetSelectedItem(const class UFortItem* ItemToSelect);
	bool TryCommitSelectedItem();

	int32 GetIndexForItem(class UObject* Item) const;
	class UFortItem* GetSelectedItem() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemPickerBase">();
	}
	static class UFortItemPickerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemPickerBase>();
	}
};
static_assert(alignof(UFortItemPickerBase) == 0x000008, "Wrong alignment on UFortItemPickerBase");
static_assert(sizeof(UFortItemPickerBase) == 0x000278, "Wrong size on UFortItemPickerBase");
static_assert(offsetof(UFortItemPickerBase, OnSelectionChangedEvent) == 0x000210, "Member 'UFortItemPickerBase::OnSelectionChangedEvent' has a wrong offset!");
static_assert(offsetof(UFortItemPickerBase, OnSelectionCommittedEvent) == 0x000220, "Member 'UFortItemPickerBase::OnSelectionCommittedEvent' has a wrong offset!");
static_assert(offsetof(UFortItemPickerBase, OnItemHoveredEvent) == 0x000230, "Member 'UFortItemPickerBase::OnItemHoveredEvent' has a wrong offset!");
static_assert(offsetof(UFortItemPickerBase, OnItemUnhovered) == 0x000240, "Member 'UFortItemPickerBase::OnItemUnhovered' has a wrong offset!");
static_assert(offsetof(UFortItemPickerBase, PickerTileView) == 0x000250, "Member 'UFortItemPickerBase::PickerTileView' has a wrong offset!");
static_assert(offsetof(UFortItemPickerBase, bConfirmSelectionIfAlreadySelectedAfterOneClick) == 0x000258, "Member 'UFortItemPickerBase::bConfirmSelectionIfAlreadySelectedAfterOneClick' has a wrong offset!");
static_assert(offsetof(UFortItemPickerBase, NewlySelectedItem) == 0x000260, "Member 'UFortItemPickerBase::NewlySelectedItem' has a wrong offset!");
static_assert(offsetof(UFortItemPickerBase, ItemViewContext) == 0x000268, "Member 'UFortItemPickerBase::ItemViewContext' has a wrong offset!");

// Class FortniteUI.FortAsyncAction_ShowConfirmation
// 0x0188 (0x01B0 - 0x0028)
class UFortAsyncAction_ShowConfirmation final : public UBlueprintAsyncActionBase
{
public:
	UMulticastDelegateProperty_                   OnConfirmed;                                       // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnDeclined;                                        // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnTimedOut;                                        // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0058(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFortDialogDescription                 Description;                                       // 0x0060(0x0150)(ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UFortAsyncAction_ShowConfirmation* ShowConfirmationDialog(class UObject* InWorldContextObject, const class FText& Title, const class FText& MESSAGE, const class FText& ConfirmButtonText, const class FText& DeclineButtonText, class UFortUserWidget* InAdditionalContent, float InDisplayTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAsyncAction_ShowConfirmation">();
	}
	static class UFortAsyncAction_ShowConfirmation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAsyncAction_ShowConfirmation>();
	}
};
static_assert(alignof(UFortAsyncAction_ShowConfirmation) == 0x000010, "Wrong alignment on UFortAsyncAction_ShowConfirmation");
static_assert(sizeof(UFortAsyncAction_ShowConfirmation) == 0x0001B0, "Wrong size on UFortAsyncAction_ShowConfirmation");
static_assert(offsetof(UFortAsyncAction_ShowConfirmation, OnConfirmed) == 0x000028, "Member 'UFortAsyncAction_ShowConfirmation::OnConfirmed' has a wrong offset!");
static_assert(offsetof(UFortAsyncAction_ShowConfirmation, OnDeclined) == 0x000038, "Member 'UFortAsyncAction_ShowConfirmation::OnDeclined' has a wrong offset!");
static_assert(offsetof(UFortAsyncAction_ShowConfirmation, OnTimedOut) == 0x000048, "Member 'UFortAsyncAction_ShowConfirmation::OnTimedOut' has a wrong offset!");
static_assert(offsetof(UFortAsyncAction_ShowConfirmation, WorldContextObject) == 0x000058, "Member 'UFortAsyncAction_ShowConfirmation::WorldContextObject' has a wrong offset!");
static_assert(offsetof(UFortAsyncAction_ShowConfirmation, Description) == 0x000060, "Member 'UFortAsyncAction_ShowConfirmation::Description' has a wrong offset!");

// Class FortniteUI.FortUIStateWidget_NUI
// 0x0020 (0x03E0 - 0x03C0)
class UFortUIStateWidget_NUI : public UCommonActivatablePanel
{
public:
	uint8                                         Pad_3C0[0x8];                                      // 0x03C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FContentPushState>              StackStates;                                       // 0x03C8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3D8[0x8];                                      // 0x03D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnEnterState(EFortUIState PreviousUIState);
	void OnExitState(EFortUIState NextUIState);
	void OnFrontEndVisibilityUpdated(bool bHideHeader, bool bHideFooter, bool bHideChatWidget);
	void PopAllContentWidgets();
	class UWidget* PopContentWidget();
	class UWidget* PopContentWidgetInternal(const struct FContentPushState& State);
	void PushContentWidget(class UWidget* Widget);
	void PushContentWidgetAdvanced(class UWidget* Widget, bool bHideHeader, bool bHideFooter, bool bHideChatWidget);
	void PushContentWidgetInternal(class UWidget* Widget, const struct FContentPushState& State);
	void SetFrontEndVisibility(bool bHideHeader, bool bHideFooter, bool bHideChatWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIStateWidget_NUI">();
	}
	static class UFortUIStateWidget_NUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIStateWidget_NUI>();
	}
};
static_assert(alignof(UFortUIStateWidget_NUI) == 0x000008, "Wrong alignment on UFortUIStateWidget_NUI");
static_assert(sizeof(UFortUIStateWidget_NUI) == 0x0003E0, "Wrong size on UFortUIStateWidget_NUI");
static_assert(offsetof(UFortUIStateWidget_NUI, StackStates) == 0x0003C8, "Member 'UFortUIStateWidget_NUI::StackStates' has a wrong offset!");

// Class FortniteUI.FortUIStateWidget_Frontend
// 0x0000 (0x03E0 - 0x03E0)
class UFortUIStateWidget_Frontend : public UFortUIStateWidget_NUI
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIStateWidget_Frontend">();
	}
	static class UFortUIStateWidget_Frontend* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIStateWidget_Frontend>();
	}
};
static_assert(alignof(UFortUIStateWidget_Frontend) == 0x000008, "Wrong alignment on UFortUIStateWidget_Frontend");
static_assert(sizeof(UFortUIStateWidget_Frontend) == 0x0003E0, "Wrong size on UFortUIStateWidget_Frontend");

// Class FortniteUI.AthenaAccountContext
// 0x0000 (0x0028 - 0x0028)
class UAthenaAccountContext final : public UBlueprintContextBase
{
public:
	void GetBattleBookPurchaseLimit(int32* MaxNumLevelsPossibleToPurchase, int32* BonusLevelsGranted);
	void SimulateBattleBookPurchase(int32 NumLevelsToPurchase, int32* BonusLevelsGranted, bool* bOverLimit);

	class FText GetCurrentSeasonName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaAccountContext">();
	}
	static class UAthenaAccountContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAccountContext>();
	}
};
static_assert(alignof(UAthenaAccountContext) == 0x000008, "Wrong alignment on UAthenaAccountContext");
static_assert(sizeof(UAthenaAccountContext) == 0x000028, "Wrong size on UAthenaAccountContext");

// Class FortniteUI.FortItemTileButton
// 0x0030 (0x07B0 - 0x0780)
class UFortItemTileButton : public UCommonButton
{
public:
	uint8                                         Pad_780[0x8];                                      // 0x0780(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMultiSizeItemCard*                 ItemWidget;                                        // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortItem>               Item;                                              // 0x0790(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFortItemCardSize                             ItemCardSize;                                      // 0x0798(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsRewardCard;                                      // 0x0799(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_79A[0x6];                                      // 0x079A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortItemViewContextInterface> ItemViewContext;                                   // 0x07A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemTileButton">();
	}
	static class UFortItemTileButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemTileButton>();
	}
};
static_assert(alignof(UFortItemTileButton) == 0x000008, "Wrong alignment on UFortItemTileButton");
static_assert(sizeof(UFortItemTileButton) == 0x0007B0, "Wrong size on UFortItemTileButton");
static_assert(offsetof(UFortItemTileButton, ItemWidget) == 0x000788, "Member 'UFortItemTileButton::ItemWidget' has a wrong offset!");
static_assert(offsetof(UFortItemTileButton, Item) == 0x000790, "Member 'UFortItemTileButton::Item' has a wrong offset!");
static_assert(offsetof(UFortItemTileButton, ItemCardSize) == 0x000798, "Member 'UFortItemTileButton::ItemCardSize' has a wrong offset!");
static_assert(offsetof(UFortItemTileButton, IsRewardCard) == 0x000799, "Member 'UFortItemTileButton::IsRewardCard' has a wrong offset!");
static_assert(offsetof(UFortItemTileButton, ItemViewContext) == 0x0007A0, "Member 'UFortItemTileButton::ItemViewContext' has a wrong offset!");

// Class FortniteUI.FortAthenaMatchmakingWidget
// 0x00E8 (0x02F8 - 0x0210)
class UFortAthenaMatchmakingWidget : public UCommonUserWidget
{
public:
	TSubclassOf<class UFortMissionGenerator>      MissionGen;                                        // 0x0210(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMissionGenerator>      DuoMissionGen;                                     // 0x0218(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMissionGenerator>      SquadMissionGen;                                   // 0x0220(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMissionGenerator>      FiftyFiftyMissionGen;                              // 0x0228(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMissionGenerator>      Event1MissionGen;                                  // 0x0230(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMissionGenerator>      Event2MissionGen;                                  // 0x0238(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMissionGenerator>      Event3MissionGen;                                  // 0x0240(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMissionGenerator>      Event4MissionGen;                                  // 0x0248(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMissionGenerator>      Event5MissionGen;                                  // 0x0250(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMissionGenerator>      Event6MissionGen;                                  // 0x0258(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMissionGenerator>      Event7MissionGen;                                  // 0x0260(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMissionGenerator>      Event8MissionGen;                                  // 0x0268(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortAthenaPlaylist                           CurrentPlaylist;                                   // 0x0270(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCurrentSquadFill;                                 // 0x0271(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_272[0x6];                                      // 0x0272(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                SpinnerAndTextContainer;                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                          PlayButton;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                          CancelButton;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       MatchmakingHeaderText;                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       MatchmakingMessageText;                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRotator*                         PlaylistRotator;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRotator*                         TeamFillRotator;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHorizontalBox*                         TeamFillRow;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B8[0x40];                                     // 0x02B8(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<EFortAthenaPlaylist> GetActivePlaylists();
	void OnAvailablePlaylistsUpdated();
	void OnCancelButtonPressed();
	void OnChangeTeamFillChanged(bool bFill);
	void OnPlayButtonPressed();
	void OnPlayButtonUpdated(bool bShowPlayButton);
	void OnPlaylistRotatorChanged(int32 PlaylistIndex);
	void RefreshBang();
	void SetCancelButtonState(bool bIsMatchmaking);
	bool SetCurrentPlaylist(EFortAthenaPlaylist NewPlaylist);
	void SetPlayButtonState(bool bCanMatchmake);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMatchmakingWidget">();
	}
	static class UFortAthenaMatchmakingWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaMatchmakingWidget>();
	}
};
static_assert(alignof(UFortAthenaMatchmakingWidget) == 0x000008, "Wrong alignment on UFortAthenaMatchmakingWidget");
static_assert(sizeof(UFortAthenaMatchmakingWidget) == 0x0002F8, "Wrong size on UFortAthenaMatchmakingWidget");
static_assert(offsetof(UFortAthenaMatchmakingWidget, MissionGen) == 0x000210, "Member 'UFortAthenaMatchmakingWidget::MissionGen' has a wrong offset!");
static_assert(offsetof(UFortAthenaMatchmakingWidget, DuoMissionGen) == 0x000218, "Member 'UFortAthenaMatchmakingWidget::DuoMissionGen' has a wrong offset!");
static_assert(offsetof(UFortAthenaMatchmakingWidget, SquadMissionGen) == 0x000220, "Member 'UFortAthenaMatchmakingWidget::SquadMissionGen' has a wrong offset!");
static_assert(offsetof(UFortAthenaMatchmakingWidget, FiftyFiftyMissionGen) == 0x000228, "Member 'UFortAthenaMatchmakingWidget::FiftyFiftyMissionGen' has a wrong offset!");
static_assert(offsetof(UFortAthenaMatchmakingWidget, Event1MissionGen) == 0x000230, "Member 'UFortAthenaMatchmakingWidget::Event1MissionGen' has a wrong offset!");
static_assert(offsetof(UFortAthenaMatchmakingWidget, Event2MissionGen) == 0x000238, "Member 'UFortAthenaMatchmakingWidget::Event2MissionGen' has a wrong offset!");
static_assert(offsetof(UFortAthenaMatchmakingWidget, Event3MissionGen) == 0x000240, "Member 'UFortAthenaMatchmakingWidget::Event3MissionGen' has a wrong offset!");
static_assert(offsetof(UFortAthenaMatchmakingWidget, Event4MissionGen) == 0x000248, "Member 'UFortAthenaMatchmakingWidget::Event4MissionGen' has a wrong offset!");
static_assert(offsetof(UFortAthenaMatchmakingWidget, Event5MissionGen) == 0x000250, "Member 'UFortAthenaMatchmakingWidget::Event5MissionGen' has a wrong offset!");
static_assert(offsetof(UFortAthenaMatchmakingWidget, Event6MissionGen) == 0x000258, "Member 'UFortAthenaMatchmakingWidget::Event6MissionGen' has a wrong offset!");
static_assert(offsetof(UFortAthenaMatchmakingWidget, Event7MissionGen) == 0x000260, "Member 'UFortAthenaMatchmakingWidget::Event7MissionGen' has a wrong offset!");
static_assert(offsetof(UFortAthenaMatchmakingWidget, Event8MissionGen) == 0x000268, "Member 'UFortAthenaMatchmakingWidget::Event8MissionGen' has a wrong offset!");
static_assert(offsetof(UFortAthenaMatchmakingWidget, CurrentPlaylist) == 0x000270, "Member 'UFortAthenaMatchmakingWidget::CurrentPlaylist' has a wrong offset!");
static_assert(offsetof(UFortAthenaMatchmakingWidget, bCurrentSquadFill) == 0x000271, "Member 'UFortAthenaMatchmakingWidget::bCurrentSquadFill' has a wrong offset!");
static_assert(offsetof(UFortAthenaMatchmakingWidget, SpinnerAndTextContainer) == 0x000278, "Member 'UFortAthenaMatchmakingWidget::SpinnerAndTextContainer' has a wrong offset!");
static_assert(offsetof(UFortAthenaMatchmakingWidget, PlayButton) == 0x000280, "Member 'UFortAthenaMatchmakingWidget::PlayButton' has a wrong offset!");
static_assert(offsetof(UFortAthenaMatchmakingWidget, CancelButton) == 0x000288, "Member 'UFortAthenaMatchmakingWidget::CancelButton' has a wrong offset!");
static_assert(offsetof(UFortAthenaMatchmakingWidget, MatchmakingHeaderText) == 0x000290, "Member 'UFortAthenaMatchmakingWidget::MatchmakingHeaderText' has a wrong offset!");
static_assert(offsetof(UFortAthenaMatchmakingWidget, MatchmakingMessageText) == 0x000298, "Member 'UFortAthenaMatchmakingWidget::MatchmakingMessageText' has a wrong offset!");
static_assert(offsetof(UFortAthenaMatchmakingWidget, PlaylistRotator) == 0x0002A0, "Member 'UFortAthenaMatchmakingWidget::PlaylistRotator' has a wrong offset!");
static_assert(offsetof(UFortAthenaMatchmakingWidget, TeamFillRotator) == 0x0002A8, "Member 'UFortAthenaMatchmakingWidget::TeamFillRotator' has a wrong offset!");
static_assert(offsetof(UFortAthenaMatchmakingWidget, TeamFillRow) == 0x0002B0, "Member 'UFortAthenaMatchmakingWidget::TeamFillRow' has a wrong offset!");

// Class FortniteUI.FortHUDElementWidget
// 0x0028 (0x0238 - 0x0210)
class UFortHUDElementWidget : public UCommonUserWidget
{
public:
	struct FGameplayTagContainer                  HUDElementTag;                                     // 0x0210(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_230[0x8];                                      // 0x0230(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleOnHUDElementVisibilityChanged(const struct FGameplayTagContainer& HiddenHUDElementTags);
	void HandleOnHUDResetToDefaults();
	void OnVisibilitySetEvent(ESlateVisibility InVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortHUDElementWidget">();
	}
	static class UFortHUDElementWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortHUDElementWidget>();
	}
};
static_assert(alignof(UFortHUDElementWidget) == 0x000008, "Wrong alignment on UFortHUDElementWidget");
static_assert(sizeof(UFortHUDElementWidget) == 0x000238, "Wrong size on UFortHUDElementWidget");
static_assert(offsetof(UFortHUDElementWidget, HUDElementTag) == 0x000210, "Member 'UFortHUDElementWidget::HUDElementTag' has a wrong offset!");

// Class FortniteUI.UINavigationManager
// 0x0020 (0x0048 - 0x0028)
class UUINavigationManager : public UObject
{
public:
	UMulticastDelegateProperty_                   OnNavigationEvent;                                 // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FUINavigationEntry>             NavigationStack;                                   // 0x0038(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	void ClearStack();
	class FText GetDisplayName(int32 Param_Index);
	int32 GetStackSize();
	void NavigationToIndex(int32 Param_Index);
	void PopNavigation();
	void PushNavigation(const class FText& DisplayName, class UObject* ObjectData, class FName IdData, int32 IntData, const TDelegate<void(const struct FUINavigationData& Data)>& OnNavigateTo, const TDelegate<void(const struct FUINavigationData& Data)>& OnNavigateFrom);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UINavigationManager">();
	}
	static class UUINavigationManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUINavigationManager>();
	}
};
static_assert(alignof(UUINavigationManager) == 0x000008, "Wrong alignment on UUINavigationManager");
static_assert(sizeof(UUINavigationManager) == 0x000048, "Wrong size on UUINavigationManager");
static_assert(offsetof(UUINavigationManager, OnNavigationEvent) == 0x000028, "Member 'UUINavigationManager::OnNavigationEvent' has a wrong offset!");
static_assert(offsetof(UUINavigationManager, NavigationStack) == 0x000038, "Member 'UUINavigationManager::NavigationStack' has a wrong offset!");

// Class FortniteUI.AthenaCompassBase
// 0x0018 (0x0250 - 0x0238)
class UAthenaCompassBase : public UFortHUDElementWidget
{
public:
	class UMaterialInstanceDynamic*               CompassMaterial;                                   // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UImage*>                         Markers;                                           // 0x0240(0x0010)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaCompassBase">();
	}
	static class UAthenaCompassBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCompassBase>();
	}
};
static_assert(alignof(UAthenaCompassBase) == 0x000008, "Wrong alignment on UAthenaCompassBase");
static_assert(sizeof(UAthenaCompassBase) == 0x000250, "Wrong size on UAthenaCompassBase");
static_assert(offsetof(UAthenaCompassBase, CompassMaterial) == 0x000238, "Member 'UAthenaCompassBase::CompassMaterial' has a wrong offset!");
static_assert(offsetof(UAthenaCompassBase, Markers) == 0x000240, "Member 'UAthenaCompassBase::Markers' has a wrong offset!");

// Class FortniteUI.FortUIStateTrigger
// 0x0008 (0x0030 - 0x0028)
class UFortUIStateTrigger : public UObject
{
public:
	EFortUIState                                  UIState;                                           // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool EvalBP() const;
	bool IsLoggedIn() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIStateTrigger">();
	}
	static class UFortUIStateTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIStateTrigger>();
	}
};
static_assert(alignof(UFortUIStateTrigger) == 0x000008, "Wrong alignment on UFortUIStateTrigger");
static_assert(sizeof(UFortUIStateTrigger) == 0x000030, "Wrong size on UFortUIStateTrigger");
static_assert(offsetof(UFortUIStateTrigger, UIState) == 0x000028, "Member 'UFortUIStateTrigger::UIState' has a wrong offset!");

// Class FortniteUI.FortUIStateTrigger_Replay
// 0x0000 (0x0030 - 0x0030)
class UFortUIStateTrigger_Replay final : public UFortUIStateTrigger
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIStateTrigger_Replay">();
	}
	static class UFortUIStateTrigger_Replay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIStateTrigger_Replay>();
	}
};
static_assert(alignof(UFortUIStateTrigger_Replay) == 0x000008, "Wrong alignment on UFortUIStateTrigger_Replay");
static_assert(sizeof(UFortUIStateTrigger_Replay) == 0x000030, "Wrong size on UFortUIStateTrigger_Replay");

// Class FortniteUI.FortActivatablePanel
// 0x0028 (0x03E8 - 0x03C0)
#pragma pack(push, 0x1)
class alignas(0x08) UFortActivatablePanel : public UCommonActivatablePanel
{
public:
	bool                                          bIsPushedOnToContentPanelStack;                    // 0x03C0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAlreadyOnContentPanelStack;                     // 0x03C1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputPriority                                InputPriority;                                     // 0x03C2(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C3[0x25];                                     // 0x03C3(0x0025)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void RestoreCenterWidget(class UWidget* FallbackWidget);
	void RestoreScrollWidget(class UWidget* FallbackWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivatablePanel">();
	}
	static class UFortActivatablePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivatablePanel>();
	}
};
#pragma pack(pop)
static_assert(alignof(UFortActivatablePanel) == 0x000008, "Wrong alignment on UFortActivatablePanel");
static_assert(sizeof(UFortActivatablePanel) == 0x0003E8, "Wrong size on UFortActivatablePanel");
static_assert(offsetof(UFortActivatablePanel, bIsPushedOnToContentPanelStack) == 0x0003C0, "Member 'UFortActivatablePanel::bIsPushedOnToContentPanelStack' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanel, bIsAlreadyOnContentPanelStack) == 0x0003C1, "Member 'UFortActivatablePanel::bIsAlreadyOnContentPanelStack' has a wrong offset!");
static_assert(offsetof(UFortActivatablePanel, InputPriority) == 0x0003C2, "Member 'UFortActivatablePanel::InputPriority' has a wrong offset!");

// Class FortniteUI.AthenaCompendiumScreenBase
// 0x0018 (0x0400 - 0x03E8)
class UAthenaCompendiumScreenBase final : public UFortActivatablePanel
{
public:
	UMulticastDelegateProperty_                   OnCompendiumChanged;                               // 0x03E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F8[0x8];                                      // 0x03F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetCompendiumBundles(TArray<class UFortCompendiumBundle*>* OutActiveBundles, TArray<class UFortCompendiumBundleDefinition*>* OutUnlockableBundles);
	void GetCompendiumItems(class UFortCompendiumBundle* Bundle, TArray<class UFortCompendiumItem*>* OutActiveItems, TArray<class UFortCompendiumItemDefinition*>* OutUnlockableItems);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaCompendiumScreenBase">();
	}
	static class UAthenaCompendiumScreenBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCompendiumScreenBase>();
	}
};
static_assert(alignof(UAthenaCompendiumScreenBase) == 0x000008, "Wrong alignment on UAthenaCompendiumScreenBase");
static_assert(sizeof(UAthenaCompendiumScreenBase) == 0x000400, "Wrong size on UAthenaCompendiumScreenBase");
static_assert(offsetof(UAthenaCompendiumScreenBase, OnCompendiumChanged) == 0x0003E8, "Member 'UAthenaCompendiumScreenBase::OnCompendiumChanged' has a wrong offset!");

// Class FortniteUI.AthenaCustomizationPicker
// 0x0050 (0x02C8 - 0x0278)
class UAthenaCustomizationPicker : public UFortItemPickerBase
{
public:
	UMulticastDelegateProperty_                   OnCosmeticSelectionSaving;                         // 0x0278(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnCosmeticSelectionSaved;                          // 0x0288(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_298[0x10];                                     // 0x0298(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	EAthenaCustomizationCategory                  CustomizeCategory;                                 // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubslotIndex;                                      // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCommitingSelection;                               // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B1[0x17];                                     // 0x02B1(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BeginCustomizationCategory(EAthenaCustomizationCategory Category, int32 SubslotToEdit);
	void EndCustomizationCategory();
	void OnCosmeticChangeSaveEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaCustomizationPicker">();
	}
	static class UAthenaCustomizationPicker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCustomizationPicker>();
	}
};
static_assert(alignof(UAthenaCustomizationPicker) == 0x000008, "Wrong alignment on UAthenaCustomizationPicker");
static_assert(sizeof(UAthenaCustomizationPicker) == 0x0002C8, "Wrong size on UAthenaCustomizationPicker");
static_assert(offsetof(UAthenaCustomizationPicker, OnCosmeticSelectionSaving) == 0x000278, "Member 'UAthenaCustomizationPicker::OnCosmeticSelectionSaving' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationPicker, OnCosmeticSelectionSaved) == 0x000288, "Member 'UAthenaCustomizationPicker::OnCosmeticSelectionSaved' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationPicker, CustomizeCategory) == 0x0002A8, "Member 'UAthenaCustomizationPicker::CustomizeCategory' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationPicker, SubslotIndex) == 0x0002AC, "Member 'UAthenaCustomizationPicker::SubslotIndex' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationPicker, bCommitingSelection) == 0x0002B0, "Member 'UAthenaCustomizationPicker::bCommitingSelection' has a wrong offset!");

// Class FortniteUI.FortUIStateTrigger_InGame
// 0x0000 (0x0030 - 0x0030)
class UFortUIStateTrigger_InGame final : public UFortUIStateTrigger
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIStateTrigger_InGame">();
	}
	static class UFortUIStateTrigger_InGame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIStateTrigger_InGame>();
	}
};
static_assert(alignof(UFortUIStateTrigger_InGame) == 0x000008, "Wrong alignment on UFortUIStateTrigger_InGame");
static_assert(sizeof(UFortUIStateTrigger_InGame) == 0x000030, "Wrong size on UFortUIStateTrigger_InGame");

// Class FortniteUI.FortItemPickerButton
// 0x0000 (0x07B0 - 0x07B0)
class UFortItemPickerButton : public UFortItemTileButton
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemPickerButton">();
	}
	static class UFortItemPickerButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemPickerButton>();
	}
};
static_assert(alignof(UFortItemPickerButton) == 0x000008, "Wrong alignment on UFortItemPickerButton");
static_assert(sizeof(UFortItemPickerButton) == 0x0007B0, "Wrong size on UFortItemPickerButton");

// Class FortniteUI.AthenaCustomizationPickerTileButton
// 0x0008 (0x07B8 - 0x07B0)
class UAthenaCustomizationPickerTileButton : public UFortItemPickerButton
{
public:
	uint8                                         Pad_7B0[0x8];                                      // 0x07B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaCustomizationPickerTileButton">();
	}
	static class UAthenaCustomizationPickerTileButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCustomizationPickerTileButton>();
	}
};
static_assert(alignof(UAthenaCustomizationPickerTileButton) == 0x000008, "Wrong alignment on UAthenaCustomizationPickerTileButton");
static_assert(sizeof(UAthenaCustomizationPickerTileButton) == 0x0007B8, "Wrong size on UAthenaCustomizationPickerTileButton");

// Class FortniteUI.FortItemDetailElementWidget
// 0x0048 (0x0258 - 0x0210)
class UFortItemDetailElementWidget : public UCommonUserWidget
{
public:
	TWeakObjectPtr<class UFortItem>               ItemToDetail;                                      // 0x0210(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortItem>               ItemToCompareWith;                                 // 0x0218(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShouldPreviewUpgradingItem;                       // 0x0220(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortItemViewContextInterface> ItemViewContext;                                   // 0x0228(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	EFortItemInspectionMode                       CurrentInspectMode;                                // 0x0238(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_239[0x1F];                                     // 0x0239(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleInspectModeChanged();
	void HandleItemToDetailChangedBP();
	void HandlePostDifferentItemToCompareWithSet();
	void HandlePostDifferentItemToDetailSet();
	void HandlePreDifferentItemToCompareWithSet();
	void HandlePreDifferentItemToDetailSet();
	void HandleShouldPreviewUpgradingItemChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemDetailElementWidget">();
	}
	static class UFortItemDetailElementWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemDetailElementWidget>();
	}
};
static_assert(alignof(UFortItemDetailElementWidget) == 0x000008, "Wrong alignment on UFortItemDetailElementWidget");
static_assert(sizeof(UFortItemDetailElementWidget) == 0x000258, "Wrong size on UFortItemDetailElementWidget");
static_assert(offsetof(UFortItemDetailElementWidget, ItemToDetail) == 0x000210, "Member 'UFortItemDetailElementWidget::ItemToDetail' has a wrong offset!");
static_assert(offsetof(UFortItemDetailElementWidget, ItemToCompareWith) == 0x000218, "Member 'UFortItemDetailElementWidget::ItemToCompareWith' has a wrong offset!");
static_assert(offsetof(UFortItemDetailElementWidget, bShouldPreviewUpgradingItem) == 0x000220, "Member 'UFortItemDetailElementWidget::bShouldPreviewUpgradingItem' has a wrong offset!");
static_assert(offsetof(UFortItemDetailElementWidget, ItemViewContext) == 0x000228, "Member 'UFortItemDetailElementWidget::ItemViewContext' has a wrong offset!");
static_assert(offsetof(UFortItemDetailElementWidget, CurrentInspectMode) == 0x000238, "Member 'UFortItemDetailElementWidget::CurrentInspectMode' has a wrong offset!");

// Class FortniteUI.FortSquadSlotItemDetailElementWidget
// 0x0028 (0x0280 - 0x0258)
class UFortSquadSlotItemDetailElementWidget : public UFortItemDetailElementWidget
{
public:
	uint8                                         Pad_258[0x28];                                     // 0x0258(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandlePostDifferentSquadSlotSetBP();
	void SetIdOfSquadSlotToManageBP(const class FName& SquadId, const int32 SquadSlotIndex);

	void GetIdOfSquadSlotToManageBP(class FName* OutSquadId, int32* OutSquadSlotIndex) const;
	class UFortItem* GetItemInSquadSlotBP(const class ULocalPlayer* LocalPlayer) const;
	bool IsSquadSlotLockedBP() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSquadSlotItemDetailElementWidget">();
	}
	static class UFortSquadSlotItemDetailElementWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSquadSlotItemDetailElementWidget>();
	}
};
static_assert(alignof(UFortSquadSlotItemDetailElementWidget) == 0x000008, "Wrong alignment on UFortSquadSlotItemDetailElementWidget");
static_assert(sizeof(UFortSquadSlotItemDetailElementWidget) == 0x000280, "Wrong size on UFortSquadSlotItemDetailElementWidget");

// Class FortniteUI.FortSquadSlotSurvivorTraitMatchesDetailWidget
// 0x0028 (0x02A8 - 0x0280)
class UFortSquadSlotSurvivorTraitMatchesDetailWidget : public UFortSquadSlotItemDetailElementWidget
{
public:
	bool                                          IsSquadLeaderSlot;                                 // 0x0280(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          LeaderMatchesSquadType;                            // 0x0281(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_282[0x2];                                      // 0x0282(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubordinatePersonalityMatchCount;                  // 0x0284(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          MatchesLeaderPersonality;                          // 0x0288(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MatchingSetBonusCount;                             // 0x028C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SetBonusSize;                                      // 0x0290(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_294[0x14];                                     // 0x0294(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void HandleTraitValuesUpdatedBP();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSquadSlotSurvivorTraitMatchesDetailWidget">();
	}
	static class UFortSquadSlotSurvivorTraitMatchesDetailWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSquadSlotSurvivorTraitMatchesDetailWidget>();
	}
};
static_assert(alignof(UFortSquadSlotSurvivorTraitMatchesDetailWidget) == 0x000008, "Wrong alignment on UFortSquadSlotSurvivorTraitMatchesDetailWidget");
static_assert(sizeof(UFortSquadSlotSurvivorTraitMatchesDetailWidget) == 0x0002A8, "Wrong size on UFortSquadSlotSurvivorTraitMatchesDetailWidget");
static_assert(offsetof(UFortSquadSlotSurvivorTraitMatchesDetailWidget, IsSquadLeaderSlot) == 0x000280, "Member 'UFortSquadSlotSurvivorTraitMatchesDetailWidget::IsSquadLeaderSlot' has a wrong offset!");
static_assert(offsetof(UFortSquadSlotSurvivorTraitMatchesDetailWidget, LeaderMatchesSquadType) == 0x000281, "Member 'UFortSquadSlotSurvivorTraitMatchesDetailWidget::LeaderMatchesSquadType' has a wrong offset!");
static_assert(offsetof(UFortSquadSlotSurvivorTraitMatchesDetailWidget, SubordinatePersonalityMatchCount) == 0x000284, "Member 'UFortSquadSlotSurvivorTraitMatchesDetailWidget::SubordinatePersonalityMatchCount' has a wrong offset!");
static_assert(offsetof(UFortSquadSlotSurvivorTraitMatchesDetailWidget, MatchesLeaderPersonality) == 0x000288, "Member 'UFortSquadSlotSurvivorTraitMatchesDetailWidget::MatchesLeaderPersonality' has a wrong offset!");
static_assert(offsetof(UFortSquadSlotSurvivorTraitMatchesDetailWidget, MatchingSetBonusCount) == 0x00028C, "Member 'UFortSquadSlotSurvivorTraitMatchesDetailWidget::MatchingSetBonusCount' has a wrong offset!");
static_assert(offsetof(UFortSquadSlotSurvivorTraitMatchesDetailWidget, SetBonusSize) == 0x000290, "Member 'UFortSquadSlotSurvivorTraitMatchesDetailWidget::SetBonusSize' has a wrong offset!");

// Class FortniteUI.AthenaCustomizationScreenBase
// 0x0008 (0x03F0 - 0x03E8)
class UAthenaCustomizationScreenBase : public UFortActivatablePanel
{
public:
	class UAthenaCustomizationPicker*             SelectionPicker;                                   // 0x03E8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static bool CanShowSlotType(EAthenaCustomizationCategory SlotType);

	class UFortItem* GetFavoriteItemForCategory(EAthenaCustomizationCategory CustomizationType, int32 SubslotIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaCustomizationScreenBase">();
	}
	static class UAthenaCustomizationScreenBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCustomizationScreenBase>();
	}
};
static_assert(alignof(UAthenaCustomizationScreenBase) == 0x000008, "Wrong alignment on UAthenaCustomizationScreenBase");
static_assert(sizeof(UAthenaCustomizationScreenBase) == 0x0003F0, "Wrong size on UAthenaCustomizationScreenBase");
static_assert(offsetof(UAthenaCustomizationScreenBase, SelectionPicker) == 0x0003E8, "Member 'UAthenaCustomizationScreenBase::SelectionPicker' has a wrong offset!");

// Class FortniteUI.AthenaCustomizationSlotSelectorButton
// 0x0018 (0x0798 - 0x0780)
class UAthenaCustomizationSlotSelectorButton : public UCommonButton
{
public:
	EAthenaCustomizationCategory                  CustomizationType;                                 // 0x0780(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_781[0x3];                                      // 0x0781(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubslotIndex;                                      // 0x0784(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortMultiSizeItemCard*                 ItemWidget;                                        // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_790[0x8];                                      // 0x0790(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetCustomizationType(EAthenaCustomizationCategory NewType, int32 InSubslotIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaCustomizationSlotSelectorButton">();
	}
	static class UAthenaCustomizationSlotSelectorButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCustomizationSlotSelectorButton>();
	}
};
static_assert(alignof(UAthenaCustomizationSlotSelectorButton) == 0x000008, "Wrong alignment on UAthenaCustomizationSlotSelectorButton");
static_assert(sizeof(UAthenaCustomizationSlotSelectorButton) == 0x000798, "Wrong size on UAthenaCustomizationSlotSelectorButton");
static_assert(offsetof(UAthenaCustomizationSlotSelectorButton, CustomizationType) == 0x000780, "Member 'UAthenaCustomizationSlotSelectorButton::CustomizationType' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotSelectorButton, SubslotIndex) == 0x000784, "Member 'UAthenaCustomizationSlotSelectorButton::SubslotIndex' has a wrong offset!");
static_assert(offsetof(UAthenaCustomizationSlotSelectorButton, ItemWidget) == 0x000788, "Member 'UAthenaCustomizationSlotSelectorButton::ItemWidget' has a wrong offset!");

// Class FortniteUI.AthenaEventGamesBase
// 0x0008 (0x03F0 - 0x03E8)
class UAthenaEventGamesBase final : public UFortActivatablePanel
{
public:
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaEventGamesBase">();
	}
	static class UAthenaEventGamesBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaEventGamesBase>();
	}
};
static_assert(alignof(UAthenaEventGamesBase) == 0x000008, "Wrong alignment on UAthenaEventGamesBase");
static_assert(sizeof(UAthenaEventGamesBase) == 0x0003F0, "Wrong size on UAthenaEventGamesBase");

// Class FortniteUI.FortItemDetailsActivatablePanel
// 0x0038 (0x03F8 - 0x03C0)
#pragma pack(push, 0x1)
class alignas(0x08) UFortItemDetailsActivatablePanel : public UCommonActivatablePanel
{
public:
	TWeakObjectPtr<class UFortItem>               ItemToDetail;                                      // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortItem>               ItemToCompareWith;                                 // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortItemManagementScreen> HostItemManagementScreen;                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
