#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortnitePartyBackdrop_Camera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass FortnitePartyBackdrop_Camera.FortnitePartyBackdrop_Camera_C
// 0x0040 (0x0920 - 0x08E0)
class AFortnitePartyBackdrop_Camera_C final : public AFortCameraBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08E0(0x0008)(Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x08E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             DirectionalLight;                                  // 0x08F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UExponentialHeightFogComponent*         ExponentialHeightFog1;                             // 0x08F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkyLightComponent*                     SkyLight;                                          // 0x0900(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 FortEntryMusic;                                    // 0x0908(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFort_Entry_Music_Controller_BP_C*      Fort_Entry_Music_Controller;                       // 0x0910(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FortnitePartyBackdrop_Camera(int32 EntryPoint);
	void OnActivated();
	void OnDeactivated();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortnitePartyBackdrop_Camera_C">();
	}
	static class AFortnitePartyBackdrop_Camera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFortnitePartyBackdrop_Camera_C>();
	}
};
static_assert(alignof(AFortnitePartyBackdrop_Camera_C) == 0x000010, "Wrong alignment on AFortnitePartyBackdrop_Camera_C");
static_assert(sizeof(AFortnitePartyBackdrop_Camera_C) == 0x000920, "Wrong size on AFortnitePartyBackdrop_Camera_C");
static_assert(offsetof(AFortnitePartyBackdrop_Camera_C, UberGraphFrame) == 0x0008E0, "Member 'AFortnitePartyBackdrop_Camera_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFortnitePartyBackdrop_Camera_C, Arrow) == 0x0008E8, "Member 'AFortnitePartyBackdrop_Camera_C::Arrow' has a wrong offset!");
static_assert(offsetof(AFortnitePartyBackdrop_Camera_C, DirectionalLight) == 0x0008F0, "Member 'AFortnitePartyBackdrop_Camera_C::DirectionalLight' has a wrong offset!");
static_assert(offsetof(AFortnitePartyBackdrop_Camera_C, ExponentialHeightFog1) == 0x0008F8, "Member 'AFortnitePartyBackdrop_Camera_C::ExponentialHeightFog1' has a wrong offset!");
static_assert(offsetof(AFortnitePartyBackdrop_Camera_C, SkyLight) == 0x000900, "Member 'AFortnitePartyBackdrop_Camera_C::SkyLight' has a wrong offset!");
static_assert(offsetof(AFortnitePartyBackdrop_Camera_C, FortEntryMusic) == 0x000908, "Member 'AFortnitePartyBackdrop_Camera_C::FortEntryMusic' has a wrong offset!");
static_assert(offsetof(AFortnitePartyBackdrop_Camera_C, Fort_Entry_Music_Controller) == 0x000910, "Member 'AFortnitePartyBackdrop_Camera_C::Fort_Entry_Music_Controller' has a wrong offset!");

}

