#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Frontend

#include "Basic.hpp"


namespace SDK::Params
{

// Function Frontend.FrontEnd_C.ExecuteUbergraph_FrontEnd
// 0x0018 (0x0018 - 0x0000)
struct FrontEnd_C_ExecuteUbergraph_FrontEnd final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileApp_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FrontEnd_C_ExecuteUbergraph_FrontEnd) == 0x000008, "Wrong alignment on FrontEnd_C_ExecuteUbergraph_FrontEnd");
static_assert(sizeof(FrontEnd_C_ExecuteUbergraph_FrontEnd) == 0x000018, "Wrong size on FrontEnd_C_ExecuteUbergraph_FrontEnd");
static_assert(offsetof(FrontEnd_C_ExecuteUbergraph_FrontEnd, EntryPoint) == 0x000000, "Member 'FrontEnd_C_ExecuteUbergraph_FrontEnd::EntryPoint' has a wrong offset!");
static_assert(offsetof(FrontEnd_C_ExecuteUbergraph_FrontEnd, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'FrontEnd_C_ExecuteUbergraph_FrontEnd::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEnd_C_ExecuteUbergraph_FrontEnd, CallFunc_IsMobileApp_ReturnValue) == 0x000010, "Member 'FrontEnd_C_ExecuteUbergraph_FrontEnd::CallFunc_IsMobileApp_ReturnValue' has a wrong offset!");

}

