#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrontEndRewardWrapperWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "UMG_structs.hpp"
#include "ItemDisplayStyle_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FrontEndRewardWrapperWidget.FrontEndRewardWrapperWidget_C
// 0x0048 (0x0260 - 0x0218)
class UFrontEndRewardWrapperWidget_C final : public UFortUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0218(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       IntroAnim;                                         // 0x0220(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Container;                                 // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Container;                                 // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextName;                                          // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ESlateVisibility                              StackCounterDefaultVisibility;                     // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemDisplayStyle                             DefaultDisplayStyle;                               // 0x0241(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   EventDispatcher_Go_Trigger;                        // 0x0248(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          ShowText;                                          // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void AddToWrapper(class UWidget* Widget, const class FText& DisplayName);
	void Construct();
	void EventDispatcher_Go_Trigger__DelegateSignature();
	void ExecuteUbergraph_FrontEndRewardWrapperWidget(int32 EntryPoint);
	void Go_Trigger();
	void IntroAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FrontEndRewardWrapperWidget_C">();
	}
	static class UFrontEndRewardWrapperWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFrontEndRewardWrapperWidget_C>();
	}
};
static_assert(alignof(UFrontEndRewardWrapperWidget_C) == 0x000008, "Wrong alignment on UFrontEndRewardWrapperWidget_C");
static_assert(sizeof(UFrontEndRewardWrapperWidget_C) == 0x000260, "Wrong size on UFrontEndRewardWrapperWidget_C");
static_assert(offsetof(UFrontEndRewardWrapperWidget_C, UberGraphFrame) == 0x000218, "Member 'UFrontEndRewardWrapperWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFrontEndRewardWrapperWidget_C, IntroAnim) == 0x000220, "Member 'UFrontEndRewardWrapperWidget_C::IntroAnim' has a wrong offset!");
static_assert(offsetof(UFrontEndRewardWrapperWidget_C, Overlay_Container) == 0x000228, "Member 'UFrontEndRewardWrapperWidget_C::Overlay_Container' has a wrong offset!");
static_assert(offsetof(UFrontEndRewardWrapperWidget_C, SizeBox_Container) == 0x000230, "Member 'UFrontEndRewardWrapperWidget_C::SizeBox_Container' has a wrong offset!");
static_assert(offsetof(UFrontEndRewardWrapperWidget_C, TextName) == 0x000238, "Member 'UFrontEndRewardWrapperWidget_C::TextName' has a wrong offset!");
static_assert(offsetof(UFrontEndRewardWrapperWidget_C, StackCounterDefaultVisibility) == 0x000240, "Member 'UFrontEndRewardWrapperWidget_C::StackCounterDefaultVisibility' has a wrong offset!");
static_assert(offsetof(UFrontEndRewardWrapperWidget_C, DefaultDisplayStyle) == 0x000241, "Member 'UFrontEndRewardWrapperWidget_C::DefaultDisplayStyle' has a wrong offset!");
static_assert(offsetof(UFrontEndRewardWrapperWidget_C, EventDispatcher_Go_Trigger) == 0x000248, "Member 'UFrontEndRewardWrapperWidget_C::EventDispatcher_Go_Trigger' has a wrong offset!");
static_assert(offsetof(UFrontEndRewardWrapperWidget_C, ShowText) == 0x000258, "Member 'UFrontEndRewardWrapperWidget_C::ShowText' has a wrong offset!");

}

