#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FrontEndRewards_Widget

#include "Basic.hpp"

#include "FrontEndRewards_Definition_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function FrontEndRewards_Widget.FrontEndRewards_Widget_C.OnRewardsClaimed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FrontEndRewards_Widget_C_OnRewardsClaimed__DelegateSignature final
{
public:
	class UFrontEndRewards_Widget_C*              RewardsWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndRewards_Widget_C_OnRewardsClaimed__DelegateSignature) == 0x000008, "Wrong alignment on FrontEndRewards_Widget_C_OnRewardsClaimed__DelegateSignature");
static_assert(sizeof(FrontEndRewards_Widget_C_OnRewardsClaimed__DelegateSignature) == 0x000008, "Wrong size on FrontEndRewards_Widget_C_OnRewardsClaimed__DelegateSignature");
static_assert(offsetof(FrontEndRewards_Widget_C_OnRewardsClaimed__DelegateSignature, RewardsWidget) == 0x000000, "Member 'FrontEndRewards_Widget_C_OnRewardsClaimed__DelegateSignature::RewardsWidget' has a wrong offset!");

// Function FrontEndRewards_Widget.FrontEndRewards_Widget_C.OnRewardsClaimError__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FrontEndRewards_Widget_C_OnRewardsClaimError__DelegateSignature final
{
public:
	class UFrontEndRewards_Widget_C*              RewardsWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndRewards_Widget_C_OnRewardsClaimError__DelegateSignature) == 0x000008, "Wrong alignment on FrontEndRewards_Widget_C_OnRewardsClaimError__DelegateSignature");
static_assert(sizeof(FrontEndRewards_Widget_C_OnRewardsClaimError__DelegateSignature) == 0x000008, "Wrong size on FrontEndRewards_Widget_C_OnRewardsClaimError__DelegateSignature");
static_assert(offsetof(FrontEndRewards_Widget_C_OnRewardsClaimError__DelegateSignature, RewardsWidget) == 0x000000, "Member 'FrontEndRewards_Widget_C_OnRewardsClaimError__DelegateSignature::RewardsWidget' has a wrong offset!");

// Function FrontEndRewards_Widget.FrontEndRewards_Widget_C.OnRewardsIgnored__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FrontEndRewards_Widget_C_OnRewardsIgnored__DelegateSignature final
{
public:
	class UFrontEndRewards_Widget_C*              RewardsWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndRewards_Widget_C_OnRewardsIgnored__DelegateSignature) == 0x000008, "Wrong alignment on FrontEndRewards_Widget_C_OnRewardsIgnored__DelegateSignature");
static_assert(sizeof(FrontEndRewards_Widget_C_OnRewardsIgnored__DelegateSignature) == 0x000008, "Wrong size on FrontEndRewards_Widget_C_OnRewardsIgnored__DelegateSignature");
static_assert(offsetof(FrontEndRewards_Widget_C_OnRewardsIgnored__DelegateSignature, RewardsWidget) == 0x000000, "Member 'FrontEndRewards_Widget_C_OnRewardsIgnored__DelegateSignature::RewardsWidget' has a wrong offset!");

// Function FrontEndRewards_Widget.FrontEndRewards_Widget_C.ExecuteUbergraph_FrontEndRewards_Widget
// 0x00A0 (0x00A0 - 0x0000)
struct FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   K2Node_Event_Text;                                 // 0x0008(0x0018)()
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Delay;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              K2Node_Event_ItemToInspect;                        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue2;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemInspectScreen_C*                   CallFunc_Create_ReturnValue;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue2;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue3;                  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget) == 0x000008, "Wrong alignment on FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget");
static_assert(sizeof(FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget) == 0x0000A0, "Wrong size on FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget");
static_assert(offsetof(FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget, EntryPoint) == 0x000000, "Member 'FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget::EntryPoint' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget, CallFunc_IsValid_ReturnValue2) == 0x000005, "Member 'FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget, CallFunc_IsValid_ReturnValue3) == 0x000006, "Member 'FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget, CallFunc_IsValid_ReturnValue4) == 0x000007, "Member 'FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget, K2Node_Event_Text) == 0x000008, "Member 'FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget::K2Node_Event_Text' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget, CallFunc_GetUINavigationManager_ReturnValue) == 0x000020, "Member 'FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget, K2Node_ComponentBoundEvent_Button) == 0x000028, "Member 'FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget, CallFunc_IsValid_ReturnValue5) == 0x000038, "Member 'FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget, K2Node_CustomEvent_Delay) == 0x00003C, "Member 'FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget::K2Node_CustomEvent_Delay' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget, CallFunc_IsValid_ReturnValue6) == 0x000040, "Member 'FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget, K2Node_Event_ItemToInspect) == 0x000048, "Member 'FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget::K2Node_Event_ItemToInspect' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget, CallFunc_GetContext_ReturnValue2) == 0x000060, "Member 'FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget, CallFunc_IsValid_ReturnValue7) == 0x000068, "Member 'FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000070, "Member 'FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget, CallFunc_Create_ReturnValue) == 0x000078, "Member 'FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000080, "Member 'FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget, CallFunc_GetUIManagerWidget_ReturnValue2) == 0x000088, "Member 'FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget::CallFunc_GetUIManagerWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget, CallFunc_GetContext_ReturnValue3) == 0x000090, "Member 'FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget, CallFunc_IsValid_ReturnValue8) == 0x000098, "Member 'FrontEndRewards_Widget_C_ExecuteUbergraph_FrontEndRewards_Widget::CallFunc_IsValid_ReturnValue8' has a wrong offset!");

// Function FrontEndRewards_Widget.FrontEndRewards_Widget_C.InspectItem
// 0x0008 (0x0008 - 0x0000)
struct FrontEndRewards_Widget_C_InspectItem final
{
public:
	class UFortItem*                              ItemToInspect;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndRewards_Widget_C_InspectItem) == 0x000008, "Wrong alignment on FrontEndRewards_Widget_C_InspectItem");
static_assert(sizeof(FrontEndRewards_Widget_C_InspectItem) == 0x000008, "Wrong size on FrontEndRewards_Widget_C_InspectItem");
static_assert(offsetof(FrontEndRewards_Widget_C_InspectItem, ItemToInspect) == 0x000000, "Member 'FrontEndRewards_Widget_C_InspectItem::ItemToInspect' has a wrong offset!");

// Function FrontEndRewards_Widget.FrontEndRewards_Widget_C.HideStarburst
// 0x0004 (0x0004 - 0x0000)
struct FrontEndRewards_Widget_C_HideStarburst final
{
public:
	float                                         Delay;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndRewards_Widget_C_HideStarburst) == 0x000004, "Wrong alignment on FrontEndRewards_Widget_C_HideStarburst");
static_assert(sizeof(FrontEndRewards_Widget_C_HideStarburst) == 0x000004, "Wrong size on FrontEndRewards_Widget_C_HideStarburst");
static_assert(offsetof(FrontEndRewards_Widget_C_HideStarburst, Delay) == 0x000000, "Member 'FrontEndRewards_Widget_C_HideStarburst::Delay' has a wrong offset!");

// Function FrontEndRewards_Widget.FrontEndRewards_Widget_C.BndEvt__ButtonOpen_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FrontEndRewards_Widget_C_BndEvt__ButtonOpen_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndRewards_Widget_C_BndEvt__ButtonOpen_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on FrontEndRewards_Widget_C_BndEvt__ButtonOpen_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(FrontEndRewards_Widget_C_BndEvt__ButtonOpen_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on FrontEndRewards_Widget_C_BndEvt__ButtonOpen_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(FrontEndRewards_Widget_C_BndEvt__ButtonOpen_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'FrontEndRewards_Widget_C_BndEvt__ButtonOpen_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function FrontEndRewards_Widget.FrontEndRewards_Widget_C.OnPrimaryActionTextChanged
// 0x0018 (0x0018 - 0x0000)
struct FrontEndRewards_Widget_C_OnPrimaryActionTextChanged final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(FrontEndRewards_Widget_C_OnPrimaryActionTextChanged) == 0x000008, "Wrong alignment on FrontEndRewards_Widget_C_OnPrimaryActionTextChanged");
static_assert(sizeof(FrontEndRewards_Widget_C_OnPrimaryActionTextChanged) == 0x000018, "Wrong size on FrontEndRewards_Widget_C_OnPrimaryActionTextChanged");
static_assert(offsetof(FrontEndRewards_Widget_C_OnPrimaryActionTextChanged, Text) == 0x000000, "Member 'FrontEndRewards_Widget_C_OnPrimaryActionTextChanged::Text' has a wrong offset!");

// Function FrontEndRewards_Widget.FrontEndRewards_Widget_C.DropReward
// 0x0008 (0x0008 - 0x0000)
struct FrontEndRewards_Widget_C_DropReward final
{
public:
	class UFortRewardNotificationData*            InReward;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndRewards_Widget_C_DropReward) == 0x000008, "Wrong alignment on FrontEndRewards_Widget_C_DropReward");
static_assert(sizeof(FrontEndRewards_Widget_C_DropReward) == 0x000008, "Wrong size on FrontEndRewards_Widget_C_DropReward");
static_assert(offsetof(FrontEndRewards_Widget_C_DropReward, InReward) == 0x000000, "Member 'FrontEndRewards_Widget_C_DropReward::InReward' has a wrong offset!");

// Function FrontEndRewards_Widget.FrontEndRewards_Widget_C.PopNextReward
// 0x0018 (0x0018 - 0x0000)
struct FrontEndRewards_Widget_C_PopNextReward final
{
public:
	class UFortRewardNotificationData*            NextReward;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRewardNotificationData*            CallFunc_DequeueReward_OutReward;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndRewards_Widget_C_PopNextReward) == 0x000008, "Wrong alignment on FrontEndRewards_Widget_C_PopNextReward");
static_assert(sizeof(FrontEndRewards_Widget_C_PopNextReward) == 0x000018, "Wrong size on FrontEndRewards_Widget_C_PopNextReward");
static_assert(offsetof(FrontEndRewards_Widget_C_PopNextReward, NextReward) == 0x000000, "Member 'FrontEndRewards_Widget_C_PopNextReward::NextReward' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_PopNextReward, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'FrontEndRewards_Widget_C_PopNextReward::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_PopNextReward, CallFunc_DequeueReward_OutReward) == 0x000010, "Member 'FrontEndRewards_Widget_C_PopNextReward::CallFunc_DequeueReward_OutReward' has a wrong offset!");

// Function FrontEndRewards_Widget.FrontEndRewards_Widget_C.HandleShowHeaderFinished
// 0x0010 (0x0010 - 0x0000)
struct FrontEndRewards_Widget_C_HandleShowHeaderFinished final
{
public:
	class UFortRewardQuestData*                   K2Node_DynamicCast_AsFort_Reward_Quest_Data;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FrontEndRewards_Widget_C_HandleShowHeaderFinished) == 0x000008, "Wrong alignment on FrontEndRewards_Widget_C_HandleShowHeaderFinished");
static_assert(sizeof(FrontEndRewards_Widget_C_HandleShowHeaderFinished) == 0x000010, "Wrong size on FrontEndRewards_Widget_C_HandleShowHeaderFinished");
static_assert(offsetof(FrontEndRewards_Widget_C_HandleShowHeaderFinished, K2Node_DynamicCast_AsFort_Reward_Quest_Data) == 0x000000, "Member 'FrontEndRewards_Widget_C_HandleShowHeaderFinished::K2Node_DynamicCast_AsFort_Reward_Quest_Data' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_HandleShowHeaderFinished, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'FrontEndRewards_Widget_C_HandleShowHeaderFinished::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function FrontEndRewards_Widget.FrontEndRewards_Widget_C.BindEvents
// 0x0140 (0x0140 - 0x0000)
struct FrontEndRewards_Widget_C_BindEvents final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TArray<struct FFortItemInstanceQuantityPair>& MissionRewards)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TArray<struct FFortItemInstanceQuantityPair>& MissionRewards)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FFortCollectionBookRewards& RewardClaimed, bool bSuccess, TArray<struct FFortItemInstanceQuantityPair>& ActualRewards)> K2Node_CreateDelegate_OutputDelegate8;             // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFortQuestItem* Quest, TArray<struct FFortItemInstanceQuantityPair>& Rewards)> K2Node_CreateDelegate_OutputDelegate9;             // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	class UFortCollectionBookManager*             CallFunc_GetCollectionBookManager_ReturnValue;     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue3;                  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate10;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool Succeeded, TArray<struct FFortItemInstanceQuantityPair>& Rewards)> K2Node_CreateDelegate_OutputDelegate11;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	class UFortRewardNotificationSubWidget*       CallFunc_Array_Get_Item;                           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Index, class UFortItem* Item)> K2Node_CreateDelegate_OutputDelegate12;            // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue4;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate13;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate14;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate15;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(FrontEndRewards_Widget_C_BindEvents) == 0x000008, "Wrong alignment on FrontEndRewards_Widget_C_BindEvents");
static_assert(sizeof(FrontEndRewards_Widget_C_BindEvents) == 0x000140, "Wrong size on FrontEndRewards_Widget_C_BindEvents");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, Temp_int_Array_Index_Variable) == 0x000000, "Member 'FrontEndRewards_Widget_C_BindEvents::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'FrontEndRewards_Widget_C_BindEvents::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'FrontEndRewards_Widget_C_BindEvents::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'FrontEndRewards_Widget_C_BindEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'FrontEndRewards_Widget_C_BindEvents::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, K2Node_CreateDelegate_OutputDelegate3) == 0x000030, "Member 'FrontEndRewards_Widget_C_BindEvents::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, K2Node_CreateDelegate_OutputDelegate4) == 0x000040, "Member 'FrontEndRewards_Widget_C_BindEvents::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, K2Node_CreateDelegate_OutputDelegate5) == 0x000050, "Member 'FrontEndRewards_Widget_C_BindEvents::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, CallFunc_GetContext_ReturnValue) == 0x000060, "Member 'FrontEndRewards_Widget_C_BindEvents::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, K2Node_CreateDelegate_OutputDelegate6) == 0x000068, "Member 'FrontEndRewards_Widget_C_BindEvents::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, CallFunc_GetQuestManager_ReturnValue) == 0x000078, "Member 'FrontEndRewards_Widget_C_BindEvents::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, K2Node_CreateDelegate_OutputDelegate7) == 0x000080, "Member 'FrontEndRewards_Widget_C_BindEvents::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, K2Node_CreateDelegate_OutputDelegate8) == 0x000090, "Member 'FrontEndRewards_Widget_C_BindEvents::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, CallFunc_GetContext_ReturnValue2) == 0x0000A0, "Member 'FrontEndRewards_Widget_C_BindEvents::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, K2Node_CreateDelegate_OutputDelegate9) == 0x0000A8, "Member 'FrontEndRewards_Widget_C_BindEvents::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, CallFunc_GetCollectionBookManager_ReturnValue) == 0x0000B8, "Member 'FrontEndRewards_Widget_C_BindEvents::CallFunc_GetCollectionBookManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, CallFunc_GetContext_ReturnValue3) == 0x0000C0, "Member 'FrontEndRewards_Widget_C_BindEvents::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, K2Node_CreateDelegate_OutputDelegate10) == 0x0000C8, "Member 'FrontEndRewards_Widget_C_BindEvents::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, K2Node_CreateDelegate_OutputDelegate11) == 0x0000D8, "Member 'FrontEndRewards_Widget_C_BindEvents::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, CallFunc_Array_Get_Item) == 0x0000E8, "Member 'FrontEndRewards_Widget_C_BindEvents::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, CallFunc_Array_Length_ReturnValue) == 0x0000F0, "Member 'FrontEndRewards_Widget_C_BindEvents::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, CallFunc_Less_IntInt_ReturnValue) == 0x0000F4, "Member 'FrontEndRewards_Widget_C_BindEvents::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, K2Node_CreateDelegate_OutputDelegate12) == 0x0000F8, "Member 'FrontEndRewards_Widget_C_BindEvents::K2Node_CreateDelegate_OutputDelegate12' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, CallFunc_GetContext_ReturnValue4) == 0x000108, "Member 'FrontEndRewards_Widget_C_BindEvents::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, K2Node_CreateDelegate_OutputDelegate13) == 0x000110, "Member 'FrontEndRewards_Widget_C_BindEvents::K2Node_CreateDelegate_OutputDelegate13' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, K2Node_CreateDelegate_OutputDelegate14) == 0x000120, "Member 'FrontEndRewards_Widget_C_BindEvents::K2Node_CreateDelegate_OutputDelegate14' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_BindEvents, K2Node_CreateDelegate_OutputDelegate15) == 0x000130, "Member 'FrontEndRewards_Widget_C_BindEvents::K2Node_CreateDelegate_OutputDelegate15' has a wrong offset!");

// Function FrontEndRewards_Widget.FrontEndRewards_Widget_C.AdjustCurrentRewardPadding
// 0x0030 (0x0030 - 0x0000)
struct FrontEndRewards_Widget_C_AdjustCurrentRewardPadding final
{
public:
	class UOverlaySlot*                           K2Node_DynamicCast_AsOverlay_Slot;                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           K2Node_DynamicCast_AsOverlay_Slot2;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x001C(0x0010)(NoDestructor)
};
static_assert(alignof(FrontEndRewards_Widget_C_AdjustCurrentRewardPadding) == 0x000008, "Wrong alignment on FrontEndRewards_Widget_C_AdjustCurrentRewardPadding");
static_assert(sizeof(FrontEndRewards_Widget_C_AdjustCurrentRewardPadding) == 0x000030, "Wrong size on FrontEndRewards_Widget_C_AdjustCurrentRewardPadding");
static_assert(offsetof(FrontEndRewards_Widget_C_AdjustCurrentRewardPadding, K2Node_DynamicCast_AsOverlay_Slot) == 0x000000, "Member 'FrontEndRewards_Widget_C_AdjustCurrentRewardPadding::K2Node_DynamicCast_AsOverlay_Slot' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_AdjustCurrentRewardPadding, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'FrontEndRewards_Widget_C_AdjustCurrentRewardPadding::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_AdjustCurrentRewardPadding, K2Node_DynamicCast_AsOverlay_Slot2) == 0x000010, "Member 'FrontEndRewards_Widget_C_AdjustCurrentRewardPadding::K2Node_DynamicCast_AsOverlay_Slot2' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_AdjustCurrentRewardPadding, K2Node_DynamicCast_bSuccess2) == 0x000018, "Member 'FrontEndRewards_Widget_C_AdjustCurrentRewardPadding::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_AdjustCurrentRewardPadding, K2Node_MakeStruct_Margin) == 0x00001C, "Member 'FrontEndRewards_Widget_C_AdjustCurrentRewardPadding::K2Node_MakeStruct_Margin' has a wrong offset!");

// Function FrontEndRewards_Widget.FrontEndRewards_Widget_C.PopulateCurrentRewardWidget
// 0x0028 (0x0028 - 0x0000)
struct FrontEndRewards_Widget_C_PopulateCurrentRewardWidget final
{
public:
	TArray<struct FFortItemQuantityPair>          TempCollectionBookRewards;                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class UFortQuestItem*                         Quest;                                             // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortRewardNotificationData*            RewardData;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FrontEndRewards_Widget_C_PopulateCurrentRewardWidget) == 0x000008, "Wrong alignment on FrontEndRewards_Widget_C_PopulateCurrentRewardWidget");
static_assert(sizeof(FrontEndRewards_Widget_C_PopulateCurrentRewardWidget) == 0x000028, "Wrong size on FrontEndRewards_Widget_C_PopulateCurrentRewardWidget");
static_assert(offsetof(FrontEndRewards_Widget_C_PopulateCurrentRewardWidget, TempCollectionBookRewards) == 0x000000, "Member 'FrontEndRewards_Widget_C_PopulateCurrentRewardWidget::TempCollectionBookRewards' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_PopulateCurrentRewardWidget, Quest) == 0x000010, "Member 'FrontEndRewards_Widget_C_PopulateCurrentRewardWidget::Quest' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_PopulateCurrentRewardWidget, RewardData) == 0x000018, "Member 'FrontEndRewards_Widget_C_PopulateCurrentRewardWidget::RewardData' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_PopulateCurrentRewardWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'FrontEndRewards_Widget_C_PopulateCurrentRewardWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_PopulateCurrentRewardWidget, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'FrontEndRewards_Widget_C_PopulateCurrentRewardWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_PopulateCurrentRewardWidget, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000022, "Member 'FrontEndRewards_Widget_C_PopulateCurrentRewardWidget::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function FrontEndRewards_Widget.FrontEndRewards_Widget_C.ShowCurrentReward
// 0x0020 (0x0020 - 0x0000)
struct FrontEndRewards_Widget_C_ShowCurrentReward final
{
public:
	class UFortRewardEpicQuestData*               K2Node_DynamicCast_AsFort_Reward_Epic_Quest_Data;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFrontEndRewards_ChoiceRewards_C*       K2Node_DynamicCast_AsFront_End_Rewards_Choice_Rewards; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FrontEndRewards_Widget_C_ShowCurrentReward) == 0x000008, "Wrong alignment on FrontEndRewards_Widget_C_ShowCurrentReward");
static_assert(sizeof(FrontEndRewards_Widget_C_ShowCurrentReward) == 0x000020, "Wrong size on FrontEndRewards_Widget_C_ShowCurrentReward");
static_assert(offsetof(FrontEndRewards_Widget_C_ShowCurrentReward, K2Node_DynamicCast_AsFort_Reward_Epic_Quest_Data) == 0x000000, "Member 'FrontEndRewards_Widget_C_ShowCurrentReward::K2Node_DynamicCast_AsFort_Reward_Epic_Quest_Data' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ShowCurrentReward, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'FrontEndRewards_Widget_C_ShowCurrentReward::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ShowCurrentReward, K2Node_DynamicCast_AsFront_End_Rewards_Choice_Rewards) == 0x000010, "Member 'FrontEndRewards_Widget_C_ShowCurrentReward::K2Node_DynamicCast_AsFront_End_Rewards_Choice_Rewards' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ShowCurrentReward, K2Node_DynamicCast_bSuccess2) == 0x000018, "Member 'FrontEndRewards_Widget_C_ShowCurrentReward::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ShowCurrentReward, CallFunc_BooleanAND_ReturnValue) == 0x000019, "Member 'FrontEndRewards_Widget_C_ShowCurrentReward::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function FrontEndRewards_Widget.FrontEndRewards_Widget_C.HandleExpeditionCompleted
// 0x0028 (0x0028 - 0x0000)
struct FrontEndRewards_Widget_C_HandleExpeditionCompleted final
{
public:
	bool                                          Succeeded;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortItemInstanceQuantityPair>  Rewards;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<class URewards_ItemCard_C*>            CallFunc_CreateCardsFromItemInstanceQuantityList_Cards; // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(FrontEndRewards_Widget_C_HandleExpeditionCompleted) == 0x000008, "Wrong alignment on FrontEndRewards_Widget_C_HandleExpeditionCompleted");
static_assert(sizeof(FrontEndRewards_Widget_C_HandleExpeditionCompleted) == 0x000028, "Wrong size on FrontEndRewards_Widget_C_HandleExpeditionCompleted");
static_assert(offsetof(FrontEndRewards_Widget_C_HandleExpeditionCompleted, Succeeded) == 0x000000, "Member 'FrontEndRewards_Widget_C_HandleExpeditionCompleted::Succeeded' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_HandleExpeditionCompleted, Rewards) == 0x000008, "Member 'FrontEndRewards_Widget_C_HandleExpeditionCompleted::Rewards' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_HandleExpeditionCompleted, CallFunc_CreateCardsFromItemInstanceQuantityList_Cards) == 0x000018, "Member 'FrontEndRewards_Widget_C_HandleExpeditionCompleted::CallFunc_CreateCardsFromItemInstanceQuantityList_Cards' has a wrong offset!");

// Function FrontEndRewards_Widget.FrontEndRewards_Widget_C.InitInitialRewards
// 0x0048 (0x0048 - 0x0000)
struct FrontEndRewards_Widget_C_InitInitialRewards final
{
public:
	struct FFrontEndRewards_Definition            Definition;                                        // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndRewards_Widget_C_InitInitialRewards) == 0x000008, "Wrong alignment on FrontEndRewards_Widget_C_InitInitialRewards");
static_assert(sizeof(FrontEndRewards_Widget_C_InitInitialRewards) == 0x000048, "Wrong size on FrontEndRewards_Widget_C_InitInitialRewards");
static_assert(offsetof(FrontEndRewards_Widget_C_InitInitialRewards, Definition) == 0x000000, "Member 'FrontEndRewards_Widget_C_InitInitialRewards::Definition' has a wrong offset!");

// Function FrontEndRewards_Widget.FrontEndRewards_Widget_C.HandleChoiceRewardSelected
// 0x0038 (0x0038 - 0x0000)
struct FrontEndRewards_Widget_C_HandleChoiceRewardSelected final
{
public:
	int32                                         RewardIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              Item;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortRewardNotificationData*            NotificationData;                                  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPersistentName_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FrontEndRewards_Widget_C_HandleChoiceRewardSelected) == 0x000008, "Wrong alignment on FrontEndRewards_Widget_C_HandleChoiceRewardSelected");
static_assert(sizeof(FrontEndRewards_Widget_C_HandleChoiceRewardSelected) == 0x000038, "Wrong size on FrontEndRewards_Widget_C_HandleChoiceRewardSelected");
static_assert(offsetof(FrontEndRewards_Widget_C_HandleChoiceRewardSelected, RewardIndex) == 0x000000, "Member 'FrontEndRewards_Widget_C_HandleChoiceRewardSelected::RewardIndex' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_HandleChoiceRewardSelected, Item) == 0x000008, "Member 'FrontEndRewards_Widget_C_HandleChoiceRewardSelected::Item' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_HandleChoiceRewardSelected, NotificationData) == 0x000010, "Member 'FrontEndRewards_Widget_C_HandleChoiceRewardSelected::NotificationData' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_HandleChoiceRewardSelected, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000018, "Member 'FrontEndRewards_Widget_C_HandleChoiceRewardSelected::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_HandleChoiceRewardSelected, CallFunc_GetPersistentName_ReturnValue) == 0x000020, "Member 'FrontEndRewards_Widget_C_HandleChoiceRewardSelected::CallFunc_GetPersistentName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_HandleChoiceRewardSelected, CallFunc_Contains_ReturnValue) == 0x000030, "Member 'FrontEndRewards_Widget_C_HandleChoiceRewardSelected::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_HandleChoiceRewardSelected, K2Node_SwitchEnum_CmpSuccess) == 0x000031, "Member 'FrontEndRewards_Widget_C_HandleChoiceRewardSelected::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_HandleChoiceRewardSelected, CallFunc_IsValid_ReturnValue) == 0x000032, "Member 'FrontEndRewards_Widget_C_HandleChoiceRewardSelected::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function FrontEndRewards_Widget.FrontEndRewards_Widget_C.ClaimQuestChoiceReward
// 0x0038 (0x0038 - 0x0000)
struct FrontEndRewards_Widget_C_ClaimQuestChoiceReward final
{
public:
	class UFortRewardNotificationData*            NotificationData;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SelectionIndex;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              Item;                                              // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortRewardQuestData*                   K2Node_DynamicCast_AsFort_Reward_Quest_Data;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndRewards_Widget_C_ClaimQuestChoiceReward) == 0x000008, "Wrong alignment on FrontEndRewards_Widget_C_ClaimQuestChoiceReward");
static_assert(sizeof(FrontEndRewards_Widget_C_ClaimQuestChoiceReward) == 0x000038, "Wrong size on FrontEndRewards_Widget_C_ClaimQuestChoiceReward");
static_assert(offsetof(FrontEndRewards_Widget_C_ClaimQuestChoiceReward, NotificationData) == 0x000000, "Member 'FrontEndRewards_Widget_C_ClaimQuestChoiceReward::NotificationData' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ClaimQuestChoiceReward, SelectionIndex) == 0x000008, "Member 'FrontEndRewards_Widget_C_ClaimQuestChoiceReward::SelectionIndex' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ClaimQuestChoiceReward, Item) == 0x000010, "Member 'FrontEndRewards_Widget_C_ClaimQuestChoiceReward::Item' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ClaimQuestChoiceReward, K2Node_DynamicCast_AsFort_Reward_Quest_Data) == 0x000018, "Member 'FrontEndRewards_Widget_C_ClaimQuestChoiceReward::K2Node_DynamicCast_AsFort_Reward_Quest_Data' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ClaimQuestChoiceReward, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'FrontEndRewards_Widget_C_ClaimQuestChoiceReward::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ClaimQuestChoiceReward, CallFunc_GetContext_ReturnValue) == 0x000028, "Member 'FrontEndRewards_Widget_C_ClaimQuestChoiceReward::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_ClaimQuestChoiceReward, CallFunc_GetQuestManager_ReturnValue) == 0x000030, "Member 'FrontEndRewards_Widget_C_ClaimQuestChoiceReward::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");

// Function FrontEndRewards_Widget.FrontEndRewards_Widget_C.CreateCardsFromItemList
// 0x0080 (0x0080 - 0x0000)
struct FrontEndRewards_Widget_C_CreateCardsFromItemList final
{
public:
	TArray<class UFortItem*>                      Items;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<EFortInventoryType>                    ItemInventoryTypeList;                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<class URewards_ItemCard_C*>            Cards;                                             // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor)
	TArray<class URewards_ItemCard_C*>            CardList;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URewards_ItemCard_C*                    CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortInventoryType                            CallFunc_Array_Get_Item2;                          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FrontEndRewards_Widget_C_CreateCardsFromItemList) == 0x000008, "Wrong alignment on FrontEndRewards_Widget_C_CreateCardsFromItemList");
static_assert(sizeof(FrontEndRewards_Widget_C_CreateCardsFromItemList) == 0x000080, "Wrong size on FrontEndRewards_Widget_C_CreateCardsFromItemList");
static_assert(offsetof(FrontEndRewards_Widget_C_CreateCardsFromItemList, Items) == 0x000000, "Member 'FrontEndRewards_Widget_C_CreateCardsFromItemList::Items' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_CreateCardsFromItemList, ItemInventoryTypeList) == 0x000010, "Member 'FrontEndRewards_Widget_C_CreateCardsFromItemList::ItemInventoryTypeList' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_CreateCardsFromItemList, Cards) == 0x000020, "Member 'FrontEndRewards_Widget_C_CreateCardsFromItemList::Cards' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_CreateCardsFromItemList, CardList) == 0x000030, "Member 'FrontEndRewards_Widget_C_CreateCardsFromItemList::CardList' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_CreateCardsFromItemList, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'FrontEndRewards_Widget_C_CreateCardsFromItemList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_CreateCardsFromItemList, CallFunc_GetOwningPlayer_ReturnValue) == 0x000048, "Member 'FrontEndRewards_Widget_C_CreateCardsFromItemList::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_CreateCardsFromItemList, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'FrontEndRewards_Widget_C_CreateCardsFromItemList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_CreateCardsFromItemList, CallFunc_Create_ReturnValue) == 0x000058, "Member 'FrontEndRewards_Widget_C_CreateCardsFromItemList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_CreateCardsFromItemList, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'FrontEndRewards_Widget_C_CreateCardsFromItemList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_CreateCardsFromItemList, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'FrontEndRewards_Widget_C_CreateCardsFromItemList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_CreateCardsFromItemList, Temp_int_Array_Index_Variable) == 0x000068, "Member 'FrontEndRewards_Widget_C_CreateCardsFromItemList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_CreateCardsFromItemList, CallFunc_Array_Get_Item) == 0x000070, "Member 'FrontEndRewards_Widget_C_CreateCardsFromItemList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_CreateCardsFromItemList, CallFunc_Array_Get_Item2) == 0x000078, "Member 'FrontEndRewards_Widget_C_CreateCardsFromItemList::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_CreateCardsFromItemList, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000079, "Member 'FrontEndRewards_Widget_C_CreateCardsFromItemList::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_CreateCardsFromItemList, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00007A, "Member 'FrontEndRewards_Widget_C_CreateCardsFromItemList::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(FrontEndRewards_Widget_C_CreateCardsFromItemList, CallFunc_Array_Add_ReturnValue) == 0x00007C, "Member 'FrontEndRewards_Widget_C_CreateCardsFromItemList::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function FrontEndRewards_Widget.FrontEndRewards_Widget_C.CreateCardsFromItemQuantityList
// 0x00B8 (0x00B8 - 0x0000)
