#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FullPartyBar

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function FullPartyBar.FullPartyBar_C.OnButtonHovered__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct FullPartyBar_C_OnButtonHovered__DelegateSignature final
{
public:
	class FText                                   HelpText;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(FullPartyBar_C_OnButtonHovered__DelegateSignature) == 0x000008, "Wrong alignment on FullPartyBar_C_OnButtonHovered__DelegateSignature");
static_assert(sizeof(FullPartyBar_C_OnButtonHovered__DelegateSignature) == 0x000018, "Wrong size on FullPartyBar_C_OnButtonHovered__DelegateSignature");
static_assert(offsetof(FullPartyBar_C_OnButtonHovered__DelegateSignature, HelpText) == 0x000000, "Member 'FullPartyBar_C_OnButtonHovered__DelegateSignature::HelpText' has a wrong offset!");

// Function FullPartyBar.FullPartyBar_C.ExecuteUbergraph_FullPartyBar
// 0x0170 (0x0170 - 0x0000)
struct FullPartyBar_C_ExecuteUbergraph_FullPartyBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumPlayersInLocalParty_ReturnValue;    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button11;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button10;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button9;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button8;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortUIFeature ChangedFeature, EFortUIFeatureState NewState, EFortUIFeatureStateReason StateReason)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0048(0x0018)()
	bool                                          Temp_bool_Variable4;                               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button7;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button6;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button5;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button4;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button3;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isTeammateSlotPopulated_ReturnValue;      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_isTeammateSlotPopulated_ReturnValue2;     // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_isTeammateSlotPopulated_ReturnValue3;     // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00A8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue2;             // 0x00C0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue3;             // 0x00D8(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x00F0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue4;             // 0x0108(0x0018)()
	class FText                                   K2Node_Select2_Default;                            // 0x0120(0x0018)()
	class FText                                   K2Node_Select3_Default;                            // 0x0138(0x0018)()
	class FText                                   K2Node_Select4_Default;                            // 0x0150(0x0018)()
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar) == 0x000008, "Wrong alignment on FullPartyBar_C_ExecuteUbergraph_FullPartyBar");
static_assert(sizeof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar) == 0x000170, "Wrong size on FullPartyBar_C_ExecuteUbergraph_FullPartyBar");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, EntryPoint) == 0x000000, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, Temp_bool_Variable) == 0x000004, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, Temp_bool_Variable2) == 0x000005, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, Temp_bool_Variable3) == 0x000006, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, CallFunc_GetNumPlayersInLocalParty_ReturnValue) == 0x000010, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::CallFunc_GetNumPlayersInLocalParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, CallFunc_Greater_IntInt_ReturnValue) == 0x000014, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, K2Node_ComponentBoundEvent_Button11) == 0x000018, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::K2Node_ComponentBoundEvent_Button11' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, K2Node_ComponentBoundEvent_Button10) == 0x000020, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::K2Node_ComponentBoundEvent_Button10' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, K2Node_ComponentBoundEvent_Button9) == 0x000028, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::K2Node_ComponentBoundEvent_Button9' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, K2Node_ComponentBoundEvent_Button8) == 0x000030, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::K2Node_ComponentBoundEvent_Button8' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, CallFunc_GetEmptyText_ReturnValue) == 0x000048, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, Temp_bool_Variable4) == 0x000060, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, K2Node_ComponentBoundEvent_Button7) == 0x000068, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::K2Node_ComponentBoundEvent_Button7' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, K2Node_ComponentBoundEvent_Button6) == 0x000070, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::K2Node_ComponentBoundEvent_Button6' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, K2Node_ComponentBoundEvent_Button5) == 0x000078, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::K2Node_ComponentBoundEvent_Button5' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, K2Node_ComponentBoundEvent_Button4) == 0x000080, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::K2Node_ComponentBoundEvent_Button4' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, K2Node_ComponentBoundEvent_Button3) == 0x000088, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, K2Node_ComponentBoundEvent_Button2) == 0x000090, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, K2Node_ComponentBoundEvent_Button) == 0x000098, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, CallFunc_isTeammateSlotPopulated_ReturnValue) == 0x0000A0, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::CallFunc_isTeammateSlotPopulated_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, CallFunc_isTeammateSlotPopulated_ReturnValue2) == 0x0000A1, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::CallFunc_isTeammateSlotPopulated_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, CallFunc_isTeammateSlotPopulated_ReturnValue3) == 0x0000A2, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::CallFunc_isTeammateSlotPopulated_ReturnValue3' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, CallFunc_MakeLiteralText_ReturnValue) == 0x0000A8, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, CallFunc_MakeLiteralText_ReturnValue2) == 0x0000C0, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::CallFunc_MakeLiteralText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, CallFunc_MakeLiteralText_ReturnValue3) == 0x0000D8, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::CallFunc_MakeLiteralText_ReturnValue3' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, K2Node_Select_Default) == 0x0000F0, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, CallFunc_MakeLiteralText_ReturnValue4) == 0x000108, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::CallFunc_MakeLiteralText_ReturnValue4' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, K2Node_Select2_Default) == 0x000120, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, K2Node_Select3_Default) == 0x000138, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, K2Node_Select4_Default) == 0x000150, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_ExecuteUbergraph_FullPartyBar, CallFunc_GetContext_ReturnValue2) == 0x000168, "Member 'FullPartyBar_C_ExecuteUbergraph_FullPartyBar::CallFunc_GetContext_ReturnValue2' has a wrong offset!");

// Function FullPartyBar.FullPartyBar_C.BndEvt__LocalPlayer_K2Node_ComponentBoundEvent_14_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FullPartyBar_C_BndEvt__LocalPlayer_K2Node_ComponentBoundEvent_14_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyBar_C_BndEvt__LocalPlayer_K2Node_ComponentBoundEvent_14_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on FullPartyBar_C_BndEvt__LocalPlayer_K2Node_ComponentBoundEvent_14_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(FullPartyBar_C_BndEvt__LocalPlayer_K2Node_ComponentBoundEvent_14_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on FullPartyBar_C_BndEvt__LocalPlayer_K2Node_ComponentBoundEvent_14_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(FullPartyBar_C_BndEvt__LocalPlayer_K2Node_ComponentBoundEvent_14_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'FullPartyBar_C_BndEvt__LocalPlayer_K2Node_ComponentBoundEvent_14_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function FullPartyBar.FullPartyBar_C.BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_13_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FullPartyBar_C_BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_13_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyBar_C_BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_13_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on FullPartyBar_C_BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_13_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(FullPartyBar_C_BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_13_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on FullPartyBar_C_BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_13_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(FullPartyBar_C_BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_13_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'FullPartyBar_C_BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_13_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function FullPartyBar.FullPartyBar_C.BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_12_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FullPartyBar_C_BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_12_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyBar_C_BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_12_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on FullPartyBar_C_BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_12_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(FullPartyBar_C_BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_12_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on FullPartyBar_C_BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_12_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(FullPartyBar_C_BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_12_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'FullPartyBar_C_BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_12_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function FullPartyBar.FullPartyBar_C.BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FullPartyBar_C_BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyBar_C_BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on FullPartyBar_C_BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(FullPartyBar_C_BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on FullPartyBar_C_BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(FullPartyBar_C_BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'FullPartyBar_C_BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function FullPartyBar.FullPartyBar_C.BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_10_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FullPartyBar_C_BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_10_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyBar_C_BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_10_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on FullPartyBar_C_BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_10_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(FullPartyBar_C_BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_10_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on FullPartyBar_C_BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_10_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(FullPartyBar_C_BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_10_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'FullPartyBar_C_BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_10_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function FullPartyBar.FullPartyBar_C.BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_9_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FullPartyBar_C_BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_9_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyBar_C_BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_9_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on FullPartyBar_C_BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_9_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(FullPartyBar_C_BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_9_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on FullPartyBar_C_BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_9_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(FullPartyBar_C_BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_9_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'FullPartyBar_C_BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_9_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function FullPartyBar.FullPartyBar_C.BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FullPartyBar_C_BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyBar_C_BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on FullPartyBar_C_BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(FullPartyBar_C_BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on FullPartyBar_C_BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(FullPartyBar_C_BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'FullPartyBar_C_BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function FullPartyBar.FullPartyBar_C.BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FullPartyBar_C_BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyBar_C_BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on FullPartyBar_C_BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(FullPartyBar_C_BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on FullPartyBar_C_BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(FullPartyBar_C_BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'FullPartyBar_C_BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function FullPartyBar.FullPartyBar_C.BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FullPartyBar_C_BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyBar_C_BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on FullPartyBar_C_BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(FullPartyBar_C_BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on FullPartyBar_C_BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(FullPartyBar_C_BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'FullPartyBar_C_BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function FullPartyBar.FullPartyBar_C.BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FullPartyBar_C_BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyBar_C_BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on FullPartyBar_C_BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(FullPartyBar_C_BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on FullPartyBar_C_BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(FullPartyBar_C_BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'FullPartyBar_C_BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function FullPartyBar.FullPartyBar_C.BndEvt__LocalPlayer_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FullPartyBar_C_BndEvt__LocalPlayer_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyBar_C_BndEvt__LocalPlayer_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on FullPartyBar_C_BndEvt__LocalPlayer_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(FullPartyBar_C_BndEvt__LocalPlayer_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on FullPartyBar_C_BndEvt__LocalPlayer_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(FullPartyBar_C_BndEvt__LocalPlayer_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'FullPartyBar_C_BndEvt__LocalPlayer_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function FullPartyBar.FullPartyBar_C.BindDelegates
// 0x0028 (0x0028 - 0x0000)
struct FullPartyBar_C_BindDelegates final
{
public:
	TDelegate<void(EFortUIFeature ChangedFeature, EFortUIFeatureState NewState, EFortUIFeatureStateReason StateReason)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUITeamInfo*                        CallFunc_GetLocalPlayerTeam_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyBar_C_BindDelegates) == 0x000008, "Wrong alignment on FullPartyBar_C_BindDelegates");
static_assert(sizeof(FullPartyBar_C_BindDelegates) == 0x000028, "Wrong size on FullPartyBar_C_BindDelegates");
static_assert(offsetof(FullPartyBar_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'FullPartyBar_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_BindDelegates, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'FullPartyBar_C_BindDelegates::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_BindDelegates, CallFunc_GetContext_ReturnValue2) == 0x000018, "Member 'FullPartyBar_C_BindDelegates::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_BindDelegates, CallFunc_GetLocalPlayerTeam_ReturnValue) == 0x000020, "Member 'FullPartyBar_C_BindDelegates::CallFunc_GetLocalPlayerTeam_ReturnValue' has a wrong offset!");

// Function FullPartyBar.FullPartyBar_C.Initialize
// 0x0010 (0x0010 - 0x0000)
struct FullPartyBar_C_Initialize final
{
public:
	class UFortUIDataConfigurationContext*        CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ArePartyFeaturesEnabled_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FullPartyBar_C_Initialize) == 0x000008, "Wrong alignment on FullPartyBar_C_Initialize");
static_assert(sizeof(FullPartyBar_C_Initialize) == 0x000010, "Wrong size on FullPartyBar_C_Initialize");
static_assert(offsetof(FullPartyBar_C_Initialize, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'FullPartyBar_C_Initialize::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_Initialize, CallFunc_ArePartyFeaturesEnabled_ReturnValue) == 0x000008, "Member 'FullPartyBar_C_Initialize::CallFunc_ArePartyFeaturesEnabled_ReturnValue' has a wrong offset!");

// Function FullPartyBar.FullPartyBar_C.HandlePartybarUIFeatureChanged
// 0x000A (0x000A - 0x0000)
struct FullPartyBar_C_HandlePartybarUIFeatureChanged final
{
public:
	EFortUIFeature                                Feature;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureState                           FeatureState;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureStateReason                     Reason;                                            // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureState                           Temp_byte_Variable5;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyBar_C_HandlePartybarUIFeatureChanged) == 0x000001, "Wrong alignment on FullPartyBar_C_HandlePartybarUIFeatureChanged");
static_assert(sizeof(FullPartyBar_C_HandlePartybarUIFeatureChanged) == 0x00000A, "Wrong size on FullPartyBar_C_HandlePartybarUIFeatureChanged");
static_assert(offsetof(FullPartyBar_C_HandlePartybarUIFeatureChanged, Feature) == 0x000000, "Member 'FullPartyBar_C_HandlePartybarUIFeatureChanged::Feature' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_HandlePartybarUIFeatureChanged, FeatureState) == 0x000001, "Member 'FullPartyBar_C_HandlePartybarUIFeatureChanged::FeatureState' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_HandlePartybarUIFeatureChanged, Reason) == 0x000002, "Member 'FullPartyBar_C_HandlePartybarUIFeatureChanged::Reason' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_HandlePartybarUIFeatureChanged, Temp_byte_Variable) == 0x000003, "Member 'FullPartyBar_C_HandlePartybarUIFeatureChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_HandlePartybarUIFeatureChanged, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'FullPartyBar_C_HandlePartybarUIFeatureChanged::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_HandlePartybarUIFeatureChanged, Temp_byte_Variable2) == 0x000005, "Member 'FullPartyBar_C_HandlePartybarUIFeatureChanged::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_HandlePartybarUIFeatureChanged, Temp_byte_Variable3) == 0x000006, "Member 'FullPartyBar_C_HandlePartybarUIFeatureChanged::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_HandlePartybarUIFeatureChanged, Temp_byte_Variable4) == 0x000007, "Member 'FullPartyBar_C_HandlePartybarUIFeatureChanged::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_HandlePartybarUIFeatureChanged, Temp_byte_Variable5) == 0x000008, "Member 'FullPartyBar_C_HandlePartybarUIFeatureChanged::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_HandlePartybarUIFeatureChanged, K2Node_Select_Default) == 0x000009, "Member 'FullPartyBar_C_HandlePartybarUIFeatureChanged::K2Node_Select_Default' has a wrong offset!");

// Function FullPartyBar.FullPartyBar_C.OpenPartyPrivacy
// 0x0008 (0x0008 - 0x0000)
struct FullPartyBar_C_OpenPartyPrivacy final
{
public:
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyBar_C_OpenPartyPrivacy) == 0x000008, "Wrong alignment on FullPartyBar_C_OpenPartyPrivacy");
static_assert(sizeof(FullPartyBar_C_OpenPartyPrivacy) == 0x000008, "Wrong size on FullPartyBar_C_OpenPartyPrivacy");
static_assert(offsetof(FullPartyBar_C_OpenPartyPrivacy, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000000, "Member 'FullPartyBar_C_OpenPartyPrivacy::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function FullPartyBar.FullPartyBar_C.isTeammateSlotPopulated
// 0x0050 (0x0050 - 0x0000)
struct FullPartyBar_C_IsTeammateSlotPopulated final
{
public:
	int32                                         InSlotNUmber;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FUniqueNetIdRepl>               CallFunc_GetTeamMemberIDs_TeamMemberIDs;           // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_Array_Get_Item;                           // 0x0020(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidNetID_ReturnValue;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FullPartyBar_C_IsTeammateSlotPopulated) == 0x000008, "Wrong alignment on FullPartyBar_C_IsTeammateSlotPopulated");
static_assert(sizeof(FullPartyBar_C_IsTeammateSlotPopulated) == 0x000050, "Wrong size on FullPartyBar_C_IsTeammateSlotPopulated");
static_assert(offsetof(FullPartyBar_C_IsTeammateSlotPopulated, InSlotNUmber) == 0x000000, "Member 'FullPartyBar_C_IsTeammateSlotPopulated::InSlotNUmber' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_IsTeammateSlotPopulated, ReturnValue) == 0x000004, "Member 'FullPartyBar_C_IsTeammateSlotPopulated::ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_IsTeammateSlotPopulated, CallFunc_GetTeamMemberIDs_TeamMemberIDs) == 0x000008, "Member 'FullPartyBar_C_IsTeammateSlotPopulated::CallFunc_GetTeamMemberIDs_TeamMemberIDs' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_IsTeammateSlotPopulated, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000018, "Member 'FullPartyBar_C_IsTeammateSlotPopulated::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_IsTeammateSlotPopulated, CallFunc_Array_Get_Item) == 0x000020, "Member 'FullPartyBar_C_IsTeammateSlotPopulated::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_IsTeammateSlotPopulated, CallFunc_IsValidNetID_ReturnValue) == 0x000048, "Member 'FullPartyBar_C_IsTeammateSlotPopulated::CallFunc_IsValidNetID_ReturnValue' has a wrong offset!");

// Function FullPartyBar.FullPartyBar_C.GetTotalNumFriendCodes
// 0x0020 (0x0020 - 0x0000)
struct FullPartyBar_C_GetTotalNumFriendCodes final
{
public:
	int32                                         Num_Codes;                                         // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumFriendCodesToIssue_ReturnValue;     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyBar_C_GetTotalNumFriendCodes) == 0x000008, "Wrong alignment on FullPartyBar_C_GetTotalNumFriendCodes");
static_assert(sizeof(FullPartyBar_C_GetTotalNumFriendCodes) == 0x000020, "Wrong size on FullPartyBar_C_GetTotalNumFriendCodes");
static_assert(offsetof(FullPartyBar_C_GetTotalNumFriendCodes, Num_Codes) == 0x000000, "Member 'FullPartyBar_C_GetTotalNumFriendCodes::Num_Codes' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_GetTotalNumFriendCodes, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'FullPartyBar_C_GetTotalNumFriendCodes::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_GetTotalNumFriendCodes, CallFunc_GetNumFriendCodesToIssue_ReturnValue) == 0x000010, "Member 'FullPartyBar_C_GetTotalNumFriendCodes::CallFunc_GetNumFriendCodesToIssue_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_GetTotalNumFriendCodes, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'FullPartyBar_C_GetTotalNumFriendCodes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_GetTotalNumFriendCodes, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'FullPartyBar_C_GetTotalNumFriendCodes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function FullPartyBar.FullPartyBar_C.Get_Fortitude_ToolTipWidget
// 0x00A0 (0x00A0 - 0x0000)
struct FullPartyBar_C_Get_Fortitude_ToolTipWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortDisplayAttribute                  CallFunc_GetTooltipStat_OutDisplayAttribute;       // 0x0008(0x0070)()
	bool                                          CallFunc_GetTooltipStat_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_Basic_Tooltip_Output;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FullPartyBar_C_Get_Fortitude_ToolTipWidget) == 0x000008, "Wrong alignment on FullPartyBar_C_Get_Fortitude_ToolTipWidget");
static_assert(sizeof(FullPartyBar_C_Get_Fortitude_ToolTipWidget) == 0x0000A0, "Wrong size on FullPartyBar_C_Get_Fortitude_ToolTipWidget");
static_assert(offsetof(FullPartyBar_C_Get_Fortitude_ToolTipWidget, ReturnValue) == 0x000000, "Member 'FullPartyBar_C_Get_Fortitude_ToolTipWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_Get_Fortitude_ToolTipWidget, CallFunc_GetTooltipStat_OutDisplayAttribute) == 0x000008, "Member 'FullPartyBar_C_Get_Fortitude_ToolTipWidget::CallFunc_GetTooltipStat_OutDisplayAttribute' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_Get_Fortitude_ToolTipWidget, CallFunc_GetTooltipStat_ReturnValue) == 0x000078, "Member 'FullPartyBar_C_Get_Fortitude_ToolTipWidget::CallFunc_GetTooltipStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_Get_Fortitude_ToolTipWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000080, "Member 'FullPartyBar_C_Get_Fortitude_ToolTipWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_Get_Fortitude_ToolTipWidget, CallFunc_GetContext_ReturnValue) == 0x000088, "Member 'FullPartyBar_C_Get_Fortitude_ToolTipWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_Get_Fortitude_ToolTipWidget, CallFunc_Create_Basic_Tooltip_Output) == 0x000090, "Member 'FullPartyBar_C_Get_Fortitude_ToolTipWidget::CallFunc_Create_Basic_Tooltip_Output' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_Get_Fortitude_ToolTipWidget, CallFunc_IsUsingGamepad_ReturnValue) == 0x000098, "Member 'FullPartyBar_C_Get_Fortitude_ToolTipWidget::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");

// Function FullPartyBar.FullPartyBar_C.Get_Offense_ToolTipWidget
// 0x00A0 (0x00A0 - 0x0000)
struct FullPartyBar_C_Get_Offense_ToolTipWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortDisplayAttribute                  CallFunc_GetTooltipStat_OutDisplayAttribute;       // 0x0008(0x0070)()
	bool                                          CallFunc_GetTooltipStat_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_Basic_Tooltip_Output;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FullPartyBar_C_Get_Offense_ToolTipWidget) == 0x000008, "Wrong alignment on FullPartyBar_C_Get_Offense_ToolTipWidget");
static_assert(sizeof(FullPartyBar_C_Get_Offense_ToolTipWidget) == 0x0000A0, "Wrong size on FullPartyBar_C_Get_Offense_ToolTipWidget");
static_assert(offsetof(FullPartyBar_C_Get_Offense_ToolTipWidget, ReturnValue) == 0x000000, "Member 'FullPartyBar_C_Get_Offense_ToolTipWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_Get_Offense_ToolTipWidget, CallFunc_GetTooltipStat_OutDisplayAttribute) == 0x000008, "Member 'FullPartyBar_C_Get_Offense_ToolTipWidget::CallFunc_GetTooltipStat_OutDisplayAttribute' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_Get_Offense_ToolTipWidget, CallFunc_GetTooltipStat_ReturnValue) == 0x000078, "Member 'FullPartyBar_C_Get_Offense_ToolTipWidget::CallFunc_GetTooltipStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_Get_Offense_ToolTipWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000080, "Member 'FullPartyBar_C_Get_Offense_ToolTipWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_Get_Offense_ToolTipWidget, CallFunc_GetContext_ReturnValue) == 0x000088, "Member 'FullPartyBar_C_Get_Offense_ToolTipWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_Get_Offense_ToolTipWidget, CallFunc_Create_Basic_Tooltip_Output) == 0x000090, "Member 'FullPartyBar_C_Get_Offense_ToolTipWidget::CallFunc_Create_Basic_Tooltip_Output' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_Get_Offense_ToolTipWidget, CallFunc_IsUsingGamepad_ReturnValue) == 0x000098, "Member 'FullPartyBar_C_Get_Offense_ToolTipWidget::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");

// Function FullPartyBar.FullPartyBar_C.Get_Resistance_ToolTipWidget
// 0x00A0 (0x00A0 - 0x0000)
struct FullPartyBar_C_Get_Resistance_ToolTipWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortDisplayAttribute                  CallFunc_GetTooltipStat_OutDisplayAttribute;       // 0x0008(0x0070)()
	bool                                          CallFunc_GetTooltipStat_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_Basic_Tooltip_Output;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FullPartyBar_C_Get_Resistance_ToolTipWidget) == 0x000008, "Wrong alignment on FullPartyBar_C_Get_Resistance_ToolTipWidget");
static_assert(sizeof(FullPartyBar_C_Get_Resistance_ToolTipWidget) == 0x0000A0, "Wrong size on FullPartyBar_C_Get_Resistance_ToolTipWidget");
static_assert(offsetof(FullPartyBar_C_Get_Resistance_ToolTipWidget, ReturnValue) == 0x000000, "Member 'FullPartyBar_C_Get_Resistance_ToolTipWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_Get_Resistance_ToolTipWidget, CallFunc_GetTooltipStat_OutDisplayAttribute) == 0x000008, "Member 'FullPartyBar_C_Get_Resistance_ToolTipWidget::CallFunc_GetTooltipStat_OutDisplayAttribute' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_Get_Resistance_ToolTipWidget, CallFunc_GetTooltipStat_ReturnValue) == 0x000078, "Member 'FullPartyBar_C_Get_Resistance_ToolTipWidget::CallFunc_GetTooltipStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_Get_Resistance_ToolTipWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000080, "Member 'FullPartyBar_C_Get_Resistance_ToolTipWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_Get_Resistance_ToolTipWidget, CallFunc_GetContext_ReturnValue) == 0x000088, "Member 'FullPartyBar_C_Get_Resistance_ToolTipWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_Get_Resistance_ToolTipWidget, CallFunc_Create_Basic_Tooltip_Output) == 0x000090, "Member 'FullPartyBar_C_Get_Resistance_ToolTipWidget::CallFunc_Create_Basic_Tooltip_Output' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_Get_Resistance_ToolTipWidget, CallFunc_IsUsingGamepad_ReturnValue) == 0x000098, "Member 'FullPartyBar_C_Get_Resistance_ToolTipWidget::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");

// Function FullPartyBar.FullPartyBar_C.Get_Tech_ToolTipWidget
// 0x00A0 (0x00A0 - 0x0000)
struct FullPartyBar_C_Get_Tech_ToolTipWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortDisplayAttribute                  CallFunc_GetTooltipStat_OutDisplayAttribute;       // 0x0008(0x0070)()
	bool                                          CallFunc_GetTooltipStat_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_Basic_Tooltip_Output;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FullPartyBar_C_Get_Tech_ToolTipWidget) == 0x000008, "Wrong alignment on FullPartyBar_C_Get_Tech_ToolTipWidget");
static_assert(sizeof(FullPartyBar_C_Get_Tech_ToolTipWidget) == 0x0000A0, "Wrong size on FullPartyBar_C_Get_Tech_ToolTipWidget");
static_assert(offsetof(FullPartyBar_C_Get_Tech_ToolTipWidget, ReturnValue) == 0x000000, "Member 'FullPartyBar_C_Get_Tech_ToolTipWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_Get_Tech_ToolTipWidget, CallFunc_GetTooltipStat_OutDisplayAttribute) == 0x000008, "Member 'FullPartyBar_C_Get_Tech_ToolTipWidget::CallFunc_GetTooltipStat_OutDisplayAttribute' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_Get_Tech_ToolTipWidget, CallFunc_GetTooltipStat_ReturnValue) == 0x000078, "Member 'FullPartyBar_C_Get_Tech_ToolTipWidget::CallFunc_GetTooltipStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_Get_Tech_ToolTipWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000080, "Member 'FullPartyBar_C_Get_Tech_ToolTipWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_Get_Tech_ToolTipWidget, CallFunc_GetContext_ReturnValue) == 0x000088, "Member 'FullPartyBar_C_Get_Tech_ToolTipWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_Get_Tech_ToolTipWidget, CallFunc_Create_Basic_Tooltip_Output) == 0x000090, "Member 'FullPartyBar_C_Get_Tech_ToolTipWidget::CallFunc_Create_Basic_Tooltip_Output' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_Get_Tech_ToolTipWidget, CallFunc_IsUsingGamepad_ReturnValue) == 0x000098, "Member 'FullPartyBar_C_Get_Tech_ToolTipWidget::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");

// Function FullPartyBar.FullPartyBar_C.InitializeStatLabels
// 0x01E0 (0x01E0 - 0x0000)
struct FullPartyBar_C_InitializeStatLabels final
{
public:
	struct FFortDisplayAttribute                  CallFunc_GetTooltipStat_OutDisplayAttribute;       // 0x0000(0x0070)()
	bool                                          CallFunc_GetTooltipStat_ReturnValue;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortDisplayAttribute                  CallFunc_GetTooltipStat_OutDisplayAttribute2;      // 0x0078(0x0070)()
	bool                                          CallFunc_GetTooltipStat_ReturnValue2;              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortDisplayAttribute                  CallFunc_GetTooltipStat_OutDisplayAttribute3;      // 0x00F0(0x0070)()
	bool                                          CallFunc_GetTooltipStat_ReturnValue3;              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortDisplayAttribute                  CallFunc_GetTooltipStat_OutDisplayAttribute4;      // 0x0168(0x0070)()
	bool                                          CallFunc_GetTooltipStat_ReturnValue4;              // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FullPartyBar_C_InitializeStatLabels) == 0x000008, "Wrong alignment on FullPartyBar_C_InitializeStatLabels");
static_assert(sizeof(FullPartyBar_C_InitializeStatLabels) == 0x0001E0, "Wrong size on FullPartyBar_C_InitializeStatLabels");
static_assert(offsetof(FullPartyBar_C_InitializeStatLabels, CallFunc_GetTooltipStat_OutDisplayAttribute) == 0x000000, "Member 'FullPartyBar_C_InitializeStatLabels::CallFunc_GetTooltipStat_OutDisplayAttribute' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_InitializeStatLabels, CallFunc_GetTooltipStat_ReturnValue) == 0x000070, "Member 'FullPartyBar_C_InitializeStatLabels::CallFunc_GetTooltipStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyBar_C_InitializeStatLabels, CallFunc_GetTooltipStat_OutDisplayAttribute2) == 0x000078, "Member 'FullPartyBar_C_InitializeStatLabels::CallFunc_GetTooltipStat_OutDisplayAttribute2' has a wrong offset!");
