#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Grenade_WithTrajectory

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_Grenade_WithTrajectory.GA_Athena_Grenade_WithTrajectory_C.ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory
// 0x0540 (0x0540 - 0x0000)
struct GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData4;                // 0x0008(0x0028)(ConstParm, ContainsInstancedReference)
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData3;                // 0x0030(0x0028)(ConstParm, ContainsInstancedReference)
	TDelegate<void(struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData2;                // 0x0068(0x0028)(ConstParm, ContainsInstancedReference)
	TDelegate<void(struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData;                 // 0x00A0(0x0028)(ConstParm, ContainsInstancedReference)
	TDelegate<void(struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate3;             // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	struct FProjectileEventData                   Temp_struct_Variable;                              // 0x00D8(0x0028)(ContainsInstancedReference)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData3;                    // 0x0110(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag3;                // 0x0130(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x0138(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x0158(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate5;             // 0x0160(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0170(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0190(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0198(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable2;                             // 0x01A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable3;                             // 0x01B0(0x0020)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x01D0(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x01E8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue2;                   // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate9;             // 0x0208(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate10;            // 0x0220(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate11;            // 0x0230(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate12;            // 0x0240(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate13;            // 0x0250(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue3;                   // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26A[0x6];                                      // 0x026A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate14;            // 0x0270(0x0010)(ZeroConstructor, NoDestructor)
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData6;                // 0x0280(0x0028)(ConstParm, ContainsInstancedReference)
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate15;            // 0x02B0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x02C4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Direction;                      // 0x02D0(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SpawnLocationAndRotation_OutLoc;          // 0x02DC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_SpawnLocationAndRotation_OutRot;          // 0x02E8(0x000C)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_SetupGrenade_Base_Grenade;                // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetupGrenade_Projectile_Speed;            // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortGameplayEffectContainerSpec       CallFunc_SetupGrenade_Explosion_Gameplay_Spec;     // 0x0310(0x0080)()
	float                                         CallFunc_SetupGrenade_Projectile_Gravity_Scale;    // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData5;                // 0x0398(0x0028)(ConstParm, ContainsInstancedReference)
	TDelegate<void(struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate16;            // 0x03C0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsStandalone_ReturnValue;                 // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x03D8(0x0008)(NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x03E8(0x0040)(ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0438(0x00A8)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x04E0(0x0020)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0500(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0511(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0512(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0513(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0514(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_515[0x3];                                      // 0x0515(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_SpawnProjectileAndWait* CallFunc_SpawnProjectileAndWait_ReturnValue;       // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortProjectileBase*                    CallFunc_BeginSpawningActor_SpawnedActor;          // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0529(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue2;            // 0x052A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52B[0x5];                                      // 0x052B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory) == 0x000008, "Wrong alignment on GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory");
static_assert(sizeof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory) == 0x000540, "Wrong size on GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, EntryPoint) == 0x000000, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CustomEvent_ProjectileData4) == 0x000008, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CustomEvent_ProjectileData4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CustomEvent_ProjectileData3) == 0x000030, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CustomEvent_ProjectileData3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CustomEvent_ProjectileData2) == 0x000068, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CustomEvent_ProjectileData2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CreateDelegate_OutputDelegate2) == 0x000090, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CustomEvent_ProjectileData) == 0x0000A0, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CustomEvent_ProjectileData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CreateDelegate_OutputDelegate3) == 0x0000C8, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, Temp_struct_Variable) == 0x0000D8, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CreateDelegate_OutputDelegate4) == 0x000100, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CustomEvent_TargetData3) == 0x000110, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CustomEvent_TargetData3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CustomEvent_ApplicationTag3) == 0x000130, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CustomEvent_ApplicationTag3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CustomEvent_TargetData2) == 0x000138, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CustomEvent_ApplicationTag2) == 0x000158, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CreateDelegate_OutputDelegate5) == 0x000160, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CustomEvent_TargetData) == 0x000170, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CustomEvent_ApplicationTag) == 0x000190, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CreateDelegate_OutputDelegate6) == 0x000198, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, Temp_struct_Variable2) == 0x0001A8, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, Temp_struct_Variable3) == 0x0001B0, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CreateDelegate_OutputDelegate7) == 0x0001D0, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_WaitDelay_ReturnValue) == 0x0001E0, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CreateDelegate_OutputDelegate8) == 0x0001E8, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_IsValid_ReturnValue) == 0x0001F8, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_WaitDelay_ReturnValue2) == 0x000200, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_WaitDelay_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CreateDelegate_OutputDelegate9) == 0x000208, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_IsValid_ReturnValue2) == 0x000218, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CreateDelegate_OutputDelegate10) == 0x000220, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CreateDelegate_OutputDelegate11) == 0x000230, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CreateDelegate_OutputDelegate12) == 0x000240, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CreateDelegate_OutputDelegate12' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CreateDelegate_OutputDelegate13) == 0x000250, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CreateDelegate_OutputDelegate13' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_WaitDelay_ReturnValue3) == 0x000260, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_WaitDelay_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_K2_CommitAbility_ReturnValue) == 0x000268, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_IsValid_ReturnValue3) == 0x000269, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CreateDelegate_OutputDelegate14) == 0x000270, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CreateDelegate_OutputDelegate14' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CustomEvent_ProjectileData6) == 0x000280, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CustomEvent_ProjectileData6' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x0002A8, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CreateDelegate_OutputDelegate15) == 0x0002B0, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CreateDelegate_OutputDelegate15' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_IsValid_ReturnValue4) == 0x0002C0, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CustomEvent_Location) == 0x0002C4, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CustomEvent_Direction) == 0x0002D0, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CustomEvent_Direction' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_SpawnLocationAndRotation_OutLoc) == 0x0002DC, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_SpawnLocationAndRotation_OutLoc' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_SpawnLocationAndRotation_OutRot) == 0x0002E8, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_SpawnLocationAndRotation_OutRot' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_BreakRotator_Roll) == 0x0002F4, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_BreakRotator_Pitch) == 0x0002F8, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_BreakRotator_Yaw) == 0x0002FC, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_SetupGrenade_Base_Grenade) == 0x000300, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_SetupGrenade_Base_Grenade' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_SetupGrenade_Projectile_Speed) == 0x000308, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_SetupGrenade_Projectile_Speed' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_SetupGrenade_Explosion_Gameplay_Spec) == 0x000310, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_SetupGrenade_Explosion_Gameplay_Spec' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_SetupGrenade_Projectile_Gravity_Scale) == 0x000390, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_SetupGrenade_Projectile_Gravity_Scale' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CustomEvent_ProjectileData5) == 0x000398, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CustomEvent_ProjectileData5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_CreateDelegate_OutputDelegate16) == 0x0003C0, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_CreateDelegate_OutputDelegate16' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_IsStandalone_ReturnValue) == 0x0003D0, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_IsStandalone_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_K2_SetTimer_ReturnValue) == 0x0003D8, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_Event_bWasCancelled) == 0x0003E0, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_GetActorInfo_ReturnValue) == 0x0003E8, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000428, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_DynamicCast_bSuccess) == 0x000430, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, K2Node_MakeStruct_GameplayEventData) == 0x000438, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0004E0, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000500, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_IsLocallyControlled_ReturnValue) == 0x000510, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_HasAuthority_ReturnValue) == 0x000511, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_Not_PreBool_ReturnValue) == 0x000512, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_BooleanAND_ReturnValue) == 0x000513, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_BooleanOR_ReturnValue) == 0x000514, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_SpawnProjectileAndWait_ReturnValue) == 0x000518, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_SpawnProjectileAndWait_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_BeginSpawningActor_SpawnedActor) == 0x000520, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_BeginSpawningActor_ReturnValue) == 0x000528, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_IsValid_ReturnValue5) == 0x000529, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_K2_CommitAbility_ReturnValue2) == 0x00052A, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_K2_CommitAbility_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000530, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory, CallFunc_IsValid_ReturnValue6) == 0x000538, "Member 'GA_Athena_Grenade_WithTrajectory_C_ExecuteUbergraph_GA_Athena_Grenade_WithTrajectory::CallFunc_IsValid_ReturnValue6' has a wrong offset!");

// Function GA_Athena_Grenade_WithTrajectory.GA_Athena_Grenade_WithTrajectory_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_Grenade_WithTrajectory_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_Grenade_WithTrajectory_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Athena_Grenade_WithTrajectory_C_K2_OnEndAbility");
static_assert(sizeof(GA_Athena_Grenade_WithTrajectory_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Athena_Grenade_WithTrajectory_C_K2_OnEndAbility");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Athena_Grenade_WithTrajectory_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Athena_Grenade_WithTrajectory.GA_Athena_Grenade_WithTrajectory_C.Server_SpawnProjectile
// 0x0018 (0x0018 - 0x0000)
struct GA_Athena_Grenade_WithTrajectory_C_Server_SpawnProjectile final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Direction;                                         // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_Grenade_WithTrajectory_C_Server_SpawnProjectile) == 0x000004, "Wrong alignment on GA_Athena_Grenade_WithTrajectory_C_Server_SpawnProjectile");
static_assert(sizeof(GA_Athena_Grenade_WithTrajectory_C_Server_SpawnProjectile) == 0x000018, "Wrong size on GA_Athena_Grenade_WithTrajectory_C_Server_SpawnProjectile");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_Server_SpawnProjectile, Location) == 0x000000, "Member 'GA_Athena_Grenade_WithTrajectory_C_Server_SpawnProjectile::Location' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_Server_SpawnProjectile, Direction) == 0x00000C, "Member 'GA_Athena_Grenade_WithTrajectory_C_Server_SpawnProjectile::Direction' has a wrong offset!");

// Function GA_Athena_Grenade_WithTrajectory.GA_Athena_Grenade_WithTrajectory_C.Triggered_B08560984B3818F6EECB3C9A92E61ADC
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Grenade_WithTrajectory_C_Triggered_B08560984B3818F6EECB3C9A92E61ADC final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Grenade_WithTrajectory_C_Triggered_B08560984B3818F6EECB3C9A92E61ADC) == 0x000008, "Wrong alignment on GA_Athena_Grenade_WithTrajectory_C_Triggered_B08560984B3818F6EECB3C9A92E61ADC");
static_assert(sizeof(GA_Athena_Grenade_WithTrajectory_C_Triggered_B08560984B3818F6EECB3C9A92E61ADC) == 0x000028, "Wrong size on GA_Athena_Grenade_WithTrajectory_C_Triggered_B08560984B3818F6EECB3C9A92E61ADC");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_Triggered_B08560984B3818F6EECB3C9A92E61ADC, TargetData) == 0x000000, "Member 'GA_Athena_Grenade_WithTrajectory_C_Triggered_B08560984B3818F6EECB3C9A92E61ADC::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_Triggered_B08560984B3818F6EECB3C9A92E61ADC, ApplicationTag) == 0x000020, "Member 'GA_Athena_Grenade_WithTrajectory_C_Triggered_B08560984B3818F6EECB3C9A92E61ADC::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Grenade_WithTrajectory.GA_Athena_Grenade_WithTrajectory_C.Cancelled_B08560984B3818F6EECB3C9A92E61ADC
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Grenade_WithTrajectory_C_Cancelled_B08560984B3818F6EECB3C9A92E61ADC final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Grenade_WithTrajectory_C_Cancelled_B08560984B3818F6EECB3C9A92E61ADC) == 0x000008, "Wrong alignment on GA_Athena_Grenade_WithTrajectory_C_Cancelled_B08560984B3818F6EECB3C9A92E61ADC");
static_assert(sizeof(GA_Athena_Grenade_WithTrajectory_C_Cancelled_B08560984B3818F6EECB3C9A92E61ADC) == 0x000028, "Wrong size on GA_Athena_Grenade_WithTrajectory_C_Cancelled_B08560984B3818F6EECB3C9A92E61ADC");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_Cancelled_B08560984B3818F6EECB3C9A92E61ADC, TargetData) == 0x000000, "Member 'GA_Athena_Grenade_WithTrajectory_C_Cancelled_B08560984B3818F6EECB3C9A92E61ADC::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_Cancelled_B08560984B3818F6EECB3C9A92E61ADC, ApplicationTag) == 0x000020, "Member 'GA_Athena_Grenade_WithTrajectory_C_Cancelled_B08560984B3818F6EECB3C9A92E61ADC::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Grenade_WithTrajectory.GA_Athena_Grenade_WithTrajectory_C.Completed_B08560984B3818F6EECB3C9A92E61ADC
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Grenade_WithTrajectory_C_Completed_B08560984B3818F6EECB3C9A92E61ADC final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Grenade_WithTrajectory_C_Completed_B08560984B3818F6EECB3C9A92E61ADC) == 0x000008, "Wrong alignment on GA_Athena_Grenade_WithTrajectory_C_Completed_B08560984B3818F6EECB3C9A92E61ADC");
static_assert(sizeof(GA_Athena_Grenade_WithTrajectory_C_Completed_B08560984B3818F6EECB3C9A92E61ADC) == 0x000028, "Wrong size on GA_Athena_Grenade_WithTrajectory_C_Completed_B08560984B3818F6EECB3C9A92E61ADC");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_Completed_B08560984B3818F6EECB3C9A92E61ADC, TargetData) == 0x000000, "Member 'GA_Athena_Grenade_WithTrajectory_C_Completed_B08560984B3818F6EECB3C9A92E61ADC::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_Completed_B08560984B3818F6EECB3C9A92E61ADC, ApplicationTag) == 0x000020, "Member 'GA_Athena_Grenade_WithTrajectory_C_Completed_B08560984B3818F6EECB3C9A92E61ADC::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Grenade_WithTrajectory.GA_Athena_Grenade_WithTrajectory_C.Created_40FE015D40E881984FE611B980B75D52
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Grenade_WithTrajectory_C_Created_40FE015D40E881984FE611B980B75D52 final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Athena_Grenade_WithTrajectory_C_Created_40FE015D40E881984FE611B980B75D52) == 0x000008, "Wrong alignment on GA_Athena_Grenade_WithTrajectory_C_Created_40FE015D40E881984FE611B980B75D52");
static_assert(sizeof(GA_Athena_Grenade_WithTrajectory_C_Created_40FE015D40E881984FE611B980B75D52) == 0x000028, "Wrong size on GA_Athena_Grenade_WithTrajectory_C_Created_40FE015D40E881984FE611B980B75D52");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_Created_40FE015D40E881984FE611B980B75D52, ProjectileData) == 0x000000, "Member 'GA_Athena_Grenade_WithTrajectory_C_Created_40FE015D40E881984FE611B980B75D52::ProjectileData' has a wrong offset!");

// Function GA_Athena_Grenade_WithTrajectory.GA_Athena_Grenade_WithTrajectory_C.Touched_40FE015D40E881984FE611B980B75D52
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Grenade_WithTrajectory_C_Touched_40FE015D40E881984FE611B980B75D52 final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Athena_Grenade_WithTrajectory_C_Touched_40FE015D40E881984FE611B980B75D52) == 0x000008, "Wrong alignment on GA_Athena_Grenade_WithTrajectory_C_Touched_40FE015D40E881984FE611B980B75D52");
static_assert(sizeof(GA_Athena_Grenade_WithTrajectory_C_Touched_40FE015D40E881984FE611B980B75D52) == 0x000028, "Wrong size on GA_Athena_Grenade_WithTrajectory_C_Touched_40FE015D40E881984FE611B980B75D52");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_Touched_40FE015D40E881984FE611B980B75D52, ProjectileData) == 0x000000, "Member 'GA_Athena_Grenade_WithTrajectory_C_Touched_40FE015D40E881984FE611B980B75D52::ProjectileData' has a wrong offset!");

// Function GA_Athena_Grenade_WithTrajectory.GA_Athena_Grenade_WithTrajectory_C.Bounced_40FE015D40E881984FE611B980B75D52
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Grenade_WithTrajectory_C_Bounced_40FE015D40E881984FE611B980B75D52 final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Athena_Grenade_WithTrajectory_C_Bounced_40FE015D40E881984FE611B980B75D52) == 0x000008, "Wrong alignment on GA_Athena_Grenade_WithTrajectory_C_Bounced_40FE015D40E881984FE611B980B75D52");
static_assert(sizeof(GA_Athena_Grenade_WithTrajectory_C_Bounced_40FE015D40E881984FE611B980B75D52) == 0x000028, "Wrong size on GA_Athena_Grenade_WithTrajectory_C_Bounced_40FE015D40E881984FE611B980B75D52");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_Bounced_40FE015D40E881984FE611B980B75D52, ProjectileData) == 0x000000, "Member 'GA_Athena_Grenade_WithTrajectory_C_Bounced_40FE015D40E881984FE611B980B75D52::ProjectileData' has a wrong offset!");

// Function GA_Athena_Grenade_WithTrajectory.GA_Athena_Grenade_WithTrajectory_C.Stopped_40FE015D40E881984FE611B980B75D52
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Grenade_WithTrajectory_C_Stopped_40FE015D40E881984FE611B980B75D52 final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Athena_Grenade_WithTrajectory_C_Stopped_40FE015D40E881984FE611B980B75D52) == 0x000008, "Wrong alignment on GA_Athena_Grenade_WithTrajectory_C_Stopped_40FE015D40E881984FE611B980B75D52");
static_assert(sizeof(GA_Athena_Grenade_WithTrajectory_C_Stopped_40FE015D40E881984FE611B980B75D52) == 0x000028, "Wrong size on GA_Athena_Grenade_WithTrajectory_C_Stopped_40FE015D40E881984FE611B980B75D52");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_Stopped_40FE015D40E881984FE611B980B75D52, ProjectileData) == 0x000000, "Member 'GA_Athena_Grenade_WithTrajectory_C_Stopped_40FE015D40E881984FE611B980B75D52::ProjectileData' has a wrong offset!");

// Function GA_Athena_Grenade_WithTrajectory.GA_Athena_Grenade_WithTrajectory_C.Exploded_40FE015D40E881984FE611B980B75D52
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Grenade_WithTrajectory_C_Exploded_40FE015D40E881984FE611B980B75D52 final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Athena_Grenade_WithTrajectory_C_Exploded_40FE015D40E881984FE611B980B75D52) == 0x000008, "Wrong alignment on GA_Athena_Grenade_WithTrajectory_C_Exploded_40FE015D40E881984FE611B980B75D52");
static_assert(sizeof(GA_Athena_Grenade_WithTrajectory_C_Exploded_40FE015D40E881984FE611B980B75D52) == 0x000028, "Wrong size on GA_Athena_Grenade_WithTrajectory_C_Exploded_40FE015D40E881984FE611B980B75D52");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_Exploded_40FE015D40E881984FE611B980B75D52, ProjectileData) == 0x000000, "Member 'GA_Athena_Grenade_WithTrajectory_C_Exploded_40FE015D40E881984FE611B980B75D52::ProjectileData' has a wrong offset!");

// Function GA_Athena_Grenade_WithTrajectory.GA_Athena_Grenade_WithTrajectory_C.Destroyed_40FE015D40E881984FE611B980B75D52
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Grenade_WithTrajectory_C_Destroyed_40FE015D40E881984FE611B980B75D52 final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Athena_Grenade_WithTrajectory_C_Destroyed_40FE015D40E881984FE611B980B75D52) == 0x000008, "Wrong alignment on GA_Athena_Grenade_WithTrajectory_C_Destroyed_40FE015D40E881984FE611B980B75D52");
static_assert(sizeof(GA_Athena_Grenade_WithTrajectory_C_Destroyed_40FE015D40E881984FE611B980B75D52) == 0x000028, "Wrong size on GA_Athena_Grenade_WithTrajectory_C_Destroyed_40FE015D40E881984FE611B980B75D52");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_Destroyed_40FE015D40E881984FE611B980B75D52, ProjectileData) == 0x000000, "Member 'GA_Athena_Grenade_WithTrajectory_C_Destroyed_40FE015D40E881984FE611B980B75D52::ProjectileData' has a wrong offset!");

// Function GA_Athena_Grenade_WithTrajectory.GA_Athena_Grenade_WithTrajectory_C.SetupGrenade
// 0x0120 (0x0120 - 0x0000)
struct GA_Athena_Grenade_WithTrajectory_C_SetupGrenade final
{
public:
	float                                         AimPitch;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Base_Grenade;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Projectile_Speed;                                  // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortGameplayEffectContainerSpec       Explosion_Gameplay_Spec;                           // 0x0018(0x0080)(Parm, OutParm)
	float                                         Projectile_Gravity_Scale;                          // 0x0098(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcGrenadeSpeedFromPitch_GrenadeSpeed;   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue; // 0x00A0(0x0080)()
};
static_assert(alignof(GA_Athena_Grenade_WithTrajectory_C_SetupGrenade) == 0x000008, "Wrong alignment on GA_Athena_Grenade_WithTrajectory_C_SetupGrenade");
static_assert(sizeof(GA_Athena_Grenade_WithTrajectory_C_SetupGrenade) == 0x000120, "Wrong size on GA_Athena_Grenade_WithTrajectory_C_SetupGrenade");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_SetupGrenade, AimPitch) == 0x000000, "Member 'GA_Athena_Grenade_WithTrajectory_C_SetupGrenade::AimPitch' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_SetupGrenade, Base_Grenade) == 0x000008, "Member 'GA_Athena_Grenade_WithTrajectory_C_SetupGrenade::Base_Grenade' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_SetupGrenade, Projectile_Speed) == 0x000010, "Member 'GA_Athena_Grenade_WithTrajectory_C_SetupGrenade::Projectile_Speed' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_SetupGrenade, Explosion_Gameplay_Spec) == 0x000018, "Member 'GA_Athena_Grenade_WithTrajectory_C_SetupGrenade::Explosion_Gameplay_Spec' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_SetupGrenade, Projectile_Gravity_Scale) == 0x000098, "Member 'GA_Athena_Grenade_WithTrajectory_C_SetupGrenade::Projectile_Gravity_Scale' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_SetupGrenade, CallFunc_CalcGrenadeSpeedFromPitch_GrenadeSpeed) == 0x00009C, "Member 'GA_Athena_Grenade_WithTrajectory_C_SetupGrenade::CallFunc_CalcGrenadeSpeedFromPitch_GrenadeSpeed' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_SetupGrenade, CallFunc_MakeGameplayEffectContainerSpec_ReturnValue) == 0x0000A0, "Member 'GA_Athena_Grenade_WithTrajectory_C_SetupGrenade::CallFunc_MakeGameplayEffectContainerSpec_ReturnValue' has a wrong offset!");

// Function GA_Athena_Grenade_WithTrajectory.GA_Athena_Grenade_WithTrajectory_C.SetupDummyProjectile
// 0x00C0 (0x00C0 - 0x0000)
struct GA_Athena_Grenade_WithTrajectory_C_SetupDummyProjectile final
{
public:
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetScaledCapsuleSize_OutRadius;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleSize_OutHalfHeight;       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGravityZ_ReturnValue;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0xC];                                       // 0x0044(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue2;                // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ProjectileTrajectory_C*             K2Node_DynamicCast_AsBP_Projectile_Trajectory;     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortProjectileBase*                    CallFunc_FinishSpawningActor_ReturnValue2;         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Grenade_WithTrajectory_C_SetupDummyProjectile) == 0x000010, "Wrong alignment on GA_Athena_Grenade_WithTrajectory_C_SetupDummyProjectile");
static_assert(sizeof(GA_Athena_Grenade_WithTrajectory_C_SetupDummyProjectile) == 0x0000C0, "Wrong size on GA_Athena_Grenade_WithTrajectory_C_SetupDummyProjectile");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_SetupDummyProjectile, CallFunc_GetTransform_ReturnValue) == 0x000000, "Member 'GA_Athena_Grenade_WithTrajectory_C_SetupDummyProjectile::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_SetupDummyProjectile, CallFunc_GetScaledCapsuleSize_OutRadius) == 0x000030, "Member 'GA_Athena_Grenade_WithTrajectory_C_SetupDummyProjectile::CallFunc_GetScaledCapsuleSize_OutRadius' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_SetupDummyProjectile, CallFunc_GetScaledCapsuleSize_OutHalfHeight) == 0x000034, "Member 'GA_Athena_Grenade_WithTrajectory_C_SetupDummyProjectile::CallFunc_GetScaledCapsuleSize_OutHalfHeight' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_SetupDummyProjectile, CallFunc_FMax_ReturnValue) == 0x000038, "Member 'GA_Athena_Grenade_WithTrajectory_C_SetupDummyProjectile::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_WithTrajectory_C_SetupDummyProjectile, CallFunc_GetGravityZ_ReturnValue) == 0x00003C, "Member 'GA_Athena_Grenade_WithTrajectory_C_SetupDummyProjectile::CallFunc_GetGravityZ_ReturnValue' has a wrong offset!");
