#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Grenade

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_Grenade.GA_Athena_Grenade_C.ExecuteUbergraph_GA_Athena_Grenade
// 0x0458 (0x0458 - 0x0000)
struct GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0028(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable2;                             // 0x0058(0x0020)()
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData6;                // 0x0078(0x0028)(ConstParm, ContainsInstancedReference)
	TDelegate<void(struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate3;             // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData5;                // 0x00B0(0x0028)(ConstParm, ContainsInstancedReference)
	TDelegate<void(struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate4;             // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData4;                // 0x00E8(0x0028)(ConstParm, ContainsInstancedReference)
	TDelegate<void(struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate5;             // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData3;                // 0x0120(0x0028)(ConstParm, ContainsInstancedReference)
	TDelegate<void(struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData2;                // 0x0158(0x0028)(ConstParm, ContainsInstancedReference)
	TDelegate<void(struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate7;             // 0x0180(0x0010)(ZeroConstructor, NoDestructor)
	struct FProjectileEventData                   K2Node_CustomEvent_ProjectileData;                 // 0x0190(0x0028)(ConstParm, ContainsInstancedReference)
	TDelegate<void(struct FProjectileEventData& ProjectileData)> K2Node_CreateDelegate_OutputDelegate8;             // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	struct FProjectileEventData                   Temp_struct_Variable3;                             // 0x01C8(0x0028)(ContainsInstancedReference)
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x01F0(0x0040)(ContainsInstancedReference)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0248(0x0020)()
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0268(0x00A8)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0310(0x0010)(ZeroConstructor, ReferenceParm)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x0320(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x0340(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetAimLocationNearestPawn_ReturnValue;    // 0x0348(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetDefaultTargetingRotation_ReturnValue;  // 0x0354(0x000C)(IsPlainOldData, NoDestructor)
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x3];                                      // 0x0369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_ThrowAthenaGrenade_NewParam;              // 0x036C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ThrowAthenaGrenade_Rotation;              // 0x0378(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_SpawnProjectileAndWait* CallFunc_SpawnProjectileAndWait_ReturnValue;       // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue; // 0x0390(0x0080)()
	class AFortProjectileBase*                    CallFunc_BeginSpawningActor_SpawnedActor;          // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BeginSpawningActor_ReturnValue;           // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue2;            // 0x041A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41B[0x5];                                      // 0x041B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData3;                    // 0x0420(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag3;                // 0x0440(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate9;             // 0x0448(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade) == 0x000008, "Wrong alignment on GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade");
static_assert(sizeof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade) == 0x000458, "Wrong size on GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, EntryPoint) == 0x000000, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, K2Node_CustomEvent_TargetData) == 0x000028, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, K2Node_CustomEvent_ApplicationTag) == 0x000048, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, Temp_struct_Variable) == 0x000050, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, Temp_struct_Variable2) == 0x000058, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, K2Node_CustomEvent_ProjectileData6) == 0x000078, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::K2Node_CustomEvent_ProjectileData6' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, K2Node_CreateDelegate_OutputDelegate3) == 0x0000A0, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, K2Node_CustomEvent_ProjectileData5) == 0x0000B0, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::K2Node_CustomEvent_ProjectileData5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, K2Node_CreateDelegate_OutputDelegate4) == 0x0000D8, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, K2Node_CustomEvent_ProjectileData4) == 0x0000E8, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::K2Node_CustomEvent_ProjectileData4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, K2Node_CreateDelegate_OutputDelegate5) == 0x000110, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, K2Node_CustomEvent_ProjectileData3) == 0x000120, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::K2Node_CustomEvent_ProjectileData3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, K2Node_CreateDelegate_OutputDelegate6) == 0x000148, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, K2Node_CustomEvent_ProjectileData2) == 0x000158, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::K2Node_CustomEvent_ProjectileData2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, K2Node_CreateDelegate_OutputDelegate7) == 0x000180, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, K2Node_CustomEvent_ProjectileData) == 0x000190, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::K2Node_CustomEvent_ProjectileData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, K2Node_CreateDelegate_OutputDelegate8) == 0x0001B8, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, Temp_struct_Variable3) == 0x0001C8, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, CallFunc_GetActorInfo_ReturnValue) == 0x0001F0, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, CallFunc_K2_CommitAbility_ReturnValue) == 0x000230, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000238, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, K2Node_DynamicCast_bSuccess) == 0x000240, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000248, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, K2Node_MakeStruct_GameplayEventData) == 0x000268, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000310, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, K2Node_CustomEvent_TargetData2) == 0x000320, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, K2Node_CustomEvent_ApplicationTag2) == 0x000340, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, CallFunc_GetAimLocationNearestPawn_ReturnValue) == 0x000348, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::CallFunc_GetAimLocationNearestPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, CallFunc_GetDefaultTargetingRotation_ReturnValue) == 0x000354, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::CallFunc_GetDefaultTargetingRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x000360, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, CallFunc_IsValid_ReturnValue) == 0x000368, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, CallFunc_ThrowAthenaGrenade_NewParam) == 0x00036C, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::CallFunc_ThrowAthenaGrenade_NewParam' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, CallFunc_ThrowAthenaGrenade_Rotation) == 0x000378, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::CallFunc_ThrowAthenaGrenade_Rotation' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, CallFunc_SpawnProjectileAndWait_ReturnValue) == 0x000388, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::CallFunc_SpawnProjectileAndWait_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, CallFunc_MakeGameplayEffectContainerSpec_ReturnValue) == 0x000390, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::CallFunc_MakeGameplayEffectContainerSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, CallFunc_BeginSpawningActor_SpawnedActor) == 0x000410, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::CallFunc_BeginSpawningActor_SpawnedActor' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, CallFunc_BeginSpawningActor_ReturnValue) == 0x000418, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::CallFunc_BeginSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, CallFunc_IsValid_ReturnValue2) == 0x000419, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, CallFunc_K2_CommitAbility_ReturnValue2) == 0x00041A, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::CallFunc_K2_CommitAbility_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, K2Node_CustomEvent_TargetData3) == 0x000420, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::K2Node_CustomEvent_TargetData3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, K2Node_CustomEvent_ApplicationTag3) == 0x000440, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::K2Node_CustomEvent_ApplicationTag3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade, K2Node_CreateDelegate_OutputDelegate9) == 0x000448, "Member 'GA_Athena_Grenade_C_ExecuteUbergraph_GA_Athena_Grenade::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");

// Function GA_Athena_Grenade.GA_Athena_Grenade_C.Bounced_9688DEB14FA370B967517191C2B710DA
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Grenade_C_Bounced_9688DEB14FA370B967517191C2B710DA final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Athena_Grenade_C_Bounced_9688DEB14FA370B967517191C2B710DA) == 0x000008, "Wrong alignment on GA_Athena_Grenade_C_Bounced_9688DEB14FA370B967517191C2B710DA");
static_assert(sizeof(GA_Athena_Grenade_C_Bounced_9688DEB14FA370B967517191C2B710DA) == 0x000028, "Wrong size on GA_Athena_Grenade_C_Bounced_9688DEB14FA370B967517191C2B710DA");
static_assert(offsetof(GA_Athena_Grenade_C_Bounced_9688DEB14FA370B967517191C2B710DA, ProjectileData) == 0x000000, "Member 'GA_Athena_Grenade_C_Bounced_9688DEB14FA370B967517191C2B710DA::ProjectileData' has a wrong offset!");

// Function GA_Athena_Grenade.GA_Athena_Grenade_C.Cancelled_6845367B4931B42A6C8BF6A6664F2203
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Grenade_C_Cancelled_6845367B4931B42A6C8BF6A6664F2203 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Grenade_C_Cancelled_6845367B4931B42A6C8BF6A6664F2203) == 0x000008, "Wrong alignment on GA_Athena_Grenade_C_Cancelled_6845367B4931B42A6C8BF6A6664F2203");
static_assert(sizeof(GA_Athena_Grenade_C_Cancelled_6845367B4931B42A6C8BF6A6664F2203) == 0x000028, "Wrong size on GA_Athena_Grenade_C_Cancelled_6845367B4931B42A6C8BF6A6664F2203");
static_assert(offsetof(GA_Athena_Grenade_C_Cancelled_6845367B4931B42A6C8BF6A6664F2203, TargetData) == 0x000000, "Member 'GA_Athena_Grenade_C_Cancelled_6845367B4931B42A6C8BF6A6664F2203::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_Cancelled_6845367B4931B42A6C8BF6A6664F2203, ApplicationTag) == 0x000020, "Member 'GA_Athena_Grenade_C_Cancelled_6845367B4931B42A6C8BF6A6664F2203::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Grenade.GA_Athena_Grenade_C.Completed_6845367B4931B42A6C8BF6A6664F2203
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Grenade_C_Completed_6845367B4931B42A6C8BF6A6664F2203 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Grenade_C_Completed_6845367B4931B42A6C8BF6A6664F2203) == 0x000008, "Wrong alignment on GA_Athena_Grenade_C_Completed_6845367B4931B42A6C8BF6A6664F2203");
static_assert(sizeof(GA_Athena_Grenade_C_Completed_6845367B4931B42A6C8BF6A6664F2203) == 0x000028, "Wrong size on GA_Athena_Grenade_C_Completed_6845367B4931B42A6C8BF6A6664F2203");
static_assert(offsetof(GA_Athena_Grenade_C_Completed_6845367B4931B42A6C8BF6A6664F2203, TargetData) == 0x000000, "Member 'GA_Athena_Grenade_C_Completed_6845367B4931B42A6C8BF6A6664F2203::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_Completed_6845367B4931B42A6C8BF6A6664F2203, ApplicationTag) == 0x000020, "Member 'GA_Athena_Grenade_C_Completed_6845367B4931B42A6C8BF6A6664F2203::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Grenade.GA_Athena_Grenade_C.Created_9688DEB14FA370B967517191C2B710DA
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Grenade_C_Created_9688DEB14FA370B967517191C2B710DA final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Athena_Grenade_C_Created_9688DEB14FA370B967517191C2B710DA) == 0x000008, "Wrong alignment on GA_Athena_Grenade_C_Created_9688DEB14FA370B967517191C2B710DA");
static_assert(sizeof(GA_Athena_Grenade_C_Created_9688DEB14FA370B967517191C2B710DA) == 0x000028, "Wrong size on GA_Athena_Grenade_C_Created_9688DEB14FA370B967517191C2B710DA");
static_assert(offsetof(GA_Athena_Grenade_C_Created_9688DEB14FA370B967517191C2B710DA, ProjectileData) == 0x000000, "Member 'GA_Athena_Grenade_C_Created_9688DEB14FA370B967517191C2B710DA::ProjectileData' has a wrong offset!");

// Function GA_Athena_Grenade.GA_Athena_Grenade_C.Destroyed_9688DEB14FA370B967517191C2B710DA
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Grenade_C_Destroyed_9688DEB14FA370B967517191C2B710DA final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Athena_Grenade_C_Destroyed_9688DEB14FA370B967517191C2B710DA) == 0x000008, "Wrong alignment on GA_Athena_Grenade_C_Destroyed_9688DEB14FA370B967517191C2B710DA");
static_assert(sizeof(GA_Athena_Grenade_C_Destroyed_9688DEB14FA370B967517191C2B710DA) == 0x000028, "Wrong size on GA_Athena_Grenade_C_Destroyed_9688DEB14FA370B967517191C2B710DA");
static_assert(offsetof(GA_Athena_Grenade_C_Destroyed_9688DEB14FA370B967517191C2B710DA, ProjectileData) == 0x000000, "Member 'GA_Athena_Grenade_C_Destroyed_9688DEB14FA370B967517191C2B710DA::ProjectileData' has a wrong offset!");

// Function GA_Athena_Grenade.GA_Athena_Grenade_C.Exploded_9688DEB14FA370B967517191C2B710DA
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Grenade_C_Exploded_9688DEB14FA370B967517191C2B710DA final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Athena_Grenade_C_Exploded_9688DEB14FA370B967517191C2B710DA) == 0x000008, "Wrong alignment on GA_Athena_Grenade_C_Exploded_9688DEB14FA370B967517191C2B710DA");
static_assert(sizeof(GA_Athena_Grenade_C_Exploded_9688DEB14FA370B967517191C2B710DA) == 0x000028, "Wrong size on GA_Athena_Grenade_C_Exploded_9688DEB14FA370B967517191C2B710DA");
static_assert(offsetof(GA_Athena_Grenade_C_Exploded_9688DEB14FA370B967517191C2B710DA, ProjectileData) == 0x000000, "Member 'GA_Athena_Grenade_C_Exploded_9688DEB14FA370B967517191C2B710DA::ProjectileData' has a wrong offset!");

// Function GA_Athena_Grenade.GA_Athena_Grenade_C.Stopped_9688DEB14FA370B967517191C2B710DA
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Grenade_C_Stopped_9688DEB14FA370B967517191C2B710DA final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Athena_Grenade_C_Stopped_9688DEB14FA370B967517191C2B710DA) == 0x000008, "Wrong alignment on GA_Athena_Grenade_C_Stopped_9688DEB14FA370B967517191C2B710DA");
static_assert(sizeof(GA_Athena_Grenade_C_Stopped_9688DEB14FA370B967517191C2B710DA) == 0x000028, "Wrong size on GA_Athena_Grenade_C_Stopped_9688DEB14FA370B967517191C2B710DA");
static_assert(offsetof(GA_Athena_Grenade_C_Stopped_9688DEB14FA370B967517191C2B710DA, ProjectileData) == 0x000000, "Member 'GA_Athena_Grenade_C_Stopped_9688DEB14FA370B967517191C2B710DA::ProjectileData' has a wrong offset!");

// Function GA_Athena_Grenade.GA_Athena_Grenade_C.ThrowAthenaGrenade
// 0x00E0 (0x00E0 - 0x0000)
struct GA_Athena_Grenade_C_ThrowAthenaGrenade final
{
public:
	struct FVector                                NewParam;                                          // 0x0000(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x000C(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor)
	struct FFortGameplayEffectContainerSpec       CallFunc_MakeGameplayEffectContainerSpec_ReturnValue; // 0x0018(0x0080)()
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x00D0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Grenade_C_ThrowAthenaGrenade) == 0x000010, "Wrong alignment on GA_Athena_Grenade_C_ThrowAthenaGrenade");
static_assert(sizeof(GA_Athena_Grenade_C_ThrowAthenaGrenade) == 0x0000E0, "Wrong size on GA_Athena_Grenade_C_ThrowAthenaGrenade");
static_assert(offsetof(GA_Athena_Grenade_C_ThrowAthenaGrenade, NewParam) == 0x000000, "Member 'GA_Athena_Grenade_C_ThrowAthenaGrenade::NewParam' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ThrowAthenaGrenade, Rotation) == 0x00000C, "Member 'GA_Athena_Grenade_C_ThrowAthenaGrenade::Rotation' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ThrowAthenaGrenade, CallFunc_MakeGameplayEffectContainerSpec_ReturnValue) == 0x000018, "Member 'GA_Athena_Grenade_C_ThrowAthenaGrenade::CallFunc_MakeGameplayEffectContainerSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ThrowAthenaGrenade, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x0000A0, "Member 'GA_Athena_Grenade_C_ThrowAthenaGrenade::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_ThrowAthenaGrenade, CallFunc_TransformLocation_ReturnValue) == 0x0000D0, "Member 'GA_Athena_Grenade_C_ThrowAthenaGrenade::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");

// Function GA_Athena_Grenade.GA_Athena_Grenade_C.Touched_9688DEB14FA370B967517191C2B710DA
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Grenade_C_Touched_9688DEB14FA370B967517191C2B710DA final
{
public:
	struct FProjectileEventData                   ProjectileData;                                    // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GA_Athena_Grenade_C_Touched_9688DEB14FA370B967517191C2B710DA) == 0x000008, "Wrong alignment on GA_Athena_Grenade_C_Touched_9688DEB14FA370B967517191C2B710DA");
static_assert(sizeof(GA_Athena_Grenade_C_Touched_9688DEB14FA370B967517191C2B710DA) == 0x000028, "Wrong size on GA_Athena_Grenade_C_Touched_9688DEB14FA370B967517191C2B710DA");
static_assert(offsetof(GA_Athena_Grenade_C_Touched_9688DEB14FA370B967517191C2B710DA, ProjectileData) == 0x000000, "Member 'GA_Athena_Grenade_C_Touched_9688DEB14FA370B967517191C2B710DA::ProjectileData' has a wrong offset!");

// Function GA_Athena_Grenade.GA_Athena_Grenade_C.Triggered_6845367B4931B42A6C8BF6A6664F2203
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Grenade_C_Triggered_6845367B4931B42A6C8BF6A6664F2203 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Grenade_C_Triggered_6845367B4931B42A6C8BF6A6664F2203) == 0x000008, "Wrong alignment on GA_Athena_Grenade_C_Triggered_6845367B4931B42A6C8BF6A6664F2203");
static_assert(sizeof(GA_Athena_Grenade_C_Triggered_6845367B4931B42A6C8BF6A6664F2203) == 0x000028, "Wrong size on GA_Athena_Grenade_C_Triggered_6845367B4931B42A6C8BF6A6664F2203");
static_assert(offsetof(GA_Athena_Grenade_C_Triggered_6845367B4931B42A6C8BF6A6664F2203, TargetData) == 0x000000, "Member 'GA_Athena_Grenade_C_Triggered_6845367B4931B42A6C8BF6A6664F2203::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Grenade_C_Triggered_6845367B4931B42A6C8BF6A6664F2203, ApplicationTag) == 0x000020, "Member 'GA_Athena_Grenade_C_Triggered_6845367B4931B42A6C8BF6A6664F2203::ApplicationTag' has a wrong offset!");

}

