#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Commando_DebilitatingShots

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Commando_DebilitatingShots.GA_Commando_DebilitatingShots_C.ExecuteUbergraph_GA_Commando_DebilitatingShots
// 0x0200 (0x0200 - 0x0000)
struct GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0008(0x0018)()
	struct FGameplayEffectSpecHandle              CallFunc_SetupDebilitationTraining_EffectspecOutInstant; // 0x0020(0x0018)()
	struct FGameplayEffectSpecHandle              CallFunc_SetupDebilitationTraining_EffectspecOutDuration; // 0x0038(0x0018)()
	struct FGameplayEffectSpecHandle              CallFunc_SetupAppliedEffect_EffectspecHandleOut;   // 0x0050(0x0018)()
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput; // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface2_CastInput; // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue2;  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0098(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue2; // 0x00A8(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue3; // 0x00B8(0x0010)(ZeroConstructor, ReferenceParm)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x00D0(0x00A8)()
	struct FGameplayAbilityTargetDataHandle       CallFunc_SetupGameplayEffect_Target_Data;          // 0x0178(0x0020)()
	class UClass*                                 CallFunc_SetupGameplayEffect_DebilitatingShots;    // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetupGameplayEffect_Effect_Level;         // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetupGameplayEffect_Stack_Count;          // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2; // 0x01B8(0x0018)()
	struct FGameplayEffectSpecHandle              CallFunc_SetupAppliedEffect_EffectspecHandleOut2;  // 0x01D0(0x0018)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue4; // 0x01E8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots) == 0x000008, "Wrong alignment on GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots");
static_assert(sizeof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots) == 0x000200, "Wrong size on GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, EntryPoint) == 0x000000, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000008, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_SetupDebilitationTraining_EffectspecOutInstant) == 0x000020, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_SetupDebilitationTraining_EffectspecOutInstant' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_SetupDebilitationTraining_EffectspecOutDuration) == 0x000038, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_SetupDebilitationTraining_EffectspecOutDuration' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_SetupAppliedEffect_EffectspecHandleOut) == 0x000050, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_SetupAppliedEffect_EffectspecHandleOut' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput) == 0x000068, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x000078, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface2_CastInput) == 0x000080, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface2_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_HasAllMatchingGameplayTags_ReturnValue2) == 0x000090, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_HasAllMatchingGameplayTags_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_BooleanAND_ReturnValue) == 0x000091, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x000098, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue2) == 0x0000A8, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue3) == 0x0000B8, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0000C8, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, K2Node_Event_EventData) == 0x0000D0, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_SetupGameplayEffect_Target_Data) == 0x000178, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_SetupGameplayEffect_Target_Data' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_SetupGameplayEffect_DebilitatingShots) == 0x000198, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_SetupGameplayEffect_DebilitatingShots' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_SetupGameplayEffect_Effect_Level) == 0x0001A0, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_SetupGameplayEffect_Effect_Level' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_SetupGameplayEffect_Stack_Count) == 0x0001A4, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_SetupGameplayEffect_Stack_Count' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, K2Node_DynamicCast_AsFort_Pawn) == 0x0001A8, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, K2Node_DynamicCast_bSuccess) == 0x0001B0, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2) == 0x0001B8, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_SetupAppliedEffect_EffectspecHandleOut2) == 0x0001D0, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_SetupAppliedEffect_EffectspecHandleOut2' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue4) == 0x0001E8, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots, CallFunc_BooleanAND_ReturnValue2) == 0x0001F8, "Member 'GA_Commando_DebilitatingShots_C_ExecuteUbergraph_GA_Commando_DebilitatingShots::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");

// Function GA_Commando_DebilitatingShots.GA_Commando_DebilitatingShots_C.SetupGameplayEffect
// 0x0070 (0x0070 - 0x0000)
struct GA_Commando_DebilitatingShots_C_SetupGameplayEffect final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HitActor;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                OptionalObject;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Target_Data;                                       // 0x0018(0x0020)(Parm, OutParm)
	class UClass*                                 DebilitatingShots;                                 // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Effect_Level;                                      // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stack_Count;                                       // 0x0044(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0048(0x0020)()
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Commando_DebilitatingShots_C_SetupGameplayEffect) == 0x000008, "Wrong alignment on GA_Commando_DebilitatingShots_C_SetupGameplayEffect");
static_assert(sizeof(GA_Commando_DebilitatingShots_C_SetupGameplayEffect) == 0x000070, "Wrong size on GA_Commando_DebilitatingShots_C_SetupGameplayEffect");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupGameplayEffect, EventTag) == 0x000000, "Member 'GA_Commando_DebilitatingShots_C_SetupGameplayEffect::EventTag' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupGameplayEffect, HitActor) == 0x000008, "Member 'GA_Commando_DebilitatingShots_C_SetupGameplayEffect::HitActor' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupGameplayEffect, OptionalObject) == 0x000010, "Member 'GA_Commando_DebilitatingShots_C_SetupGameplayEffect::OptionalObject' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupGameplayEffect, Target_Data) == 0x000018, "Member 'GA_Commando_DebilitatingShots_C_SetupGameplayEffect::Target_Data' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupGameplayEffect, DebilitatingShots) == 0x000038, "Member 'GA_Commando_DebilitatingShots_C_SetupGameplayEffect::DebilitatingShots' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupGameplayEffect, Effect_Level) == 0x000040, "Member 'GA_Commando_DebilitatingShots_C_SetupGameplayEffect::Effect_Level' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupGameplayEffect, Stack_Count) == 0x000044, "Member 'GA_Commando_DebilitatingShots_C_SetupGameplayEffect::Stack_Count' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupGameplayEffect, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000048, "Member 'GA_Commando_DebilitatingShots_C_SetupGameplayEffect::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupGameplayEffect, CallFunc_MatchesTag_ReturnValue) == 0x000068, "Member 'GA_Commando_DebilitatingShots_C_SetupGameplayEffect::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");

// Function GA_Commando_DebilitatingShots.GA_Commando_DebilitatingShots_C.SetupAppliedEffect
// 0x0088 (0x0088 - 0x0000)
struct GA_Commando_DebilitatingShots_C_SetupAppliedEffect final
{
public:
	float                                         Magnitude;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stack_Count;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              EffectSpecHandle;                                  // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayEffectSpecHandle              EffectspecHandleOut;                               // 0x0028(0x0018)(Parm, OutParm)
	struct FGameplayEffectSpecHandle              CallFunc_AssignSetByCallerMagnitude_ReturnValue;   // 0x0040(0x0018)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignSetByCallerMagnitude_ReturnValue2;  // 0x0058(0x0018)()
	struct FGameplayEffectSpecHandle              CallFunc_SetStackCount_ReturnValue;                // 0x0070(0x0018)()
};
static_assert(alignof(GA_Commando_DebilitatingShots_C_SetupAppliedEffect) == 0x000008, "Wrong alignment on GA_Commando_DebilitatingShots_C_SetupAppliedEffect");
static_assert(sizeof(GA_Commando_DebilitatingShots_C_SetupAppliedEffect) == 0x000088, "Wrong size on GA_Commando_DebilitatingShots_C_SetupAppliedEffect");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupAppliedEffect, Magnitude) == 0x000000, "Member 'GA_Commando_DebilitatingShots_C_SetupAppliedEffect::Magnitude' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupAppliedEffect, Duration) == 0x000004, "Member 'GA_Commando_DebilitatingShots_C_SetupAppliedEffect::Duration' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupAppliedEffect, Stack_Count) == 0x000008, "Member 'GA_Commando_DebilitatingShots_C_SetupAppliedEffect::Stack_Count' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupAppliedEffect, EffectSpecHandle) == 0x000010, "Member 'GA_Commando_DebilitatingShots_C_SetupAppliedEffect::EffectSpecHandle' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupAppliedEffect, EffectspecHandleOut) == 0x000028, "Member 'GA_Commando_DebilitatingShots_C_SetupAppliedEffect::EffectspecHandleOut' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupAppliedEffect, CallFunc_AssignSetByCallerMagnitude_ReturnValue) == 0x000040, "Member 'GA_Commando_DebilitatingShots_C_SetupAppliedEffect::CallFunc_AssignSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupAppliedEffect, CallFunc_AssignSetByCallerMagnitude_ReturnValue2) == 0x000058, "Member 'GA_Commando_DebilitatingShots_C_SetupAppliedEffect::CallFunc_AssignSetByCallerMagnitude_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupAppliedEffect, CallFunc_SetStackCount_ReturnValue) == 0x000070, "Member 'GA_Commando_DebilitatingShots_C_SetupAppliedEffect::CallFunc_SetStackCount_ReturnValue' has a wrong offset!");

// Function GA_Commando_DebilitatingShots.GA_Commando_DebilitatingShots_C.K2_ActivateAbilityFromEvent
// 0x00A8 (0x00A8 - 0x0000)
struct GA_Commando_DebilitatingShots_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00A8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Commando_DebilitatingShots_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_Commando_DebilitatingShots_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Commando_DebilitatingShots_C_K2_ActivateAbilityFromEvent) == 0x0000A8, "Wrong size on GA_Commando_DebilitatingShots_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_Commando_DebilitatingShots_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_Commando_DebilitatingShots.GA_Commando_DebilitatingShots_C.SetupDebilitationTraining
// 0x0060 (0x0060 - 0x0000)
struct GA_Commando_DebilitatingShots_C_SetupDebilitationTraining final
{
public:
	struct FGameplayEffectSpecHandle              EffectspecOutInstant;                              // 0x0000(0x0018)(Parm, OutParm)
	struct FGameplayEffectSpecHandle              EffectspecOutDuration;                             // 0x0018(0x0018)(Parm, OutParm)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0030(0x0018)()
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2; // 0x0048(0x0018)()
};
static_assert(alignof(GA_Commando_DebilitatingShots_C_SetupDebilitationTraining) == 0x000008, "Wrong alignment on GA_Commando_DebilitatingShots_C_SetupDebilitationTraining");
static_assert(sizeof(GA_Commando_DebilitatingShots_C_SetupDebilitationTraining) == 0x000060, "Wrong size on GA_Commando_DebilitatingShots_C_SetupDebilitationTraining");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupDebilitationTraining, EffectspecOutInstant) == 0x000000, "Member 'GA_Commando_DebilitatingShots_C_SetupDebilitationTraining::EffectspecOutInstant' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupDebilitationTraining, EffectspecOutDuration) == 0x000018, "Member 'GA_Commando_DebilitatingShots_C_SetupDebilitationTraining::EffectspecOutDuration' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupDebilitationTraining, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000030, "Member 'GA_Commando_DebilitatingShots_C_SetupDebilitationTraining::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupDebilitationTraining, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2) == 0x000048, "Member 'GA_Commando_DebilitatingShots_C_SetupDebilitationTraining::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue2' has a wrong offset!");

// Function GA_Commando_DebilitatingShots.GA_Commando_DebilitatingShots_C.SetupAbility
// 0x0058 (0x0058 - 0x0000)
struct GA_Commando_DebilitatingShots_C_SetupAbility final
{
public:
	class UAbilitySystemComponent*                AbilitySystem;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface2_CastInput; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue2;  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface3_CastInput; // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue3;  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Commando_DebilitatingShots_C_SetupAbility) == 0x000008, "Wrong alignment on GA_Commando_DebilitatingShots_C_SetupAbility");
static_assert(sizeof(GA_Commando_DebilitatingShots_C_SetupAbility) == 0x000058, "Wrong size on GA_Commando_DebilitatingShots_C_SetupAbility");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupAbility, AbilitySystem) == 0x000000, "Member 'GA_Commando_DebilitatingShots_C_SetupAbility::AbilitySystem' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupAbility, CallFunc_SelectInt_ReturnValue) == 0x000008, "Member 'GA_Commando_DebilitatingShots_C_SetupAbility::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput) == 0x000010, "Member 'GA_Commando_DebilitatingShots_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x000020, "Member 'GA_Commando_DebilitatingShots_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface2_CastInput) == 0x000028, "Member 'GA_Commando_DebilitatingShots_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface2_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_ReturnValue2) == 0x000038, "Member 'GA_Commando_DebilitatingShots_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupAbility, Temp_bool_Variable) == 0x000039, "Member 'GA_Commando_DebilitatingShots_C_SetupAbility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupAbility, K2Node_Select_Default) == 0x00003C, "Member 'GA_Commando_DebilitatingShots_C_SetupAbility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface3_CastInput) == 0x000040, "Member 'GA_Commando_DebilitatingShots_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface3_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_ReturnValue3) == 0x000050, "Member 'GA_Commando_DebilitatingShots_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_ReturnValue3' has a wrong offset!");

// Function GA_Commando_DebilitatingShots.GA_Commando_DebilitatingShots_C.K2_ShouldAbilityRespondToEvent
// 0x0100 (0x0100 - 0x0000)
struct GA_Commando_DebilitatingShots_C_K2_ShouldAbilityRespondToEvent final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayEventData                     Payload;                                           // 0x0040(0x00A8)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          ReturnValue;                                       // 0x00E8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Commando_DebilitatingShots_C_K2_ShouldAbilityRespondToEvent) == 0x000008, "Wrong alignment on GA_Commando_DebilitatingShots_C_K2_ShouldAbilityRespondToEvent");
static_assert(sizeof(GA_Commando_DebilitatingShots_C_K2_ShouldAbilityRespondToEvent) == 0x000100, "Wrong size on GA_Commando_DebilitatingShots_C_K2_ShouldAbilityRespondToEvent");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_K2_ShouldAbilityRespondToEvent, ActorInfo) == 0x000000, "Member 'GA_Commando_DebilitatingShots_C_K2_ShouldAbilityRespondToEvent::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Commando_DebilitatingShots_C_K2_ShouldAbilityRespondToEvent, Payload) == 0x000040, "Member 'GA_Commando_DebilitatingShots_C_K2_ShouldAbilityRespondToEvent::Payload' has a wrong offset!");
