#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TrapGeneric

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_TrapGeneric.GA_TrapGeneric_C.ExecuteUbergraph_GA_TrapGeneric
// 0x0160 (0x0160 - 0x0000)
struct GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0010(0x0020)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAbilityLevel_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable2;                             // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0048(0x0018)()
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	class ABuildingTrap*                          K2Node_DynamicCast_AsBuilding_Trap;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTrapLevel_ReturnValue;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDamageDelay_ReturnValue;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x0090(0x0010)(ZeroConstructor, ReferenceParm)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFireDelay_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue; // 0x00AC(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue2; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingTrap*                          K2Node_DynamicCast_AsBuilding_Trap2;               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x00D0(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x00F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue3; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingTrap*                          K2Node_DynamicCast_AsBuilding_Trap3;               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue4; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingTrap*                          K2Node_DynamicCast_AsBuilding_Trap4;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x0138(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x0158(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric) == 0x000008, "Wrong alignment on GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric");
static_assert(sizeof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric) == 0x000160, "Wrong size on GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, EntryPoint) == 0x000000, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_K2_CommitAbility_ReturnValue) == 0x000004, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_WaitTargetSelection_ReturnValue) == 0x000008, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_WaitTargetSelection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, Temp_struct_Variable) == 0x000010, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_GetAbilityLevel_ReturnValue) == 0x000034, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_GetAbilityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000038, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, Temp_struct_Variable2) == 0x000040, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000048, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000060, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, K2Node_DynamicCast_AsBuilding_Trap) == 0x000078, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::K2Node_DynamicCast_AsBuilding_Trap' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_GetTrapLevel_ReturnValue) == 0x000084, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_GetTrapLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_GetDamageDelay_ReturnValue) == 0x000088, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_GetDamageDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x000090, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0000A0, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_GetFireDelay_ReturnValue) == 0x0000A8, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_GetFireDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue) == 0x0000AC, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_GetOwningActorFromActorInfo_ReturnValue2) == 0x0000B8, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_GetOwningActorFromActorInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, K2Node_DynamicCast_AsBuilding_Trap2) == 0x0000C0, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::K2Node_DynamicCast_AsBuilding_Trap2' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, K2Node_DynamicCast_bSuccess2) == 0x0000C8, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, K2Node_CustomEvent_TargetData) == 0x0000D0, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, K2Node_CustomEvent_ApplicationTag) == 0x0000F0, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_GetOwningActorFromActorInfo_ReturnValue3) == 0x0000F8, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_GetOwningActorFromActorInfo_ReturnValue3' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, K2Node_DynamicCast_AsBuilding_Trap3) == 0x000100, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::K2Node_DynamicCast_AsBuilding_Trap3' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, K2Node_DynamicCast_bSuccess3) == 0x000108, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, K2Node_CreateDelegate_OutputDelegate2) == 0x000110, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, CallFunc_GetOwningActorFromActorInfo_ReturnValue4) == 0x000120, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::CallFunc_GetOwningActorFromActorInfo_ReturnValue4' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, K2Node_DynamicCast_AsBuilding_Trap4) == 0x000128, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::K2Node_DynamicCast_AsBuilding_Trap4' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, K2Node_DynamicCast_bSuccess4) == 0x000130, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, K2Node_CustomEvent_TargetData2) == 0x000138, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric, K2Node_CustomEvent_ApplicationTag2) == 0x000158, "Member 'GA_TrapGeneric_C_ExecuteUbergraph_GA_TrapGeneric::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");

// Function GA_TrapGeneric.GA_TrapGeneric_C.Cancelled_EFEC611E4D988CAA3867F28EE35771B3
// 0x0028 (0x0028 - 0x0000)
struct GA_TrapGeneric_C_Cancelled_EFEC611E4D988CAA3867F28EE35771B3 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TrapGeneric_C_Cancelled_EFEC611E4D988CAA3867F28EE35771B3) == 0x000008, "Wrong alignment on GA_TrapGeneric_C_Cancelled_EFEC611E4D988CAA3867F28EE35771B3");
static_assert(sizeof(GA_TrapGeneric_C_Cancelled_EFEC611E4D988CAA3867F28EE35771B3) == 0x000028, "Wrong size on GA_TrapGeneric_C_Cancelled_EFEC611E4D988CAA3867F28EE35771B3");
static_assert(offsetof(GA_TrapGeneric_C_Cancelled_EFEC611E4D988CAA3867F28EE35771B3, TargetData) == 0x000000, "Member 'GA_TrapGeneric_C_Cancelled_EFEC611E4D988CAA3867F28EE35771B3::TargetData' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_Cancelled_EFEC611E4D988CAA3867F28EE35771B3, ApplicationTag) == 0x000020, "Member 'GA_TrapGeneric_C_Cancelled_EFEC611E4D988CAA3867F28EE35771B3::ApplicationTag' has a wrong offset!");

// Function GA_TrapGeneric.GA_TrapGeneric_C.Targeted_EFEC611E4D988CAA3867F28EE35771B3
// 0x0028 (0x0028 - 0x0000)
struct GA_TrapGeneric_C_Targeted_EFEC611E4D988CAA3867F28EE35771B3 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_TrapGeneric_C_Targeted_EFEC611E4D988CAA3867F28EE35771B3) == 0x000008, "Wrong alignment on GA_TrapGeneric_C_Targeted_EFEC611E4D988CAA3867F28EE35771B3");
static_assert(sizeof(GA_TrapGeneric_C_Targeted_EFEC611E4D988CAA3867F28EE35771B3) == 0x000028, "Wrong size on GA_TrapGeneric_C_Targeted_EFEC611E4D988CAA3867F28EE35771B3");
static_assert(offsetof(GA_TrapGeneric_C_Targeted_EFEC611E4D988CAA3867F28EE35771B3, TargetData) == 0x000000, "Member 'GA_TrapGeneric_C_Targeted_EFEC611E4D988CAA3867F28EE35771B3::TargetData' has a wrong offset!");
static_assert(offsetof(GA_TrapGeneric_C_Targeted_EFEC611E4D988CAA3867F28EE35771B3, ApplicationTag) == 0x000020, "Member 'GA_TrapGeneric_C_Targeted_EFEC611E4D988CAA3867F28EE35771B3::ApplicationTag' has a wrong offset!");

}

