#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_PlayerDBNO

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GAB_PlayerDBNO.GAB_PlayerDBNO_C
// 0x00E0 (0x0B90 - 0x0AB0)
class UGAB_PlayerDBNO_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB0(0x0008)(Transient, DuplicateTransient)
	class UAnimMontage*                           DeathMontage;                                      // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DeathHitDirection;                                 // 0x0AC0(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ACC[0x4];                                      // 0x0ACC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             DeathHitResult;                                    // 0x0AD0(0x0080)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0B50(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  GameplayStatusAfflicted;                           // 0x0B70(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GAB_PlayerDBNO(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void OnCompleted_4B0F8658452931EE3B297A9E70C9C496();
	void OnBlendOut_4B0F8658452931EE3B297A9E70C9C496();
	void OnInterrupted_4B0F8658452931EE3B297A9E70C9C496();
	void OnCancelled_4B0F8658452931EE3B297A9E70C9C496();
	void InitializeDeathHitDirection(const struct FGameplayEventData& EventHitData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAB_PlayerDBNO_C">();
	}
	static class UGAB_PlayerDBNO_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAB_PlayerDBNO_C>();
	}
};
static_assert(alignof(UGAB_PlayerDBNO_C) == 0x000008, "Wrong alignment on UGAB_PlayerDBNO_C");
static_assert(sizeof(UGAB_PlayerDBNO_C) == 0x000B90, "Wrong size on UGAB_PlayerDBNO_C");
static_assert(offsetof(UGAB_PlayerDBNO_C, UberGraphFrame) == 0x000AB0, "Member 'UGAB_PlayerDBNO_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGAB_PlayerDBNO_C, DeathMontage) == 0x000AB8, "Member 'UGAB_PlayerDBNO_C::DeathMontage' has a wrong offset!");
static_assert(offsetof(UGAB_PlayerDBNO_C, DeathHitDirection) == 0x000AC0, "Member 'UGAB_PlayerDBNO_C::DeathHitDirection' has a wrong offset!");
static_assert(offsetof(UGAB_PlayerDBNO_C, DeathHitResult) == 0x000AD0, "Member 'UGAB_PlayerDBNO_C::DeathHitResult' has a wrong offset!");
static_assert(offsetof(UGAB_PlayerDBNO_C, DamageTags) == 0x000B50, "Member 'UGAB_PlayerDBNO_C::DamageTags' has a wrong offset!");
static_assert(offsetof(UGAB_PlayerDBNO_C, GameplayStatusAfflicted) == 0x000B70, "Member 'UGAB_PlayerDBNO_C::GameplayStatusAfflicted' has a wrong offset!");

}

