#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_TakerMarkedForDeath

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_TakerMarkedForDeath.GCN_TakerMarkedForDeath_C
// 0x0050 (0x04E0 - 0x0490)
class AGCN_TakerMarkedForDeath_C final : public AFortGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               OverHeadEffect;                                    // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortMiniMapComponent*                  MiniMapCrosshair;                                  // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortMiniMapComponent*                  MiniMapIconBackground;                             // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FFortFeedbackHandle                    TakerFeedbackEvent;                                // 0x04B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         TakerFeedbackRepeatDelay;                          // 0x04C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TakerFeedbackInitialDelay;                         // 0x04CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           TC_GameplayStatusStun;                             // 0x04D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayerIsStunned;                                   // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GCN_TakerMarkedForDeath(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SoulSuckCheck();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_TakerMarkedForDeath_C">();
	}
	static class AGCN_TakerMarkedForDeath_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_TakerMarkedForDeath_C>();
	}
};
static_assert(alignof(AGCN_TakerMarkedForDeath_C) == 0x000010, "Wrong alignment on AGCN_TakerMarkedForDeath_C");
static_assert(sizeof(AGCN_TakerMarkedForDeath_C) == 0x0004E0, "Wrong size on AGCN_TakerMarkedForDeath_C");
static_assert(offsetof(AGCN_TakerMarkedForDeath_C, UberGraphFrame) == 0x000490, "Member 'AGCN_TakerMarkedForDeath_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_TakerMarkedForDeath_C, OverHeadEffect) == 0x000498, "Member 'AGCN_TakerMarkedForDeath_C::OverHeadEffect' has a wrong offset!");
static_assert(offsetof(AGCN_TakerMarkedForDeath_C, MiniMapCrosshair) == 0x0004A0, "Member 'AGCN_TakerMarkedForDeath_C::MiniMapCrosshair' has a wrong offset!");
static_assert(offsetof(AGCN_TakerMarkedForDeath_C, MiniMapIconBackground) == 0x0004A8, "Member 'AGCN_TakerMarkedForDeath_C::MiniMapIconBackground' has a wrong offset!");
static_assert(offsetof(AGCN_TakerMarkedForDeath_C, TakerFeedbackEvent) == 0x0004B0, "Member 'AGCN_TakerMarkedForDeath_C::TakerFeedbackEvent' has a wrong offset!");
static_assert(offsetof(AGCN_TakerMarkedForDeath_C, TakerFeedbackRepeatDelay) == 0x0004C8, "Member 'AGCN_TakerMarkedForDeath_C::TakerFeedbackRepeatDelay' has a wrong offset!");
static_assert(offsetof(AGCN_TakerMarkedForDeath_C, TakerFeedbackInitialDelay) == 0x0004CC, "Member 'AGCN_TakerMarkedForDeath_C::TakerFeedbackInitialDelay' has a wrong offset!");
static_assert(offsetof(AGCN_TakerMarkedForDeath_C, TC_GameplayStatusStun) == 0x0004D0, "Member 'AGCN_TakerMarkedForDeath_C::TC_GameplayStatusStun' has a wrong offset!");
static_assert(offsetof(AGCN_TakerMarkedForDeath_C, PlayerIsStunned) == 0x0004D8, "Member 'AGCN_TakerMarkedForDeath_C::PlayerIsStunned' has a wrong offset!");

}

