#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_RiftStaminaDrain

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_RiftStaminaDrain.GCN_RiftStaminaDrain_C
// 0x0030 (0x04C0 - 0x0490)
class AGCN_RiftStaminaDrain_C final : public AFortGameplayCueNotify_Looping
{
public:
	class UStaticMeshComponent*                   SM_DtB_StaminaDrainPlayer;                         // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DrainMeshMaterial;                                 // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DrainBeamMaterial;                                 // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DrainLocationOffset;                               // 0x04A8(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation;                                    // 0x04B4(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

	void OnWhileActiveParticleSystemActivate(class UParticleSystemComponent* WhileActiveParticleSysComponent, struct FGameplayCueParameters& Parameters) const;
	void OnWhileActiveParticleSystemDeactivate(class UParticleSystemComponent* WhileActiveParticleSysComponent, struct FGameplayCueParameters& Parameters) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_RiftStaminaDrain_C">();
	}
	static class AGCN_RiftStaminaDrain_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_RiftStaminaDrain_C>();
	}
};
static_assert(alignof(AGCN_RiftStaminaDrain_C) == 0x000010, "Wrong alignment on AGCN_RiftStaminaDrain_C");
static_assert(sizeof(AGCN_RiftStaminaDrain_C) == 0x0004C0, "Wrong size on AGCN_RiftStaminaDrain_C");
static_assert(offsetof(AGCN_RiftStaminaDrain_C, SM_DtB_StaminaDrainPlayer) == 0x000490, "Member 'AGCN_RiftStaminaDrain_C::SM_DtB_StaminaDrainPlayer' has a wrong offset!");
static_assert(offsetof(AGCN_RiftStaminaDrain_C, DrainMeshMaterial) == 0x000498, "Member 'AGCN_RiftStaminaDrain_C::DrainMeshMaterial' has a wrong offset!");
static_assert(offsetof(AGCN_RiftStaminaDrain_C, DrainBeamMaterial) == 0x0004A0, "Member 'AGCN_RiftStaminaDrain_C::DrainBeamMaterial' has a wrong offset!");
static_assert(offsetof(AGCN_RiftStaminaDrain_C, DrainLocationOffset) == 0x0004A8, "Member 'AGCN_RiftStaminaDrain_C::DrainLocationOffset' has a wrong offset!");
static_assert(offsetof(AGCN_RiftStaminaDrain_C, TargetLocation) == 0x0004B4, "Member 'AGCN_RiftStaminaDrain_C::TargetLocation' has a wrong offset!");

}

