#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_DanceStun

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_Athena_DanceStun.GCN_Athena_DanceStun_C
// 0x0020 (0x04B0 - 0x0490)
class AGCN_Athena_DanceStun_C final : public AFortGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  PlayerPawn;                                        // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCN_Athena_DanceStun(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();
	bool OnActive(class AActor* MyTarget, struct FGameplayCueParameters& Parameters);
	bool OnRemove(class AActor* MyTarget, struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_Athena_DanceStun_C">();
	}
	static class AGCN_Athena_DanceStun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_Athena_DanceStun_C>();
	}
};
static_assert(alignof(AGCN_Athena_DanceStun_C) == 0x000010, "Wrong alignment on AGCN_Athena_DanceStun_C");
static_assert(sizeof(AGCN_Athena_DanceStun_C) == 0x0004B0, "Wrong size on AGCN_Athena_DanceStun_C");
static_assert(offsetof(AGCN_Athena_DanceStun_C, UberGraphFrame) == 0x000490, "Member 'AGCN_Athena_DanceStun_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_DanceStun_C, StaticMesh) == 0x000498, "Member 'AGCN_Athena_DanceStun_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_DanceStun_C, PlayerPawn) == 0x0004A0, "Member 'AGCN_Athena_DanceStun_C::PlayerPawn' has a wrong offset!");

}

