#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_Bush

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCN_Athena_Bush.GCN_Athena_Bush_C
// 0x0050 (0x04E0 - 0x0490)
class AGCN_Athena_Bush_C final : public AFortGameplayCueNotify_Looping
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow2;                                            // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow1;                                            // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BushMesh;                                          // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Trail_Leaves;                                      // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 PlayerPawn;                                        // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Bush;                                          // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActive;                                          // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GCN_Athena_Bush(int32 EntryPoint);
	void On_Player_Step();
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();
	bool OnRemove(class AActor* MyTarget, struct FGameplayCueParameters& Parameters);
	bool WhileActive(class AActor* MyTarget, struct FGameplayCueParameters& Parameters);
	void Activated(class AActor* Param_PlayerPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCN_Athena_Bush_C">();
	}
	static class AGCN_Athena_Bush_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCN_Athena_Bush_C>();
	}
};
static_assert(alignof(AGCN_Athena_Bush_C) == 0x000010, "Wrong alignment on AGCN_Athena_Bush_C");
static_assert(sizeof(AGCN_Athena_Bush_C) == 0x0004E0, "Wrong size on AGCN_Athena_Bush_C");
static_assert(offsetof(AGCN_Athena_Bush_C, UberGraphFrame) == 0x000490, "Member 'AGCN_Athena_Bush_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Bush_C, Arrow2) == 0x000498, "Member 'AGCN_Athena_Bush_C::Arrow2' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Bush_C, Arrow1) == 0x0004A0, "Member 'AGCN_Athena_Bush_C::Arrow1' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Bush_C, BushMesh) == 0x0004A8, "Member 'AGCN_Athena_Bush_C::BushMesh' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Bush_C, Arrow) == 0x0004B0, "Member 'AGCN_Athena_Bush_C::Arrow' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Bush_C, Trail_Leaves) == 0x0004B8, "Member 'AGCN_Athena_Bush_C::Trail_Leaves' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Bush_C, PlayerPawn) == 0x0004C0, "Member 'AGCN_Athena_Bush_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Bush_C, MID_Bush) == 0x0004C8, "Member 'AGCN_Athena_Bush_C::MID_Bush' has a wrong offset!");
static_assert(offsetof(AGCN_Athena_Bush_C, IsActive) == 0x0004D0, "Member 'AGCN_Athena_Bush_C::IsActive' has a wrong offset!");

}

