#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HealthWarningWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HealthWarningWidget.HealthWarningWidget_C
// 0x0058 (0x0428 - 0x03D0)
class UHealthWarningWidget_C final : public UFortHealthWarningBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       FinishingAnim;                                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       CommonLazyImage_0;                                 // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HealthWarningText;                                 // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RatingIconsBox;                                    // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   HealthWarningCompleted;                            // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         ShowTimeLength;                                    // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           ShowTimer;                                         // 0x0410(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMargin                                IconPadding;                                       // 0x0418(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void HealthWarningCompleted__DelegateSignature();
	void ExecuteUbergraph_HealthWarningWidget(int32 EntryPoint);
	void AddIconToScreen(class UCommonLazyImage* Image);
	void Construct();
	void Destruct();
	void HandleShowTimerComplete();
	void OnActivated();
	void SetupShowTimer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HealthWarningWidget_C">();
	}
	static class UHealthWarningWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHealthWarningWidget_C>();
	}
};
static_assert(alignof(UHealthWarningWidget_C) == 0x000008, "Wrong alignment on UHealthWarningWidget_C");
static_assert(sizeof(UHealthWarningWidget_C) == 0x000428, "Wrong size on UHealthWarningWidget_C");
static_assert(offsetof(UHealthWarningWidget_C, UberGraphFrame) == 0x0003D0, "Member 'UHealthWarningWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHealthWarningWidget_C, FinishingAnim) == 0x0003D8, "Member 'UHealthWarningWidget_C::FinishingAnim' has a wrong offset!");
static_assert(offsetof(UHealthWarningWidget_C, CommonLazyImage_0) == 0x0003E0, "Member 'UHealthWarningWidget_C::CommonLazyImage_0' has a wrong offset!");
static_assert(offsetof(UHealthWarningWidget_C, HealthWarningText) == 0x0003E8, "Member 'UHealthWarningWidget_C::HealthWarningText' has a wrong offset!");
static_assert(offsetof(UHealthWarningWidget_C, RatingIconsBox) == 0x0003F0, "Member 'UHealthWarningWidget_C::RatingIconsBox' has a wrong offset!");
static_assert(offsetof(UHealthWarningWidget_C, HealthWarningCompleted) == 0x0003F8, "Member 'UHealthWarningWidget_C::HealthWarningCompleted' has a wrong offset!");
static_assert(offsetof(UHealthWarningWidget_C, ShowTimeLength) == 0x000408, "Member 'UHealthWarningWidget_C::ShowTimeLength' has a wrong offset!");
static_assert(offsetof(UHealthWarningWidget_C, ShowTimer) == 0x000410, "Member 'UHealthWarningWidget_C::ShowTimer' has a wrong offset!");
static_assert(offsetof(UHealthWarningWidget_C, IconPadding) == 0x000418, "Member 'UHealthWarningWidget_C::IconPadding' has a wrong offset!");

}

