#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeroSquadBonuses

#include "Basic.hpp"


namespace SDK::Params
{

// Function HeroSquadBonuses.HeroSquadBonuses_C.OnSquadSlotSelected
// 0x0028 (0x0028 - 0x0000)
struct HeroSquadBonuses_C_OnSquadSlotSelected final
{
public:
	int32                                         SquadSlotIndex;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHeroSquadBonus_C*                      K2Node_DynamicCast_AsHero_Squad_Bonus;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHeroSquadBonus_C*                      K2Node_DynamicCast_AsHero_Squad_Bonus2;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HeroSquadBonuses_C_OnSquadSlotSelected) == 0x000008, "Wrong alignment on HeroSquadBonuses_C_OnSquadSlotSelected");
static_assert(sizeof(HeroSquadBonuses_C_OnSquadSlotSelected) == 0x000028, "Wrong size on HeroSquadBonuses_C_OnSquadSlotSelected");
static_assert(offsetof(HeroSquadBonuses_C_OnSquadSlotSelected, SquadSlotIndex) == 0x000000, "Member 'HeroSquadBonuses_C_OnSquadSlotSelected::SquadSlotIndex' has a wrong offset!");
static_assert(offsetof(HeroSquadBonuses_C_OnSquadSlotSelected, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'HeroSquadBonuses_C_OnSquadSlotSelected::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroSquadBonuses_C_OnSquadSlotSelected, K2Node_DynamicCast_AsHero_Squad_Bonus) == 0x000008, "Member 'HeroSquadBonuses_C_OnSquadSlotSelected::K2Node_DynamicCast_AsHero_Squad_Bonus' has a wrong offset!");
static_assert(offsetof(HeroSquadBonuses_C_OnSquadSlotSelected, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'HeroSquadBonuses_C_OnSquadSlotSelected::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HeroSquadBonuses_C_OnSquadSlotSelected, CallFunc_EqualEqual_IntInt_ReturnValue2) == 0x000011, "Member 'HeroSquadBonuses_C_OnSquadSlotSelected::CallFunc_EqualEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HeroSquadBonuses_C_OnSquadSlotSelected, K2Node_DynamicCast_AsHero_Squad_Bonus2) == 0x000018, "Member 'HeroSquadBonuses_C_OnSquadSlotSelected::K2Node_DynamicCast_AsHero_Squad_Bonus2' has a wrong offset!");
static_assert(offsetof(HeroSquadBonuses_C_OnSquadSlotSelected, K2Node_DynamicCast_bSuccess2) == 0x000020, "Member 'HeroSquadBonuses_C_OnSquadSlotSelected::K2Node_DynamicCast_bSuccess2' has a wrong offset!");

}

