#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeroNotificationHandler

#include "Basic.hpp"


namespace SDK::Params
{

// Function HeroNotificationHandler.HeroNotificationHandler_C.CreateWidget
// 0x0018 (0x0018 - 0x0000)
struct HeroNotificationHandler_C_CreateWidget final
{
public:
	class APlayerController*                      OwningPlayer;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStickyNotification_C*                  CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HeroNotificationHandler_C_CreateWidget) == 0x000008, "Wrong alignment on HeroNotificationHandler_C_CreateWidget");
static_assert(sizeof(HeroNotificationHandler_C_CreateWidget) == 0x000018, "Wrong size on HeroNotificationHandler_C_CreateWidget");
static_assert(offsetof(HeroNotificationHandler_C_CreateWidget, OwningPlayer) == 0x000000, "Member 'HeroNotificationHandler_C_CreateWidget::OwningPlayer' has a wrong offset!");
static_assert(offsetof(HeroNotificationHandler_C_CreateWidget, ReturnValue) == 0x000008, "Member 'HeroNotificationHandler_C_CreateWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(HeroNotificationHandler_C_CreateWidget, CallFunc_Create_ReturnValue) == 0x000010, "Member 'HeroNotificationHandler_C_CreateWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

}

