#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HexmapLevelSettings_Temperate01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HexmapLevelSettings_Temperate01.HexmapLevelSettings_Temperate01_C
// 0x0040 (0x03A8 - 0x0368)
class AHexmapLevelSettings_Temperate01_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(Transient, DuplicateTransient)
	class UExponentialHeightFogComponent*         ExponentialHeightFog_Volumetric;                   // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UExponentialHeightFogComponent*         ExponentialHeightFog;                              // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkyLightComponent*                     SkyLight;                                          // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             DirectionalLightMinusMain;                         // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        LightsRoot;                                        // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HexmapLevelSettings_Temperate01(int32 EntryPoint);
	void CustomSettings(bool Visibility);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HexmapLevelSettings_Temperate01_C">();
	}
	static class AHexmapLevelSettings_Temperate01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHexmapLevelSettings_Temperate01_C>();
	}
};
static_assert(alignof(AHexmapLevelSettings_Temperate01_C) == 0x000008, "Wrong alignment on AHexmapLevelSettings_Temperate01_C");
static_assert(sizeof(AHexmapLevelSettings_Temperate01_C) == 0x0003A8, "Wrong size on AHexmapLevelSettings_Temperate01_C");
static_assert(offsetof(AHexmapLevelSettings_Temperate01_C, UberGraphFrame) == 0x000368, "Member 'AHexmapLevelSettings_Temperate01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AHexmapLevelSettings_Temperate01_C, ExponentialHeightFog_Volumetric) == 0x000370, "Member 'AHexmapLevelSettings_Temperate01_C::ExponentialHeightFog_Volumetric' has a wrong offset!");
static_assert(offsetof(AHexmapLevelSettings_Temperate01_C, ExponentialHeightFog) == 0x000378, "Member 'AHexmapLevelSettings_Temperate01_C::ExponentialHeightFog' has a wrong offset!");
static_assert(offsetof(AHexmapLevelSettings_Temperate01_C, SkyLight) == 0x000380, "Member 'AHexmapLevelSettings_Temperate01_C::SkyLight' has a wrong offset!");
static_assert(offsetof(AHexmapLevelSettings_Temperate01_C, DirectionalLightMinusMain) == 0x000388, "Member 'AHexmapLevelSettings_Temperate01_C::DirectionalLightMinusMain' has a wrong offset!");
static_assert(offsetof(AHexmapLevelSettings_Temperate01_C, LightsRoot) == 0x000390, "Member 'AHexmapLevelSettings_Temperate01_C::LightsRoot' has a wrong offset!");
static_assert(offsetof(AHexmapLevelSettings_Temperate01_C, Arrow) == 0x000398, "Member 'AHexmapLevelSettings_Temperate01_C::Arrow' has a wrong offset!");
static_assert(offsetof(AHexmapLevelSettings_Temperate01_C, DefaultSceneRoot) == 0x0003A0, "Member 'AHexmapLevelSettings_Temperate01_C::DefaultSceneRoot' has a wrong offset!");

}

