#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function HUD.HUD_C.ExecuteUbergraph_HUD
// 0x04C0 (0x04C0 - 0x0000)
struct HUD_C_ExecuteUbergraph_HUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPickerContext*                     CallFunc_GetContext_ReturnValue2;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue3;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue4;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue5;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputManager*                    CallFunc_GetInputManager_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIState                                  K2Node_Event_PreviousUIState;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EFortQuickBars QuickbarIndex, int32 Slot)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CursorModeContentWidget)> K2Node_CreateDelegate_OutputDelegate5;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bIsTargeting)>            K2Node_CreateDelegate_OutputDelegate6;             // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(struct FEndOfDayRecap& EndOfDayRecap)> K2Node_CreateDelegate_OutputDelegate7;             // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue6;                  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBuildingInfoIndicator_C*               CallFunc_Create_ReturnValue;                       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortActorCanvasSlot*                   CallFunc_AddActorIndicator_ReturnValue;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue7;                  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bIndicatorsEnabled)>      K2Node_CreateDelegate_OutputDelegate8;             // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue8;                  // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortQuestItem*>                 K2Node_CustomEvent_Quests;                         // 0x0100(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class AFortGameStateZone*                     CallFunc_GetGameStateZone_ReturnValue;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortGameplayState                            CallFunc_GetGameplayState_ReturnValue;             // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11F[0x1];                                      // 0x011F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue9;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue2;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInteractionIndicator_C*                CallFunc_Create_ReturnValue2;                      // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortActorCanvasSlot*                   CallFunc_AddActorIndicator_ReturnValue2;           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bVisible;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool IsVisible)>               K2Node_CreateDelegate_OutputDelegate9;             // 0x0150(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue10;                 // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEndOfDayRecap                         K2Node_CustomEvent_EndOfDayRecap;                  // 0x0178(0x0020)(ConstParm)
	TDelegate<void(EFortCompletionResult Result)> K2Node_CreateDelegate_OutputDelegate10;            // 0x0198(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EFortPickerMode Mode, int32 InitialOption, bool bIgnoreFirstAccept)> K2Node_CreateDelegate_OutputDelegate11;            // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate12;            // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* PointOfInterest, class FText DisplayText, class UTexture2D* DisplayImage)> K2Node_CreateDelegate_OutputDelegate13;            // 0x01C8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* PointOfInterest)> K2Node_CreateDelegate_OutputDelegate14;            // 0x01D8(0x0010)(ZeroConstructor, NoDestructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue11;                 // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Event_Widget;                               // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FContentPushState                      K2Node_Event_State;                                // 0x01F8(0x0003)(NoDestructor)
	uint8                                         Pad_1FB[0x5];                                      // 0x01FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate15;            // 0x0200(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItem*                         CallFunc_Array_Get_Item;                           // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_GetItemSmallPreviewImageBrush_ReturnValue; // 0x0220(0x0078)()
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0298(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x02B0(0x0040)(HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_UsingGamepad;                   // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x02F8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0308(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0xF];                                      // 0x0321(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortDialogDescription                 K2Node_MakeStruct_FortDialogDescription;           // 0x0330(0x0150)(ContainsInstancedReference)
	class UFortAsyncAction_TriggerNotification*   CallFunc_TriggerNotification_ReturnValue;          // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue12;                 // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TArray<class UFortQuestItem*>& Quests)> K2Node_CreateDelegate_OutputDelegate16;            // 0x0498(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(struct FGameplayTagContainer& HiddenHUDElementTags)> K2Node_CreateDelegate_OutputDelegate17;            // 0x04A8(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(HUD_C_ExecuteUbergraph_HUD) == 0x000010, "Wrong alignment on HUD_C_ExecuteUbergraph_HUD");
static_assert(sizeof(HUD_C_ExecuteUbergraph_HUD) == 0x0004C0, "Wrong size on HUD_C_ExecuteUbergraph_HUD");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, EntryPoint) == 0x000000, "Member 'HUD_C_ExecuteUbergraph_HUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_GetContext_ReturnValue2) == 0x000010, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_GetContext_ReturnValue3) == 0x000018, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, Temp_bool_Variable) == 0x000020, "Member 'HUD_C_ExecuteUbergraph_HUD::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, Temp_byte_Variable) == 0x000021, "Member 'HUD_C_ExecuteUbergraph_HUD::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, Temp_byte_Variable2) == 0x000022, "Member 'HUD_C_ExecuteUbergraph_HUD::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_GetContext_ReturnValue4) == 0x000028, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_GetContext_ReturnValue5) == 0x000030, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_GetContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_GetInputManager_ReturnValue) == 0x000038, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_Event_PreviousUIState) == 0x000040, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_Event_PreviousUIState' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_CreateDelegate_OutputDelegate2) == 0x000058, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_CreateDelegate_OutputDelegate3) == 0x000068, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_CreateDelegate_OutputDelegate4) == 0x000078, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_CreateDelegate_OutputDelegate5) == 0x000088, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_CreateDelegate_OutputDelegate6) == 0x000098, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_CreateDelegate_OutputDelegate7) == 0x0000A8, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_GetContext_ReturnValue6) == 0x0000B8, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_GetContext_ReturnValue6' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000C0, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_Create_ReturnValue) == 0x0000C8, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_AddActorIndicator_ReturnValue) == 0x0000D0, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_AddActorIndicator_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_GetContext_ReturnValue7) == 0x0000D8, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_GetContext_ReturnValue7' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_CreateDelegate_OutputDelegate8) == 0x0000E0, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_IsValid_ReturnValue) == 0x0000F0, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_GetContext_ReturnValue8) == 0x0000F8, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_GetContext_ReturnValue8' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_CustomEvent_Quests) == 0x000100, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_CustomEvent_Quests' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_GetGameStateZone_ReturnValue) == 0x000110, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_GetGameStateZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_Array_Length_ReturnValue) == 0x000118, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_IsValid_ReturnValue2) == 0x00011C, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_GetGameplayState_ReturnValue) == 0x00011D, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_GetGameplayState_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00011E, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_GetContext_ReturnValue9) == 0x000120, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_GetContext_ReturnValue9' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_GetOwningPlayer_ReturnValue2) == 0x000128, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_GetOwningPlayer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_GetQuestManager_ReturnValue) == 0x000130, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_Create_ReturnValue2) == 0x000138, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_Create_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_AddActorIndicator_ReturnValue2) == 0x000140, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_AddActorIndicator_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_CustomEvent_bVisible) == 0x000148, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_CustomEvent_bVisible' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_CreateDelegate_OutputDelegate9) == 0x000150, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, Temp_int_Loop_Counter_Variable) == 0x000160, "Member 'HUD_C_ExecuteUbergraph_HUD::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_Less_IntInt_ReturnValue) == 0x000164, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_Add_IntInt_ReturnValue) == 0x000168, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_GetContext_ReturnValue10) == 0x000170, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_GetContext_ReturnValue10' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_CustomEvent_EndOfDayRecap) == 0x000178, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_CustomEvent_EndOfDayRecap' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_CreateDelegate_OutputDelegate10) == 0x000198, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_CreateDelegate_OutputDelegate11) == 0x0001A8, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_CreateDelegate_OutputDelegate12) == 0x0001B8, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_CreateDelegate_OutputDelegate12' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_CreateDelegate_OutputDelegate13) == 0x0001C8, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_CreateDelegate_OutputDelegate13' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_CreateDelegate_OutputDelegate14) == 0x0001D8, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_CreateDelegate_OutputDelegate14' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_GetContext_ReturnValue11) == 0x0001E8, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_GetContext_ReturnValue11' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_Event_Widget) == 0x0001F0, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_Event_Widget' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_Event_State) == 0x0001F8, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_CreateDelegate_OutputDelegate15) == 0x000200, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_CreateDelegate_OutputDelegate15' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, Temp_int_Array_Index_Variable) == 0x000210, "Member 'HUD_C_ExecuteUbergraph_HUD::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_Array_Get_Item) == 0x000218, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_GetItemSmallPreviewImageBrush_ReturnValue) == 0x000220, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_GetItemSmallPreviewImageBrush_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_GetDisplayName_ReturnValue) == 0x000298, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_MakeStruct_FormatArgumentData) == 0x0002B0, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_CustomEvent_UsingGamepad) == 0x0002F0, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_CustomEvent_UsingGamepad' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_MakeArray_Array) == 0x0002F8, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_Format_ReturnValue) == 0x000308, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_Select_Default) == 0x000320, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_MakeStruct_FortDialogDescription) == 0x000330, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_MakeStruct_FortDialogDescription' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_TriggerNotification_ReturnValue) == 0x000480, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_TriggerNotification_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_GetContext_ReturnValue12) == 0x000488, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_GetContext_ReturnValue12' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, CallFunc_IsValid_ReturnValue3) == 0x000490, "Member 'HUD_C_ExecuteUbergraph_HUD::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_CreateDelegate_OutputDelegate16) == 0x000498, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_CreateDelegate_OutputDelegate16' has a wrong offset!");
static_assert(offsetof(HUD_C_ExecuteUbergraph_HUD, K2Node_CreateDelegate_OutputDelegate17) == 0x0004A8, "Member 'HUD_C_ExecuteUbergraph_HUD::K2Node_CreateDelegate_OutputDelegate17' has a wrong offset!");

// Function HUD.HUD_C.HandleInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct HUD_C_HandleInputMethodChanged final
{
public:
	bool                                          UsingGamepad;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUD_C_HandleInputMethodChanged) == 0x000001, "Wrong alignment on HUD_C_HandleInputMethodChanged");
static_assert(sizeof(HUD_C_HandleInputMethodChanged) == 0x000001, "Wrong size on HUD_C_HandleInputMethodChanged");
static_assert(offsetof(HUD_C_HandleInputMethodChanged, UsingGamepad) == 0x000000, "Member 'HUD_C_HandleInputMethodChanged::UsingGamepad' has a wrong offset!");

// Function HUD.HUD_C.PushContentWidgetInternal
// 0x0010 (0x0010 - 0x0000)
struct HUD_C_PushContentWidgetInternal final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FContentPushState                      State;                                             // 0x0008(0x0003)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(HUD_C_PushContentWidgetInternal) == 0x000008, "Wrong alignment on HUD_C_PushContentWidgetInternal");
static_assert(sizeof(HUD_C_PushContentWidgetInternal) == 0x000010, "Wrong size on HUD_C_PushContentWidgetInternal");
static_assert(offsetof(HUD_C_PushContentWidgetInternal, Widget) == 0x000000, "Member 'HUD_C_PushContentWidgetInternal::Widget' has a wrong offset!");
static_assert(offsetof(HUD_C_PushContentWidgetInternal, State) == 0x000008, "Member 'HUD_C_PushContentWidgetInternal::State' has a wrong offset!");

// Function HUD.HUD_C.EndOfDayRecapStarted
// 0x0020 (0x0020 - 0x0000)
struct HUD_C_EndOfDayRecapStarted final
{
public:
	struct FEndOfDayRecap                         EndOfDayRecap;                                     // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(HUD_C_EndOfDayRecapStarted) == 0x000008, "Wrong alignment on HUD_C_EndOfDayRecapStarted");
static_assert(sizeof(HUD_C_EndOfDayRecapStarted) == 0x000020, "Wrong size on HUD_C_EndOfDayRecapStarted");
static_assert(offsetof(HUD_C_EndOfDayRecapStarted, EndOfDayRecap) == 0x000000, "Member 'HUD_C_EndOfDayRecapStarted::EndOfDayRecap' has a wrong offset!");

// Function HUD.HUD_C.LoadingScreenChanged
// 0x0001 (0x0001 - 0x0000)
struct HUD_C_LoadingScreenChanged final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUD_C_LoadingScreenChanged) == 0x000001, "Wrong alignment on HUD_C_LoadingScreenChanged");
static_assert(sizeof(HUD_C_LoadingScreenChanged) == 0x000001, "Wrong size on HUD_C_LoadingScreenChanged");
static_assert(offsetof(HUD_C_LoadingScreenChanged, bVisible) == 0x000000, "Member 'HUD_C_LoadingScreenChanged::bVisible' has a wrong offset!");

// Function HUD.HUD_C.QuestsCompleted
// 0x0010 (0x0010 - 0x0000)
struct HUD_C_QuestsCompleted final
{
public:
	TArray<class UFortQuestItem*>                 Quests;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(HUD_C_QuestsCompleted) == 0x000008, "Wrong alignment on HUD_C_QuestsCompleted");
static_assert(sizeof(HUD_C_QuestsCompleted) == 0x000010, "Wrong size on HUD_C_QuestsCompleted");
static_assert(offsetof(HUD_C_QuestsCompleted, Quests) == 0x000000, "Member 'HUD_C_QuestsCompleted::Quests' has a wrong offset!");

// Function HUD.HUD_C.OnEnterState
// 0x0001 (0x0001 - 0x0000)
struct HUD_C_OnEnterState final
{
public:
	EFortUIState                                  PreviousUIState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUD_C_OnEnterState) == 0x000001, "Wrong alignment on HUD_C_OnEnterState");
static_assert(sizeof(HUD_C_OnEnterState) == 0x000001, "Wrong size on HUD_C_OnEnterState");
static_assert(offsetof(HUD_C_OnEnterState, PreviousUIState) == 0x000000, "Member 'HUD_C_OnEnterState::PreviousUIState' has a wrong offset!");

// Function HUD.HUD_C.HandleCursorModeChanged
// 0x00C0 (0x00C0 - 0x0000)
struct HUD_C_HandleCursorModeChanged final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ActionName;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CursorModeContentCustomWidget;                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortInputMode                                Temp_byte_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortInputMode                                Temp_byte_Variable2;                               // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortInputMode                                K2Node_Select_Default;                             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIManager_C*                           K2Node_DynamicCast_AsUIManager;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFeedback_C*                            K2Node_DynamicCast_AsFeedback;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue2;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetCachedWidget_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMgmtTabsScreen_C*                      K2Node_DynamicCast_AsMgmt_Tabs_Screen;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetActiveTab_ReturnValue;                 // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue2;                  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputManager*                    CallFunc_GetInputManager_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue3;                  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputManager*                    CallFunc_GetInputManager_ReturnValue2;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUD_C_HandleCursorModeChanged) == 0x000008, "Wrong alignment on HUD_C_HandleCursorModeChanged");
static_assert(sizeof(HUD_C_HandleCursorModeChanged) == 0x0000C0, "Wrong size on HUD_C_HandleCursorModeChanged");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, IsEnabled) == 0x000000, "Member 'HUD_C_HandleCursorModeChanged::IsEnabled' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, ActionName) == 0x000008, "Member 'HUD_C_HandleCursorModeChanged::ActionName' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, CursorModeContentCustomWidget) == 0x000010, "Member 'HUD_C_HandleCursorModeChanged::CursorModeContentCustomWidget' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, K2Node_SwitchName_CmpSuccess) == 0x000018, "Member 'HUD_C_HandleCursorModeChanged::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, CallFunc_NotEqual_NameName_ReturnValue) == 0x000019, "Member 'HUD_C_HandleCursorModeChanged::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, Temp_byte_Variable) == 0x00001A, "Member 'HUD_C_HandleCursorModeChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, Temp_byte_Variable2) == 0x00001B, "Member 'HUD_C_HandleCursorModeChanged::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00001C, "Member 'HUD_C_HandleCursorModeChanged::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, Temp_bool_Variable) == 0x000020, "Member 'HUD_C_HandleCursorModeChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, CallFunc_GetContext_ReturnValue) == 0x000028, "Member 'HUD_C_HandleCursorModeChanged::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, Temp_byte_Variable3) == 0x000030, "Member 'HUD_C_HandleCursorModeChanged::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, K2Node_Select_Default) == 0x000031, "Member 'HUD_C_HandleCursorModeChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000038, "Member 'HUD_C_HandleCursorModeChanged::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, Temp_byte_Variable4) == 0x000040, "Member 'HUD_C_HandleCursorModeChanged::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, K2Node_DynamicCast_AsUIManager) == 0x000048, "Member 'HUD_C_HandleCursorModeChanged::K2Node_DynamicCast_AsUIManager' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'HUD_C_HandleCursorModeChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, K2Node_DynamicCast_AsFeedback) == 0x000058, "Member 'HUD_C_HandleCursorModeChanged::K2Node_DynamicCast_AsFeedback' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, K2Node_DynamicCast_bSuccess2) == 0x000060, "Member 'HUD_C_HandleCursorModeChanged::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, CallFunc_GetUIManagerWidget_ReturnValue2) == 0x000068, "Member 'HUD_C_HandleCursorModeChanged::CallFunc_GetUIManagerWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, CallFunc_GetCachedWidget_ReturnValue) == 0x000070, "Member 'HUD_C_HandleCursorModeChanged::CallFunc_GetCachedWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, K2Node_DynamicCast_AsMgmt_Tabs_Screen) == 0x000078, "Member 'HUD_C_HandleCursorModeChanged::K2Node_DynamicCast_AsMgmt_Tabs_Screen' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, K2Node_DynamicCast_bSuccess3) == 0x000080, "Member 'HUD_C_HandleCursorModeChanged::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, CallFunc_GetActiveTab_ReturnValue) == 0x000088, "Member 'HUD_C_HandleCursorModeChanged::CallFunc_GetActiveTab_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, Temp_bool_Variable2) == 0x000090, "Member 'HUD_C_HandleCursorModeChanged::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, CallFunc_GetContext_ReturnValue2) == 0x000098, "Member 'HUD_C_HandleCursorModeChanged::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, CallFunc_GetInputManager_ReturnValue) == 0x0000A0, "Member 'HUD_C_HandleCursorModeChanged::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, K2Node_Select2_Default) == 0x0000A8, "Member 'HUD_C_HandleCursorModeChanged::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, CallFunc_GetContext_ReturnValue3) == 0x0000B0, "Member 'HUD_C_HandleCursorModeChanged::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleCursorModeChanged, CallFunc_GetInputManager_ReturnValue2) == 0x0000B8, "Member 'HUD_C_HandleCursorModeChanged::CallFunc_GetInputManager_ReturnValue2' has a wrong offset!");

// Function HUD.HUD_C.HandleQuickbarSlotFocusSlotChanged
// 0x000C (0x000C - 0x0000)
struct HUD_C_HandleQuickbarSlotFocusSlotChanged final
{
public:
	EFortQuickBars                                Quickbar_Index;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param_Slot;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUD_C_HandleQuickbarSlotFocusSlotChanged) == 0x000004, "Wrong alignment on HUD_C_HandleQuickbarSlotFocusSlotChanged");
static_assert(sizeof(HUD_C_HandleQuickbarSlotFocusSlotChanged) == 0x00000C, "Wrong size on HUD_C_HandleQuickbarSlotFocusSlotChanged");
static_assert(offsetof(HUD_C_HandleQuickbarSlotFocusSlotChanged, Quickbar_Index) == 0x000000, "Member 'HUD_C_HandleQuickbarSlotFocusSlotChanged::Quickbar_Index' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleQuickbarSlotFocusSlotChanged, Param_Slot) == 0x000004, "Member 'HUD_C_HandleQuickbarSlotFocusSlotChanged::Param_Slot' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleQuickbarSlotFocusSlotChanged, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000008, "Member 'HUD_C_HandleQuickbarSlotFocusSlotChanged::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function HUD.HUD_C.SetQuickbarSizes
// 0x0010 (0x0010 - 0x0000)
struct HUD_C_SetQuickbarSizes final
{
public:
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUD_C_SetQuickbarSizes) == 0x000008, "Wrong alignment on HUD_C_SetQuickbarSizes");
static_assert(sizeof(HUD_C_SetQuickbarSizes) == 0x000010, "Wrong size on HUD_C_SetQuickbarSizes");
static_assert(offsetof(HUD_C_SetQuickbarSizes, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'HUD_C_SetQuickbarSizes::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_SetQuickbarSizes, CallFunc_IsUsingGamepad_ReturnValue) == 0x000008, "Member 'HUD_C_SetQuickbarSizes::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_SetQuickbarSizes, K2Node_SwitchEnum_CmpSuccess) == 0x000009, "Member 'HUD_C_SetQuickbarSizes::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function HUD.HUD_C.OnHandleAction
// 0x0310 (0x0310 - 0x0000)
struct HUD_C_OnHandleAction final
{
public:
	struct FEventReply                            Result;                                            // 0x0000(0x00B8)(Parm, OutParm)
	bool                                          bPassThrough;                                      // 0x00B8(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HandleAction;                                      // 0x00B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BB[0x5];                                       // 0x00BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldCloseMenuOnEscape_ReturnValue;      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00D8(0x00B8)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0198(0x00B8)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            K2Node_Select_Default;                             // 0x0258(0x00B8)()
};
static_assert(alignof(HUD_C_OnHandleAction) == 0x000008, "Wrong alignment on HUD_C_OnHandleAction");
static_assert(sizeof(HUD_C_OnHandleAction) == 0x000310, "Wrong size on HUD_C_OnHandleAction");
static_assert(offsetof(HUD_C_OnHandleAction, Result) == 0x000000, "Member 'HUD_C_OnHandleAction::Result' has a wrong offset!");
static_assert(offsetof(HUD_C_OnHandleAction, bPassThrough) == 0x0000B8, "Member 'HUD_C_OnHandleAction::bPassThrough' has a wrong offset!");
static_assert(offsetof(HUD_C_OnHandleAction, HandleAction) == 0x0000B9, "Member 'HUD_C_OnHandleAction::HandleAction' has a wrong offset!");
static_assert(offsetof(HUD_C_OnHandleAction, Temp_bool_Variable) == 0x0000BA, "Member 'HUD_C_OnHandleAction::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HUD_C_OnHandleAction, CallFunc_GetContext_ReturnValue) == 0x0000C0, "Member 'HUD_C_OnHandleAction::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_OnHandleAction, CallFunc_GetContext_ReturnValue2) == 0x0000C8, "Member 'HUD_C_OnHandleAction::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HUD_C_OnHandleAction, CallFunc_ShouldCloseMenuOnEscape_ReturnValue) == 0x0000D0, "Member 'HUD_C_OnHandleAction::CallFunc_ShouldCloseMenuOnEscape_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_OnHandleAction, CallFunc_Handled_ReturnValue) == 0x0000D8, "Member 'HUD_C_OnHandleAction::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_OnHandleAction, CallFunc_Not_PreBool_ReturnValue) == 0x000190, "Member 'HUD_C_OnHandleAction::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_OnHandleAction, CallFunc_Unhandled_ReturnValue) == 0x000198, "Member 'HUD_C_OnHandleAction::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_OnHandleAction, CallFunc_BooleanAND_ReturnValue) == 0x000250, "Member 'HUD_C_OnHandleAction::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_OnHandleAction, K2Node_Select_Default) == 0x000258, "Member 'HUD_C_OnHandleAction::K2Node_Select_Default' has a wrong offset!");

// Function HUD.HUD_C.HandleZoneCompleted
// 0x0030 (0x0030 - 0x0000)
struct HUD_C_HandleZoneCompleted final
{
public:
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UResults_Widget_C*                      CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue2;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue3;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUD_C_HandleZoneCompleted) == 0x000008, "Wrong alignment on HUD_C_HandleZoneCompleted");
static_assert(sizeof(HUD_C_HandleZoneCompleted) == 0x000030, "Wrong size on HUD_C_HandleZoneCompleted");
static_assert(offsetof(HUD_C_HandleZoneCompleted, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'HUD_C_HandleZoneCompleted::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleZoneCompleted, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'HUD_C_HandleZoneCompleted::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleZoneCompleted, CallFunc_Create_ReturnValue) == 0x000010, "Member 'HUD_C_HandleZoneCompleted::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleZoneCompleted, CallFunc_AddChild_ReturnValue) == 0x000018, "Member 'HUD_C_HandleZoneCompleted::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleZoneCompleted, CallFunc_GetContext_ReturnValue2) == 0x000020, "Member 'HUD_C_HandleZoneCompleted::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HUD_C_HandleZoneCompleted, CallFunc_GetContext_ReturnValue3) == 0x000028, "Member 'HUD_C_HandleZoneCompleted::CallFunc_GetContext_ReturnValue3' has a wrong offset!");

// Function HUD.HUD_C.OnPlayerTargetingChanged
// 0x0028 (0x0028 - 0x0000)
struct HUD_C_OnPlayerTargetingChanged final
{
public:
	bool                                          IsTargeting;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWeapon*                            CallFunc_GetEquippedWeapon_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWeaponRanged*                      K2Node_DynamicCast_AsFort_Weapon_Ranged;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUD_C_OnPlayerTargetingChanged) == 0x000008, "Wrong alignment on HUD_C_OnPlayerTargetingChanged");
static_assert(sizeof(HUD_C_OnPlayerTargetingChanged) == 0x000028, "Wrong size on HUD_C_OnPlayerTargetingChanged");
static_assert(offsetof(HUD_C_OnPlayerTargetingChanged, IsTargeting) == 0x000000, "Member 'HUD_C_OnPlayerTargetingChanged::IsTargeting' has a wrong offset!");
static_assert(offsetof(HUD_C_OnPlayerTargetingChanged, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'HUD_C_OnPlayerTargetingChanged::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_OnPlayerTargetingChanged, CallFunc_GetEquippedWeapon_ReturnValue) == 0x000010, "Member 'HUD_C_OnPlayerTargetingChanged::CallFunc_GetEquippedWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_OnPlayerTargetingChanged, K2Node_DynamicCast_AsFort_Weapon_Ranged) == 0x000018, "Member 'HUD_C_OnPlayerTargetingChanged::K2Node_DynamicCast_AsFort_Weapon_Ranged' has a wrong offset!");
static_assert(offsetof(HUD_C_OnPlayerTargetingChanged, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'HUD_C_OnPlayerTargetingChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function HUD.HUD_C.SetCursorModeContent
// 0x0028 (0x0028 - 0x0000)
struct HUD_C_SetCursorModeContent final
{
public:
	class UUserWidget*                            CustomWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ActionName;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CursorWidget;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUD_C_SetCursorModeContent) == 0x000008, "Wrong alignment on HUD_C_SetCursorModeContent");
static_assert(sizeof(HUD_C_SetCursorModeContent) == 0x000028, "Wrong size on HUD_C_SetCursorModeContent");
static_assert(offsetof(HUD_C_SetCursorModeContent, CustomWidget) == 0x000000, "Member 'HUD_C_SetCursorModeContent::CustomWidget' has a wrong offset!");
static_assert(offsetof(HUD_C_SetCursorModeContent, ActionName) == 0x000008, "Member 'HUD_C_SetCursorModeContent::ActionName' has a wrong offset!");
static_assert(offsetof(HUD_C_SetCursorModeContent, CursorWidget) == 0x000010, "Member 'HUD_C_SetCursorModeContent::CursorWidget' has a wrong offset!");
static_assert(offsetof(HUD_C_SetCursorModeContent, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'HUD_C_SetCursorModeContent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUD_C_SetCursorModeContent, CallFunc_AddChild_ReturnValue) == 0x000020, "Member 'HUD_C_SetCursorModeContent::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function HUD.HUD_C.HandleIndicatorModeChanged
// 0x0005 (0x0005 - 0x0000)
struct HUD_C_HandleIndicatorModeChanged final
{
