#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HUDMinusPickupItemWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function HUD-PickupItemWidget.HUD-PickupItemWidget_C.ExecuteUbergraph_HUD-PickupItemWidget
// 0x0004 (0x0004 - 0x0000)
struct HUDMinusPickupItemWidget_C_ExecuteUbergraph_HUDMinusPickupItemWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDMinusPickupItemWidget_C_ExecuteUbergraph_HUDMinusPickupItemWidget) == 0x000004, "Wrong alignment on HUDMinusPickupItemWidget_C_ExecuteUbergraph_HUDMinusPickupItemWidget");
static_assert(sizeof(HUDMinusPickupItemWidget_C_ExecuteUbergraph_HUDMinusPickupItemWidget) == 0x000004, "Wrong size on HUDMinusPickupItemWidget_C_ExecuteUbergraph_HUDMinusPickupItemWidget");
static_assert(offsetof(HUDMinusPickupItemWidget_C_ExecuteUbergraph_HUDMinusPickupItemWidget, EntryPoint) == 0x000000, "Member 'HUDMinusPickupItemWidget_C_ExecuteUbergraph_HUDMinusPickupItemWidget::EntryPoint' has a wrong offset!");

// Function HUD-PickupItemWidget.HUD-PickupItemWidget_C.InitializeItemData
// 0x0020 (0x0020 - 0x0000)
struct HUDMinusPickupItemWidget_C_InitializeItemData final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              K2Node_Select2_Default;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDMinusPickupItemWidget_C_InitializeItemData) == 0x000008, "Wrong alignment on HUDMinusPickupItemWidget_C_InitializeItemData");
static_assert(sizeof(HUDMinusPickupItemWidget_C_InitializeItemData) == 0x000020, "Wrong size on HUDMinusPickupItemWidget_C_InitializeItemData");
static_assert(offsetof(HUDMinusPickupItemWidget_C_InitializeItemData, Temp_bool_Variable) == 0x000000, "Member 'HUDMinusPickupItemWidget_C_InitializeItemData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HUDMinusPickupItemWidget_C_InitializeItemData, Temp_object_Variable) == 0x000008, "Member 'HUDMinusPickupItemWidget_C_InitializeItemData::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(HUDMinusPickupItemWidget_C_InitializeItemData, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'HUDMinusPickupItemWidget_C_InitializeItemData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDMinusPickupItemWidget_C_InitializeItemData, Temp_bool_Variable2) == 0x000011, "Member 'HUDMinusPickupItemWidget_C_InitializeItemData::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(HUDMinusPickupItemWidget_C_InitializeItemData, Temp_byte_Variable) == 0x000012, "Member 'HUDMinusPickupItemWidget_C_InitializeItemData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HUDMinusPickupItemWidget_C_InitializeItemData, Temp_byte_Variable2) == 0x000013, "Member 'HUDMinusPickupItemWidget_C_InitializeItemData::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(HUDMinusPickupItemWidget_C_InitializeItemData, K2Node_Select_Default) == 0x000014, "Member 'HUDMinusPickupItemWidget_C_InitializeItemData::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HUDMinusPickupItemWidget_C_InitializeItemData, CallFunc_IsValid_ReturnValue2) == 0x000015, "Member 'HUDMinusPickupItemWidget_C_InitializeItemData::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HUDMinusPickupItemWidget_C_InitializeItemData, K2Node_Select2_Default) == 0x000018, "Member 'HUDMinusPickupItemWidget_C_InitializeItemData::K2Node_Select2_Default' has a wrong offset!");

// Function HUD-PickupItemWidget.HUD-PickupItemWidget_C.InitializeInteractionFailureText
// 0x0070 (0x0070 - 0x0000)
struct HUDMinusPickupItemWidget_C_InitializeInteractionFailureText final
{
public:
	class FText                                   InteractErrorText;                                 // 0x0000(0x0018)(Edit, BlueprintVisible)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBackpackItemCounts_ItemsCount;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBackpackItemCounts_MaxItemsCount;      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBackpackItemCounts_OverflowItemsCount; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0030(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetInteractErrorText_InteractErrorText;   // 0x0050(0x0018)()
	bool                                          CallFunc_GetInteractErrorText_ReturnValue;         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HUDMinusPickupItemWidget_C_InitializeInteractionFailureText) == 0x000008, "Wrong alignment on HUDMinusPickupItemWidget_C_InitializeInteractionFailureText");
static_assert(sizeof(HUDMinusPickupItemWidget_C_InitializeInteractionFailureText) == 0x000070, "Wrong size on HUDMinusPickupItemWidget_C_InitializeInteractionFailureText");
static_assert(offsetof(HUDMinusPickupItemWidget_C_InitializeInteractionFailureText, InteractErrorText) == 0x000000, "Member 'HUDMinusPickupItemWidget_C_InitializeInteractionFailureText::InteractErrorText' has a wrong offset!");
static_assert(offsetof(HUDMinusPickupItemWidget_C_InitializeInteractionFailureText, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'HUDMinusPickupItemWidget_C_InitializeInteractionFailureText::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDMinusPickupItemWidget_C_InitializeInteractionFailureText, CallFunc_GetBackpackItemCounts_ItemsCount) == 0x000020, "Member 'HUDMinusPickupItemWidget_C_InitializeInteractionFailureText::CallFunc_GetBackpackItemCounts_ItemsCount' has a wrong offset!");
static_assert(offsetof(HUDMinusPickupItemWidget_C_InitializeInteractionFailureText, CallFunc_GetBackpackItemCounts_MaxItemsCount) == 0x000024, "Member 'HUDMinusPickupItemWidget_C_InitializeInteractionFailureText::CallFunc_GetBackpackItemCounts_MaxItemsCount' has a wrong offset!");
static_assert(offsetof(HUDMinusPickupItemWidget_C_InitializeInteractionFailureText, CallFunc_GetBackpackItemCounts_OverflowItemsCount) == 0x000028, "Member 'HUDMinusPickupItemWidget_C_InitializeInteractionFailureText::CallFunc_GetBackpackItemCounts_OverflowItemsCount' has a wrong offset!");
static_assert(offsetof(HUDMinusPickupItemWidget_C_InitializeInteractionFailureText, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00002C, "Member 'HUDMinusPickupItemWidget_C_InitializeInteractionFailureText::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDMinusPickupItemWidget_C_InitializeInteractionFailureText, Temp_byte_Variable) == 0x00002D, "Member 'HUDMinusPickupItemWidget_C_InitializeInteractionFailureText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HUDMinusPickupItemWidget_C_InitializeInteractionFailureText, CallFunc_GetEmptyText_ReturnValue) == 0x000030, "Member 'HUDMinusPickupItemWidget_C_InitializeInteractionFailureText::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDMinusPickupItemWidget_C_InitializeInteractionFailureText, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'HUDMinusPickupItemWidget_C_InitializeInteractionFailureText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HUDMinusPickupItemWidget_C_InitializeInteractionFailureText, Temp_byte_Variable2) == 0x000049, "Member 'HUDMinusPickupItemWidget_C_InitializeInteractionFailureText::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(HUDMinusPickupItemWidget_C_InitializeInteractionFailureText, Temp_bool_Variable) == 0x00004A, "Member 'HUDMinusPickupItemWidget_C_InitializeInteractionFailureText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HUDMinusPickupItemWidget_C_InitializeInteractionFailureText, K2Node_Select_Default) == 0x00004B, "Member 'HUDMinusPickupItemWidget_C_InitializeInteractionFailureText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HUDMinusPickupItemWidget_C_InitializeInteractionFailureText, CallFunc_GetInteractErrorText_InteractErrorText) == 0x000050, "Member 'HUDMinusPickupItemWidget_C_InitializeInteractionFailureText::CallFunc_GetInteractErrorText_InteractErrorText' has a wrong offset!");
static_assert(offsetof(HUDMinusPickupItemWidget_C_InitializeInteractionFailureText, CallFunc_GetInteractErrorText_ReturnValue) == 0x000068, "Member 'HUDMinusPickupItemWidget_C_InitializeInteractionFailureText::CallFunc_GetInteractErrorText_ReturnValue' has a wrong offset!");

// Function HUD-PickupItemWidget.HUD-PickupItemWidget_C.SetPickup
// 0x0008 (0x0008 - 0x0000)
struct HUDMinusPickupItemWidget_C_SetPickup final
{
public:
	class AFortPickup*                            NewPickup;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HUDMinusPickupItemWidget_C_SetPickup) == 0x000008, "Wrong alignment on HUDMinusPickupItemWidget_C_SetPickup");
static_assert(sizeof(HUDMinusPickupItemWidget_C_SetPickup) == 0x000008, "Wrong size on HUDMinusPickupItemWidget_C_SetPickup");
static_assert(offsetof(HUDMinusPickupItemWidget_C_SetPickup, NewPickup) == 0x000000, "Member 'HUDMinusPickupItemWidget_C_SetPickup::NewPickup' has a wrong offset!");

}

