#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IconTabButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass IconTabButton.IconTabButton_C
// 0x00F0 (0x0870 - 0x0780)
class UIconTabButton_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0780(0x0008)(Transient, DuplicateTransient)
	class UNormalBangWrapper_C*                   BangWrapper;                                       // 0x0788(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CenterButtonTextWidget;                            // 0x0790(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ContentHB;                                         // 0x0798(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftSideImage;                                     // 0x07A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x07A8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateBrush                            IconBrush;                                         // 0x07C0(0x0078)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          UseText;                                           // 0x0838(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_839[0x3];                                      // 0x0839(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           SelectedIconTint;                                  // 0x083C(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DeselectedIconTint;                                // 0x084C(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoveredIconTint;                                   // 0x085C(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBangEnabled;                                      // 0x086C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_IconTabButton(int32 EntryPoint);
	void OnDisabled();
	void OnEnabled();
	void OnUnhovered();
	void OnHovered();
	void Construct();
	void OnDeselected();
	void OnSelected();
	void SetTabLabelInfo(const struct FFortTabButtonLabelInfo& TabLabelInfo);
	void OnCurrentTextStyleChanged();
	void PreConstruct(bool IsDesignTime);
	void Set_Text(const class FText& Param_ButtonText);
	void Set_Icon(const struct FSlateBrush& Param_IconBrush);
	void ShowText();
	void SetTutorialBorderStyle(class UClass* BorderStyle);
	void Update_Bang_State(bool Param_bBangEnabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IconTabButton_C">();
	}
	static class UIconTabButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIconTabButton_C>();
	}
};
static_assert(alignof(UIconTabButton_C) == 0x000008, "Wrong alignment on UIconTabButton_C");
static_assert(sizeof(UIconTabButton_C) == 0x000870, "Wrong size on UIconTabButton_C");
static_assert(offsetof(UIconTabButton_C, UberGraphFrame) == 0x000780, "Member 'UIconTabButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UIconTabButton_C, BangWrapper) == 0x000788, "Member 'UIconTabButton_C::BangWrapper' has a wrong offset!");
static_assert(offsetof(UIconTabButton_C, CenterButtonTextWidget) == 0x000790, "Member 'UIconTabButton_C::CenterButtonTextWidget' has a wrong offset!");
static_assert(offsetof(UIconTabButton_C, ContentHB) == 0x000798, "Member 'UIconTabButton_C::ContentHB' has a wrong offset!");
static_assert(offsetof(UIconTabButton_C, LeftSideImage) == 0x0007A0, "Member 'UIconTabButton_C::LeftSideImage' has a wrong offset!");
static_assert(offsetof(UIconTabButton_C, ButtonText) == 0x0007A8, "Member 'UIconTabButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UIconTabButton_C, IconBrush) == 0x0007C0, "Member 'UIconTabButton_C::IconBrush' has a wrong offset!");
static_assert(offsetof(UIconTabButton_C, UseText) == 0x000838, "Member 'UIconTabButton_C::UseText' has a wrong offset!");
static_assert(offsetof(UIconTabButton_C, SelectedIconTint) == 0x00083C, "Member 'UIconTabButton_C::SelectedIconTint' has a wrong offset!");
static_assert(offsetof(UIconTabButton_C, DeselectedIconTint) == 0x00084C, "Member 'UIconTabButton_C::DeselectedIconTint' has a wrong offset!");
static_assert(offsetof(UIconTabButton_C, HoveredIconTint) == 0x00085C, "Member 'UIconTabButton_C::HoveredIconTint' has a wrong offset!");
static_assert(offsetof(UIconTabButton_C, bBangEnabled) == 0x00086C, "Member 'UIconTabButton_C::bBangEnabled' has a wrong offset!");

}

