#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemTransformResultModal

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ItemTransformResultModal.ItemTransformResultModal_C.ExecuteUbergraph_ItemTransformResultModal
// 0x0028 (0x0028 - 0x0000)
struct ItemTransformResultModal_C_ExecuteUbergraph_ItemTransformResultModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemTransformResultModal_C_ExecuteUbergraph_ItemTransformResultModal) == 0x000008, "Wrong alignment on ItemTransformResultModal_C_ExecuteUbergraph_ItemTransformResultModal");
static_assert(sizeof(ItemTransformResultModal_C_ExecuteUbergraph_ItemTransformResultModal) == 0x000028, "Wrong size on ItemTransformResultModal_C_ExecuteUbergraph_ItemTransformResultModal");
static_assert(offsetof(ItemTransformResultModal_C_ExecuteUbergraph_ItemTransformResultModal, EntryPoint) == 0x000000, "Member 'ItemTransformResultModal_C_ExecuteUbergraph_ItemTransformResultModal::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemTransformResultModal_C_ExecuteUbergraph_ItemTransformResultModal, K2Node_ComponentBoundEvent_Button2) == 0x000008, "Member 'ItemTransformResultModal_C_ExecuteUbergraph_ItemTransformResultModal::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(ItemTransformResultModal_C_ExecuteUbergraph_ItemTransformResultModal, K2Node_ComponentBoundEvent_Button) == 0x000010, "Member 'ItemTransformResultModal_C_ExecuteUbergraph_ItemTransformResultModal::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(ItemTransformResultModal_C_ExecuteUbergraph_ItemTransformResultModal, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000018, "Member 'ItemTransformResultModal_C_ExecuteUbergraph_ItemTransformResultModal::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTransformResultModal_C_ExecuteUbergraph_ItemTransformResultModal, CallFunc_GetUINavigationManager_ReturnValue) == 0x000020, "Member 'ItemTransformResultModal_C_ExecuteUbergraph_ItemTransformResultModal::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

// Function ItemTransformResultModal.ItemTransformResultModal_C.BndEvt__InspectButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ItemTransformResultModal_C_BndEvt__InspectButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemTransformResultModal_C_BndEvt__InspectButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ItemTransformResultModal_C_BndEvt__InspectButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ItemTransformResultModal_C_BndEvt__InspectButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ItemTransformResultModal_C_BndEvt__InspectButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ItemTransformResultModal_C_BndEvt__InspectButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ItemTransformResultModal_C_BndEvt__InspectButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ItemTransformResultModal.ItemTransformResultModal_C.BndEvt__ContinueButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ItemTransformResultModal_C_BndEvt__ContinueButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemTransformResultModal_C_BndEvt__ContinueButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ItemTransformResultModal_C_BndEvt__ContinueButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ItemTransformResultModal_C_BndEvt__ContinueButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ItemTransformResultModal_C_BndEvt__ContinueButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ItemTransformResultModal_C_BndEvt__ContinueButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ItemTransformResultModal_C_BndEvt__ContinueButton_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ItemTransformResultModal.ItemTransformResultModal_C.OpenInspect
// 0x0008 (0x0008 - 0x0000)
struct ItemTransformResultModal_C_OpenInspect final
{
public:
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemTransformResultModal_C_OpenInspect) == 0x000008, "Wrong alignment on ItemTransformResultModal_C_OpenInspect");
static_assert(sizeof(ItemTransformResultModal_C_OpenInspect) == 0x000008, "Wrong size on ItemTransformResultModal_C_OpenInspect");
static_assert(offsetof(ItemTransformResultModal_C_OpenInspect, CallFunc_GetUINavigationManager_ReturnValue) == 0x000000, "Member 'ItemTransformResultModal_C_OpenInspect::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

// Function ItemTransformResultModal.ItemTransformResultModal_C.OpenResult
// 0x00C8 (0x00C8 - 0x0000)
struct ItemTransformResultModal_C_OpenResult final
{
public:
	TArray<struct FFortItemInstanceQuantityPair>  RewardItems;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<struct FFortItemInstanceQuantityPair>  SacrificeItems;                                    // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	struct FSlateColor                            TextColor;                                         // 0x0020(0x0028)(Edit, BlueprintVisible)
	struct FFortItemInstanceQuantityPair          CallFunc_Array_Get_Item;                           // 0x0048(0x0010)(NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortItemInstanceQuantityPair          CallFunc_Array_Get_Item2;                          // 0x0068(0x0010)(NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URewardsListEntry_C*                    CallFunc_Create_ReturnValue;                       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemTransformResultModal_C_OpenResult) == 0x000008, "Wrong alignment on ItemTransformResultModal_C_OpenResult");
static_assert(sizeof(ItemTransformResultModal_C_OpenResult) == 0x0000C8, "Wrong size on ItemTransformResultModal_C_OpenResult");
static_assert(offsetof(ItemTransformResultModal_C_OpenResult, RewardItems) == 0x000000, "Member 'ItemTransformResultModal_C_OpenResult::RewardItems' has a wrong offset!");
static_assert(offsetof(ItemTransformResultModal_C_OpenResult, SacrificeItems) == 0x000010, "Member 'ItemTransformResultModal_C_OpenResult::SacrificeItems' has a wrong offset!");
static_assert(offsetof(ItemTransformResultModal_C_OpenResult, TextColor) == 0x000020, "Member 'ItemTransformResultModal_C_OpenResult::TextColor' has a wrong offset!");
static_assert(offsetof(ItemTransformResultModal_C_OpenResult, CallFunc_Array_Get_Item) == 0x000048, "Member 'ItemTransformResultModal_C_OpenResult::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ItemTransformResultModal_C_OpenResult, Temp_int_Array_Index_Variable) == 0x000058, "Member 'ItemTransformResultModal_C_OpenResult::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ItemTransformResultModal_C_OpenResult, Temp_byte_Variable) == 0x00005C, "Member 'ItemTransformResultModal_C_OpenResult::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemTransformResultModal_C_OpenResult, Temp_int_Loop_Counter_Variable) == 0x000060, "Member 'ItemTransformResultModal_C_OpenResult::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ItemTransformResultModal_C_OpenResult, CallFunc_Array_Get_Item2) == 0x000068, "Member 'ItemTransformResultModal_C_OpenResult::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(ItemTransformResultModal_C_OpenResult, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'ItemTransformResultModal_C_OpenResult::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTransformResultModal_C_OpenResult, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000080, "Member 'ItemTransformResultModal_C_OpenResult::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTransformResultModal_C_OpenResult, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'ItemTransformResultModal_C_OpenResult::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTransformResultModal_C_OpenResult, CallFunc_CreateTemporaryItemInstanceBP_ReturnValue) == 0x000090, "Member 'ItemTransformResultModal_C_OpenResult::CallFunc_CreateTemporaryItemInstanceBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTransformResultModal_C_OpenResult, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'ItemTransformResultModal_C_OpenResult::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTransformResultModal_C_OpenResult, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000A0, "Member 'ItemTransformResultModal_C_OpenResult::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTransformResultModal_C_OpenResult, CallFunc_Less_IntInt_ReturnValue) == 0x0000A8, "Member 'ItemTransformResultModal_C_OpenResult::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTransformResultModal_C_OpenResult, CallFunc_Create_ReturnValue) == 0x0000B0, "Member 'ItemTransformResultModal_C_OpenResult::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTransformResultModal_C_OpenResult, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x0000B8, "Member 'ItemTransformResultModal_C_OpenResult::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTransformResultModal_C_OpenResult, CallFunc_Array_Length_ReturnValue2) == 0x0000C0, "Member 'ItemTransformResultModal_C_OpenResult::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemTransformResultModal_C_OpenResult, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C4, "Member 'ItemTransformResultModal_C_OpenResult::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTransformResultModal_C_OpenResult, Temp_byte_Variable2) == 0x0000C5, "Member 'ItemTransformResultModal_C_OpenResult::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(ItemTransformResultModal_C_OpenResult, Temp_bool_Variable) == 0x0000C6, "Member 'ItemTransformResultModal_C_OpenResult::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemTransformResultModal_C_OpenResult, K2Node_Select_Default) == 0x0000C7, "Member 'ItemTransformResultModal_C_OpenResult::K2Node_Select_Default' has a wrong offset!");

}

