#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemInspectEvolutionIngredientsList

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemInspectEvolutionIngredientsList.ItemInspectEvolutionIngredientsList_C
// 0x0088 (0x0290 - 0x0208)
class UItemInspectEvolutionIngredientsList_C final : public UUserWidget
{
public:
	class UVerticalBox*                           IngredientsListBox;                                // 0x0208(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LevelCheckMarkIcon;                                // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LevelRequirementText;                              // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LevelText;                                         // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FFortItemQuantityPair>          IngredientsList;                                   // 0x0228(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FSlateColor                            HaveColor;                                         // 0x0238(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            NotHaveColor;                                      // 0x0260(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         HaveQuantity;                                      // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NeedQuantity;                                      // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetIngredients(class UFortItem* Item, TArray<struct FFortItemQuantityPair>& InIngredients);
	void ClearIngredients();
	void SetupItemLevelRequirement(class UFortItem* Item);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemInspectEvolutionIngredientsList_C">();
	}
	static class UItemInspectEvolutionIngredientsList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemInspectEvolutionIngredientsList_C>();
	}
};
static_assert(alignof(UItemInspectEvolutionIngredientsList_C) == 0x000008, "Wrong alignment on UItemInspectEvolutionIngredientsList_C");
static_assert(sizeof(UItemInspectEvolutionIngredientsList_C) == 0x000290, "Wrong size on UItemInspectEvolutionIngredientsList_C");
static_assert(offsetof(UItemInspectEvolutionIngredientsList_C, IngredientsListBox) == 0x000208, "Member 'UItemInspectEvolutionIngredientsList_C::IngredientsListBox' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionIngredientsList_C, LevelCheckMarkIcon) == 0x000210, "Member 'UItemInspectEvolutionIngredientsList_C::LevelCheckMarkIcon' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionIngredientsList_C, LevelRequirementText) == 0x000218, "Member 'UItemInspectEvolutionIngredientsList_C::LevelRequirementText' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionIngredientsList_C, LevelText) == 0x000220, "Member 'UItemInspectEvolutionIngredientsList_C::LevelText' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionIngredientsList_C, IngredientsList) == 0x000228, "Member 'UItemInspectEvolutionIngredientsList_C::IngredientsList' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionIngredientsList_C, HaveColor) == 0x000238, "Member 'UItemInspectEvolutionIngredientsList_C::HaveColor' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionIngredientsList_C, NotHaveColor) == 0x000260, "Member 'UItemInspectEvolutionIngredientsList_C::NotHaveColor' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionIngredientsList_C, HaveQuantity) == 0x000288, "Member 'UItemInspectEvolutionIngredientsList_C::HaveQuantity' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionIngredientsList_C, NeedQuantity) == 0x00028C, "Member 'UItemInspectEvolutionIngredientsList_C::NeedQuantity' has a wrong offset!");

}

