#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemTransformSlotItemPickerTileButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemTransformSlotItemPickerTileButton.ItemTransformSlotItemPickerTileButton_C
// 0x0028 (0x07D8 - 0x07B0)
class UItemTransformSlotItemPickerTileButton_C final : public UFortTransformSlotItemPickerTileButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07B0(0x0008)(Transient, DuplicateTransient)
	class UVerticalBox*                           BottomBarBox;                                      // 0x07B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ItemWidgetSwitcher;                                // 0x07C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          NullItemBorder;                                    // 0x07C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                SacrificePointText;                                // 0x07D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ItemTransformSlotItemPickerTileButton(int32 EntryPoint);
	void SetData(class UObject* InData, class UCommonListView* OwningList);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemTransformSlotItemPickerTileButton_C">();
	}
	static class UItemTransformSlotItemPickerTileButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemTransformSlotItemPickerTileButton_C>();
	}
};
static_assert(alignof(UItemTransformSlotItemPickerTileButton_C) == 0x000008, "Wrong alignment on UItemTransformSlotItemPickerTileButton_C");
static_assert(sizeof(UItemTransformSlotItemPickerTileButton_C) == 0x0007D8, "Wrong size on UItemTransformSlotItemPickerTileButton_C");
static_assert(offsetof(UItemTransformSlotItemPickerTileButton_C, UberGraphFrame) == 0x0007B0, "Member 'UItemTransformSlotItemPickerTileButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemTransformSlotItemPickerTileButton_C, BottomBarBox) == 0x0007B8, "Member 'UItemTransformSlotItemPickerTileButton_C::BottomBarBox' has a wrong offset!");
static_assert(offsetof(UItemTransformSlotItemPickerTileButton_C, ItemWidgetSwitcher) == 0x0007C0, "Member 'UItemTransformSlotItemPickerTileButton_C::ItemWidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UItemTransformSlotItemPickerTileButton_C, NullItemBorder) == 0x0007C8, "Member 'UItemTransformSlotItemPickerTileButton_C::NullItemBorder' has a wrong offset!");
static_assert(offsetof(UItemTransformSlotItemPickerTileButton_C, SacrificePointText) == 0x0007D0, "Member 'UItemTransformSlotItemPickerTileButton_C::SacrificePointText' has a wrong offset!");

}

