#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemUIFunctionLibrary

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function ItemUIFunctionLibrary.ItemUIFunctionLibrary_C.ParseLevelRequiredFromString
// 0x0050 (0x0050 - 0x0000)
struct ItemUIFunctionLibrary_C_ParseLevelRequiredFromString final
{
public:
	class FString                                 InString;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OutInt;                                            // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue2;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue2;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemUIFunctionLibrary_C_ParseLevelRequiredFromString) == 0x000008, "Wrong alignment on ItemUIFunctionLibrary_C_ParseLevelRequiredFromString");
static_assert(sizeof(ItemUIFunctionLibrary_C_ParseLevelRequiredFromString) == 0x000050, "Wrong size on ItemUIFunctionLibrary_C_ParseLevelRequiredFromString");
static_assert(offsetof(ItemUIFunctionLibrary_C_ParseLevelRequiredFromString, InString) == 0x000000, "Member 'ItemUIFunctionLibrary_C_ParseLevelRequiredFromString::InString' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_ParseLevelRequiredFromString, __WorldContext) == 0x000010, "Member 'ItemUIFunctionLibrary_C_ParseLevelRequiredFromString::__WorldContext' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_ParseLevelRequiredFromString, OutInt) == 0x000018, "Member 'ItemUIFunctionLibrary_C_ParseLevelRequiredFromString::OutInt' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_ParseLevelRequiredFromString, CallFunc_FindSubstring_ReturnValue) == 0x00001C, "Member 'ItemUIFunctionLibrary_C_ParseLevelRequiredFromString::CallFunc_FindSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_ParseLevelRequiredFromString, CallFunc_FindSubstring_ReturnValue2) == 0x000020, "Member 'ItemUIFunctionLibrary_C_ParseLevelRequiredFromString::CallFunc_FindSubstring_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_ParseLevelRequiredFromString, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'ItemUIFunctionLibrary_C_ParseLevelRequiredFromString::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_ParseLevelRequiredFromString, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'ItemUIFunctionLibrary_C_ParseLevelRequiredFromString::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_ParseLevelRequiredFromString, CallFunc_Subtract_IntInt_ReturnValue2) == 0x00002C, "Member 'ItemUIFunctionLibrary_C_ParseLevelRequiredFromString::CallFunc_Subtract_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_ParseLevelRequiredFromString, CallFunc_Add_IntInt_ReturnValue2) == 0x000030, "Member 'ItemUIFunctionLibrary_C_ParseLevelRequiredFromString::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_ParseLevelRequiredFromString, CallFunc_GetSubstring_ReturnValue) == 0x000038, "Member 'ItemUIFunctionLibrary_C_ParseLevelRequiredFromString::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_ParseLevelRequiredFromString, CallFunc_Conv_StringToInt_ReturnValue) == 0x000048, "Member 'ItemUIFunctionLibrary_C_ParseLevelRequiredFromString::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");

// Function ItemUIFunctionLibrary.ItemUIFunctionLibrary_C.Convert Tier To Integer
// 0x0048 (0x0048 - 0x0000)
struct ItemUIFunctionLibrary_C_Convert_Tier_To_Integer final
{
public:
	EFortItemTier                                 Tier;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Numeric_Tier;                                      // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemTier                                 Temp_byte_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable4;                                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable5;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable6;                                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable7;                                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable8;                                // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable9;                                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable10;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable11;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer) == 0x000008, "Wrong alignment on ItemUIFunctionLibrary_C_Convert_Tier_To_Integer");
static_assert(sizeof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer) == 0x000048, "Wrong size on ItemUIFunctionLibrary_C_Convert_Tier_To_Integer");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Tier) == 0x000000, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Tier' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, __WorldContext) == 0x000008, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::__WorldContext' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Numeric_Tier) == 0x000010, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Numeric_Tier' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Temp_byte_Variable) == 0x000014, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Temp_int_Variable) == 0x000018, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Temp_int_Variable2) == 0x00001C, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Temp_int_Variable3) == 0x000020, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Temp_int_Variable4) == 0x000024, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Temp_int_Variable4' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Temp_int_Variable5) == 0x000028, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Temp_int_Variable5' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Temp_int_Variable6) == 0x00002C, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Temp_int_Variable6' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Temp_int_Variable7) == 0x000030, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Temp_int_Variable7' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Temp_int_Variable8) == 0x000034, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Temp_int_Variable8' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Temp_int_Variable9) == 0x000038, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Temp_int_Variable9' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Temp_int_Variable10) == 0x00003C, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Temp_int_Variable10' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, Temp_int_Variable11) == 0x000040, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::Temp_int_Variable11' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Convert_Tier_To_Integer, K2Node_Select_Default) == 0x000044, "Member 'ItemUIFunctionLibrary_C_Convert_Tier_To_Integer::K2Node_Select_Default' has a wrong offset!");

// Function ItemUIFunctionLibrary.ItemUIFunctionLibrary_C.Truncate Integer Value
// 0x01E8 (0x01E8 - 0x0000)
struct ItemUIFunctionLibrary_C_Truncate_Integer_Value final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Min_Fractional_Digits;                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Max_Fractional_Digits;                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Formatted_Value;                                   // 0x0018(0x0018)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue2;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue3;         // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue3;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0058(0x0018)()
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77[0x1];                                       // 0x0077(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable2;                               // 0x0078(0x0018)()
	bool                                          Temp_bool_Variable5;                               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable3;                               // 0x0098(0x0018)()
	float                                         K2Node_Select_Default;                             // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable4;                               // 0x00B8(0x0018)()
	float                                         K2Node_Select2_Default;                            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select3_Default;                            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable6;                               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x00E0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00F8(0x0040)(HasGetValueTypeHash)
	class FText                                   K2Node_Select4_Default;                            // 0x0138(0x0018)()
	class FText                                   K2Node_Select5_Default;                            // 0x0150(0x0018)()
	class FText                                   K2Node_Select6_Default;                            // 0x0168(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0180(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01C0(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01D0(0x0018)()
};
static_assert(alignof(ItemUIFunctionLibrary_C_Truncate_Integer_Value) == 0x000008, "Wrong alignment on ItemUIFunctionLibrary_C_Truncate_Integer_Value");
static_assert(sizeof(ItemUIFunctionLibrary_C_Truncate_Integer_Value) == 0x0001E8, "Wrong size on ItemUIFunctionLibrary_C_Truncate_Integer_Value");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, Value) == 0x000000, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::Value' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, Min_Fractional_Digits) == 0x000004, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::Min_Fractional_Digits' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, Max_Fractional_Digits) == 0x000008, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::Max_Fractional_Digits' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, __WorldContext) == 0x000010, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::__WorldContext' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, Formatted_Value) == 0x000018, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::Formatted_Value' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, Temp_bool_Variable) == 0x000030, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000034, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000038, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00003C, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, CallFunc_GreaterEqual_IntInt_ReturnValue2) == 0x000040, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::CallFunc_GreaterEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x000044, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000048, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, CallFunc_GreaterEqual_IntInt_ReturnValue3) == 0x00004C, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::CallFunc_GreaterEqual_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, CallFunc_Conv_IntToFloat_ReturnValue3) == 0x000050, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::CallFunc_Conv_IntToFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, Temp_text_Variable) == 0x000058, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x000070, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, Temp_bool_Variable2) == 0x000074, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, Temp_bool_Variable3) == 0x000075, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, Temp_bool_Variable4) == 0x000076, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, Temp_text_Variable2) == 0x000078, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, Temp_bool_Variable5) == 0x000090, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, Temp_text_Variable3) == 0x000098, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::Temp_text_Variable3' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, K2Node_Select_Default) == 0x0000B0, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, Temp_text_Variable4) == 0x0000B8, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::Temp_text_Variable4' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, K2Node_Select2_Default) == 0x0000D0, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, K2Node_Select3_Default) == 0x0000D4, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, Temp_bool_Variable6) == 0x0000D8, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, CallFunc_Conv_FloatToText_ReturnValue) == 0x0000E0, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, K2Node_MakeStruct_FormatArgumentData) == 0x0000F8, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, K2Node_Select4_Default) == 0x000138, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, K2Node_Select5_Default) == 0x000150, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::K2Node_Select5_Default' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, K2Node_Select6_Default) == 0x000168, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::K2Node_Select6_Default' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, K2Node_MakeStruct_FormatArgumentData2) == 0x000180, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, K2Node_MakeArray_Array) == 0x0001C0, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ItemUIFunctionLibrary_C_Truncate_Integer_Value, CallFunc_Format_ReturnValue) == 0x0001D0, "Member 'ItemUIFunctionLibrary_C_Truncate_Integer_Value::CallFunc_Format_ReturnValue' has a wrong offset!");

}

