#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemCraftingIngredientListEntryHaveNeedVerbose

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function ItemCraftingIngredientListEntryHaveNeedVerbose.ItemCraftingIngredientListEntryHaveNeedVerbose_C.ExecuteUbergraph_ItemCraftingIngredientListEntryHaveNeedVerbose
// 0x0008 (0x0008 - 0x0000)
struct ItemCraftingIngredientListEntryHaveNeedVerbose_C_ExecuteUbergraph_ItemCraftingIngredientListEntryHaveNeedVerbose final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsBeingReset;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_ExecuteUbergraph_ItemCraftingIngredientListEntryHaveNeedVerbose) == 0x000004, "Wrong alignment on ItemCraftingIngredientListEntryHaveNeedVerbose_C_ExecuteUbergraph_ItemCraftingIngredientListEntryHaveNeedVerbose");
static_assert(sizeof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_ExecuteUbergraph_ItemCraftingIngredientListEntryHaveNeedVerbose) == 0x000008, "Wrong size on ItemCraftingIngredientListEntryHaveNeedVerbose_C_ExecuteUbergraph_ItemCraftingIngredientListEntryHaveNeedVerbose");
static_assert(offsetof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_ExecuteUbergraph_ItemCraftingIngredientListEntryHaveNeedVerbose, EntryPoint) == 0x000000, "Member 'ItemCraftingIngredientListEntryHaveNeedVerbose_C_ExecuteUbergraph_ItemCraftingIngredientListEntryHaveNeedVerbose::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_ExecuteUbergraph_ItemCraftingIngredientListEntryHaveNeedVerbose, K2Node_Event_IsBeingReset) == 0x000004, "Member 'ItemCraftingIngredientListEntryHaveNeedVerbose_C_ExecuteUbergraph_ItemCraftingIngredientListEntryHaveNeedVerbose::K2Node_Event_IsBeingReset' has a wrong offset!");
static_assert(offsetof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_ExecuteUbergraph_ItemCraftingIngredientListEntryHaveNeedVerbose, K2Node_Event_IsDesignTime) == 0x000005, "Member 'ItemCraftingIngredientListEntryHaveNeedVerbose_C_ExecuteUbergraph_ItemCraftingIngredientListEntryHaveNeedVerbose::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function ItemCraftingIngredientListEntryHaveNeedVerbose.ItemCraftingIngredientListEntryHaveNeedVerbose_C.HandleDifferentItemOrQuantitySetBP
// 0x0001 (0x0001 - 0x0000)
struct ItemCraftingIngredientListEntryHaveNeedVerbose_C_HandleDifferentItemOrQuantitySetBP final
{
public:
	bool                                          IsBeingReset;                                      // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_HandleDifferentItemOrQuantitySetBP) == 0x000001, "Wrong alignment on ItemCraftingIngredientListEntryHaveNeedVerbose_C_HandleDifferentItemOrQuantitySetBP");
static_assert(sizeof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_HandleDifferentItemOrQuantitySetBP) == 0x000001, "Wrong size on ItemCraftingIngredientListEntryHaveNeedVerbose_C_HandleDifferentItemOrQuantitySetBP");
static_assert(offsetof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_HandleDifferentItemOrQuantitySetBP, IsBeingReset) == 0x000000, "Member 'ItemCraftingIngredientListEntryHaveNeedVerbose_C_HandleDifferentItemOrQuantitySetBP::IsBeingReset' has a wrong offset!");

// Function ItemCraftingIngredientListEntryHaveNeedVerbose.ItemCraftingIngredientListEntryHaveNeedVerbose_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ItemCraftingIngredientListEntryHaveNeedVerbose_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_PreConstruct) == 0x000001, "Wrong alignment on ItemCraftingIngredientListEntryHaveNeedVerbose_C_PreConstruct");
static_assert(sizeof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_PreConstruct) == 0x000001, "Wrong size on ItemCraftingIngredientListEntryHaveNeedVerbose_C_PreConstruct");
static_assert(offsetof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ItemCraftingIngredientListEntryHaveNeedVerbose_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ItemCraftingIngredientListEntryHaveNeedVerbose.ItemCraftingIngredientListEntryHaveNeedVerbose_C.DoDesignTimeRandomization
// 0x0068 (0x0068 - 0x0000)
struct ItemCraftingIngredientListEntryHaveNeedVerbose_C_DoDesignTimeRandomization final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    Temp_object_Variable2;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    Temp_object_Variable3;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    Temp_object_Variable4;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue2;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortItemQuantityPair                  CallFunc_MakeItemQuantityPair_ReturnValue;         // 0x0038(0x0030)()
};
static_assert(alignof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_DoDesignTimeRandomization) == 0x000008, "Wrong alignment on ItemCraftingIngredientListEntryHaveNeedVerbose_C_DoDesignTimeRandomization");
static_assert(sizeof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_DoDesignTimeRandomization) == 0x000068, "Wrong size on ItemCraftingIngredientListEntryHaveNeedVerbose_C_DoDesignTimeRandomization");
static_assert(offsetof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_DoDesignTimeRandomization, Temp_int_Variable) == 0x000000, "Member 'ItemCraftingIngredientListEntryHaveNeedVerbose_C_DoDesignTimeRandomization::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_DoDesignTimeRandomization, Temp_object_Variable) == 0x000008, "Member 'ItemCraftingIngredientListEntryHaveNeedVerbose_C_DoDesignTimeRandomization::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_DoDesignTimeRandomization, Temp_object_Variable2) == 0x000010, "Member 'ItemCraftingIngredientListEntryHaveNeedVerbose_C_DoDesignTimeRandomization::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_DoDesignTimeRandomization, Temp_object_Variable3) == 0x000018, "Member 'ItemCraftingIngredientListEntryHaveNeedVerbose_C_DoDesignTimeRandomization::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_DoDesignTimeRandomization, Temp_object_Variable4) == 0x000020, "Member 'ItemCraftingIngredientListEntryHaveNeedVerbose_C_DoDesignTimeRandomization::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_DoDesignTimeRandomization, CallFunc_RandomInteger_ReturnValue) == 0x000028, "Member 'ItemCraftingIngredientListEntryHaveNeedVerbose_C_DoDesignTimeRandomization::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_DoDesignTimeRandomization, CallFunc_RandomInteger_ReturnValue2) == 0x00002C, "Member 'ItemCraftingIngredientListEntryHaveNeedVerbose_C_DoDesignTimeRandomization::CallFunc_RandomInteger_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_DoDesignTimeRandomization, K2Node_Select_Default) == 0x000030, "Member 'ItemCraftingIngredientListEntryHaveNeedVerbose_C_DoDesignTimeRandomization::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_DoDesignTimeRandomization, CallFunc_MakeItemQuantityPair_ReturnValue) == 0x000038, "Member 'ItemCraftingIngredientListEntryHaveNeedVerbose_C_DoDesignTimeRandomization::CallFunc_MakeItemQuantityPair_ReturnValue' has a wrong offset!");

// Function ItemCraftingIngredientListEntryHaveNeedVerbose.ItemCraftingIngredientListEntryHaveNeedVerbose_C.Refresh
// 0x0058 (0x0058 - 0x0000)
struct ItemCraftingIngredientListEntryHaveNeedVerbose_C_Refresh final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0008(0x0018)()
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemDefinition_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumInInventory_ReturnValue;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0040(0x0018)()
};
static_assert(alignof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_Refresh) == 0x000008, "Wrong alignment on ItemCraftingIngredientListEntryHaveNeedVerbose_C_Refresh");
static_assert(sizeof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_Refresh) == 0x000058, "Wrong size on ItemCraftingIngredientListEntryHaveNeedVerbose_C_Refresh");
static_assert(offsetof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_Refresh, Temp_byte_Variable) == 0x000000, "Member 'ItemCraftingIngredientListEntryHaveNeedVerbose_C_Refresh::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_Refresh, CallFunc_GetEmptyText_ReturnValue) == 0x000008, "Member 'ItemCraftingIngredientListEntryHaveNeedVerbose_C_Refresh::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_Refresh, Temp_byte_Variable2) == 0x000020, "Member 'ItemCraftingIngredientListEntryHaveNeedVerbose_C_Refresh::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_Refresh, Temp_bool_Variable) == 0x000021, "Member 'ItemCraftingIngredientListEntryHaveNeedVerbose_C_Refresh::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_Refresh, CallFunc_GetContext_ReturnValue) == 0x000028, "Member 'ItemCraftingIngredientListEntryHaveNeedVerbose_C_Refresh::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_Refresh, CallFunc_GetItemDefinition_ReturnValue) == 0x000030, "Member 'ItemCraftingIngredientListEntryHaveNeedVerbose_C_Refresh::CallFunc_GetItemDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_Refresh, CallFunc_GetNumInInventory_ReturnValue) == 0x000038, "Member 'ItemCraftingIngredientListEntryHaveNeedVerbose_C_Refresh::CallFunc_GetNumInInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_Refresh, CallFunc_EqualEqual_TextText_ReturnValue) == 0x00003C, "Member 'ItemCraftingIngredientListEntryHaveNeedVerbose_C_Refresh::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_Refresh, K2Node_Select_Default) == 0x00003D, "Member 'ItemCraftingIngredientListEntryHaveNeedVerbose_C_Refresh::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemCraftingIngredientListEntryHaveNeedVerbose_C_Refresh, CallFunc_GetDisplayName_ReturnValue) == 0x000040, "Member 'ItemCraftingIngredientListEntryHaveNeedVerbose_C_Refresh::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");

}

