#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemManagementMulchConfirmationDialogContent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemManagementMulchConfirmationDialogContent.ItemManagementMulchConfirmationDialogContent_C
// 0x0038 (0x0248 - 0x0210)
class UItemManagementMulchConfirmationDialogContent_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UScrollBox*                             ItemScrollBox;                                     // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ItemSlots;                                         // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UFortItem*>                      ItemList;                                          // 0x0228(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn)
	TArray<int32>                                 ItemCounts;                                        // 0x0238(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_ItemManagementMulchConfirmationDialogContent(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemManagementMulchConfirmationDialogContent_C">();
	}
	static class UItemManagementMulchConfirmationDialogContent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemManagementMulchConfirmationDialogContent_C>();
	}
};
static_assert(alignof(UItemManagementMulchConfirmationDialogContent_C) == 0x000008, "Wrong alignment on UItemManagementMulchConfirmationDialogContent_C");
static_assert(sizeof(UItemManagementMulchConfirmationDialogContent_C) == 0x000248, "Wrong size on UItemManagementMulchConfirmationDialogContent_C");
static_assert(offsetof(UItemManagementMulchConfirmationDialogContent_C, UberGraphFrame) == 0x000210, "Member 'UItemManagementMulchConfirmationDialogContent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemManagementMulchConfirmationDialogContent_C, ItemScrollBox) == 0x000218, "Member 'UItemManagementMulchConfirmationDialogContent_C::ItemScrollBox' has a wrong offset!");
static_assert(offsetof(UItemManagementMulchConfirmationDialogContent_C, ItemSlots) == 0x000220, "Member 'UItemManagementMulchConfirmationDialogContent_C::ItemSlots' has a wrong offset!");
static_assert(offsetof(UItemManagementMulchConfirmationDialogContent_C, ItemList) == 0x000228, "Member 'UItemManagementMulchConfirmationDialogContent_C::ItemList' has a wrong offset!");
static_assert(offsetof(UItemManagementMulchConfirmationDialogContent_C, ItemCounts) == 0x000238, "Member 'UItemManagementMulchConfirmationDialogContent_C::ItemCounts' has a wrong offset!");

}

