#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemOrWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemOrWidget.ItemOrWidget_C
// 0x0038 (0x0240 - 0x0208)
class UItemOrWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_0;                            // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_154;                                         // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_156;                                         // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_157;                                         // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsVerticalList;                                    // 0x0238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_ItemOrWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemOrWidget_C">();
	}
	static class UItemOrWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemOrWidget_C>();
	}
};
static_assert(alignof(UItemOrWidget_C) == 0x000008, "Wrong alignment on UItemOrWidget_C");
static_assert(sizeof(UItemOrWidget_C) == 0x000240, "Wrong size on UItemOrWidget_C");
static_assert(offsetof(UItemOrWidget_C, UberGraphFrame) == 0x000208, "Member 'UItemOrWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemOrWidget_C, CommonWidgetSwitcher_0) == 0x000210, "Member 'UItemOrWidget_C::CommonWidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UItemOrWidget_C, Image_3) == 0x000218, "Member 'UItemOrWidget_C::Image_3' has a wrong offset!");
static_assert(offsetof(UItemOrWidget_C, Image_154) == 0x000220, "Member 'UItemOrWidget_C::Image_154' has a wrong offset!");
static_assert(offsetof(UItemOrWidget_C, Image_156) == 0x000228, "Member 'UItemOrWidget_C::Image_156' has a wrong offset!");
static_assert(offsetof(UItemOrWidget_C, Image_157) == 0x000230, "Member 'UItemOrWidget_C::Image_157' has a wrong offset!");
static_assert(offsetof(UItemOrWidget_C, IsVerticalList) == 0x000238, "Member 'UItemOrWidget_C::IsVerticalList' has a wrong offset!");

}

