#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemTransformConfirmationModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemTransformConfirmationModal.ItemTransformConfirmationModal_C
// 0x0088 (0x0448 - 0x03C0)
class UItemTransformConfirmationModal_C final : public UCommonActivatablePanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(Transient, DuplicateTransient)
	class UIconTextButton_C*                      CancelButton;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ConfirmButton;                                     // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemTransformRequiredItems_C*          ItemTransformRequiredItems;                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemTransformResultItems_C*            ItemTransformResultItems;                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 KeyItemCard;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SacrificeItemBox;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 SacrificeItemCard1;                                // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 SacrificeItemCard2;                                // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 SacrificeItemCard3;                                // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 SacrificeItemCard4;                                // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 SacrificeItemCard5;                                // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnCancel;                                          // 0x0428(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnConfirm;                                         // 0x0438(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnCancel__DelegateSignature();
	void OnConfirm__DelegateSignature();
	void ExecuteUbergraph_ItemTransformConfirmationModal(int32 EntryPoint);
	void OnActivated();
	void BndEvt__ConfirmButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__CancelButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void UpdateTransformInfo(class UFortItem* TransformKey, TArray<class UFortItem*>& SacrificeItems, int32 SacrificePoints, int32 CurrentTier);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemTransformConfirmationModal_C">();
	}
	static class UItemTransformConfirmationModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemTransformConfirmationModal_C>();
	}
};
static_assert(alignof(UItemTransformConfirmationModal_C) == 0x000008, "Wrong alignment on UItemTransformConfirmationModal_C");
static_assert(sizeof(UItemTransformConfirmationModal_C) == 0x000448, "Wrong size on UItemTransformConfirmationModal_C");
static_assert(offsetof(UItemTransformConfirmationModal_C, UberGraphFrame) == 0x0003C0, "Member 'UItemTransformConfirmationModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemTransformConfirmationModal_C, CancelButton) == 0x0003C8, "Member 'UItemTransformConfirmationModal_C::CancelButton' has a wrong offset!");
static_assert(offsetof(UItemTransformConfirmationModal_C, ConfirmButton) == 0x0003D0, "Member 'UItemTransformConfirmationModal_C::ConfirmButton' has a wrong offset!");
static_assert(offsetof(UItemTransformConfirmationModal_C, Image_0) == 0x0003D8, "Member 'UItemTransformConfirmationModal_C::Image_0' has a wrong offset!");
static_assert(offsetof(UItemTransformConfirmationModal_C, ItemTransformRequiredItems) == 0x0003E0, "Member 'UItemTransformConfirmationModal_C::ItemTransformRequiredItems' has a wrong offset!");
static_assert(offsetof(UItemTransformConfirmationModal_C, ItemTransformResultItems) == 0x0003E8, "Member 'UItemTransformConfirmationModal_C::ItemTransformResultItems' has a wrong offset!");
static_assert(offsetof(UItemTransformConfirmationModal_C, KeyItemCard) == 0x0003F0, "Member 'UItemTransformConfirmationModal_C::KeyItemCard' has a wrong offset!");
static_assert(offsetof(UItemTransformConfirmationModal_C, SacrificeItemBox) == 0x0003F8, "Member 'UItemTransformConfirmationModal_C::SacrificeItemBox' has a wrong offset!");
static_assert(offsetof(UItemTransformConfirmationModal_C, SacrificeItemCard1) == 0x000400, "Member 'UItemTransformConfirmationModal_C::SacrificeItemCard1' has a wrong offset!");
static_assert(offsetof(UItemTransformConfirmationModal_C, SacrificeItemCard2) == 0x000408, "Member 'UItemTransformConfirmationModal_C::SacrificeItemCard2' has a wrong offset!");
static_assert(offsetof(UItemTransformConfirmationModal_C, SacrificeItemCard3) == 0x000410, "Member 'UItemTransformConfirmationModal_C::SacrificeItemCard3' has a wrong offset!");
static_assert(offsetof(UItemTransformConfirmationModal_C, SacrificeItemCard4) == 0x000418, "Member 'UItemTransformConfirmationModal_C::SacrificeItemCard4' has a wrong offset!");
static_assert(offsetof(UItemTransformConfirmationModal_C, SacrificeItemCard5) == 0x000420, "Member 'UItemTransformConfirmationModal_C::SacrificeItemCard5' has a wrong offset!");
static_assert(offsetof(UItemTransformConfirmationModal_C, OnCancel) == 0x000428, "Member 'UItemTransformConfirmationModal_C::OnCancel' has a wrong offset!");
static_assert(offsetof(UItemTransformConfirmationModal_C, OnConfirm) == 0x000438, "Member 'UItemTransformConfirmationModal_C::OnConfirm' has a wrong offset!");

}

