#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemTransformItemPicker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemTransformItemPicker.ItemTransformItemPicker_C
// 0x0060 (0x0270 - 0x0210)
class UItemTransformItemPicker_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UHorizontalTabList_C*                   FilterTabList;                                     // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemTransformSlotItemPicker_C*         ItemTransformSlotItemPicker;                       // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainModeItemDetailsHostPanel_C*        MainModeItemDetailsHostPanel;                      // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnItemSelected;                                    // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FFortItemTransformFilterTabLabelInfo> FilterTabs;                                        // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn)
	TArray<class UFortItem*>                      SacrificeItems;                                    // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FName                                   CurrentTab;                                        // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentlySelectedSlot;                             // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnItemSelected__DelegateSignature(class UFortItem* SelectedItem);
	void ExecuteUbergraph_ItemTransformItemPicker(int32 EntryPoint);
	void BndEvt__FilterTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature(class FName TabId);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void SetupItemPicker();
	void HandleItemSelected(class UFortItem* Item);
	void RemoveInvalidItems(TArray<class UFortAccountItem*>& UnrefinedItems, TArray<class UFortItem*>& CurrentSacrificeItems, TArray<class UFortAccountItem*>* RefinedItems);
	void HandleItemCommitted(class UFortItem* Item);
	void SetupFilterTabList();
	void SetFilter(class FName FilterName);
	void OpenPicker(TArray<class UFortItem*>& Param_SacrificeItems, int32 SelectedSlot);
	void CommitSelectedItem(bool* PassThru);
	void OpenInspectionScreen(bool* PassThru);
	void Return_Item_to_Detail(class UFortItem* InItem, class UFortItem** OutItem);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemTransformItemPicker_C">();
	}
	static class UItemTransformItemPicker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemTransformItemPicker_C>();
	}
};
static_assert(alignof(UItemTransformItemPicker_C) == 0x000008, "Wrong alignment on UItemTransformItemPicker_C");
static_assert(sizeof(UItemTransformItemPicker_C) == 0x000270, "Wrong size on UItemTransformItemPicker_C");
static_assert(offsetof(UItemTransformItemPicker_C, UberGraphFrame) == 0x000210, "Member 'UItemTransformItemPicker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemTransformItemPicker_C, FilterTabList) == 0x000218, "Member 'UItemTransformItemPicker_C::FilterTabList' has a wrong offset!");
static_assert(offsetof(UItemTransformItemPicker_C, ItemTransformSlotItemPicker) == 0x000220, "Member 'UItemTransformItemPicker_C::ItemTransformSlotItemPicker' has a wrong offset!");
static_assert(offsetof(UItemTransformItemPicker_C, MainModeItemDetailsHostPanel) == 0x000228, "Member 'UItemTransformItemPicker_C::MainModeItemDetailsHostPanel' has a wrong offset!");
static_assert(offsetof(UItemTransformItemPicker_C, OnItemSelected) == 0x000230, "Member 'UItemTransformItemPicker_C::OnItemSelected' has a wrong offset!");
static_assert(offsetof(UItemTransformItemPicker_C, FilterTabs) == 0x000240, "Member 'UItemTransformItemPicker_C::FilterTabs' has a wrong offset!");
static_assert(offsetof(UItemTransformItemPicker_C, SacrificeItems) == 0x000250, "Member 'UItemTransformItemPicker_C::SacrificeItems' has a wrong offset!");
static_assert(offsetof(UItemTransformItemPicker_C, CurrentTab) == 0x000260, "Member 'UItemTransformItemPicker_C::CurrentTab' has a wrong offset!");
static_assert(offsetof(UItemTransformItemPicker_C, CurrentlySelectedSlot) == 0x000268, "Member 'UItemTransformItemPicker_C::CurrentlySelectedSlot' has a wrong offset!");

}

