#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LeaderboardRowWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LeaderboardRowWidget.LeaderboardRowWidget_C
// 0x0020 (0x07B0 - 0x0790)
class ULeaderboardRowWidget_C final : public UFortLeaderboardEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0790(0x0008)(Transient, DuplicateTransient)
	class UCommonTextBlock*                       Rank;                                              // 0x0798(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       StatValue;                                         // 0x07A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       User;                                              // 0x07A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LeaderboardRowWidget(int32 EntryPoint);
	void OnLeaderboardEntryDataSet();
	void Refresh(class UFortLeaderboardRowProxyInstance* RowObject);
	void SetDataDirect(class UFortLeaderboardRowProxyInstance* NewData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LeaderboardRowWidget_C">();
	}
	static class ULeaderboardRowWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULeaderboardRowWidget_C>();
	}
};
static_assert(alignof(ULeaderboardRowWidget_C) == 0x000008, "Wrong alignment on ULeaderboardRowWidget_C");
static_assert(sizeof(ULeaderboardRowWidget_C) == 0x0007B0, "Wrong size on ULeaderboardRowWidget_C");
static_assert(offsetof(ULeaderboardRowWidget_C, UberGraphFrame) == 0x000790, "Member 'ULeaderboardRowWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULeaderboardRowWidget_C, Rank) == 0x000798, "Member 'ULeaderboardRowWidget_C::Rank' has a wrong offset!");
static_assert(offsetof(ULeaderboardRowWidget_C, StatValue) == 0x0007A0, "Member 'ULeaderboardRowWidget_C::StatValue' has a wrong offset!");
static_assert(offsetof(ULeaderboardRowWidget_C, User) == 0x0007A8, "Member 'ULeaderboardRowWidget_C::User' has a wrong offset!");

}

