#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LegacyButtonIconText

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LegacyButtonIconText.LegacyButtonIconText_C
// 0x00F0 (0x0850 - 0x0760)
class ULegacyButtonIconText_C final : public UFortBaseButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0760(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Outro;                                        // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Intro;                                        // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ContentHBox;                                       // 0x0778(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0780(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               IconOverlay;                                       // 0x0788(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow;                                            // 0x0790(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x0798(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x07A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   DisplayText;                                       // 0x07A8(0x0018)(Edit, BlueprintVisible, Config, ExposeOnSpawn)
	struct FSlateBrush                            IconBrush;                                         // 0x07C0(0x0078)(Edit, BlueprintVisible, Config, ExposeOnSpawn)
	bool                                          HasIcon;                                           // 0x0838(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HasText;                                           // 0x0839(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ETextJustify                                  Content_Align;                                     // 0x083A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83B[0x5];                                      // 0x083B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   On_Mouse_Hovered_Changed;                          // 0x0840(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void On_Mouse_Hovered_Changed__DelegateSignature(bool Is_Hovered);
	void ExecuteUbergraph_LegacyButtonIconText(int32 EntryPoint);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void Set_Text(const class FText& InText, bool RefreshPadding);
	void Set_Icon(const struct FSlateBrush& InBrush, bool RefreshPadding);
	void Update_Padding();
	struct FLinearColor Get_Secondary_Color();
	struct FSlateColor Get_Primary_Color();
	void Update_Size_Box();
	void Set_Alignment(ETextJustify Align);
	void Toggle(bool Show_Button);
	void Intro();
	void Outro();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LegacyButtonIconText_C">();
	}
	static class ULegacyButtonIconText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULegacyButtonIconText_C>();
	}
};
static_assert(alignof(ULegacyButtonIconText_C) == 0x000008, "Wrong alignment on ULegacyButtonIconText_C");
static_assert(sizeof(ULegacyButtonIconText_C) == 0x000850, "Wrong size on ULegacyButtonIconText_C");
static_assert(offsetof(ULegacyButtonIconText_C, UberGraphFrame) == 0x000760, "Member 'ULegacyButtonIconText_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, Anim_Outro) == 0x000768, "Member 'ULegacyButtonIconText_C::Anim_Outro' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, Anim_Intro) == 0x000770, "Member 'ULegacyButtonIconText_C::Anim_Intro' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, ContentHBox) == 0x000778, "Member 'ULegacyButtonIconText_C::ContentHBox' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, Icon) == 0x000780, "Member 'ULegacyButtonIconText_C::Icon' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, IconOverlay) == 0x000788, "Member 'ULegacyButtonIconText_C::IconOverlay' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, Shadow) == 0x000790, "Member 'ULegacyButtonIconText_C::Shadow' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, SizeBox) == 0x000798, "Member 'ULegacyButtonIconText_C::SizeBox' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, TextBlock) == 0x0007A0, "Member 'ULegacyButtonIconText_C::TextBlock' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, DisplayText) == 0x0007A8, "Member 'ULegacyButtonIconText_C::DisplayText' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, IconBrush) == 0x0007C0, "Member 'ULegacyButtonIconText_C::IconBrush' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, HasIcon) == 0x000838, "Member 'ULegacyButtonIconText_C::HasIcon' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, HasText) == 0x000839, "Member 'ULegacyButtonIconText_C::HasText' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, Content_Align) == 0x00083A, "Member 'ULegacyButtonIconText_C::Content_Align' has a wrong offset!");
static_assert(offsetof(ULegacyButtonIconText_C, On_Mouse_Hovered_Changed) == 0x000840, "Member 'ULegacyButtonIconText_C::On_Mouse_Hovered_Changed' has a wrong offset!");

}

