#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyPlayerPadBottom

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LobbyPlayerPadBottom.LobbyPlayerPadBottom_C
// 0x01C8 (0x03D8 - 0x0210)
class ULobbyPlayerPadBottom_C final : public UCommonUserWidget
{
public:
	class UImage*                                 BattlePassBadge;                                   // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       BattlePassSelfXpGainLine;                          // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       BattlePassSharedXpGainLine;                        // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFortTeamMemberInfo                    Team_Member_Info;                                  // 0x0228(0x01A8)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Is_Local_Player;                                   // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Is_Friend;                                         // 0x03D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void Set_Team_Member_Info(const struct FFortTeamMemberInfo& New_Team_Member_Info);
	void Refresh();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LobbyPlayerPadBottom_C">();
	}
	static class ULobbyPlayerPadBottom_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULobbyPlayerPadBottom_C>();
	}
};
static_assert(alignof(ULobbyPlayerPadBottom_C) == 0x000008, "Wrong alignment on ULobbyPlayerPadBottom_C");
static_assert(sizeof(ULobbyPlayerPadBottom_C) == 0x0003D8, "Wrong size on ULobbyPlayerPadBottom_C");
static_assert(offsetof(ULobbyPlayerPadBottom_C, BattlePassBadge) == 0x000210, "Member 'ULobbyPlayerPadBottom_C::BattlePassBadge' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadBottom_C, BattlePassSelfXpGainLine) == 0x000218, "Member 'ULobbyPlayerPadBottom_C::BattlePassSelfXpGainLine' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadBottom_C, BattlePassSharedXpGainLine) == 0x000220, "Member 'ULobbyPlayerPadBottom_C::BattlePassSharedXpGainLine' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadBottom_C, Team_Member_Info) == 0x000228, "Member 'ULobbyPlayerPadBottom_C::Team_Member_Info' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadBottom_C, Is_Local_Player) == 0x0003D0, "Member 'ULobbyPlayerPadBottom_C::Is_Local_Player' has a wrong offset!");
static_assert(offsetof(ULobbyPlayerPadBottom_C, Is_Friend) == 0x0003D1, "Member 'ULobbyPlayerPadBottom_C::Is_Friend' has a wrong offset!");

}

