#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_ASN_Jae_Head_01_Skeleton_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_ASN_Jae_Head_01_Skeleton_AnimBP.M_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C
// 0x0510 (0x0980 - 0x0470)
class UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_41381D7E4D7E99EA8EC551A923E79B00; // 0x0478(0x0048)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_F956F2E8479EEFF67D8F1DA653FDDA51; // 0x04C0(0x0098)(ContainsInstancedReference)
	struct FAnimNode_Slot                         AnimGraphNode_Slot_FE1708FD4517E3B31189ED81E8962A96; // 0x0558(0x0068)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_72B6242A4CD8EEAB1EFFBF86F43E5880; // 0x05C0(0x00E0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_6236249D4438BD6C34A1F893FA09079C; // 0x06A0(0x00E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_B5E65BCB4057B88003A0D69EBD580D3A; // 0x0780(0x00D0)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_6C132E614AB4561E426158B1BE9628A7; // 0x0850(0x0098)(ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_A7365E35471B8EF307FFA39C7D11F102; // 0x08E8(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3EC5D65A4E8ADCB871D686A4380F2903; // 0x0930(0x0048)()
	class USkeletalMeshComponent*                 MeshToCopy;                                        // 0x0978(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_M_MED_ASN_Jae_Head_01_Skeleton_AnimBP(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_ASN_Jae_Head_01_Skeleton_AnimBP_AnimGraphNode_BlendListByBool_B5E65BCB4057B88003A0D69EBD580D3A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_ASN_Jae_Head_01_Skeleton_AnimBP_AnimGraphNode_CopyPoseFromMesh_6C132E614AB4561E426158B1BE9628A7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_ASN_Jae_Head_01_Skeleton_AnimBP_AnimGraphNode_CopyPoseFromMesh_F956F2E8479EEFF67D8F1DA653FDDA51();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C">();
	}
	static class UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C>();
	}
};
static_assert(alignof(UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C) == 0x000008, "Wrong alignment on UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C");
static_assert(sizeof(UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C) == 0x000980, "Wrong size on UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C");
static_assert(offsetof(UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C, UberGraphFrame) == 0x000470, "Member 'UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C, AnimGraphNode_Root_41381D7E4D7E99EA8EC551A923E79B00) == 0x000478, "Member 'UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C::AnimGraphNode_Root_41381D7E4D7E99EA8EC551A923E79B00' has a wrong offset!");
static_assert(offsetof(UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C, AnimGraphNode_CopyPoseFromMesh_F956F2E8479EEFF67D8F1DA653FDDA51) == 0x0004C0, "Member 'UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C::AnimGraphNode_CopyPoseFromMesh_F956F2E8479EEFF67D8F1DA653FDDA51' has a wrong offset!");
static_assert(offsetof(UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C, AnimGraphNode_Slot_FE1708FD4517E3B31189ED81E8962A96) == 0x000558, "Member 'UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C::AnimGraphNode_Slot_FE1708FD4517E3B31189ED81E8962A96' has a wrong offset!");
static_assert(offsetof(UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C, AnimGraphNode_LayeredBoneBlend_72B6242A4CD8EEAB1EFFBF86F43E5880) == 0x0005C0, "Member 'UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C::AnimGraphNode_LayeredBoneBlend_72B6242A4CD8EEAB1EFFBF86F43E5880' has a wrong offset!");
static_assert(offsetof(UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C, AnimGraphNode_LayeredBoneBlend_6236249D4438BD6C34A1F893FA09079C) == 0x0006A0, "Member 'UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C::AnimGraphNode_LayeredBoneBlend_6236249D4438BD6C34A1F893FA09079C' has a wrong offset!");
static_assert(offsetof(UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C, AnimGraphNode_BlendListByBool_B5E65BCB4057B88003A0D69EBD580D3A) == 0x000780, "Member 'UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C::AnimGraphNode_BlendListByBool_B5E65BCB4057B88003A0D69EBD580D3A' has a wrong offset!");
static_assert(offsetof(UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C, AnimGraphNode_CopyPoseFromMesh_6C132E614AB4561E426158B1BE9628A7) == 0x000850, "Member 'UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C::AnimGraphNode_CopyPoseFromMesh_6C132E614AB4561E426158B1BE9628A7' has a wrong offset!");
static_assert(offsetof(UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C, AnimGraphNode_LocalToComponentSpace_A7365E35471B8EF307FFA39C7D11F102) == 0x0008E8, "Member 'UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C::AnimGraphNode_LocalToComponentSpace_A7365E35471B8EF307FFA39C7D11F102' has a wrong offset!");
static_assert(offsetof(UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_3EC5D65A4E8ADCB871D686A4380F2903) == 0x000930, "Member 'UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_3EC5D65A4E8ADCB871D686A4380F2903' has a wrong offset!");
static_assert(offsetof(UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C, MeshToCopy) == 0x000978, "Member 'UM_MED_ASN_Jae_Head_01_Skeleton_AnimBP_C::MeshToCopy' has a wrong offset!");

}

