#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_HIS_Sparks_Head_01_Skeleton_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_HIS_Sparks_Head_01_Skeleton_AnimBP.M_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C
// 0x0510 (0x0980 - 0x0470)
class UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_F901F86F47BB0F1F9BB524BC464D209F; // 0x0478(0x0048)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_0DAB21BB41E9DEE27FC2A48E47BCC290; // 0x04C0(0x0098)(ContainsInstancedReference)
	struct FAnimNode_Slot                         AnimGraphNode_Slot_EC53447A47EF3B33B9B6AB9A09D0A7B8; // 0x0558(0x0068)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_126DBAF54E00BF07110680986BEC829C; // 0x05C0(0x00E0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_662B3DFB44FA08592E46219428119F66; // 0x06A0(0x00E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4C473D884B5C599CB66269BA6C880FDD; // 0x0780(0x00D0)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_CD91997043F75270B169AA90390DB8CD; // 0x0850(0x0098)(ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2A31EFF642A7F0EC3DDBA189723CF36C; // 0x08E8(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_EB97BCF7419D3643C831D8A99B57F2EB; // 0x0930(0x0048)()
	class USkeletalMeshComponent*                 MeshToCopy;                                        // 0x0978(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_M_MED_HIS_Sparks_Head_01_Skeleton_AnimBP(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_AnimGraphNode_BlendListByBool_4C473D884B5C599CB66269BA6C880FDD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_AnimGraphNode_CopyPoseFromMesh_0DAB21BB41E9DEE27FC2A48E47BCC290();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_AnimGraphNode_CopyPoseFromMesh_CD91997043F75270B169AA90390DB8CD();
	void Playface();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C">();
	}
	static class UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C>();
	}
};
static_assert(alignof(UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C) == 0x000008, "Wrong alignment on UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C");
static_assert(sizeof(UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C) == 0x000980, "Wrong size on UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C");
static_assert(offsetof(UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C, UberGraphFrame) == 0x000470, "Member 'UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C, AnimGraphNode_Root_F901F86F47BB0F1F9BB524BC464D209F) == 0x000478, "Member 'UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C::AnimGraphNode_Root_F901F86F47BB0F1F9BB524BC464D209F' has a wrong offset!");
static_assert(offsetof(UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C, AnimGraphNode_CopyPoseFromMesh_0DAB21BB41E9DEE27FC2A48E47BCC290) == 0x0004C0, "Member 'UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C::AnimGraphNode_CopyPoseFromMesh_0DAB21BB41E9DEE27FC2A48E47BCC290' has a wrong offset!");
static_assert(offsetof(UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C, AnimGraphNode_Slot_EC53447A47EF3B33B9B6AB9A09D0A7B8) == 0x000558, "Member 'UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C::AnimGraphNode_Slot_EC53447A47EF3B33B9B6AB9A09D0A7B8' has a wrong offset!");
static_assert(offsetof(UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C, AnimGraphNode_LayeredBoneBlend_126DBAF54E00BF07110680986BEC829C) == 0x0005C0, "Member 'UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C::AnimGraphNode_LayeredBoneBlend_126DBAF54E00BF07110680986BEC829C' has a wrong offset!");
static_assert(offsetof(UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C, AnimGraphNode_LayeredBoneBlend_662B3DFB44FA08592E46219428119F66) == 0x0006A0, "Member 'UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C::AnimGraphNode_LayeredBoneBlend_662B3DFB44FA08592E46219428119F66' has a wrong offset!");
static_assert(offsetof(UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C, AnimGraphNode_BlendListByBool_4C473D884B5C599CB66269BA6C880FDD) == 0x000780, "Member 'UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C::AnimGraphNode_BlendListByBool_4C473D884B5C599CB66269BA6C880FDD' has a wrong offset!");
static_assert(offsetof(UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C, AnimGraphNode_CopyPoseFromMesh_CD91997043F75270B169AA90390DB8CD) == 0x000850, "Member 'UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C::AnimGraphNode_CopyPoseFromMesh_CD91997043F75270B169AA90390DB8CD' has a wrong offset!");
static_assert(offsetof(UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C, AnimGraphNode_LocalToComponentSpace_2A31EFF642A7F0EC3DDBA189723CF36C) == 0x0008E8, "Member 'UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C::AnimGraphNode_LocalToComponentSpace_2A31EFF642A7F0EC3DDBA189723CF36C' has a wrong offset!");
static_assert(offsetof(UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_EB97BCF7419D3643C831D8A99B57F2EB) == 0x000930, "Member 'UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_EB97BCF7419D3643C831D8A99B57F2EB' has a wrong offset!");
static_assert(offsetof(UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C, MeshToCopy) == 0x000978, "Member 'UM_MED_HIS_Sparks_Head_01_Skeleton_AnimBP_C::MeshToCopy' has a wrong offset!");

}

