#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_BLK_Sydney_01_Skeleton_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_BLK_Sydney_01_Skeleton_AnimBP.M_MED_BLK_Sydney_01_Skeleton_AnimBP_C
// 0x04F0 (0x0960 - 0x0470)
class UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_B67577B1437A5E72A2A96FBF53853F39; // 0x0478(0x0048)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_205F747E477B9AB23F0ACEB95679AF9F; // 0x04C0(0x0098)(ContainsInstancedReference)
	struct FAnimNode_Slot                         AnimGraphNode_Slot_CDA9F3D5454FD4724D3515AD7592E226; // 0x0558(0x0068)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_8FBD9D21449E3E1C6AB8F894EB679AEE; // 0x05C0(0x00E0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_599E96B04D5802DB750D1A8064FE9257; // 0x06A0(0x00E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_D165706F485A4C579E56468E9B4786F9; // 0x0780(0x00D0)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_FA82137D403C3565CD766E8DEE9CA7BE; // 0x0850(0x0098)(ContainsInstancedReference)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C7E479204816452B491316BEB1224D64; // 0x08E8(0x0070)()
	class USkeletalMeshComponent*                 MeshToCopy;                                        // 0x0958(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_M_MED_BLK_Sydney_01_Skeleton_AnimBP(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_BLK_Sydney_01_Skeleton_AnimBP_AnimGraphNode_BlendListByBool_D165706F485A4C579E56468E9B4786F9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_BLK_Sydney_01_Skeleton_AnimBP_AnimGraphNode_CopyPoseFromMesh_205F747E477B9AB23F0ACEB95679AF9F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_BLK_Sydney_01_Skeleton_AnimBP_AnimGraphNode_CopyPoseFromMesh_FA82137D403C3565CD766E8DEE9CA7BE();
	void Playface();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_BLK_Sydney_01_Skeleton_AnimBP_C">();
	}
	static class UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C>();
	}
};
static_assert(alignof(UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C) == 0x000008, "Wrong alignment on UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C");
static_assert(sizeof(UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C) == 0x000960, "Wrong size on UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C");
static_assert(offsetof(UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C, UberGraphFrame) == 0x000470, "Member 'UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C, AnimGraphNode_Root_B67577B1437A5E72A2A96FBF53853F39) == 0x000478, "Member 'UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C::AnimGraphNode_Root_B67577B1437A5E72A2A96FBF53853F39' has a wrong offset!");
static_assert(offsetof(UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C, AnimGraphNode_CopyPoseFromMesh_205F747E477B9AB23F0ACEB95679AF9F) == 0x0004C0, "Member 'UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C::AnimGraphNode_CopyPoseFromMesh_205F747E477B9AB23F0ACEB95679AF9F' has a wrong offset!");
static_assert(offsetof(UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C, AnimGraphNode_Slot_CDA9F3D5454FD4724D3515AD7592E226) == 0x000558, "Member 'UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C::AnimGraphNode_Slot_CDA9F3D5454FD4724D3515AD7592E226' has a wrong offset!");
static_assert(offsetof(UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C, AnimGraphNode_LayeredBoneBlend_8FBD9D21449E3E1C6AB8F894EB679AEE) == 0x0005C0, "Member 'UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C::AnimGraphNode_LayeredBoneBlend_8FBD9D21449E3E1C6AB8F894EB679AEE' has a wrong offset!");
static_assert(offsetof(UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C, AnimGraphNode_LayeredBoneBlend_599E96B04D5802DB750D1A8064FE9257) == 0x0006A0, "Member 'UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C::AnimGraphNode_LayeredBoneBlend_599E96B04D5802DB750D1A8064FE9257' has a wrong offset!");
static_assert(offsetof(UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C, AnimGraphNode_BlendListByBool_D165706F485A4C579E56468E9B4786F9) == 0x000780, "Member 'UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C::AnimGraphNode_BlendListByBool_D165706F485A4C579E56468E9B4786F9' has a wrong offset!");
static_assert(offsetof(UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C, AnimGraphNode_CopyPoseFromMesh_FA82137D403C3565CD766E8DEE9CA7BE) == 0x000850, "Member 'UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C::AnimGraphNode_CopyPoseFromMesh_FA82137D403C3565CD766E8DEE9CA7BE' has a wrong offset!");
static_assert(offsetof(UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C, AnimGraphNode_SequencePlayer_C7E479204816452B491316BEB1224D64) == 0x0008E8, "Member 'UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C::AnimGraphNode_SequencePlayer_C7E479204816452B491316BEB1224D64' has a wrong offset!");
static_assert(offsetof(UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C, MeshToCopy) == 0x000958, "Member 'UM_MED_BLK_Sydney_01_Skeleton_AnimBP_C::MeshToCopy' has a wrong offset!");

}

