#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MiniCraftingIngredientListEntry

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function MiniCraftingIngredientListEntry.MiniCraftingIngredientListEntry_C.ExecuteUbergraph_MiniCraftingIngredientListEntry
// 0x0008 (0x0008 - 0x0000)
struct MiniCraftingIngredientListEntry_C_ExecuteUbergraph_MiniCraftingIngredientListEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsBeingReset;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MiniCraftingIngredientListEntry_C_ExecuteUbergraph_MiniCraftingIngredientListEntry) == 0x000004, "Wrong alignment on MiniCraftingIngredientListEntry_C_ExecuteUbergraph_MiniCraftingIngredientListEntry");
static_assert(sizeof(MiniCraftingIngredientListEntry_C_ExecuteUbergraph_MiniCraftingIngredientListEntry) == 0x000008, "Wrong size on MiniCraftingIngredientListEntry_C_ExecuteUbergraph_MiniCraftingIngredientListEntry");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_ExecuteUbergraph_MiniCraftingIngredientListEntry, EntryPoint) == 0x000000, "Member 'MiniCraftingIngredientListEntry_C_ExecuteUbergraph_MiniCraftingIngredientListEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_ExecuteUbergraph_MiniCraftingIngredientListEntry, K2Node_Event_IsBeingReset) == 0x000004, "Member 'MiniCraftingIngredientListEntry_C_ExecuteUbergraph_MiniCraftingIngredientListEntry::K2Node_Event_IsBeingReset' has a wrong offset!");

// Function MiniCraftingIngredientListEntry.MiniCraftingIngredientListEntry_C.HandleDifferentItemOrQuantitySetBP
// 0x0001 (0x0001 - 0x0000)
struct MiniCraftingIngredientListEntry_C_HandleDifferentItemOrQuantitySetBP final
{
public:
	bool                                          IsBeingReset;                                      // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MiniCraftingIngredientListEntry_C_HandleDifferentItemOrQuantitySetBP) == 0x000001, "Wrong alignment on MiniCraftingIngredientListEntry_C_HandleDifferentItemOrQuantitySetBP");
static_assert(sizeof(MiniCraftingIngredientListEntry_C_HandleDifferentItemOrQuantitySetBP) == 0x000001, "Wrong size on MiniCraftingIngredientListEntry_C_HandleDifferentItemOrQuantitySetBP");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_HandleDifferentItemOrQuantitySetBP, IsBeingReset) == 0x000000, "Member 'MiniCraftingIngredientListEntry_C_HandleDifferentItemOrQuantitySetBP::IsBeingReset' has a wrong offset!");

// Function MiniCraftingIngredientListEntry.MiniCraftingIngredientListEntry_C.Refresh
// 0x0008 (0x0008 - 0x0000)
struct MiniCraftingIngredientListEntry_C_Refresh final
{
public:
	class UFortItemDefinition*                    CallFunc_GetItemDefinition_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MiniCraftingIngredientListEntry_C_Refresh) == 0x000008, "Wrong alignment on MiniCraftingIngredientListEntry_C_Refresh");
static_assert(sizeof(MiniCraftingIngredientListEntry_C_Refresh) == 0x000008, "Wrong size on MiniCraftingIngredientListEntry_C_Refresh");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_Refresh, CallFunc_GetItemDefinition_ReturnValue) == 0x000000, "Member 'MiniCraftingIngredientListEntry_C_Refresh::CallFunc_GetItemDefinition_ReturnValue' has a wrong offset!");

// Function MiniCraftingIngredientListEntry.MiniCraftingIngredientListEntry_C.RefreshBeingPreviewed
// 0x0010 (0x0010 - 0x0000)
struct MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed final
{
public:
	struct FFortItemEntryPreviewData              CallFunc_GetPreviewData_OutPreviewData;            // 0x0000(0x0008)(NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeingPreviewed_ReturnValue;             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed) == 0x000004, "Wrong alignment on MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed");
static_assert(sizeof(MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed) == 0x000010, "Wrong size on MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed, CallFunc_GetPreviewData_OutPreviewData) == 0x000000, "Member 'MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed::CallFunc_GetPreviewData_OutPreviewData' has a wrong offset!");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000008, "Member 'MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000009, "Member 'MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x00000A, "Member 'MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed, CallFunc_IsBeingPreviewed_ReturnValue) == 0x00000B, "Member 'MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed::CallFunc_IsBeingPreviewed_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed, CallFunc_BooleanOR_ReturnValue) == 0x00000C, "Member 'MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed, CallFunc_BooleanAND_ReturnValue) == 0x00000D, "Member 'MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed, CallFunc_BooleanAND_ReturnValue2) == 0x00000E, "Member 'MiniCraftingIngredientListEntry_C_RefreshBeingPreviewed::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");

// Function MiniCraftingIngredientListEntry.MiniCraftingIngredientListEntry_C.Get_ItemCountWidget_ToolTipWidget
// 0x0068 (0x0068 - 0x0000)
struct MiniCraftingIngredientListEntry_C_Get_ItemCountWidget_ToolTipWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemDefinition_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetShortDescription_ReturnValue;          // 0x0020(0x0018)()
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0038(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_Basic_Tooltip_Output;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MiniCraftingIngredientListEntry_C_Get_ItemCountWidget_ToolTipWidget) == 0x000008, "Wrong alignment on MiniCraftingIngredientListEntry_C_Get_ItemCountWidget_ToolTipWidget");
static_assert(sizeof(MiniCraftingIngredientListEntry_C_Get_ItemCountWidget_ToolTipWidget) == 0x000068, "Wrong size on MiniCraftingIngredientListEntry_C_Get_ItemCountWidget_ToolTipWidget");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_Get_ItemCountWidget_ToolTipWidget, ReturnValue) == 0x000000, "Member 'MiniCraftingIngredientListEntry_C_Get_ItemCountWidget_ToolTipWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_Get_ItemCountWidget_ToolTipWidget, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'MiniCraftingIngredientListEntry_C_Get_ItemCountWidget_ToolTipWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_Get_ItemCountWidget_ToolTipWidget, CallFunc_GetItemDefinition_ReturnValue) == 0x000010, "Member 'MiniCraftingIngredientListEntry_C_Get_ItemCountWidget_ToolTipWidget::CallFunc_GetItemDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_Get_ItemCountWidget_ToolTipWidget, CallFunc_IsUsingGamepad_ReturnValue) == 0x000018, "Member 'MiniCraftingIngredientListEntry_C_Get_ItemCountWidget_ToolTipWidget::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_Get_ItemCountWidget_ToolTipWidget, CallFunc_GetShortDescription_ReturnValue) == 0x000020, "Member 'MiniCraftingIngredientListEntry_C_Get_ItemCountWidget_ToolTipWidget::CallFunc_GetShortDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_Get_ItemCountWidget_ToolTipWidget, CallFunc_GetDisplayName_ReturnValue) == 0x000038, "Member 'MiniCraftingIngredientListEntry_C_Get_ItemCountWidget_ToolTipWidget::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_Get_ItemCountWidget_ToolTipWidget, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'MiniCraftingIngredientListEntry_C_Get_ItemCountWidget_ToolTipWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_Get_ItemCountWidget_ToolTipWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000058, "Member 'MiniCraftingIngredientListEntry_C_Get_ItemCountWidget_ToolTipWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniCraftingIngredientListEntry_C_Get_ItemCountWidget_ToolTipWidget, CallFunc_Create_Basic_Tooltip_Output) == 0x000060, "Member 'MiniCraftingIngredientListEntry_C_Get_ItemCountWidget_ToolTipWidget::CallFunc_Create_Basic_Tooltip_Output' has a wrong offset!");

}

