#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissionRichText

#include "Basic.hpp"


namespace SDK::Params
{

// Function MissionRichText.MissionRichText_C.ExecuteUbergraph_MissionRichText
// 0x0004 (0x0004 - 0x0000)
struct MissionRichText_C_ExecuteUbergraph_MissionRichText final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionRichText_C_ExecuteUbergraph_MissionRichText) == 0x000004, "Wrong alignment on MissionRichText_C_ExecuteUbergraph_MissionRichText");
static_assert(sizeof(MissionRichText_C_ExecuteUbergraph_MissionRichText) == 0x000004, "Wrong size on MissionRichText_C_ExecuteUbergraph_MissionRichText");
static_assert(offsetof(MissionRichText_C_ExecuteUbergraph_MissionRichText, EntryPoint) == 0x000000, "Member 'MissionRichText_C_ExecuteUbergraph_MissionRichText::EntryPoint' has a wrong offset!");

// Function MissionRichText.MissionRichText_C.Update
// 0x0018 (0x0018 - 0x0000)
struct MissionRichText_C_Update final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(MissionRichText_C_Update) == 0x000008, "Wrong alignment on MissionRichText_C_Update");
static_assert(sizeof(MissionRichText_C_Update) == 0x000018, "Wrong size on MissionRichText_C_Update");
static_assert(offsetof(MissionRichText_C_Update, Text) == 0x000000, "Member 'MissionRichText_C_Update::Text' has a wrong offset!");

}

