#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissionRichText

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MissionRichText.MissionRichText_C
// 0x0038 (0x0248 - 0x0210)
class UMissionRichText_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UFortRichTextBlock*                     TextBlockHUD;                                      // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortRichTextBlock*                     TextBlockNonHUD;                                   // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TextToDisplay;                                     // 0x0228(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          bConfigureAsHUD;                                   // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_MissionRichText(int32 EntryPoint);
	void Update(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MissionRichText_C">();
	}
	static class UMissionRichText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionRichText_C>();
	}
};
static_assert(alignof(UMissionRichText_C) == 0x000008, "Wrong alignment on UMissionRichText_C");
static_assert(sizeof(UMissionRichText_C) == 0x000248, "Wrong size on UMissionRichText_C");
static_assert(offsetof(UMissionRichText_C, UberGraphFrame) == 0x000210, "Member 'UMissionRichText_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMissionRichText_C, TextBlockHUD) == 0x000218, "Member 'UMissionRichText_C::TextBlockHUD' has a wrong offset!");
static_assert(offsetof(UMissionRichText_C, TextBlockNonHUD) == 0x000220, "Member 'UMissionRichText_C::TextBlockNonHUD' has a wrong offset!");
static_assert(offsetof(UMissionRichText_C, TextToDisplay) == 0x000228, "Member 'UMissionRichText_C::TextToDisplay' has a wrong offset!");
static_assert(offsetof(UMissionRichText_C, bConfigureAsHUD) == 0x000240, "Member 'UMissionRichText_C::bConfigureAsHUD' has a wrong offset!");

}

