#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissionTooltip

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MissionTooltip.MissionTooltip_C.ExecuteUbergraph_MissionTooltip
// 0x0020 (0x0020 - 0x0000)
struct MissionTooltip_C_ExecuteUbergraph_MissionTooltip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_InitObject;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Hex_PARENT_C*                       K2Node_DynamicCast_AsBP_Hex_PARENT;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionTooltip_C_ExecuteUbergraph_MissionTooltip) == 0x000008, "Wrong alignment on MissionTooltip_C_ExecuteUbergraph_MissionTooltip");
static_assert(sizeof(MissionTooltip_C_ExecuteUbergraph_MissionTooltip) == 0x000020, "Wrong size on MissionTooltip_C_ExecuteUbergraph_MissionTooltip");
static_assert(offsetof(MissionTooltip_C_ExecuteUbergraph_MissionTooltip, EntryPoint) == 0x000000, "Member 'MissionTooltip_C_ExecuteUbergraph_MissionTooltip::EntryPoint' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_ExecuteUbergraph_MissionTooltip, K2Node_Event_InitObject) == 0x000008, "Member 'MissionTooltip_C_ExecuteUbergraph_MissionTooltip::K2Node_Event_InitObject' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_ExecuteUbergraph_MissionTooltip, K2Node_DynamicCast_AsBP_Hex_PARENT) == 0x000010, "Member 'MissionTooltip_C_ExecuteUbergraph_MissionTooltip::K2Node_DynamicCast_AsBP_Hex_PARENT' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_ExecuteUbergraph_MissionTooltip, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'MissionTooltip_C_ExecuteUbergraph_MissionTooltip::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function MissionTooltip.MissionTooltip_C.InitFromObject
// 0x0008 (0x0008 - 0x0000)
struct MissionTooltip_C_InitFromObject final
{
public:
	class UObject*                                InitObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionTooltip_C_InitFromObject) == 0x000008, "Wrong alignment on MissionTooltip_C_InitFromObject");
static_assert(sizeof(MissionTooltip_C_InitFromObject) == 0x000008, "Wrong size on MissionTooltip_C_InitFromObject");
static_assert(offsetof(MissionTooltip_C_InitFromObject, InitObject) == 0x000000, "Member 'MissionTooltip_C_InitFromObject::InitObject' has a wrong offset!");

// Function MissionTooltip.MissionTooltip_C.UpdateMissionInfo
// 0x07C0 (0x07C0 - 0x0000)
struct MissionTooltip_C_UpdateMissionInfo final
{
public:
	class ABP_Hex_PARENT_C*                       Mission_Details;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameDifficultyInfo                    GameDifficultyInfo;                                // 0x0008(0x0080)(Edit, BlueprintVisible)
	int32                                         ConningBucketIndex;                                // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ConningColor;                                      // 0x008C(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CollapseDifficulty;                                // 0x009C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMissionDetails                    TileMissionDetails;                                // 0x00A0(0x0168)(Edit, BlueprintVisible)
	int32                                         ContentDifficulty;                                 // 0x0208(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalSkillPoints;                                  // 0x020C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Blank_FText;                                       // 0x0210(0x0018)(Edit, BlueprintVisible)
	TArray<class UFortGameplayModifierItemDefinition*> GameplayMods;                                      // 0x0228(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class FText                                   Temp_text_Variable;                                // 0x0238(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0250(0x0018)()
	class FText                                   Temp_text_Variable3;                               // 0x0268(0x0018)()
	EFortTheaterMapTileType                       Temp_byte_Variable;                                // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable4;                               // 0x0288(0x0018)()
	class FText                                   Temp_text_Variable5;                               // 0x02A0(0x0018)()
	class UHomeBaseContext*                       CallFunc_GetContext_ReturnValue;                   // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortTheaterMapTileType                       Temp_byte_Variable2;                               // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLocalTeamHomebaseRating_Rating;        // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocalTeamHomebaseRating_ProgressFraction; // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLocalTeamHomebaseRating_ReturnValue;   // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable6;                               // 0x02D0(0x0018)()
	class FText                                   Temp_text_Variable7;                               // 0x02E8(0x0018)()
	EFortTheaterMapTileType                       Temp_byte_Variable3;                               // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortMissionDetails                    CallFunc_GetTileMissionDetails_MissionDetails;     // 0x0310(0x0168)()
	bool                                          CallFunc_GetTileMissionDetails_ReturnValue;        // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x047A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x047B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x047C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x047D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x047E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47F[0x1];                                      // 0x047F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0480(0x0028)()
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x04A8(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor2;                     // 0x04B8(0x0028)()
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x04E8(0x0078)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0561(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_562[0x2];                                      // 0x0562(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Get_Conning_Color_From_Difficulty_Value_Difficulty_Linear_Color; // 0x0564(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_Conning_Color_From_Difficulty_Value_Success; // 0x0574(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_575[0x3];                                      // 0x0575(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Get_Conning_Color_From_Difficulty_Value_TooltipText; // 0x0578(0x0018)()
	int32                                         CallFunc_Get_Conning_Color_From_Difficulty_Value_DifficultyValue; // 0x0590(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594[0x4];                                      // 0x0594(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHomeBaseContext*                       CallFunc_GetContext_ReturnValue3;                  // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalSkillPointsEarned_ReturnValue;    // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x05A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x05A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x05A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A7[0x1];                                      // 0x05A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor3;                     // 0x05A8(0x0028)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush2;                     // 0x05D0(0x0078)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0650(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue2;                 // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_669[0x7];                                      // 0x0669(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0670(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0688(0x0040)(HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x06C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CA[0x6];                                      // 0x06CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x06D0(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_711[0x7];                                      // 0x0711(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0718(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0728(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x0740(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue4;         // 0x0741(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0742(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0743(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x0744(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_745[0x3];                                      // 0x0745(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select2_Default;                            // 0x0748(0x0018)()
	class FText                                   K2Node_Select3_Default;                            // 0x0760(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue4;                   // 0x0779(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x077A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x077B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x077C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue5;         // 0x077D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77E[0x2];                                      // 0x077E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0780(0x0018)()
	bool                                          CallFunc_BooleanOR_ReturnValue5;                   // 0x0798(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_799[0x7];                                      // 0x0799(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select4_Default;                            // 0x07A0(0x0018)()
	ESlateVisibility                              K2Node_Select5_Default;                            // 0x07B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionTooltip_C_UpdateMissionInfo) == 0x000008, "Wrong alignment on MissionTooltip_C_UpdateMissionInfo");
static_assert(sizeof(MissionTooltip_C_UpdateMissionInfo) == 0x0007C0, "Wrong size on MissionTooltip_C_UpdateMissionInfo");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, Mission_Details) == 0x000000, "Member 'MissionTooltip_C_UpdateMissionInfo::Mission_Details' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, GameDifficultyInfo) == 0x000008, "Member 'MissionTooltip_C_UpdateMissionInfo::GameDifficultyInfo' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, ConningBucketIndex) == 0x000088, "Member 'MissionTooltip_C_UpdateMissionInfo::ConningBucketIndex' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, ConningColor) == 0x00008C, "Member 'MissionTooltip_C_UpdateMissionInfo::ConningColor' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CollapseDifficulty) == 0x00009C, "Member 'MissionTooltip_C_UpdateMissionInfo::CollapseDifficulty' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, TileMissionDetails) == 0x0000A0, "Member 'MissionTooltip_C_UpdateMissionInfo::TileMissionDetails' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, ContentDifficulty) == 0x000208, "Member 'MissionTooltip_C_UpdateMissionInfo::ContentDifficulty' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, TotalSkillPoints) == 0x00020C, "Member 'MissionTooltip_C_UpdateMissionInfo::TotalSkillPoints' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, Blank_FText) == 0x000210, "Member 'MissionTooltip_C_UpdateMissionInfo::Blank_FText' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, GameplayMods) == 0x000228, "Member 'MissionTooltip_C_UpdateMissionInfo::GameplayMods' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, Temp_text_Variable) == 0x000238, "Member 'MissionTooltip_C_UpdateMissionInfo::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, Temp_text_Variable2) == 0x000250, "Member 'MissionTooltip_C_UpdateMissionInfo::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, Temp_text_Variable3) == 0x000268, "Member 'MissionTooltip_C_UpdateMissionInfo::Temp_text_Variable3' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, Temp_byte_Variable) == 0x000280, "Member 'MissionTooltip_C_UpdateMissionInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, Temp_text_Variable4) == 0x000288, "Member 'MissionTooltip_C_UpdateMissionInfo::Temp_text_Variable4' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, Temp_text_Variable5) == 0x0002A0, "Member 'MissionTooltip_C_UpdateMissionInfo::Temp_text_Variable5' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_GetContext_ReturnValue) == 0x0002B8, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, Temp_byte_Variable2) == 0x0002C0, "Member 'MissionTooltip_C_UpdateMissionInfo::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_GetLocalTeamHomebaseRating_Rating) == 0x0002C4, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_GetLocalTeamHomebaseRating_Rating' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_GetLocalTeamHomebaseRating_ProgressFraction) == 0x0002C8, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_GetLocalTeamHomebaseRating_ProgressFraction' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_GetLocalTeamHomebaseRating_ReturnValue) == 0x0002CC, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_GetLocalTeamHomebaseRating_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, Temp_text_Variable6) == 0x0002D0, "Member 'MissionTooltip_C_UpdateMissionInfo::Temp_text_Variable6' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, Temp_text_Variable7) == 0x0002E8, "Member 'MissionTooltip_C_UpdateMissionInfo::Temp_text_Variable7' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, Temp_byte_Variable3) == 0x000300, "Member 'MissionTooltip_C_UpdateMissionInfo::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_GetContext_ReturnValue2) == 0x000308, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_GetTileMissionDetails_MissionDetails) == 0x000310, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_GetTileMissionDetails_MissionDetails' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_GetTileMissionDetails_ReturnValue) == 0x000478, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_GetTileMissionDetails_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_TextIsEmpty_ReturnValue) == 0x000479, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00047A, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_BooleanAND_ReturnValue) == 0x00047B, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x00047C, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_BooleanOR_ReturnValue) == 0x00047D, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_BooleanOR_ReturnValue2) == 0x00047E, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, K2Node_MakeStruct_SlateColor) == 0x000480, "Member 'MissionTooltip_C_UpdateMissionInfo::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, K2Node_MakeStruct_LinearColor) == 0x0004A8, "Member 'MissionTooltip_C_UpdateMissionInfo::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, K2Node_MakeStruct_SlateColor2) == 0x0004B8, "Member 'MissionTooltip_C_UpdateMissionInfo::K2Node_MakeStruct_SlateColor2' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0004E0, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, K2Node_MakeStruct_SlateBrush) == 0x0004E8, "Member 'MissionTooltip_C_UpdateMissionInfo::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000560, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_BooleanAND_ReturnValue2) == 0x000561, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_Get_Conning_Color_From_Difficulty_Value_Difficulty_Linear_Color) == 0x000564, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_Get_Conning_Color_From_Difficulty_Value_Difficulty_Linear_Color' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_Get_Conning_Color_From_Difficulty_Value_Success) == 0x000574, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_Get_Conning_Color_From_Difficulty_Value_Success' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_Get_Conning_Color_From_Difficulty_Value_TooltipText) == 0x000578, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_Get_Conning_Color_From_Difficulty_Value_TooltipText' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_Get_Conning_Color_From_Difficulty_Value_DifficultyValue) == 0x000590, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_Get_Conning_Color_From_Difficulty_Value_DifficultyValue' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_GetContext_ReturnValue3) == 0x000598, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_GetTotalSkillPointsEarned_ReturnValue) == 0x0005A0, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_GetTotalSkillPointsEarned_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, Temp_byte_Variable4) == 0x0005A4, "Member 'MissionTooltip_C_UpdateMissionInfo::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, Temp_byte_Variable5) == 0x0005A5, "Member 'MissionTooltip_C_UpdateMissionInfo::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, Temp_bool_Variable) == 0x0005A6, "Member 'MissionTooltip_C_UpdateMissionInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, K2Node_MakeStruct_SlateColor3) == 0x0005A8, "Member 'MissionTooltip_C_UpdateMissionInfo::K2Node_MakeStruct_SlateColor3' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, K2Node_MakeStruct_SlateBrush2) == 0x0005D0, "Member 'MissionTooltip_C_UpdateMissionInfo::K2Node_MakeStruct_SlateBrush2' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_Greater_IntInt_ReturnValue) == 0x000648, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_GetText_ReturnValue) == 0x000650, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_TextIsEmpty_ReturnValue2) == 0x000668, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_TextIsEmpty_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x000670, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, K2Node_MakeStruct_FormatArgumentData) == 0x000688, "Member 'MissionTooltip_C_UpdateMissionInfo::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, K2Node_Select_Default) == 0x0006C8, "Member 'MissionTooltip_C_UpdateMissionInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0006C9, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, K2Node_MakeStruct_FormatArgumentData2) == 0x0006D0, "Member 'MissionTooltip_C_UpdateMissionInfo::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_IsValid_ReturnValue) == 0x000710, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, K2Node_MakeArray_Array) == 0x000718, "Member 'MissionTooltip_C_UpdateMissionInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_Format_ReturnValue) == 0x000728, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_EqualEqual_ByteByte_ReturnValue3) == 0x000740, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_EqualEqual_ByteByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_EqualEqual_ByteByte_ReturnValue4) == 0x000741, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_EqualEqual_ByteByte_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_IsValid_ReturnValue2) == 0x000742, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_BooleanAND_ReturnValue3) == 0x000743, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_BooleanOR_ReturnValue3) == 0x000744, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, K2Node_Select2_Default) == 0x000748, "Member 'MissionTooltip_C_UpdateMissionInfo::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, K2Node_Select3_Default) == 0x000760, "Member 'MissionTooltip_C_UpdateMissionInfo::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000778, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_BooleanOR_ReturnValue4) == 0x000779, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_BooleanOR_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, Temp_byte_Variable6) == 0x00077A, "Member 'MissionTooltip_C_UpdateMissionInfo::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, Temp_byte_Variable7) == 0x00077B, "Member 'MissionTooltip_C_UpdateMissionInfo::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, Temp_bool_Variable2) == 0x00077C, "Member 'MissionTooltip_C_UpdateMissionInfo::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_EqualEqual_ByteByte_ReturnValue5) == 0x00077D, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_EqualEqual_ByteByte_ReturnValue5' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_MakeLiteralText_ReturnValue) == 0x000780, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, CallFunc_BooleanOR_ReturnValue5) == 0x000798, "Member 'MissionTooltip_C_UpdateMissionInfo::CallFunc_BooleanOR_ReturnValue5' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, K2Node_Select4_Default) == 0x0007A0, "Member 'MissionTooltip_C_UpdateMissionInfo::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_UpdateMissionInfo, K2Node_Select5_Default) == 0x0007B8, "Member 'MissionTooltip_C_UpdateMissionInfo::K2Node_Select5_Default' has a wrong offset!");

// Function MissionTooltip.MissionTooltip_C.HandleMissionRewards
// 0x00D0 (0x00D0 - 0x0000)
struct MissionTooltip_C_HandleMissionRewards final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMissionRewardInfo                 CallFunc_Array_Get_Item;                           // 0x0010(0x00A0)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMissionRewardItemMinusTooltip_C*       CallFunc_Create_ReturnValue;                       // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionTooltip_C_HandleMissionRewards) == 0x000008, "Wrong alignment on MissionTooltip_C_HandleMissionRewards");
static_assert(sizeof(MissionTooltip_C_HandleMissionRewards) == 0x0000D0, "Wrong size on MissionTooltip_C_HandleMissionRewards");
static_assert(offsetof(MissionTooltip_C_HandleMissionRewards, Temp_int_Array_Index_Variable) == 0x000000, "Member 'MissionTooltip_C_HandleMissionRewards::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_HandleMissionRewards, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'MissionTooltip_C_HandleMissionRewards::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_HandleMissionRewards, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'MissionTooltip_C_HandleMissionRewards::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_HandleMissionRewards, CallFunc_Array_Get_Item) == 0x000010, "Member 'MissionTooltip_C_HandleMissionRewards::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_HandleMissionRewards, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'MissionTooltip_C_HandleMissionRewards::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_HandleMissionRewards, CallFunc_Less_IntInt_ReturnValue) == 0x0000B4, "Member 'MissionTooltip_C_HandleMissionRewards::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_HandleMissionRewards, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000B8, "Member 'MissionTooltip_C_HandleMissionRewards::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_HandleMissionRewards, CallFunc_Create_ReturnValue) == 0x0000C0, "Member 'MissionTooltip_C_HandleMissionRewards::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_HandleMissionRewards, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x0000C8, "Member 'MissionTooltip_C_HandleMissionRewards::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function MissionTooltip.MissionTooltip_C.HandleGameplayModifiers
// 0x0060 (0x0060 - 0x0000)
struct MissionTooltip_C_HandleGameplayModifiers final
{
public:
	TArray<class UFortGameplayModifierItemDefinition*> GameplayModifiers;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameplayModifierItemDefinition*    CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMissionModifierItem_C*                 CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionTooltip_C_HandleGameplayModifiers) == 0x000008, "Wrong alignment on MissionTooltip_C_HandleGameplayModifiers");
static_assert(sizeof(MissionTooltip_C_HandleGameplayModifiers) == 0x000060, "Wrong size on MissionTooltip_C_HandleGameplayModifiers");
static_assert(offsetof(MissionTooltip_C_HandleGameplayModifiers, GameplayModifiers) == 0x000000, "Member 'MissionTooltip_C_HandleGameplayModifiers::GameplayModifiers' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_HandleGameplayModifiers, Temp_byte_Variable) == 0x000010, "Member 'MissionTooltip_C_HandleGameplayModifiers::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MissionTooltip_C_HandleGameplayModifiers, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'MissionTooltip_C_HandleGameplayModifiers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
