#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissionRewardItemMinusTooltip

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MissionRewardItem-Tooltip.MissionRewardItem-Tooltip_C
// 0x0038 (0x0240 - 0x0208)
class UMissionRewardItemMinusTooltip_C final : public UUserWidget
{
public:
	class UBorder*                                Border;                                            // 0x0208(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextField;                                         // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItem*                              Item;                                              // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   DisplayName;                                       // 0x0228(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	class FText Get_Reward_Name();
	struct FSlateBrush Get_Reward_Icon();
	struct FLinearColor Get_Rarity_Color();
	struct FSlateColor Get_Rarity_Color__SlateColor_();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MissionRewardItem-Tooltip_C">();
	}
	static class UMissionRewardItemMinusTooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionRewardItemMinusTooltip_C>();
	}
};
static_assert(alignof(UMissionRewardItemMinusTooltip_C) == 0x000008, "Wrong alignment on UMissionRewardItemMinusTooltip_C");
static_assert(sizeof(UMissionRewardItemMinusTooltip_C) == 0x000240, "Wrong size on UMissionRewardItemMinusTooltip_C");
static_assert(offsetof(UMissionRewardItemMinusTooltip_C, Border) == 0x000208, "Member 'UMissionRewardItemMinusTooltip_C::Border' has a wrong offset!");
static_assert(offsetof(UMissionRewardItemMinusTooltip_C, Icon) == 0x000210, "Member 'UMissionRewardItemMinusTooltip_C::Icon' has a wrong offset!");
static_assert(offsetof(UMissionRewardItemMinusTooltip_C, TextField) == 0x000218, "Member 'UMissionRewardItemMinusTooltip_C::TextField' has a wrong offset!");
static_assert(offsetof(UMissionRewardItemMinusTooltip_C, Item) == 0x000220, "Member 'UMissionRewardItemMinusTooltip_C::Item' has a wrong offset!");
static_assert(offsetof(UMissionRewardItemMinusTooltip_C, DisplayName) == 0x000228, "Member 'UMissionRewardItemMinusTooltip_C::DisplayName' has a wrong offset!");

}

