#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissionTrackerSubEntry

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function MissionTrackerSubEntry.MissionTrackerSubEntry_C.ExecuteUbergraph_MissionTrackerSubEntry
// 0x0008 (0x0008 - 0x0000)
struct MissionTrackerSubEntry_C_ExecuteUbergraph_MissionTrackerSubEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionTrackerSubEntry_C_ExecuteUbergraph_MissionTrackerSubEntry) == 0x000004, "Wrong alignment on MissionTrackerSubEntry_C_ExecuteUbergraph_MissionTrackerSubEntry");
static_assert(sizeof(MissionTrackerSubEntry_C_ExecuteUbergraph_MissionTrackerSubEntry) == 0x000008, "Wrong size on MissionTrackerSubEntry_C_ExecuteUbergraph_MissionTrackerSubEntry");
static_assert(offsetof(MissionTrackerSubEntry_C_ExecuteUbergraph_MissionTrackerSubEntry, EntryPoint) == 0x000000, "Member 'MissionTrackerSubEntry_C_ExecuteUbergraph_MissionTrackerSubEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_ExecuteUbergraph_MissionTrackerSubEntry, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'MissionTrackerSubEntry_C_ExecuteUbergraph_MissionTrackerSubEntry::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_ExecuteUbergraph_MissionTrackerSubEntry, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'MissionTrackerSubEntry_C_ExecuteUbergraph_MissionTrackerSubEntry::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function MissionTrackerSubEntry.MissionTrackerSubEntry_C.Setup
// 0x0058 (0x0058 - 0x0000)
struct MissionTrackerSubEntry_C_Setup final
{
public:
	class AFortObjectiveBase*                     Objective;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortObjectiveBase* Objective, EFortMissionVisibilityOverride NewVisibilityOverride)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AFortMissionState* MissionState, struct FGameplayTagContainer& EventTags)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AFortMissionState* MissionState)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AFortObjectiveBase* Objective, EFortObjectiveStatus NewStatus)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AFortObjectiveBase* Objective, bool bNewVisibility)> K2Node_CreateDelegate_OutputDelegate5;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(MissionTrackerSubEntry_C_Setup) == 0x000008, "Wrong alignment on MissionTrackerSubEntry_C_Setup");
static_assert(sizeof(MissionTrackerSubEntry_C_Setup) == 0x000058, "Wrong size on MissionTrackerSubEntry_C_Setup");
static_assert(offsetof(MissionTrackerSubEntry_C_Setup, Objective) == 0x000000, "Member 'MissionTrackerSubEntry_C_Setup::Objective' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_Setup, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'MissionTrackerSubEntry_C_Setup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_Setup, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'MissionTrackerSubEntry_C_Setup::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_Setup, K2Node_CreateDelegate_OutputDelegate3) == 0x000028, "Member 'MissionTrackerSubEntry_C_Setup::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_Setup, K2Node_CreateDelegate_OutputDelegate4) == 0x000038, "Member 'MissionTrackerSubEntry_C_Setup::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_Setup, K2Node_CreateDelegate_OutputDelegate5) == 0x000048, "Member 'MissionTrackerSubEntry_C_Setup::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");

// Function MissionTrackerSubEntry.MissionTrackerSubEntry_C.HandleObjectiveStatusChanged
// 0x0040 (0x0040 - 0x0000)
struct MissionTrackerSubEntry_C_HandleObjectiveStatusChanged final
{
public:
	class AFortObjectiveBase*                     Objective;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortObjectiveStatus                          NewStatus;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       Temp_object_Variable2;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Temp_object_Variable3;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortObjectiveStatus                          Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionTrackerSubEntry_C_HandleObjectiveStatusChanged) == 0x000008, "Wrong alignment on MissionTrackerSubEntry_C_HandleObjectiveStatusChanged");
static_assert(sizeof(MissionTrackerSubEntry_C_HandleObjectiveStatusChanged) == 0x000040, "Wrong size on MissionTrackerSubEntry_C_HandleObjectiveStatusChanged");
static_assert(offsetof(MissionTrackerSubEntry_C_HandleObjectiveStatusChanged, Objective) == 0x000000, "Member 'MissionTrackerSubEntry_C_HandleObjectiveStatusChanged::Objective' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_HandleObjectiveStatusChanged, NewStatus) == 0x000008, "Member 'MissionTrackerSubEntry_C_HandleObjectiveStatusChanged::NewStatus' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_HandleObjectiveStatusChanged, Temp_object_Variable) == 0x000010, "Member 'MissionTrackerSubEntry_C_HandleObjectiveStatusChanged::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_HandleObjectiveStatusChanged, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'MissionTrackerSubEntry_C_HandleObjectiveStatusChanged::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_HandleObjectiveStatusChanged, Temp_object_Variable2) == 0x000020, "Member 'MissionTrackerSubEntry_C_HandleObjectiveStatusChanged::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_HandleObjectiveStatusChanged, Temp_object_Variable3) == 0x000028, "Member 'MissionTrackerSubEntry_C_HandleObjectiveStatusChanged::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_HandleObjectiveStatusChanged, Temp_byte_Variable) == 0x000030, "Member 'MissionTrackerSubEntry_C_HandleObjectiveStatusChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_HandleObjectiveStatusChanged, K2Node_Select_Default) == 0x000038, "Member 'MissionTrackerSubEntry_C_HandleObjectiveStatusChanged::K2Node_Select_Default' has a wrong offset!");

// Function MissionTrackerSubEntry.MissionTrackerSubEntry_C.HandleObjectiveVisibilityChanged
// 0x0010 (0x0010 - 0x0000)
struct MissionTrackerSubEntry_C_HandleObjectiveVisibilityChanged final
{
public:
	class AFortObjectiveBase*                     Objective;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVisibility;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionTrackerSubEntry_C_HandleObjectiveVisibilityChanged) == 0x000008, "Wrong alignment on MissionTrackerSubEntry_C_HandleObjectiveVisibilityChanged");
static_assert(sizeof(MissionTrackerSubEntry_C_HandleObjectiveVisibilityChanged) == 0x000010, "Wrong size on MissionTrackerSubEntry_C_HandleObjectiveVisibilityChanged");
static_assert(offsetof(MissionTrackerSubEntry_C_HandleObjectiveVisibilityChanged, Objective) == 0x000000, "Member 'MissionTrackerSubEntry_C_HandleObjectiveVisibilityChanged::Objective' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_HandleObjectiveVisibilityChanged, NewVisibility) == 0x000008, "Member 'MissionTrackerSubEntry_C_HandleObjectiveVisibilityChanged::NewVisibility' has a wrong offset!");

// Function MissionTrackerSubEntry.MissionTrackerSubEntry_C.HandleUpdate
// 0x0008 (0x0008 - 0x0000)
struct MissionTrackerSubEntry_C_HandleUpdate final
{
public:
	class AFortMissionState*                      Objective;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionTrackerSubEntry_C_HandleUpdate) == 0x000008, "Wrong alignment on MissionTrackerSubEntry_C_HandleUpdate");
static_assert(sizeof(MissionTrackerSubEntry_C_HandleUpdate) == 0x000008, "Wrong size on MissionTrackerSubEntry_C_HandleUpdate");
static_assert(offsetof(MissionTrackerSubEntry_C_HandleUpdate, Objective) == 0x000000, "Member 'MissionTrackerSubEntry_C_HandleUpdate::Objective' has a wrong offset!");

// Function MissionTrackerSubEntry.MissionTrackerSubEntry_C.HideObjectiveWidget
// 0x0001 (0x0001 - 0x0000)
struct MissionTrackerSubEntry_C_HideObjectiveWidget final
{
public:
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionTrackerSubEntry_C_HideObjectiveWidget) == 0x000001, "Wrong alignment on MissionTrackerSubEntry_C_HideObjectiveWidget");
static_assert(sizeof(MissionTrackerSubEntry_C_HideObjectiveWidget) == 0x000001, "Wrong size on MissionTrackerSubEntry_C_HideObjectiveWidget");
static_assert(offsetof(MissionTrackerSubEntry_C_HideObjectiveWidget, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000000, "Member 'MissionTrackerSubEntry_C_HideObjectiveWidget::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function MissionTrackerSubEntry.MissionTrackerSubEntry_C.StartEndingAnimations
// 0x0028 (0x0028 - 0x0000)
struct MissionTrackerSubEntry_C_StartEndingAnimations final
{
public:
	class UWidgetAnimation*                       Animation;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionTrackerSubEntry_C_StartEndingAnimations) == 0x000008, "Wrong alignment on MissionTrackerSubEntry_C_StartEndingAnimations");
static_assert(sizeof(MissionTrackerSubEntry_C_StartEndingAnimations) == 0x000028, "Wrong size on MissionTrackerSubEntry_C_StartEndingAnimations");
static_assert(offsetof(MissionTrackerSubEntry_C_StartEndingAnimations, Animation) == 0x000000, "Member 'MissionTrackerSubEntry_C_StartEndingAnimations::Animation' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_StartEndingAnimations, CallFunc_IsVisible_ReturnValue) == 0x000008, "Member 'MissionTrackerSubEntry_C_StartEndingAnimations::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_StartEndingAnimations, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'MissionTrackerSubEntry_C_StartEndingAnimations::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_StartEndingAnimations, CallFunc_BooleanAND_ReturnValue) == 0x000020, "Member 'MissionTrackerSubEntry_C_StartEndingAnimations::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function MissionTrackerSubEntry.MissionTrackerSubEntry_C.CreateObjectiveContentWidget
// 0x00C0 (0x00C0 - 0x0000)
struct MissionTrackerSubEntry_C_CreateObjectiveContentWidget final
{
public:
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ClassClass_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue2;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue2;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue2;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDefaultObjectiveContentWidget_C*       CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMissionObjectiveContentWidgetInterface_C> K2Node_DynamicCast_AsMission_Objective_Content_Widget_Interface; // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue2;      // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMissionObjectiveWidgetProviderInterface_C> K2Node_DynamicCast_AsMission_Objective_Widget_Provider_Interface; // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectiveContentWidgetClass_Objective_WIdget_Class; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ClassClass_ReturnValue2;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue2;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUserWidget*                        CallFunc_Create_ReturnValue2;                      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IMissionObjectiveContentWidgetInterface_C> K2Node_DynamicCast_AsMission_Objective_Content_Widget_Interface2; // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue2;                    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue3;      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget) == 0x000008, "Wrong alignment on MissionTrackerSubEntry_C_CreateObjectiveContentWidget");
static_assert(sizeof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget) == 0x0000C0, "Wrong size on MissionTrackerSubEntry_C_CreateObjectiveContentWidget");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget, CallFunc_GetChildAt_ReturnValue) == 0x000000, "Member 'MissionTrackerSubEntry_C_CreateObjectiveContentWidget::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget, CallFunc_GetObjectClass_ReturnValue) == 0x000008, "Member 'MissionTrackerSubEntry_C_CreateObjectiveContentWidget::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget, CallFunc_NotEqual_ClassClass_ReturnValue) == 0x000010, "Member 'MissionTrackerSubEntry_C_CreateObjectiveContentWidget::CallFunc_NotEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget, CallFunc_HasAnyChildren_ReturnValue) == 0x000011, "Member 'MissionTrackerSubEntry_C_CreateObjectiveContentWidget::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'MissionTrackerSubEntry_C_CreateObjectiveContentWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget, CallFunc_GetChildAt_ReturnValue2) == 0x000018, "Member 'MissionTrackerSubEntry_C_CreateObjectiveContentWidget::CallFunc_GetChildAt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget, CallFunc_HasAnyChildren_ReturnValue2) == 0x000020, "Member 'MissionTrackerSubEntry_C_CreateObjectiveContentWidget::CallFunc_HasAnyChildren_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget, CallFunc_GetObjectClass_ReturnValue2) == 0x000028, "Member 'MissionTrackerSubEntry_C_CreateObjectiveContentWidget::CallFunc_GetObjectClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000030, "Member 'MissionTrackerSubEntry_C_CreateObjectiveContentWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget, CallFunc_Create_ReturnValue) == 0x000038, "Member 'MissionTrackerSubEntry_C_CreateObjectiveContentWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget, K2Node_DynamicCast_AsMission_Objective_Content_Widget_Interface) == 0x000040, "Member 'MissionTrackerSubEntry_C_CreateObjectiveContentWidget::K2Node_DynamicCast_AsMission_Objective_Content_Widget_Interface' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'MissionTrackerSubEntry_C_CreateObjectiveContentWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget, CallFunc_DoesImplementInterface_ReturnValue) == 0x000051, "Member 'MissionTrackerSubEntry_C_CreateObjectiveContentWidget::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget, CallFunc_DoesImplementInterface_ReturnValue2) == 0x000052, "Member 'MissionTrackerSubEntry_C_CreateObjectiveContentWidget::CallFunc_DoesImplementInterface_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget, K2Node_DynamicCast_AsMission_Objective_Widget_Provider_Interface) == 0x000058, "Member 'MissionTrackerSubEntry_C_CreateObjectiveContentWidget::K2Node_DynamicCast_AsMission_Objective_Widget_Provider_Interface' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget, K2Node_DynamicCast_bSuccess2) == 0x000068, "Member 'MissionTrackerSubEntry_C_CreateObjectiveContentWidget::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget, CallFunc_GetObjectiveContentWidgetClass_Objective_WIdget_Class) == 0x000070, "Member 'MissionTrackerSubEntry_C_CreateObjectiveContentWidget::CallFunc_GetObjectiveContentWidgetClass_Objective_WIdget_Class' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget, CallFunc_NotEqual_ClassClass_ReturnValue2) == 0x000078, "Member 'MissionTrackerSubEntry_C_CreateObjectiveContentWidget::CallFunc_NotEqual_ClassClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget, CallFunc_IsValidClass_ReturnValue) == 0x000079, "Member 'MissionTrackerSubEntry_C_CreateObjectiveContentWidget::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget, CallFunc_GetOwningPlayer_ReturnValue2) == 0x000080, "Member 'MissionTrackerSubEntry_C_CreateObjectiveContentWidget::CallFunc_GetOwningPlayer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget, CallFunc_Create_ReturnValue2) == 0x000088, "Member 'MissionTrackerSubEntry_C_CreateObjectiveContentWidget::CallFunc_Create_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget, K2Node_DynamicCast_AsMission_Objective_Content_Widget_Interface2) == 0x000090, "Member 'MissionTrackerSubEntry_C_CreateObjectiveContentWidget::K2Node_DynamicCast_AsMission_Objective_Content_Widget_Interface2' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget, K2Node_DynamicCast_bSuccess3) == 0x0000A0, "Member 'MissionTrackerSubEntry_C_CreateObjectiveContentWidget::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget, CallFunc_AddChild_ReturnValue) == 0x0000A8, "Member 'MissionTrackerSubEntry_C_CreateObjectiveContentWidget::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget, CallFunc_AddChild_ReturnValue2) == 0x0000B0, "Member 'MissionTrackerSubEntry_C_CreateObjectiveContentWidget::CallFunc_AddChild_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateObjectiveContentWidget, CallFunc_DoesImplementInterface_ReturnValue3) == 0x0000B8, "Member 'MissionTrackerSubEntry_C_CreateObjectiveContentWidget::CallFunc_DoesImplementInterface_ReturnValue3' has a wrong offset!");

// Function MissionTrackerSubEntry.MissionTrackerSubEntry_C.HanldeObjectiveVisiblityOverrideChanged
// 0x0010 (0x0010 - 0x0000)
struct MissionTrackerSubEntry_C_HanldeObjectiveVisiblityOverrideChanged final
{
public:
	class AFortObjectiveBase*                     Objective;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMissionVisibilityOverride                New_Visibility_Override;                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionTrackerSubEntry_C_HanldeObjectiveVisiblityOverrideChanged) == 0x000008, "Wrong alignment on MissionTrackerSubEntry_C_HanldeObjectiveVisiblityOverrideChanged");
static_assert(sizeof(MissionTrackerSubEntry_C_HanldeObjectiveVisiblityOverrideChanged) == 0x000010, "Wrong size on MissionTrackerSubEntry_C_HanldeObjectiveVisiblityOverrideChanged");
static_assert(offsetof(MissionTrackerSubEntry_C_HanldeObjectiveVisiblityOverrideChanged, Objective) == 0x000000, "Member 'MissionTrackerSubEntry_C_HanldeObjectiveVisiblityOverrideChanged::Objective' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_HanldeObjectiveVisiblityOverrideChanged, New_Visibility_Override) == 0x000008, "Member 'MissionTrackerSubEntry_C_HanldeObjectiveVisiblityOverrideChanged::New_Visibility_Override' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_HanldeObjectiveVisiblityOverrideChanged, K2Node_SwitchEnum_CmpSuccess) == 0x000009, "Member 'MissionTrackerSubEntry_C_HanldeObjectiveVisiblityOverrideChanged::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function MissionTrackerSubEntry.MissionTrackerSubEntry_C.ShowObjectiveWidget
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) MissionTrackerSubEntry_C_ShowObjectiveWidget final
{
public:
	bool                                          bIsAlreadyVisible;                                 // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionTrackerSubEntry_C_ShowObjectiveWidget) == 0x000008, "Wrong alignment on MissionTrackerSubEntry_C_ShowObjectiveWidget");
static_assert(sizeof(MissionTrackerSubEntry_C_ShowObjectiveWidget) == 0x000020, "Wrong size on MissionTrackerSubEntry_C_ShowObjectiveWidget");
static_assert(offsetof(MissionTrackerSubEntry_C_ShowObjectiveWidget, bIsAlreadyVisible) == 0x000000, "Member 'MissionTrackerSubEntry_C_ShowObjectiveWidget::bIsAlreadyVisible' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_ShowObjectiveWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'MissionTrackerSubEntry_C_ShowObjectiveWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_ShowObjectiveWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'MissionTrackerSubEntry_C_ShowObjectiveWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_ShowObjectiveWidget, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000018, "Member 'MissionTrackerSubEntry_C_ShowObjectiveWidget::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_ShowObjectiveWidget, CallFunc_BooleanAND_ReturnValue) == 0x000019, "Member 'MissionTrackerSubEntry_C_ShowObjectiveWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_ShowObjectiveWidget, CallFunc_BooleanAND_ReturnValue2) == 0x00001A, "Member 'MissionTrackerSubEntry_C_ShowObjectiveWidget::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_ShowObjectiveWidget, CallFunc_Not_PreBool_ReturnValue2) == 0x00001B, "Member 'MissionTrackerSubEntry_C_ShowObjectiveWidget::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_ShowObjectiveWidget, CallFunc_BooleanAND_ReturnValue3) == 0x00001C, "Member 'MissionTrackerSubEntry_C_ShowObjectiveWidget::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_ShowObjectiveWidget, CallFunc_IsVisible_ReturnValue) == 0x00001D, "Member 'MissionTrackerSubEntry_C_ShowObjectiveWidget::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function MissionTrackerSubEntry.MissionTrackerSubEntry_C.Update
// 0x0110 (0x0110 - 0x0000)
struct MissionTrackerSubEntry_C_Update final
{
public:
	TScriptInterface<class IMissionObjectiveWidgetProviderInterface_C> K2Node_DynamicCast_AsMission_Objective_Widget_Provider_Interface; // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_GetObjectiveBulletIcon_BulletIcon;        // 0x0018(0x0078)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0098(0x0078)()
};
static_assert(alignof(MissionTrackerSubEntry_C_Update) == 0x000008, "Wrong alignment on MissionTrackerSubEntry_C_Update");
static_assert(sizeof(MissionTrackerSubEntry_C_Update) == 0x000110, "Wrong size on MissionTrackerSubEntry_C_Update");
static_assert(offsetof(MissionTrackerSubEntry_C_Update, K2Node_DynamicCast_AsMission_Objective_Widget_Provider_Interface) == 0x000000, "Member 'MissionTrackerSubEntry_C_Update::K2Node_DynamicCast_AsMission_Objective_Widget_Provider_Interface' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_Update, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'MissionTrackerSubEntry_C_Update::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_Update, CallFunc_DoesImplementInterface_ReturnValue) == 0x000011, "Member 'MissionTrackerSubEntry_C_Update::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_Update, CallFunc_GetObjectiveBulletIcon_BulletIcon) == 0x000018, "Member 'MissionTrackerSubEntry_C_Update::CallFunc_GetObjectiveBulletIcon_BulletIcon' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_Update, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'MissionTrackerSubEntry_C_Update::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_Update, K2Node_MakeStruct_SlateBrush) == 0x000098, "Member 'MissionTrackerSubEntry_C_Update::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

// Function MissionTrackerSubEntry.MissionTrackerSubEntry_C.HandleMissionUIEvent
// 0x0078 (0x0078 - 0x0000)
struct MissionTrackerSubEntry_C_HandleMissionUIEvent final
{
public:
	class AFortMissionState*                      MissionElement;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  EventTags;                                         // 0x0008(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class AFortObjectiveBase*                     K2Node_DynamicCast_AsFort_Objective_Base;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue; // 0x0050(0x0020)()
	bool                                          CallFunc_HasAllTags_ReturnValue;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionTrackerSubEntry_C_HandleMissionUIEvent) == 0x000008, "Wrong alignment on MissionTrackerSubEntry_C_HandleMissionUIEvent");
static_assert(sizeof(MissionTrackerSubEntry_C_HandleMissionUIEvent) == 0x000078, "Wrong size on MissionTrackerSubEntry_C_HandleMissionUIEvent");
static_assert(offsetof(MissionTrackerSubEntry_C_HandleMissionUIEvent, MissionElement) == 0x000000, "Member 'MissionTrackerSubEntry_C_HandleMissionUIEvent::MissionElement' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_HandleMissionUIEvent, EventTags) == 0x000008, "Member 'MissionTrackerSubEntry_C_HandleMissionUIEvent::EventTags' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_HandleMissionUIEvent, K2Node_DynamicCast_AsFort_Objective_Base) == 0x000028, "Member 'MissionTrackerSubEntry_C_HandleMissionUIEvent::K2Node_DynamicCast_AsFort_Objective_Base' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_HandleMissionUIEvent, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'MissionTrackerSubEntry_C_HandleMissionUIEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_HandleMissionUIEvent, K2Node_MakeArray_Array) == 0x000038, "Member 'MissionTrackerSubEntry_C_HandleMissionUIEvent::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_HandleMissionUIEvent, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000048, "Member 'MissionTrackerSubEntry_C_HandleMissionUIEvent::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_HandleMissionUIEvent, CallFunc_MakeGameplayTagContainerFromArray_ReturnValue) == 0x000050, "Member 'MissionTrackerSubEntry_C_HandleMissionUIEvent::CallFunc_MakeGameplayTagContainerFromArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_HandleMissionUIEvent, CallFunc_HasAllTags_ReturnValue) == 0x000070, "Member 'MissionTrackerSubEntry_C_HandleMissionUIEvent::CallFunc_HasAllTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_HandleMissionUIEvent, CallFunc_BooleanAND_ReturnValue) == 0x000071, "Member 'MissionTrackerSubEntry_C_HandleMissionUIEvent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function MissionTrackerSubEntry.MissionTrackerSubEntry_C.CreateCompletionAnnouncement
// 0x0150 (0x0150 - 0x0000)
struct MissionTrackerSubEntry_C_CreateCompletionAnnouncement final
{
public:
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortClientAnnouncementData_Basic      K2Node_MakeStruct_FortClientAnnouncementData_Basic; // 0x0008(0x00D8)()
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00E0(0x0030)(IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerController*>          K2Node_MakeArray_Array;                            // 0x0130(0x0010)(ZeroConstructor, ReferenceParm)
	class AFortClientAnnouncement_Basic*          CallFunc_FinishSpawningActor_ReturnValue;          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionTrackerSubEntry_C_CreateCompletionAnnouncement) == 0x000010, "Wrong alignment on MissionTrackerSubEntry_C_CreateCompletionAnnouncement");
static_assert(sizeof(MissionTrackerSubEntry_C_CreateCompletionAnnouncement) == 0x000150, "Wrong size on MissionTrackerSubEntry_C_CreateCompletionAnnouncement");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateCompletionAnnouncement, CallFunc_IsVisible_ReturnValue) == 0x000000, "Member 'MissionTrackerSubEntry_C_CreateCompletionAnnouncement::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateCompletionAnnouncement, K2Node_MakeStruct_FortClientAnnouncementData_Basic) == 0x000008, "Member 'MissionTrackerSubEntry_C_CreateCompletionAnnouncement::K2Node_MakeStruct_FortClientAnnouncementData_Basic' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateCompletionAnnouncement, CallFunc_MakeTransform_ReturnValue) == 0x0000E0, "Member 'MissionTrackerSubEntry_C_CreateCompletionAnnouncement::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateCompletionAnnouncement, CallFunc_GetOwningPlayer_ReturnValue) == 0x000110, "Member 'MissionTrackerSubEntry_C_CreateCompletionAnnouncement::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateCompletionAnnouncement, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000118, "Member 'MissionTrackerSubEntry_C_CreateCompletionAnnouncement::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateCompletionAnnouncement, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000120, "Member 'MissionTrackerSubEntry_C_CreateCompletionAnnouncement::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateCompletionAnnouncement, K2Node_DynamicCast_bSuccess) == 0x000128, "Member 'MissionTrackerSubEntry_C_CreateCompletionAnnouncement::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateCompletionAnnouncement, K2Node_MakeArray_Array) == 0x000130, "Member 'MissionTrackerSubEntry_C_CreateCompletionAnnouncement::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_CreateCompletionAnnouncement, CallFunc_FinishSpawningActor_ReturnValue) == 0x000140, "Member 'MissionTrackerSubEntry_C_CreateCompletionAnnouncement::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function MissionTrackerSubEntry.MissionTrackerSubEntry_C.GetHeightEstimate
// 0x0040 (0x0040 - 0x0000)
struct MissionTrackerSubEntry_C_GetHeightEstimate final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMissionObjectiveContentWidgetInterface_C> K2Node_DynamicCast_AsMission_Objective_Content_Widget_Interface; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHeightEstimate_Height;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionTrackerSubEntry_C_GetHeightEstimate) == 0x000008, "Wrong alignment on MissionTrackerSubEntry_C_GetHeightEstimate");
static_assert(sizeof(MissionTrackerSubEntry_C_GetHeightEstimate) == 0x000040, "Wrong size on MissionTrackerSubEntry_C_GetHeightEstimate");
static_assert(offsetof(MissionTrackerSubEntry_C_GetHeightEstimate, ReturnValue) == 0x000000, "Member 'MissionTrackerSubEntry_C_GetHeightEstimate::ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionTrackerSubEntry_C_GetHeightEstimate, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'MissionTrackerSubEntry_C_GetHeightEstimate::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
