#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MOTD

#include "Basic.hpp"


namespace SDK::Params
{

// Function MOTD.MOTD_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MOTD_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MOTD_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on MOTD_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(MOTD_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on MOTD_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(MOTD_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'MOTD_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function MOTD.MOTD_C.ExecuteUbergraph_MOTD
// 0x0020 (0x0020 - 0x0000)
struct MOTD_C_ExecuteUbergraph_MOTD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MOTD_C_ExecuteUbergraph_MOTD) == 0x000008, "Wrong alignment on MOTD_C_ExecuteUbergraph_MOTD");
static_assert(sizeof(MOTD_C_ExecuteUbergraph_MOTD) == 0x000020, "Wrong size on MOTD_C_ExecuteUbergraph_MOTD");
static_assert(offsetof(MOTD_C_ExecuteUbergraph_MOTD, EntryPoint) == 0x000000, "Member 'MOTD_C_ExecuteUbergraph_MOTD::EntryPoint' has a wrong offset!");
static_assert(offsetof(MOTD_C_ExecuteUbergraph_MOTD, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'MOTD_C_ExecuteUbergraph_MOTD::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(MOTD_C_ExecuteUbergraph_MOTD, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000010, "Member 'MOTD_C_ExecuteUbergraph_MOTD::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(MOTD_C_ExecuteUbergraph_MOTD, CallFunc_GetUINavigationManager_ReturnValue) == 0x000018, "Member 'MOTD_C_ExecuteUbergraph_MOTD::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

}

