#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NormalBangWrapper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass NormalBangWrapper.NormalBangWrapper_C
// 0x0070 (0x0298 - 0x0228)
class UNormalBangWrapper_C final : public UFortBangWrapper_NUI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       TutorialGlow;                                      // 0x0230(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               BigBang;                                           // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               BigBangCount;                                      // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_0;                                 // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_5;                                 // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Content;                                           // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CountText;                                         // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ModeSwitcher;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NoCount;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SmallBang;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SmallBangCount;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          TutorialBorder;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          UseSmallVersion;                                   // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count;                                             // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_NormalBangWrapper(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnStartCallout();
	void OnStopCallout();
	void OnBangStateChanged(bool bEnabled, int32 Param_Count);
	void SetTutorialBorderStyle(class UClass* BorderStyle);
	void Update_Bang_Icon_Version(int32 InCount);
	void Adjust_Bang_Image_Translation(const struct FVector2D& Translation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NormalBangWrapper_C">();
	}
	static class UNormalBangWrapper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNormalBangWrapper_C>();
	}
};
static_assert(alignof(UNormalBangWrapper_C) == 0x000008, "Wrong alignment on UNormalBangWrapper_C");
static_assert(sizeof(UNormalBangWrapper_C) == 0x000298, "Wrong size on UNormalBangWrapper_C");
static_assert(offsetof(UNormalBangWrapper_C, UberGraphFrame) == 0x000228, "Member 'UNormalBangWrapper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNormalBangWrapper_C, TutorialGlow) == 0x000230, "Member 'UNormalBangWrapper_C::TutorialGlow' has a wrong offset!");
static_assert(offsetof(UNormalBangWrapper_C, BigBang) == 0x000238, "Member 'UNormalBangWrapper_C::BigBang' has a wrong offset!");
static_assert(offsetof(UNormalBangWrapper_C, BigBangCount) == 0x000240, "Member 'UNormalBangWrapper_C::BigBangCount' has a wrong offset!");
static_assert(offsetof(UNormalBangWrapper_C, CommonTextBlock_0) == 0x000248, "Member 'UNormalBangWrapper_C::CommonTextBlock_0' has a wrong offset!");
static_assert(offsetof(UNormalBangWrapper_C, CommonTextBlock_5) == 0x000250, "Member 'UNormalBangWrapper_C::CommonTextBlock_5' has a wrong offset!");
static_assert(offsetof(UNormalBangWrapper_C, Content) == 0x000258, "Member 'UNormalBangWrapper_C::Content' has a wrong offset!");
static_assert(offsetof(UNormalBangWrapper_C, CountText) == 0x000260, "Member 'UNormalBangWrapper_C::CountText' has a wrong offset!");
static_assert(offsetof(UNormalBangWrapper_C, ModeSwitcher) == 0x000268, "Member 'UNormalBangWrapper_C::ModeSwitcher' has a wrong offset!");
static_assert(offsetof(UNormalBangWrapper_C, NoCount) == 0x000270, "Member 'UNormalBangWrapper_C::NoCount' has a wrong offset!");
static_assert(offsetof(UNormalBangWrapper_C, SmallBang) == 0x000278, "Member 'UNormalBangWrapper_C::SmallBang' has a wrong offset!");
static_assert(offsetof(UNormalBangWrapper_C, SmallBangCount) == 0x000280, "Member 'UNormalBangWrapper_C::SmallBangCount' has a wrong offset!");
static_assert(offsetof(UNormalBangWrapper_C, TutorialBorder) == 0x000288, "Member 'UNormalBangWrapper_C::TutorialBorder' has a wrong offset!");
static_assert(offsetof(UNormalBangWrapper_C, UseSmallVersion) == 0x000290, "Member 'UNormalBangWrapper_C::UseSmallVersion' has a wrong offset!");
static_assert(offsetof(UNormalBangWrapper_C, Count) == 0x000294, "Member 'UNormalBangWrapper_C::Count' has a wrong offset!");

}

