#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PartyCharacterPlacementHelper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass PartyCharacterPlacementHelper.PartyCharacterPlacementHelper_C
// 0x0110 (0x0478 - 0x0368)
class APartyCharacterPlacementHelper_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(Transient, DuplicateTransient)
	class UWidgetComponent*                       LobbyPlayerPadBottom;                              // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       LobbyPlayerAddPlayer;                              // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       LobbyPlayerPadTop;                                 // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       LobbyPlayerPadGadgets;                             // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   UnderlightBluePoint02;                             // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   UnderlightBluePoint01;                             // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    UnderlightBlue02;                                  // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    UnderlightBlue01;                                  // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    RimSpotLight;                                      // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    TopSpotLight;                                      // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        LightsParent;                                      // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PSMinusNoPlayerMinusSparkle;                       // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PSMinusNoPlayerMinusSwirl02;                       // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PSMinusNoPlayerMinusSwirl01;                       // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Lobby_Character_Pad_Light_Ring;                 // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Lobby_Character_Pad;                            // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CharacterPlacement;                                // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerID;                                          // 0x0400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PreviewMesh;                                       // 0x0404(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_405[0x3];                                      // 0x0405(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            Mesh;                                              // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPlayerSelected;                                 // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          PlayerOnPad;                                       // 0x0411(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_412[0x6];                                      // 0x0412(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               MID_Pad;                                           // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugFakePlayer;                                   // 0x0420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421[0x3];                                      // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DebugFakePlayerID_;                                // 0x0424(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   NewEventDispatcher_0;                              // 0x0428(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          PlayerBeingRemoved;                                // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlay*                               OverlayEmptySpot;                                  // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               OverlayInputAction;                                // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULobbyPlayerPadTop_C*                   Top;                                               // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULobbyPlayerPadGadgets_C*               Gadgets;                                           // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULobbyPlayerAddPlayer_C*                PlayerAdd;                                         // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        LastAnimatedPlayerPawn;                            // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULobbyPlayerPadBottom_C*                BattlePassWidget;                                  // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void NewEventDispatcher_0__DelegateSignature();
	void ExecuteUbergraph_PartyCharacterPlacementHelper(int32 EntryPoint);
	void HandleClientEvent_StoreTabSelected(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void HandleClientEvent_StoreTabClosed(class UObject* EventSource, class UObject* EventFocus, const struct FFortClientEvent& ClientEvent);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void OnLobbyPlayerHovered(int32 PlayerIndex);
	void OnLobbyPlayerSelected(int32 PlayerIndex);
	void OnLobbyPlayerUnselected(int32 PlayerIndex);
	void InitializeContextEvents();
	void Initialize();
	void InitializePadUI();
	void OnLobbyStarted();
	void OnFrontEndCameraChanged(EFrontEndCamera NewCamera, EFrontEndCamera OldCamera);
	void OnTeamMemberAdded(const struct FFortTeamMemberInfo& TeamMemberInfo);
	void OnTeamMemberRemoved(int32 TeamMemberRemovedInt);
	void OnTeamMemberStateChanged(const struct FFortTeamMemberInfo& TeamMemberInfo);
	void OnLobbyPlayerUnhovered(int32 PlayerIndex);
	void InitializeWidgets();
	void RefreshWidgets();
	void OnLobbyDisconnected();
	void PlayLobbyAnimation(int32 PartyMemberIndex);
	void IsInLobby(bool* Param_IsInLobby);
	void CompletedQuestPrerequisites(bool* bCompleted);
	void OnPartyDataChanged(struct FFortTeamMemberInfo& MemberInfo);
	void Refresh_Lights(const struct FFortTeamMemberInfo& Team_Info);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PartyCharacterPlacementHelper_C">();
	}
	static class APartyCharacterPlacementHelper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APartyCharacterPlacementHelper_C>();
	}
};
static_assert(alignof(APartyCharacterPlacementHelper_C) == 0x000008, "Wrong alignment on APartyCharacterPlacementHelper_C");
static_assert(sizeof(APartyCharacterPlacementHelper_C) == 0x000478, "Wrong size on APartyCharacterPlacementHelper_C");
static_assert(offsetof(APartyCharacterPlacementHelper_C, UberGraphFrame) == 0x000368, "Member 'APartyCharacterPlacementHelper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, LobbyPlayerPadBottom) == 0x000370, "Member 'APartyCharacterPlacementHelper_C::LobbyPlayerPadBottom' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, LobbyPlayerAddPlayer) == 0x000378, "Member 'APartyCharacterPlacementHelper_C::LobbyPlayerAddPlayer' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, LobbyPlayerPadTop) == 0x000380, "Member 'APartyCharacterPlacementHelper_C::LobbyPlayerPadTop' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, LobbyPlayerPadGadgets) == 0x000388, "Member 'APartyCharacterPlacementHelper_C::LobbyPlayerPadGadgets' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, UnderlightBluePoint02) == 0x000390, "Member 'APartyCharacterPlacementHelper_C::UnderlightBluePoint02' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, UnderlightBluePoint01) == 0x000398, "Member 'APartyCharacterPlacementHelper_C::UnderlightBluePoint01' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, UnderlightBlue02) == 0x0003A0, "Member 'APartyCharacterPlacementHelper_C::UnderlightBlue02' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, UnderlightBlue01) == 0x0003A8, "Member 'APartyCharacterPlacementHelper_C::UnderlightBlue01' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, RimSpotLight) == 0x0003B0, "Member 'APartyCharacterPlacementHelper_C::RimSpotLight' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, TopSpotLight) == 0x0003B8, "Member 'APartyCharacterPlacementHelper_C::TopSpotLight' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, LightsParent) == 0x0003C0, "Member 'APartyCharacterPlacementHelper_C::LightsParent' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, PSMinusNoPlayerMinusSparkle) == 0x0003C8, "Member 'APartyCharacterPlacementHelper_C::PSMinusNoPlayerMinusSparkle' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, PSMinusNoPlayerMinusSwirl02) == 0x0003D0, "Member 'APartyCharacterPlacementHelper_C::PSMinusNoPlayerMinusSwirl02' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, PSMinusNoPlayerMinusSwirl01) == 0x0003D8, "Member 'APartyCharacterPlacementHelper_C::PSMinusNoPlayerMinusSwirl01' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, SM_Lobby_Character_Pad_Light_Ring) == 0x0003E0, "Member 'APartyCharacterPlacementHelper_C::SM_Lobby_Character_Pad_Light_Ring' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, SM_Lobby_Character_Pad) == 0x0003E8, "Member 'APartyCharacterPlacementHelper_C::SM_Lobby_Character_Pad' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, CharacterPlacement) == 0x0003F0, "Member 'APartyCharacterPlacementHelper_C::CharacterPlacement' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, Root) == 0x0003F8, "Member 'APartyCharacterPlacementHelper_C::Root' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, PlayerID) == 0x000400, "Member 'APartyCharacterPlacementHelper_C::PlayerID' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, PreviewMesh) == 0x000404, "Member 'APartyCharacterPlacementHelper_C::PreviewMesh' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, Mesh) == 0x000408, "Member 'APartyCharacterPlacementHelper_C::Mesh' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, bIsPlayerSelected) == 0x000410, "Member 'APartyCharacterPlacementHelper_C::bIsPlayerSelected' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, PlayerOnPad) == 0x000411, "Member 'APartyCharacterPlacementHelper_C::PlayerOnPad' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, MID_Pad) == 0x000418, "Member 'APartyCharacterPlacementHelper_C::MID_Pad' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, DebugFakePlayer) == 0x000420, "Member 'APartyCharacterPlacementHelper_C::DebugFakePlayer' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, DebugFakePlayerID_) == 0x000424, "Member 'APartyCharacterPlacementHelper_C::DebugFakePlayerID_' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, NewEventDispatcher_0) == 0x000428, "Member 'APartyCharacterPlacementHelper_C::NewEventDispatcher_0' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, PlayerBeingRemoved) == 0x000438, "Member 'APartyCharacterPlacementHelper_C::PlayerBeingRemoved' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, OverlayEmptySpot) == 0x000440, "Member 'APartyCharacterPlacementHelper_C::OverlayEmptySpot' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, OverlayInputAction) == 0x000448, "Member 'APartyCharacterPlacementHelper_C::OverlayInputAction' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, Top) == 0x000450, "Member 'APartyCharacterPlacementHelper_C::Top' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, Gadgets) == 0x000458, "Member 'APartyCharacterPlacementHelper_C::Gadgets' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, PlayerAdd) == 0x000460, "Member 'APartyCharacterPlacementHelper_C::PlayerAdd' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, LastAnimatedPlayerPawn) == 0x000468, "Member 'APartyCharacterPlacementHelper_C::LastAnimatedPlayerPawn' has a wrong offset!");
static_assert(offsetof(APartyCharacterPlacementHelper_C, BattlePassWidget) == 0x000470, "Member 'APartyCharacterPlacementHelper_C::BattlePassWidget' has a wrong offset!");

}

