#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PartyInfo

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PartyInfo.PartyInfo_C
// 0x0070 (0x0278 - 0x0208)
class UPartyInfo_C final : public UUserWidget
{
public:
	class UHorizontalBox*                         Biome_Info;                                        // 0x0208(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       BiomeName;                                         // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Difficulty_Info;                                   // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DifficultyName;                                    // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_15;                                          // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_16;                                          // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_HeaderSplitter;                              // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Mission_Type_Icon;                                 // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ModifierContentHorizontalBox;                      // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ModifierVerticalBox;                               // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           RewardsContent;                                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ZoneName;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PartyInfo_C">();
	}
	static class UPartyInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPartyInfo_C>();
	}
};
static_assert(alignof(UPartyInfo_C) == 0x000008, "Wrong alignment on UPartyInfo_C");
static_assert(sizeof(UPartyInfo_C) == 0x000278, "Wrong size on UPartyInfo_C");
static_assert(offsetof(UPartyInfo_C, Biome_Info) == 0x000208, "Member 'UPartyInfo_C::Biome_Info' has a wrong offset!");
static_assert(offsetof(UPartyInfo_C, BiomeName) == 0x000210, "Member 'UPartyInfo_C::BiomeName' has a wrong offset!");
static_assert(offsetof(UPartyInfo_C, Difficulty_Info) == 0x000218, "Member 'UPartyInfo_C::Difficulty_Info' has a wrong offset!");
static_assert(offsetof(UPartyInfo_C, DifficultyName) == 0x000220, "Member 'UPartyInfo_C::DifficultyName' has a wrong offset!");
static_assert(offsetof(UPartyInfo_C, Image_0) == 0x000228, "Member 'UPartyInfo_C::Image_0' has a wrong offset!");
static_assert(offsetof(UPartyInfo_C, Image_1) == 0x000230, "Member 'UPartyInfo_C::Image_1' has a wrong offset!");
static_assert(offsetof(UPartyInfo_C, Image_15) == 0x000238, "Member 'UPartyInfo_C::Image_15' has a wrong offset!");
static_assert(offsetof(UPartyInfo_C, Image_16) == 0x000240, "Member 'UPartyInfo_C::Image_16' has a wrong offset!");
static_assert(offsetof(UPartyInfo_C, Image_HeaderSplitter) == 0x000248, "Member 'UPartyInfo_C::Image_HeaderSplitter' has a wrong offset!");
static_assert(offsetof(UPartyInfo_C, Mission_Type_Icon) == 0x000250, "Member 'UPartyInfo_C::Mission_Type_Icon' has a wrong offset!");
static_assert(offsetof(UPartyInfo_C, ModifierContentHorizontalBox) == 0x000258, "Member 'UPartyInfo_C::ModifierContentHorizontalBox' has a wrong offset!");
static_assert(offsetof(UPartyInfo_C, ModifierVerticalBox) == 0x000260, "Member 'UPartyInfo_C::ModifierVerticalBox' has a wrong offset!");
static_assert(offsetof(UPartyInfo_C, RewardsContent) == 0x000268, "Member 'UPartyInfo_C::RewardsContent' has a wrong offset!");
static_assert(offsetof(UPartyInfo_C, ZoneName) == 0x000270, "Member 'UPartyInfo_C::ZoneName' has a wrong offset!");

}

