#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PartyFinderListItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PartyFinderListItem.PartyFinderListItem_C
// 0x0060 (0x07F8 - 0x0798)
class UPartyFinderListItem_C final : public UFortPartyTreeItemBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0798(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 Arrow;                                             // 0x07A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Header;                                            // 0x07A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HeaderText;                                        // 0x07B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Location;                                          // 0x07B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerBanner_C*                        PlayerBanner;                                      // 0x07C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        PlayerHeaderSwitcher;                              // 0x07C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PlayerName;                                        // 0x07D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PlayerStatus;                                      // 0x07D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextState;                                         // 0x07E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   InviteJoinChanged;                                 // 0x07E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void InviteJoinChanged__DelegateSignature();
	void ExecuteUbergraph_PartyFinderListItem(int32 EntryPoint);
	void Destruct();
	void Construct();
	void ExpansionChanged(bool bExpanded);
	void OnSocialItemSet();
	void InitializeItem();
	void BindSocialItemDelegates();
	void HandlePresenceUpdated();
	void SetupExpansion(bool Expanded);
	void UpdateStateText();
	void UnbindSocialItemDelegates();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PartyFinderListItem_C">();
	}
	static class UPartyFinderListItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPartyFinderListItem_C>();
	}
};
static_assert(alignof(UPartyFinderListItem_C) == 0x000008, "Wrong alignment on UPartyFinderListItem_C");
static_assert(sizeof(UPartyFinderListItem_C) == 0x0007F8, "Wrong size on UPartyFinderListItem_C");
static_assert(offsetof(UPartyFinderListItem_C, UberGraphFrame) == 0x000798, "Member 'UPartyFinderListItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPartyFinderListItem_C, Arrow) == 0x0007A0, "Member 'UPartyFinderListItem_C::Arrow' has a wrong offset!");
static_assert(offsetof(UPartyFinderListItem_C, Header) == 0x0007A8, "Member 'UPartyFinderListItem_C::Header' has a wrong offset!");
static_assert(offsetof(UPartyFinderListItem_C, HeaderText) == 0x0007B0, "Member 'UPartyFinderListItem_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UPartyFinderListItem_C, Location) == 0x0007B8, "Member 'UPartyFinderListItem_C::Location' has a wrong offset!");
static_assert(offsetof(UPartyFinderListItem_C, PlayerBanner) == 0x0007C0, "Member 'UPartyFinderListItem_C::PlayerBanner' has a wrong offset!");
static_assert(offsetof(UPartyFinderListItem_C, PlayerHeaderSwitcher) == 0x0007C8, "Member 'UPartyFinderListItem_C::PlayerHeaderSwitcher' has a wrong offset!");
static_assert(offsetof(UPartyFinderListItem_C, PlayerName) == 0x0007D0, "Member 'UPartyFinderListItem_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UPartyFinderListItem_C, PlayerStatus) == 0x0007D8, "Member 'UPartyFinderListItem_C::PlayerStatus' has a wrong offset!");
static_assert(offsetof(UPartyFinderListItem_C, TextState) == 0x0007E0, "Member 'UPartyFinderListItem_C::TextState' has a wrong offset!");
static_assert(offsetof(UPartyFinderListItem_C, InviteJoinChanged) == 0x0007E8, "Member 'UPartyFinderListItem_C::InviteJoinChanged' has a wrong offset!");

}

