#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerkWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "TooltipStat_structs.hpp"


namespace SDK::Params
{

// Function PerkWidget.PerkWidget_C.ExecuteUbergraph_PerkWidget
// 0x0098 (0x0098 - 0x0000)
struct PerkWidget_C_ExecuteUbergraph_PerkWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAbility_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0008(0x0078)()
	bool                                          CallFunc_ShouldFadePerk_Result;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0084(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PerkWidget_C_ExecuteUbergraph_PerkWidget) == 0x000008, "Wrong alignment on PerkWidget_C_ExecuteUbergraph_PerkWidget");
static_assert(sizeof(PerkWidget_C_ExecuteUbergraph_PerkWidget) == 0x000098, "Wrong size on PerkWidget_C_ExecuteUbergraph_PerkWidget");
static_assert(offsetof(PerkWidget_C_ExecuteUbergraph_PerkWidget, EntryPoint) == 0x000000, "Member 'PerkWidget_C_ExecuteUbergraph_PerkWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_ExecuteUbergraph_PerkWidget, CallFunc_HasAbility_ReturnValue) == 0x000004, "Member 'PerkWidget_C_ExecuteUbergraph_PerkWidget::CallFunc_HasAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_ExecuteUbergraph_PerkWidget, K2Node_MakeStruct_SlateBrush) == 0x000008, "Member 'PerkWidget_C_ExecuteUbergraph_PerkWidget::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_ExecuteUbergraph_PerkWidget, CallFunc_ShouldFadePerk_Result) == 0x000080, "Member 'PerkWidget_C_ExecuteUbergraph_PerkWidget::CallFunc_ShouldFadePerk_Result' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_ExecuteUbergraph_PerkWidget, K2Node_MakeStruct_LinearColor) == 0x000084, "Member 'PerkWidget_C_ExecuteUbergraph_PerkWidget::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_ExecuteUbergraph_PerkWidget, K2Node_Event_IsDesignTime) == 0x000094, "Member 'PerkWidget_C_ExecuteUbergraph_PerkWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function PerkWidget.PerkWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct PerkWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PerkWidget_C_PreConstruct) == 0x000001, "Wrong alignment on PerkWidget_C_PreConstruct");
static_assert(sizeof(PerkWidget_C_PreConstruct) == 0x000001, "Wrong size on PerkWidget_C_PreConstruct");
static_assert(offsetof(PerkWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'PerkWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function PerkWidget.PerkWidget_C.InitializeBasicPerk
// 0x0200 (0x0200 - 0x0000)
struct PerkWidget_C_InitializeBasicPerk final
{
public:
	struct FLinearColor                           CallFunc_GetHighlightColor_Color;                  // 0x0000(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_NoResourceBrush_ReturnValue;              // 0x0010(0x0078)()
	bool                                          Temp_bool_Variable;                                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_GetIcon_Brush;                            // 0x0090(0x0078)()
	bool                                          CallFunc_GetIcon_ReturnValue;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_Select_Default;                             // 0x0110(0x0078)()
	struct FSlateBrush                            CallFunc_ResizeBrush_NewParam;                     // 0x0188(0x0078)()
};
static_assert(alignof(PerkWidget_C_InitializeBasicPerk) == 0x000008, "Wrong alignment on PerkWidget_C_InitializeBasicPerk");
static_assert(sizeof(PerkWidget_C_InitializeBasicPerk) == 0x000200, "Wrong size on PerkWidget_C_InitializeBasicPerk");
static_assert(offsetof(PerkWidget_C_InitializeBasicPerk, CallFunc_GetHighlightColor_Color) == 0x000000, "Member 'PerkWidget_C_InitializeBasicPerk::CallFunc_GetHighlightColor_Color' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeBasicPerk, CallFunc_NoResourceBrush_ReturnValue) == 0x000010, "Member 'PerkWidget_C_InitializeBasicPerk::CallFunc_NoResourceBrush_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeBasicPerk, Temp_bool_Variable) == 0x000088, "Member 'PerkWidget_C_InitializeBasicPerk::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeBasicPerk, CallFunc_GetIcon_Brush) == 0x000090, "Member 'PerkWidget_C_InitializeBasicPerk::CallFunc_GetIcon_Brush' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeBasicPerk, CallFunc_GetIcon_ReturnValue) == 0x000108, "Member 'PerkWidget_C_InitializeBasicPerk::CallFunc_GetIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeBasicPerk, K2Node_Select_Default) == 0x000110, "Member 'PerkWidget_C_InitializeBasicPerk::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeBasicPerk, CallFunc_ResizeBrush_NewParam) == 0x000188, "Member 'PerkWidget_C_InitializeBasicPerk::CallFunc_ResizeBrush_NewParam' has a wrong offset!");

// Function PerkWidget.PerkWidget_C.InitializeAbilityPerk
// 0x0208 (0x0208 - 0x0000)
struct PerkWidget_C_InitializeAbilityPerk final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetHighlightColor_Color;                  // 0x0004(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0018(0x0078)()
	bool                                          CallFunc_IsPerkHighlighted_ReturnValue;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_GetIcon_Brush;                            // 0x0098(0x0078)()
	bool                                          CallFunc_GetIcon_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_Select2_Default;                            // 0x0118(0x0078)()
	struct FSlateBrush                            CallFunc_ResizeBrush_NewParam;                     // 0x0190(0x0078)()
};
static_assert(alignof(PerkWidget_C_InitializeAbilityPerk) == 0x000008, "Wrong alignment on PerkWidget_C_InitializeAbilityPerk");
static_assert(sizeof(PerkWidget_C_InitializeAbilityPerk) == 0x000208, "Wrong size on PerkWidget_C_InitializeAbilityPerk");
static_assert(offsetof(PerkWidget_C_InitializeAbilityPerk, Temp_bool_Variable) == 0x000000, "Member 'PerkWidget_C_InitializeAbilityPerk::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeAbilityPerk, Temp_byte_Variable) == 0x000001, "Member 'PerkWidget_C_InitializeAbilityPerk::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeAbilityPerk, Temp_byte_Variable2) == 0x000002, "Member 'PerkWidget_C_InitializeAbilityPerk::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeAbilityPerk, CallFunc_GetHighlightColor_Color) == 0x000004, "Member 'PerkWidget_C_InitializeAbilityPerk::CallFunc_GetHighlightColor_Color' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeAbilityPerk, K2Node_MakeStruct_SlateBrush) == 0x000018, "Member 'PerkWidget_C_InitializeAbilityPerk::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeAbilityPerk, CallFunc_IsPerkHighlighted_ReturnValue) == 0x000090, "Member 'PerkWidget_C_InitializeAbilityPerk::CallFunc_IsPerkHighlighted_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeAbilityPerk, Temp_bool_Variable2) == 0x000091, "Member 'PerkWidget_C_InitializeAbilityPerk::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeAbilityPerk, K2Node_Select_Default) == 0x000092, "Member 'PerkWidget_C_InitializeAbilityPerk::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeAbilityPerk, CallFunc_GetIcon_Brush) == 0x000098, "Member 'PerkWidget_C_InitializeAbilityPerk::CallFunc_GetIcon_Brush' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeAbilityPerk, CallFunc_GetIcon_ReturnValue) == 0x000110, "Member 'PerkWidget_C_InitializeAbilityPerk::CallFunc_GetIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeAbilityPerk, K2Node_Select2_Default) == 0x000118, "Member 'PerkWidget_C_InitializeAbilityPerk::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeAbilityPerk, CallFunc_ResizeBrush_NewParam) == 0x000190, "Member 'PerkWidget_C_InitializeAbilityPerk::CallFunc_ResizeBrush_NewParam' has a wrong offset!");

// Function PerkWidget.PerkWidget_C.GetTierAbilityBrush
// 0x0160 (0x0160 - 0x0000)
struct PerkWidget_C_GetTierAbilityBrush final
{
public:
	struct FSlateBrush                            SlateBrush;                                        // 0x0000(0x0078)(Parm, OutParm)
	EFortItemTier                                 Temp_byte_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable2;                             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable3;                             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable4;                             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable5;                             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable6;                             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable7;                             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable8;                             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable9;                             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable10;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable11;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemTier                                 CallFunc_GetPerkTier_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Select_Default;                             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x00E8(0x0078)()
};
static_assert(alignof(PerkWidget_C_GetTierAbilityBrush) == 0x000008, "Wrong alignment on PerkWidget_C_GetTierAbilityBrush");
static_assert(sizeof(PerkWidget_C_GetTierAbilityBrush) == 0x000160, "Wrong size on PerkWidget_C_GetTierAbilityBrush");
static_assert(offsetof(PerkWidget_C_GetTierAbilityBrush, SlateBrush) == 0x000000, "Member 'PerkWidget_C_GetTierAbilityBrush::SlateBrush' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetTierAbilityBrush, Temp_byte_Variable) == 0x000078, "Member 'PerkWidget_C_GetTierAbilityBrush::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetTierAbilityBrush, Temp_object_Variable) == 0x000080, "Member 'PerkWidget_C_GetTierAbilityBrush::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetTierAbilityBrush, Temp_object_Variable2) == 0x000088, "Member 'PerkWidget_C_GetTierAbilityBrush::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetTierAbilityBrush, Temp_object_Variable3) == 0x000090, "Member 'PerkWidget_C_GetTierAbilityBrush::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetTierAbilityBrush, Temp_object_Variable4) == 0x000098, "Member 'PerkWidget_C_GetTierAbilityBrush::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetTierAbilityBrush, Temp_object_Variable5) == 0x0000A0, "Member 'PerkWidget_C_GetTierAbilityBrush::Temp_object_Variable5' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetTierAbilityBrush, Temp_object_Variable6) == 0x0000A8, "Member 'PerkWidget_C_GetTierAbilityBrush::Temp_object_Variable6' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetTierAbilityBrush, Temp_object_Variable7) == 0x0000B0, "Member 'PerkWidget_C_GetTierAbilityBrush::Temp_object_Variable7' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetTierAbilityBrush, Temp_object_Variable8) == 0x0000B8, "Member 'PerkWidget_C_GetTierAbilityBrush::Temp_object_Variable8' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetTierAbilityBrush, Temp_object_Variable9) == 0x0000C0, "Member 'PerkWidget_C_GetTierAbilityBrush::Temp_object_Variable9' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetTierAbilityBrush, Temp_object_Variable10) == 0x0000C8, "Member 'PerkWidget_C_GetTierAbilityBrush::Temp_object_Variable10' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetTierAbilityBrush, Temp_object_Variable11) == 0x0000D0, "Member 'PerkWidget_C_GetTierAbilityBrush::Temp_object_Variable11' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetTierAbilityBrush, CallFunc_GetPerkTier_ReturnValue) == 0x0000D8, "Member 'PerkWidget_C_GetTierAbilityBrush::CallFunc_GetPerkTier_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetTierAbilityBrush, K2Node_Select_Default) == 0x0000E0, "Member 'PerkWidget_C_GetTierAbilityBrush::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetTierAbilityBrush, K2Node_MakeStruct_SlateBrush) == 0x0000E8, "Member 'PerkWidget_C_GetTierAbilityBrush::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

// Function PerkWidget.PerkWidget_C.GetHighlightColor
// 0x0048 (0x0048 - 0x0000)
struct PerkWidget_C_GetHighlightColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0014(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Get_Buff_Color_Color;                     // 0x0024(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPerkHighlighted_ReturnValue;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0038(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerkWidget_C_GetHighlightColor) == 0x000004, "Wrong alignment on PerkWidget_C_GetHighlightColor");
static_assert(sizeof(PerkWidget_C_GetHighlightColor) == 0x000048, "Wrong size on PerkWidget_C_GetHighlightColor");
static_assert(offsetof(PerkWidget_C_GetHighlightColor, Color) == 0x000000, "Member 'PerkWidget_C_GetHighlightColor::Color' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetHighlightColor, Temp_bool_Variable) == 0x000010, "Member 'PerkWidget_C_GetHighlightColor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetHighlightColor, Temp_struct_Variable) == 0x000014, "Member 'PerkWidget_C_GetHighlightColor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetHighlightColor, CallFunc_Get_Buff_Color_Color) == 0x000024, "Member 'PerkWidget_C_GetHighlightColor::CallFunc_Get_Buff_Color_Color' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetHighlightColor, CallFunc_IsPerkHighlighted_ReturnValue) == 0x000034, "Member 'PerkWidget_C_GetHighlightColor::CallFunc_IsPerkHighlighted_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetHighlightColor, K2Node_Select_Default) == 0x000038, "Member 'PerkWidget_C_GetHighlightColor::K2Node_Select_Default' has a wrong offset!");

// Function PerkWidget.PerkWidget_C.ShouldFadePerk
// 0x0006 (0x0006 - 0x0000)
struct PerkWidget_C_ShouldFadePerk final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPerkHighlighted_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPerkUnlocked_ReturnValue;               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PerkWidget_C_ShouldFadePerk) == 0x000001, "Wrong alignment on PerkWidget_C_ShouldFadePerk");
static_assert(sizeof(PerkWidget_C_ShouldFadePerk) == 0x000006, "Wrong size on PerkWidget_C_ShouldFadePerk");
static_assert(offsetof(PerkWidget_C_ShouldFadePerk, Result) == 0x000000, "Member 'PerkWidget_C_ShouldFadePerk::Result' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_ShouldFadePerk, CallFunc_IsPerkHighlighted_ReturnValue) == 0x000001, "Member 'PerkWidget_C_ShouldFadePerk::CallFunc_IsPerkHighlighted_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_ShouldFadePerk, CallFunc_IsPerkUnlocked_ReturnValue) == 0x000002, "Member 'PerkWidget_C_ShouldFadePerk::CallFunc_IsPerkUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_ShouldFadePerk, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'PerkWidget_C_ShouldFadePerk::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_ShouldFadePerk, CallFunc_Not_PreBool_ReturnValue2) == 0x000004, "Member 'PerkWidget_C_ShouldFadePerk::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_ShouldFadePerk, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'PerkWidget_C_ShouldFadePerk::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function PerkWidget.PerkWidget_C.InitializeTextOnlyPerk
// 0x0050 (0x0050 - 0x0000)
struct PerkWidget_C_InitializeTextOnlyPerk final
{
public:
	struct FTooltipStat                           CallFunc_GetPerkStat_TooltipStat;                  // 0x0000(0x0038)(HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTooltipStatWidget_C*                   CallFunc_Create_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerkWidget_C_InitializeTextOnlyPerk) == 0x000008, "Wrong alignment on PerkWidget_C_InitializeTextOnlyPerk");
static_assert(sizeof(PerkWidget_C_InitializeTextOnlyPerk) == 0x000050, "Wrong size on PerkWidget_C_InitializeTextOnlyPerk");
static_assert(offsetof(PerkWidget_C_InitializeTextOnlyPerk, CallFunc_GetPerkStat_TooltipStat) == 0x000000, "Member 'PerkWidget_C_InitializeTextOnlyPerk::CallFunc_GetPerkStat_TooltipStat' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeTextOnlyPerk, CallFunc_GetOwningPlayer_ReturnValue) == 0x000038, "Member 'PerkWidget_C_InitializeTextOnlyPerk::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeTextOnlyPerk, CallFunc_Create_ReturnValue) == 0x000040, "Member 'PerkWidget_C_InitializeTextOnlyPerk::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeTextOnlyPerk, CallFunc_AddChild_ReturnValue) == 0x000048, "Member 'PerkWidget_C_InitializeTextOnlyPerk::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function PerkWidget.PerkWidget_C.InitializeHeroBonusIcon
// 0x00B0 (0x00B0 - 0x0000)
struct PerkWidget_C_InitializeHeroBonusIcon final
{
public:
	EFortSupportBonusType                         SupportPerkType;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortSupportBonusType                         Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable2;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable3;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortSupportBonusType                         CallFunc_GetSupportBonusType_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0030(0x0078)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PerkWidget_C_InitializeHeroBonusIcon) == 0x000008, "Wrong alignment on PerkWidget_C_InitializeHeroBonusIcon");
static_assert(sizeof(PerkWidget_C_InitializeHeroBonusIcon) == 0x0000B0, "Wrong size on PerkWidget_C_InitializeHeroBonusIcon");
static_assert(offsetof(PerkWidget_C_InitializeHeroBonusIcon, SupportPerkType) == 0x000000, "Member 'PerkWidget_C_InitializeHeroBonusIcon::SupportPerkType' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeHeroBonusIcon, Temp_byte_Variable) == 0x000001, "Member 'PerkWidget_C_InitializeHeroBonusIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeHeroBonusIcon, Temp_object_Variable) == 0x000008, "Member 'PerkWidget_C_InitializeHeroBonusIcon::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeHeroBonusIcon, Temp_object_Variable2) == 0x000010, "Member 'PerkWidget_C_InitializeHeroBonusIcon::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeHeroBonusIcon, Temp_object_Variable3) == 0x000018, "Member 'PerkWidget_C_InitializeHeroBonusIcon::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeHeroBonusIcon, CallFunc_GetSupportBonusType_ReturnValue) == 0x000020, "Member 'PerkWidget_C_InitializeHeroBonusIcon::CallFunc_GetSupportBonusType_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeHeroBonusIcon, K2Node_Select_Default) == 0x000028, "Member 'PerkWidget_C_InitializeHeroBonusIcon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeHeroBonusIcon, K2Node_MakeStruct_SlateBrush) == 0x000030, "Member 'PerkWidget_C_InitializeHeroBonusIcon::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeHeroBonusIcon, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000A8, "Member 'PerkWidget_C_InitializeHeroBonusIcon::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function PerkWidget.PerkWidget_C.SetupBadge
// 0x00A0 (0x00A0 - 0x0000)
struct PerkWidget_C_SetupBadge final
{
public:
	EFortSupportBonusType                         SupportPerkType;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_GetTierAbilityBrush_SlateBrush;           // 0x0008(0x0078)()
	bool                                          CallFunc_IsTierPerk_ReturnValue;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRequiredLevel_ReturnValue;             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0088(0x0018)()
};
static_assert(alignof(PerkWidget_C_SetupBadge) == 0x000008, "Wrong alignment on PerkWidget_C_SetupBadge");
static_assert(sizeof(PerkWidget_C_SetupBadge) == 0x0000A0, "Wrong size on PerkWidget_C_SetupBadge");
static_assert(offsetof(PerkWidget_C_SetupBadge, SupportPerkType) == 0x000000, "Member 'PerkWidget_C_SetupBadge::SupportPerkType' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_SetupBadge, CallFunc_GetTierAbilityBrush_SlateBrush) == 0x000008, "Member 'PerkWidget_C_SetupBadge::CallFunc_GetTierAbilityBrush_SlateBrush' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_SetupBadge, CallFunc_IsTierPerk_ReturnValue) == 0x000080, "Member 'PerkWidget_C_SetupBadge::CallFunc_IsTierPerk_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_SetupBadge, CallFunc_GetRequiredLevel_ReturnValue) == 0x000084, "Member 'PerkWidget_C_SetupBadge::CallFunc_GetRequiredLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_SetupBadge, CallFunc_Conv_IntToText_ReturnValue) == 0x000088, "Member 'PerkWidget_C_SetupBadge::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function PerkWidget.PerkWidget_C.GetPerkStat
// 0x0258 (0x0258 - 0x0000)
struct PerkWidget_C_GetPerkStat final
{
public:
	struct FTooltipStat                           TooltipStat;                                       // 0x0000(0x0038)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemTier                                 CallFunc_GetPerkTier_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetTooltipTitle_ReturnValue;              // 0x0040(0x0018)()
	bool                                          CallFunc_IsTierPerk_ReturnValue;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetTooltipTitle_ReturnValue2;             // 0x00A0(0x0018)()
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x00C0(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetTierText_ReturnValue;                  // 0x0100(0x0018)()
	int32                                         CallFunc_GetRequiredLevel_ReturnValue;             // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData3;             // 0x0120(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0160(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0178(0x0010)(ZeroConstructor, ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData4;             // 0x0188(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01C8(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array2;                           // 0x01E0(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue2;                      // 0x01F0(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0208(0x0018)()
	struct FTooltipStat                           K2Node_MakeStruct_TooltipStat;                     // 0x0220(0x0038)(HasGetValueTypeHash)
};
static_assert(alignof(PerkWidget_C_GetPerkStat) == 0x000008, "Wrong alignment on PerkWidget_C_GetPerkStat");
static_assert(sizeof(PerkWidget_C_GetPerkStat) == 0x000258, "Wrong size on PerkWidget_C_GetPerkStat");
static_assert(offsetof(PerkWidget_C_GetPerkStat, TooltipStat) == 0x000000, "Member 'PerkWidget_C_GetPerkStat::TooltipStat' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetPerkStat, Temp_bool_Variable) == 0x000038, "Member 'PerkWidget_C_GetPerkStat::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetPerkStat, CallFunc_GetPerkTier_ReturnValue) == 0x000039, "Member 'PerkWidget_C_GetPerkStat::CallFunc_GetPerkTier_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetPerkStat, CallFunc_GetTooltipTitle_ReturnValue) == 0x000040, "Member 'PerkWidget_C_GetPerkStat::CallFunc_GetTooltipTitle_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetPerkStat, CallFunc_IsTierPerk_ReturnValue) == 0x000058, "Member 'PerkWidget_C_GetPerkStat::CallFunc_IsTierPerk_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetPerkStat, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'PerkWidget_C_GetPerkStat::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetPerkStat, CallFunc_GetTooltipTitle_ReturnValue2) == 0x0000A0, "Member 'PerkWidget_C_GetPerkStat::CallFunc_GetTooltipTitle_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetPerkStat, CallFunc_GetContext_ReturnValue) == 0x0000B8, "Member 'PerkWidget_C_GetPerkStat::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetPerkStat, K2Node_MakeStruct_FormatArgumentData2) == 0x0000C0, "Member 'PerkWidget_C_GetPerkStat::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetPerkStat, CallFunc_GetTierText_ReturnValue) == 0x000100, "Member 'PerkWidget_C_GetPerkStat::CallFunc_GetTierText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetPerkStat, CallFunc_GetRequiredLevel_ReturnValue) == 0x000118, "Member 'PerkWidget_C_GetPerkStat::CallFunc_GetRequiredLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetPerkStat, K2Node_MakeStruct_FormatArgumentData3) == 0x000120, "Member 'PerkWidget_C_GetPerkStat::K2Node_MakeStruct_FormatArgumentData3' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetPerkStat, CallFunc_Conv_IntToText_ReturnValue) == 0x000160, "Member 'PerkWidget_C_GetPerkStat::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetPerkStat, K2Node_MakeArray_Array) == 0x000178, "Member 'PerkWidget_C_GetPerkStat::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetPerkStat, K2Node_MakeStruct_FormatArgumentData4) == 0x000188, "Member 'PerkWidget_C_GetPerkStat::K2Node_MakeStruct_FormatArgumentData4' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetPerkStat, CallFunc_Format_ReturnValue) == 0x0001C8, "Member 'PerkWidget_C_GetPerkStat::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetPerkStat, K2Node_MakeArray_Array2) == 0x0001E0, "Member 'PerkWidget_C_GetPerkStat::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetPerkStat, CallFunc_Format_ReturnValue2) == 0x0001F0, "Member 'PerkWidget_C_GetPerkStat::CallFunc_Format_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetPerkStat, K2Node_Select_Default) == 0x000208, "Member 'PerkWidget_C_GetPerkStat::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_GetPerkStat, K2Node_MakeStruct_TooltipStat) == 0x000220, "Member 'PerkWidget_C_GetPerkStat::K2Node_MakeStruct_TooltipStat' has a wrong offset!");

// Function PerkWidget.PerkWidget_C.HighlightBadge
// 0x0048 (0x0048 - 0x0000)
struct PerkWidget_C_HighlightBadge final
{
public:
	struct FLinearColor                           CallFunc_GetHighlightColor_Color;                  // 0x0000(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetHighlightColor_Color2;                 // 0x0010(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0020(0x0028)()
};
static_assert(alignof(PerkWidget_C_HighlightBadge) == 0x000008, "Wrong alignment on PerkWidget_C_HighlightBadge");
static_assert(sizeof(PerkWidget_C_HighlightBadge) == 0x000048, "Wrong size on PerkWidget_C_HighlightBadge");
static_assert(offsetof(PerkWidget_C_HighlightBadge, CallFunc_GetHighlightColor_Color) == 0x000000, "Member 'PerkWidget_C_HighlightBadge::CallFunc_GetHighlightColor_Color' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_HighlightBadge, CallFunc_GetHighlightColor_Color2) == 0x000010, "Member 'PerkWidget_C_HighlightBadge::CallFunc_GetHighlightColor_Color2' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_HighlightBadge, K2Node_MakeStruct_SlateColor) == 0x000020, "Member 'PerkWidget_C_HighlightBadge::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function PerkWidget.PerkWidget_C.InitializeTextInfo
// 0x0090 (0x0090 - 0x0000)
struct PerkWidget_C_InitializeTextInfo final
{
public:
	EFortSupportBonusType                         Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable3;                               // 0x0038(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortSupportBonusType                         CallFunc_GetSupportBonusType_ReturnValue;          // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0058(0x0018)()
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetTooltipTitle_ReturnValue;              // 0x0078(0x0018)()
};
static_assert(alignof(PerkWidget_C_InitializeTextInfo) == 0x000008, "Wrong alignment on PerkWidget_C_InitializeTextInfo");
static_assert(sizeof(PerkWidget_C_InitializeTextInfo) == 0x000090, "Wrong size on PerkWidget_C_InitializeTextInfo");
static_assert(offsetof(PerkWidget_C_InitializeTextInfo, Temp_byte_Variable) == 0x000000, "Member 'PerkWidget_C_InitializeTextInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeTextInfo, Temp_text_Variable) == 0x000008, "Member 'PerkWidget_C_InitializeTextInfo::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeTextInfo, Temp_text_Variable2) == 0x000020, "Member 'PerkWidget_C_InitializeTextInfo::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeTextInfo, Temp_text_Variable3) == 0x000038, "Member 'PerkWidget_C_InitializeTextInfo::Temp_text_Variable3' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeTextInfo, Temp_bool_Variable) == 0x000050, "Member 'PerkWidget_C_InitializeTextInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeTextInfo, Temp_byte_Variable2) == 0x000051, "Member 'PerkWidget_C_InitializeTextInfo::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeTextInfo, Temp_byte_Variable3) == 0x000052, "Member 'PerkWidget_C_InitializeTextInfo::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeTextInfo, CallFunc_GetSupportBonusType_ReturnValue) == 0x000053, "Member 'PerkWidget_C_InitializeTextInfo::CallFunc_GetSupportBonusType_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeTextInfo, K2Node_Select_Default) == 0x000058, "Member 'PerkWidget_C_InitializeTextInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeTextInfo, K2Node_Select2_Default) == 0x000070, "Member 'PerkWidget_C_InitializeTextInfo::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_InitializeTextInfo, CallFunc_GetTooltipTitle_ReturnValue) == 0x000078, "Member 'PerkWidget_C_InitializeTextInfo::CallFunc_GetTooltipTitle_ReturnValue' has a wrong offset!");

// Function PerkWidget.PerkWidget_C.CreateToolTipWidget
// 0x0040 (0x0040 - 0x0000)
struct PerkWidget_C_CreateToolTipWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           CallFunc_GetTooltipDescription_ReturnValue;        // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_GetTooltipTitle_ReturnValue;              // 0x0018(0x0018)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_Basic_Multi_Line_Tooltip_Output;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerkWidget_C_CreateToolTipWidget) == 0x000008, "Wrong alignment on PerkWidget_C_CreateToolTipWidget");
static_assert(sizeof(PerkWidget_C_CreateToolTipWidget) == 0x000040, "Wrong size on PerkWidget_C_CreateToolTipWidget");
static_assert(offsetof(PerkWidget_C_CreateToolTipWidget, ReturnValue) == 0x000000, "Member 'PerkWidget_C_CreateToolTipWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_CreateToolTipWidget, CallFunc_GetTooltipDescription_ReturnValue) == 0x000008, "Member 'PerkWidget_C_CreateToolTipWidget::CallFunc_GetTooltipDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidget_C_CreateToolTipWidget, CallFunc_GetTooltipTitle_ReturnValue) == 0x000018, "Member 'PerkWidget_C_CreateToolTipWidget::CallFunc_GetTooltipTitle_ReturnValue' has a wrong offset!");
