#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerksList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PerksList.PerksList_C
// 0x00A0 (0x0328 - 0x0288)
class UPerksList_C final : public UFortPerksWidget_NUI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(Transient, DuplicateTransient)
	class UCommonBorder*                          BorderLockedL;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderLockedR;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderUnlockedL;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderUnlockedR;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PerksLockedL;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PerksLockedR;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PerksNoTiers;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PerksRightColumn;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PerksUnlockedL;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PerksUnlockedR;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PerkTiers;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  PerkTierSwitcher;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIncludeName;                                      // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bFirstTier;                                        // 0x02F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIncludeDescription;                               // 0x02F2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	EFortBrushSize                                IconSize;                                          // 0x02F3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bGenerateTiers;                                    // 0x02F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bFirstPerkCompleteL;                               // 0x02F5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F6[0x2];                                      // 0x02F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PerkCount;                                         // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bTwoColumns;                                       // 0x02FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bSecondColumnStarted;                              // 0x02FD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bFirstPerkCompleteR;                               // 0x02FE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FF[0x1];                                      // 0x02FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SecondColumnSplitCount;                            // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FMargin                                RowPadding;                                        // 0x0304(0x0010)(Edit, BlueprintVisible, NoDestructor)
	struct FMargin                                Description_Padding;                               // 0x0314(0x0010)(Edit, BlueprintVisible, NoDestructor)
	bool                                          bUseLargeFormatNameOnly;                           // 0x0324(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bShowActiveAbilitiesOnly;                          // 0x0325(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bEnableMouseTooltips;                              // 0x0326(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_PerksList(int32 EntryPoint);
	void Construct();
	void OnGeneratePerk(const struct FFortUIPerk& FortPerk, class UFortPerkWidget_NUI* PerkWidget);
	void OnGeneratePerkTier(const struct FFortUIPerkTier& FortPerkTier, class UFortPerkTierWidget_NUI* PerkTierWidget);
	void OnHeroChanged();
	void OnStateChanged();
	void ResetVariables();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PerksList_C">();
	}
	static class UPerksList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPerksList_C>();
	}
};
static_assert(alignof(UPerksList_C) == 0x000008, "Wrong alignment on UPerksList_C");
static_assert(sizeof(UPerksList_C) == 0x000328, "Wrong size on UPerksList_C");
static_assert(offsetof(UPerksList_C, UberGraphFrame) == 0x000288, "Member 'UPerksList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPerksList_C, BorderLockedL) == 0x000290, "Member 'UPerksList_C::BorderLockedL' has a wrong offset!");
static_assert(offsetof(UPerksList_C, BorderLockedR) == 0x000298, "Member 'UPerksList_C::BorderLockedR' has a wrong offset!");
static_assert(offsetof(UPerksList_C, BorderUnlockedL) == 0x0002A0, "Member 'UPerksList_C::BorderUnlockedL' has a wrong offset!");
static_assert(offsetof(UPerksList_C, BorderUnlockedR) == 0x0002A8, "Member 'UPerksList_C::BorderUnlockedR' has a wrong offset!");
static_assert(offsetof(UPerksList_C, PerksLockedL) == 0x0002B0, "Member 'UPerksList_C::PerksLockedL' has a wrong offset!");
static_assert(offsetof(UPerksList_C, PerksLockedR) == 0x0002B8, "Member 'UPerksList_C::PerksLockedR' has a wrong offset!");
static_assert(offsetof(UPerksList_C, PerksNoTiers) == 0x0002C0, "Member 'UPerksList_C::PerksNoTiers' has a wrong offset!");
static_assert(offsetof(UPerksList_C, PerksRightColumn) == 0x0002C8, "Member 'UPerksList_C::PerksRightColumn' has a wrong offset!");
static_assert(offsetof(UPerksList_C, PerksUnlockedL) == 0x0002D0, "Member 'UPerksList_C::PerksUnlockedL' has a wrong offset!");
static_assert(offsetof(UPerksList_C, PerksUnlockedR) == 0x0002D8, "Member 'UPerksList_C::PerksUnlockedR' has a wrong offset!");
static_assert(offsetof(UPerksList_C, PerkTiers) == 0x0002E0, "Member 'UPerksList_C::PerkTiers' has a wrong offset!");
static_assert(offsetof(UPerksList_C, PerkTierSwitcher) == 0x0002E8, "Member 'UPerksList_C::PerkTierSwitcher' has a wrong offset!");
static_assert(offsetof(UPerksList_C, bIncludeName) == 0x0002F0, "Member 'UPerksList_C::bIncludeName' has a wrong offset!");
static_assert(offsetof(UPerksList_C, bFirstTier) == 0x0002F1, "Member 'UPerksList_C::bFirstTier' has a wrong offset!");
static_assert(offsetof(UPerksList_C, bIncludeDescription) == 0x0002F2, "Member 'UPerksList_C::bIncludeDescription' has a wrong offset!");
static_assert(offsetof(UPerksList_C, IconSize) == 0x0002F3, "Member 'UPerksList_C::IconSize' has a wrong offset!");
static_assert(offsetof(UPerksList_C, bGenerateTiers) == 0x0002F4, "Member 'UPerksList_C::bGenerateTiers' has a wrong offset!");
static_assert(offsetof(UPerksList_C, bFirstPerkCompleteL) == 0x0002F5, "Member 'UPerksList_C::bFirstPerkCompleteL' has a wrong offset!");
static_assert(offsetof(UPerksList_C, PerkCount) == 0x0002F8, "Member 'UPerksList_C::PerkCount' has a wrong offset!");
static_assert(offsetof(UPerksList_C, bTwoColumns) == 0x0002FC, "Member 'UPerksList_C::bTwoColumns' has a wrong offset!");
static_assert(offsetof(UPerksList_C, bSecondColumnStarted) == 0x0002FD, "Member 'UPerksList_C::bSecondColumnStarted' has a wrong offset!");
static_assert(offsetof(UPerksList_C, bFirstPerkCompleteR) == 0x0002FE, "Member 'UPerksList_C::bFirstPerkCompleteR' has a wrong offset!");
static_assert(offsetof(UPerksList_C, SecondColumnSplitCount) == 0x000300, "Member 'UPerksList_C::SecondColumnSplitCount' has a wrong offset!");
static_assert(offsetof(UPerksList_C, RowPadding) == 0x000304, "Member 'UPerksList_C::RowPadding' has a wrong offset!");
static_assert(offsetof(UPerksList_C, Description_Padding) == 0x000314, "Member 'UPerksList_C::Description_Padding' has a wrong offset!");
static_assert(offsetof(UPerksList_C, bUseLargeFormatNameOnly) == 0x000324, "Member 'UPerksList_C::bUseLargeFormatNameOnly' has a wrong offset!");
static_assert(offsetof(UPerksList_C, bShowActiveAbilitiesOnly) == 0x000325, "Member 'UPerksList_C::bShowActiveAbilitiesOnly' has a wrong offset!");
static_assert(offsetof(UPerksList_C, bEnableMouseTooltips) == 0x000326, "Member 'UPerksList_C::bEnableMouseTooltips' has a wrong offset!");

}

