#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerksList

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function PerksList.PerksList_C.ExecuteUbergraph_PerksList
// 0x0190 (0x0190 - 0x0000)
struct PerksList_C_ExecuteUbergraph_PerksList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortUIPerkTier                        K2Node_Event_FortPerkTier;                         // 0x0008(0x0020)(NoDestructor)
	class UFortPerkTierWidget_NUI*                K2Node_Event_PerkTierWidget;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPerkTierWidgetNew_C*                   K2Node_DynamicCast_AsPerk_Tier_Widget_New;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortUIPerk                            K2Node_Event_FortPerk;                             // 0x0050(0x0098)()
	class UFortPerkWidget_NUI*                    K2Node_Event_PerkWidget;                           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPerkWidgetNew_C*                       K2Node_DynamicCast_AsPerk_Widget_New;              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPerkUnlocked_ReturnValue;               // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityKit*                        CallFunc_GetGrantedAbilityKit_ReturnValue;         // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortGadgetItemDefinition*>      CallFunc_BP_GetGadgets_GadgetItemDefinitions;      // 0x0108(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyChildren_ReturnValue2;              // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPerkDivider_C*                         CallFunc_Create_ReturnValue;                       // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue2;                    // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue3;              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyChildren_ReturnValue4;              // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x0156(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0157(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable8;                               // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x015B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable9;                               // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select4_Default;                            // 0x015D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable10;                              // 0x015E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable5;                               // 0x015F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue2;       // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select5_Default;                            // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable11;                              // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable12;                              // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16B[0x5];                                      // 0x016B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue3;       // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable6;                               // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue4;       // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select6_Default;                            // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerksList_C_ExecuteUbergraph_PerksList) == 0x000008, "Wrong alignment on PerksList_C_ExecuteUbergraph_PerksList");
static_assert(sizeof(PerksList_C_ExecuteUbergraph_PerksList) == 0x000190, "Wrong size on PerksList_C_ExecuteUbergraph_PerksList");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, EntryPoint) == 0x000000, "Member 'PerksList_C_ExecuteUbergraph_PerksList::EntryPoint' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, K2Node_Event_FortPerkTier) == 0x000008, "Member 'PerksList_C_ExecuteUbergraph_PerksList::K2Node_Event_FortPerkTier' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, K2Node_Event_PerkTierWidget) == 0x000028, "Member 'PerksList_C_ExecuteUbergraph_PerksList::K2Node_Event_PerkTierWidget' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, K2Node_DynamicCast_AsPerk_Tier_Widget_New) == 0x000030, "Member 'PerksList_C_ExecuteUbergraph_PerksList::K2Node_DynamicCast_AsPerk_Tier_Widget_New' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'PerksList_C_ExecuteUbergraph_PerksList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, CallFunc_AddChild_ReturnValue) == 0x000040, "Member 'PerksList_C_ExecuteUbergraph_PerksList::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, Temp_byte_Variable) == 0x000048, "Member 'PerksList_C_ExecuteUbergraph_PerksList::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, Temp_byte_Variable2) == 0x000049, "Member 'PerksList_C_ExecuteUbergraph_PerksList::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, Temp_bool_Variable) == 0x00004A, "Member 'PerksList_C_ExecuteUbergraph_PerksList::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, K2Node_Event_FortPerk) == 0x000050, "Member 'PerksList_C_ExecuteUbergraph_PerksList::K2Node_Event_FortPerk' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, K2Node_Event_PerkWidget) == 0x0000E8, "Member 'PerksList_C_ExecuteUbergraph_PerksList::K2Node_Event_PerkWidget' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, K2Node_DynamicCast_AsPerk_Widget_New) == 0x0000F0, "Member 'PerksList_C_ExecuteUbergraph_PerksList::K2Node_DynamicCast_AsPerk_Widget_New' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, K2Node_DynamicCast_bSuccess2) == 0x0000F8, "Member 'PerksList_C_ExecuteUbergraph_PerksList::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, CallFunc_IsPerkUnlocked_ReturnValue) == 0x0000F9, "Member 'PerksList_C_ExecuteUbergraph_PerksList::CallFunc_IsPerkUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, CallFunc_GetGrantedAbilityKit_ReturnValue) == 0x000100, "Member 'PerksList_C_ExecuteUbergraph_PerksList::CallFunc_GetGrantedAbilityKit_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, CallFunc_BP_GetGadgets_GadgetItemDefinitions) == 0x000108, "Member 'PerksList_C_ExecuteUbergraph_PerksList::CallFunc_BP_GetGadgets_GadgetItemDefinitions' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, CallFunc_IsValid_ReturnValue) == 0x000118, "Member 'PerksList_C_ExecuteUbergraph_PerksList::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, CallFunc_Array_Length_ReturnValue) == 0x00011C, "Member 'PerksList_C_ExecuteUbergraph_PerksList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, CallFunc_Greater_IntInt_ReturnValue) == 0x000120, "Member 'PerksList_C_ExecuteUbergraph_PerksList::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, CallFunc_HasAnyChildren_ReturnValue) == 0x000121, "Member 'PerksList_C_ExecuteUbergraph_PerksList::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, CallFunc_HasAnyChildren_ReturnValue2) == 0x000122, "Member 'PerksList_C_ExecuteUbergraph_PerksList::CallFunc_HasAnyChildren_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, Temp_byte_Variable3) == 0x000123, "Member 'PerksList_C_ExecuteUbergraph_PerksList::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, CallFunc_Create_ReturnValue) == 0x000128, "Member 'PerksList_C_ExecuteUbergraph_PerksList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, CallFunc_Greater_IntInt_ReturnValue2) == 0x000130, "Member 'PerksList_C_ExecuteUbergraph_PerksList::CallFunc_Greater_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, CallFunc_AddChild_ReturnValue2) == 0x000138, "Member 'PerksList_C_ExecuteUbergraph_PerksList::CallFunc_AddChild_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, CallFunc_Add_IntInt_ReturnValue) == 0x000140, "Member 'PerksList_C_ExecuteUbergraph_PerksList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, Temp_byte_Variable4) == 0x000144, "Member 'PerksList_C_ExecuteUbergraph_PerksList::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000148, "Member 'PerksList_C_ExecuteUbergraph_PerksList::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, CallFunc_HasAnyChildren_ReturnValue3) == 0x000150, "Member 'PerksList_C_ExecuteUbergraph_PerksList::CallFunc_HasAnyChildren_ReturnValue3' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, CallFunc_HasAnyChildren_ReturnValue4) == 0x000151, "Member 'PerksList_C_ExecuteUbergraph_PerksList::CallFunc_HasAnyChildren_ReturnValue4' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, K2Node_Select_Default) == 0x000152, "Member 'PerksList_C_ExecuteUbergraph_PerksList::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, Temp_bool_Variable2) == 0x000153, "Member 'PerksList_C_ExecuteUbergraph_PerksList::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, Temp_byte_Variable5) == 0x000154, "Member 'PerksList_C_ExecuteUbergraph_PerksList::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, K2Node_Select2_Default) == 0x000155, "Member 'PerksList_C_ExecuteUbergraph_PerksList::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, Temp_byte_Variable6) == 0x000156, "Member 'PerksList_C_ExecuteUbergraph_PerksList::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, Temp_bool_Variable3) == 0x000157, "Member 'PerksList_C_ExecuteUbergraph_PerksList::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, Temp_byte_Variable7) == 0x000158, "Member 'PerksList_C_ExecuteUbergraph_PerksList::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, K2Node_Select3_Default) == 0x000159, "Member 'PerksList_C_ExecuteUbergraph_PerksList::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, Temp_byte_Variable8) == 0x00015A, "Member 'PerksList_C_ExecuteUbergraph_PerksList::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, Temp_bool_Variable4) == 0x00015B, "Member 'PerksList_C_ExecuteUbergraph_PerksList::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, Temp_byte_Variable9) == 0x00015C, "Member 'PerksList_C_ExecuteUbergraph_PerksList::Temp_byte_Variable9' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, K2Node_Select4_Default) == 0x00015D, "Member 'PerksList_C_ExecuteUbergraph_PerksList::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, Temp_byte_Variable10) == 0x00015E, "Member 'PerksList_C_ExecuteUbergraph_PerksList::Temp_byte_Variable10' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, Temp_bool_Variable5) == 0x00015F, "Member 'PerksList_C_ExecuteUbergraph_PerksList::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, CallFunc_AddChildToVerticalBox_ReturnValue2) == 0x000160, "Member 'PerksList_C_ExecuteUbergraph_PerksList::CallFunc_AddChildToVerticalBox_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, K2Node_Select5_Default) == 0x000168, "Member 'PerksList_C_ExecuteUbergraph_PerksList::K2Node_Select5_Default' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, Temp_byte_Variable11) == 0x000169, "Member 'PerksList_C_ExecuteUbergraph_PerksList::Temp_byte_Variable11' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, Temp_byte_Variable12) == 0x00016A, "Member 'PerksList_C_ExecuteUbergraph_PerksList::Temp_byte_Variable12' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, CallFunc_AddChildToVerticalBox_ReturnValue3) == 0x000170, "Member 'PerksList_C_ExecuteUbergraph_PerksList::CallFunc_AddChildToVerticalBox_ReturnValue3' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, Temp_bool_Variable6) == 0x000178, "Member 'PerksList_C_ExecuteUbergraph_PerksList::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, CallFunc_AddChildToVerticalBox_ReturnValue4) == 0x000180, "Member 'PerksList_C_ExecuteUbergraph_PerksList::CallFunc_AddChildToVerticalBox_ReturnValue4' has a wrong offset!");
static_assert(offsetof(PerksList_C_ExecuteUbergraph_PerksList, K2Node_Select6_Default) == 0x000188, "Member 'PerksList_C_ExecuteUbergraph_PerksList::K2Node_Select6_Default' has a wrong offset!");

// Function PerksList.PerksList_C.OnGeneratePerk
// 0x00A0 (0x00A0 - 0x0000)
struct PerksList_C_OnGeneratePerk final
{
public:
	struct FFortUIPerk                            FortPerk;                                          // 0x0000(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UFortPerkWidget_NUI*                    PerkWidget;                                        // 0x0098(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerksList_C_OnGeneratePerk) == 0x000008, "Wrong alignment on PerksList_C_OnGeneratePerk");
static_assert(sizeof(PerksList_C_OnGeneratePerk) == 0x0000A0, "Wrong size on PerksList_C_OnGeneratePerk");
static_assert(offsetof(PerksList_C_OnGeneratePerk, FortPerk) == 0x000000, "Member 'PerksList_C_OnGeneratePerk::FortPerk' has a wrong offset!");
static_assert(offsetof(PerksList_C_OnGeneratePerk, PerkWidget) == 0x000098, "Member 'PerksList_C_OnGeneratePerk::PerkWidget' has a wrong offset!");

// Function PerksList.PerksList_C.OnGeneratePerkTier
// 0x0028 (0x0028 - 0x0000)
struct PerksList_C_OnGeneratePerkTier final
{
public:
	struct FFortUIPerkTier                        FortPerkTier;                                      // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UFortPerkTierWidget_NUI*                PerkTierWidget;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerksList_C_OnGeneratePerkTier) == 0x000008, "Wrong alignment on PerksList_C_OnGeneratePerkTier");
static_assert(sizeof(PerksList_C_OnGeneratePerkTier) == 0x000028, "Wrong size on PerksList_C_OnGeneratePerkTier");
static_assert(offsetof(PerksList_C_OnGeneratePerkTier, FortPerkTier) == 0x000000, "Member 'PerksList_C_OnGeneratePerkTier::FortPerkTier' has a wrong offset!");
static_assert(offsetof(PerksList_C_OnGeneratePerkTier, PerkTierWidget) == 0x000020, "Member 'PerksList_C_OnGeneratePerkTier::PerkTierWidget' has a wrong offset!");

}

