#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerkWidgetNew

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "TooltipStat_structs.hpp"


namespace SDK::Params
{

// Function PerkWidgetNew.PerkWidgetNew_C.ExecuteUbergraph_PerkWidgetNew
// 0x00D8 (0x00D8 - 0x0000)
struct PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPerkHighlighted_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0010(0x0078)()
	bool                                          CallFunc_ShouldFadePerk_Result;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x008C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAbility_ReturnValue;                   // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable2;                             // 0x00A0(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable5;                               // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select3_Default;                            // 0x00B4(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select4_Default;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select5_Default;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew) == 0x000008, "Wrong alignment on PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew");
static_assert(sizeof(PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew) == 0x0000D8, "Wrong size on PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew");
static_assert(offsetof(PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew, EntryPoint) == 0x000000, "Member 'PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew::EntryPoint' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew, CallFunc_IsPerkHighlighted_ReturnValue) == 0x000004, "Member 'PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew::CallFunc_IsPerkHighlighted_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew, Temp_bool_Variable) == 0x000005, "Member 'PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew, Temp_byte_Variable) == 0x000006, "Member 'PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew, Temp_byte_Variable2) == 0x000007, "Member 'PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew, Temp_bool_Variable2) == 0x000008, "Member 'PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew, Temp_bool_Variable3) == 0x000009, "Member 'PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew, Temp_bool_Variable4) == 0x00000A, "Member 'PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew, Temp_byte_Variable3) == 0x00000B, "Member 'PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew, Temp_byte_Variable4) == 0x00000C, "Member 'PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew, K2Node_Event_IsDesignTime) == 0x00000D, "Member 'PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew, K2Node_Select_Default) == 0x00000E, "Member 'PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew, K2Node_MakeStruct_SlateBrush) == 0x000010, "Member 'PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew, CallFunc_ShouldFadePerk_Result) == 0x000088, "Member 'PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew::CallFunc_ShouldFadePerk_Result' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew, Temp_struct_Variable) == 0x00008C, "Member 'PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew, K2Node_Select2_Default) == 0x00009C, "Member 'PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew, CallFunc_HasAbility_ReturnValue) == 0x00009D, "Member 'PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew::CallFunc_HasAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew, Temp_struct_Variable2) == 0x0000A0, "Member 'PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew, Temp_bool_Variable5) == 0x0000B0, "Member 'PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew, K2Node_Select3_Default) == 0x0000B4, "Member 'PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew, K2Node_Select4_Default) == 0x0000C8, "Member 'PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew, K2Node_Select5_Default) == 0x0000D0, "Member 'PerkWidgetNew_C_ExecuteUbergraph_PerkWidgetNew::K2Node_Select5_Default' has a wrong offset!");

// Function PerkWidgetNew.PerkWidgetNew_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct PerkWidgetNew_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PerkWidgetNew_C_PreConstruct) == 0x000001, "Wrong alignment on PerkWidgetNew_C_PreConstruct");
static_assert(sizeof(PerkWidgetNew_C_PreConstruct) == 0x000001, "Wrong size on PerkWidgetNew_C_PreConstruct");
static_assert(offsetof(PerkWidgetNew_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'PerkWidgetNew_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function PerkWidgetNew.PerkWidgetNew_C.InitializeBasicPerk
// 0x0178 (0x0178 - 0x0000)
struct PerkWidgetNew_C_InitializeBasicPerk final
{
public:
	struct FSlateBrush                            CallFunc_NoResourceBrush_ReturnValue;              // 0x0000(0x0078)()
	bool                                          Temp_bool_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_GetIcon_Brush;                            // 0x0080(0x0078)()
	bool                                          CallFunc_GetIcon_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_Select_Default;                             // 0x0100(0x0078)()
};
static_assert(alignof(PerkWidgetNew_C_InitializeBasicPerk) == 0x000008, "Wrong alignment on PerkWidgetNew_C_InitializeBasicPerk");
static_assert(sizeof(PerkWidgetNew_C_InitializeBasicPerk) == 0x000178, "Wrong size on PerkWidgetNew_C_InitializeBasicPerk");
static_assert(offsetof(PerkWidgetNew_C_InitializeBasicPerk, CallFunc_NoResourceBrush_ReturnValue) == 0x000000, "Member 'PerkWidgetNew_C_InitializeBasicPerk::CallFunc_NoResourceBrush_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_InitializeBasicPerk, Temp_bool_Variable) == 0x000078, "Member 'PerkWidgetNew_C_InitializeBasicPerk::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_InitializeBasicPerk, CallFunc_GetIcon_Brush) == 0x000080, "Member 'PerkWidgetNew_C_InitializeBasicPerk::CallFunc_GetIcon_Brush' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_InitializeBasicPerk, CallFunc_GetIcon_ReturnValue) == 0x0000F8, "Member 'PerkWidgetNew_C_InitializeBasicPerk::CallFunc_GetIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_InitializeBasicPerk, K2Node_Select_Default) == 0x000100, "Member 'PerkWidgetNew_C_InitializeBasicPerk::K2Node_Select_Default' has a wrong offset!");

// Function PerkWidgetNew.PerkWidgetNew_C.InitializeAbilityPerk
// 0x0178 (0x0178 - 0x0000)
struct PerkWidgetNew_C_InitializeAbilityPerk final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0008(0x0078)()
	struct FSlateBrush                            CallFunc_GetIcon_Brush;                            // 0x0080(0x0078)()
	bool                                          CallFunc_GetIcon_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_Select_Default;                             // 0x0100(0x0078)()
};
static_assert(alignof(PerkWidgetNew_C_InitializeAbilityPerk) == 0x000008, "Wrong alignment on PerkWidgetNew_C_InitializeAbilityPerk");
static_assert(sizeof(PerkWidgetNew_C_InitializeAbilityPerk) == 0x000178, "Wrong size on PerkWidgetNew_C_InitializeAbilityPerk");
static_assert(offsetof(PerkWidgetNew_C_InitializeAbilityPerk, Temp_bool_Variable) == 0x000000, "Member 'PerkWidgetNew_C_InitializeAbilityPerk::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_InitializeAbilityPerk, K2Node_MakeStruct_SlateBrush) == 0x000008, "Member 'PerkWidgetNew_C_InitializeAbilityPerk::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_InitializeAbilityPerk, CallFunc_GetIcon_Brush) == 0x000080, "Member 'PerkWidgetNew_C_InitializeAbilityPerk::CallFunc_GetIcon_Brush' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_InitializeAbilityPerk, CallFunc_GetIcon_ReturnValue) == 0x0000F8, "Member 'PerkWidgetNew_C_InitializeAbilityPerk::CallFunc_GetIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_InitializeAbilityPerk, K2Node_Select_Default) == 0x000100, "Member 'PerkWidgetNew_C_InitializeAbilityPerk::K2Node_Select_Default' has a wrong offset!");

// Function PerkWidgetNew.PerkWidgetNew_C.GetTierAbilityBrush
// 0x0160 (0x0160 - 0x0000)
struct PerkWidgetNew_C_GetTierAbilityBrush final
{
public:
	struct FSlateBrush                            SlateBrush;                                        // 0x0000(0x0078)(Parm, OutParm)
	EFortItemTier                                 Temp_byte_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable2;                             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable3;                             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable4;                             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable5;                             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable6;                             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable7;                             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable8;                             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable9;                             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable10;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable11;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemTier                                 CallFunc_GetPerkTier_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Select_Default;                             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x00E8(0x0078)()
};
static_assert(alignof(PerkWidgetNew_C_GetTierAbilityBrush) == 0x000008, "Wrong alignment on PerkWidgetNew_C_GetTierAbilityBrush");
static_assert(sizeof(PerkWidgetNew_C_GetTierAbilityBrush) == 0x000160, "Wrong size on PerkWidgetNew_C_GetTierAbilityBrush");
static_assert(offsetof(PerkWidgetNew_C_GetTierAbilityBrush, SlateBrush) == 0x000000, "Member 'PerkWidgetNew_C_GetTierAbilityBrush::SlateBrush' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetTierAbilityBrush, Temp_byte_Variable) == 0x000078, "Member 'PerkWidgetNew_C_GetTierAbilityBrush::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetTierAbilityBrush, Temp_object_Variable) == 0x000080, "Member 'PerkWidgetNew_C_GetTierAbilityBrush::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetTierAbilityBrush, Temp_object_Variable2) == 0x000088, "Member 'PerkWidgetNew_C_GetTierAbilityBrush::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetTierAbilityBrush, Temp_object_Variable3) == 0x000090, "Member 'PerkWidgetNew_C_GetTierAbilityBrush::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetTierAbilityBrush, Temp_object_Variable4) == 0x000098, "Member 'PerkWidgetNew_C_GetTierAbilityBrush::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetTierAbilityBrush, Temp_object_Variable5) == 0x0000A0, "Member 'PerkWidgetNew_C_GetTierAbilityBrush::Temp_object_Variable5' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetTierAbilityBrush, Temp_object_Variable6) == 0x0000A8, "Member 'PerkWidgetNew_C_GetTierAbilityBrush::Temp_object_Variable6' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetTierAbilityBrush, Temp_object_Variable7) == 0x0000B0, "Member 'PerkWidgetNew_C_GetTierAbilityBrush::Temp_object_Variable7' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetTierAbilityBrush, Temp_object_Variable8) == 0x0000B8, "Member 'PerkWidgetNew_C_GetTierAbilityBrush::Temp_object_Variable8' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetTierAbilityBrush, Temp_object_Variable9) == 0x0000C0, "Member 'PerkWidgetNew_C_GetTierAbilityBrush::Temp_object_Variable9' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetTierAbilityBrush, Temp_object_Variable10) == 0x0000C8, "Member 'PerkWidgetNew_C_GetTierAbilityBrush::Temp_object_Variable10' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetTierAbilityBrush, Temp_object_Variable11) == 0x0000D0, "Member 'PerkWidgetNew_C_GetTierAbilityBrush::Temp_object_Variable11' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetTierAbilityBrush, CallFunc_GetPerkTier_ReturnValue) == 0x0000D8, "Member 'PerkWidgetNew_C_GetTierAbilityBrush::CallFunc_GetPerkTier_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetTierAbilityBrush, K2Node_Select_Default) == 0x0000E0, "Member 'PerkWidgetNew_C_GetTierAbilityBrush::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetTierAbilityBrush, K2Node_MakeStruct_SlateBrush) == 0x0000E8, "Member 'PerkWidgetNew_C_GetTierAbilityBrush::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

// Function PerkWidgetNew.PerkWidgetNew_C.GetHighlightColor
// 0x0048 (0x0048 - 0x0000)
struct PerkWidgetNew_C_GetHighlightColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0014(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Get_Buff_Color_Color;                     // 0x0024(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPerkHighlighted_ReturnValue;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0038(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerkWidgetNew_C_GetHighlightColor) == 0x000004, "Wrong alignment on PerkWidgetNew_C_GetHighlightColor");
static_assert(sizeof(PerkWidgetNew_C_GetHighlightColor) == 0x000048, "Wrong size on PerkWidgetNew_C_GetHighlightColor");
static_assert(offsetof(PerkWidgetNew_C_GetHighlightColor, Color) == 0x000000, "Member 'PerkWidgetNew_C_GetHighlightColor::Color' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetHighlightColor, Temp_bool_Variable) == 0x000010, "Member 'PerkWidgetNew_C_GetHighlightColor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetHighlightColor, Temp_struct_Variable) == 0x000014, "Member 'PerkWidgetNew_C_GetHighlightColor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetHighlightColor, CallFunc_Get_Buff_Color_Color) == 0x000024, "Member 'PerkWidgetNew_C_GetHighlightColor::CallFunc_Get_Buff_Color_Color' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetHighlightColor, CallFunc_IsPerkHighlighted_ReturnValue) == 0x000034, "Member 'PerkWidgetNew_C_GetHighlightColor::CallFunc_IsPerkHighlighted_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetHighlightColor, K2Node_Select_Default) == 0x000038, "Member 'PerkWidgetNew_C_GetHighlightColor::K2Node_Select_Default' has a wrong offset!");

// Function PerkWidgetNew.PerkWidgetNew_C.ShouldFadePerk
// 0x0006 (0x0006 - 0x0000)
struct PerkWidgetNew_C_ShouldFadePerk final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPerkHighlighted_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPerkUnlocked_ReturnValue;               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PerkWidgetNew_C_ShouldFadePerk) == 0x000001, "Wrong alignment on PerkWidgetNew_C_ShouldFadePerk");
static_assert(sizeof(PerkWidgetNew_C_ShouldFadePerk) == 0x000006, "Wrong size on PerkWidgetNew_C_ShouldFadePerk");
static_assert(offsetof(PerkWidgetNew_C_ShouldFadePerk, Result) == 0x000000, "Member 'PerkWidgetNew_C_ShouldFadePerk::Result' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_ShouldFadePerk, CallFunc_IsPerkHighlighted_ReturnValue) == 0x000001, "Member 'PerkWidgetNew_C_ShouldFadePerk::CallFunc_IsPerkHighlighted_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_ShouldFadePerk, CallFunc_IsPerkUnlocked_ReturnValue) == 0x000002, "Member 'PerkWidgetNew_C_ShouldFadePerk::CallFunc_IsPerkUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_ShouldFadePerk, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'PerkWidgetNew_C_ShouldFadePerk::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_ShouldFadePerk, CallFunc_Not_PreBool_ReturnValue2) == 0x000004, "Member 'PerkWidgetNew_C_ShouldFadePerk::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_ShouldFadePerk, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'PerkWidgetNew_C_ShouldFadePerk::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function PerkWidgetNew.PerkWidgetNew_C.InitializeText
// 0x0058 (0x0058 - 0x0000)
struct PerkWidgetNew_C_InitializeText final
{
public:
	class FString                                 DescriptionText;                                   // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCombinedTooltipDescription_ReturnValue; // 0x0010(0x0018)()
	TScriptInterface<class IFortClientAnnouncement_TutorialInterface> K2Node_DynamicCast_AsFort_Client_Announcement_Tutorial_Interface; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetTooltipTitle_ReturnValue;              // 0x0040(0x0018)()
};
static_assert(alignof(PerkWidgetNew_C_InitializeText) == 0x000008, "Wrong alignment on PerkWidgetNew_C_InitializeText");
static_assert(sizeof(PerkWidgetNew_C_InitializeText) == 0x000058, "Wrong size on PerkWidgetNew_C_InitializeText");
static_assert(offsetof(PerkWidgetNew_C_InitializeText, DescriptionText) == 0x000000, "Member 'PerkWidgetNew_C_InitializeText::DescriptionText' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_InitializeText, CallFunc_GetCombinedTooltipDescription_ReturnValue) == 0x000010, "Member 'PerkWidgetNew_C_InitializeText::CallFunc_GetCombinedTooltipDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_InitializeText, K2Node_DynamicCast_AsFort_Client_Announcement_Tutorial_Interface) == 0x000028, "Member 'PerkWidgetNew_C_InitializeText::K2Node_DynamicCast_AsFort_Client_Announcement_Tutorial_Interface' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_InitializeText, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'PerkWidgetNew_C_InitializeText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_InitializeText, CallFunc_GetTooltipTitle_ReturnValue) == 0x000040, "Member 'PerkWidgetNew_C_InitializeText::CallFunc_GetTooltipTitle_ReturnValue' has a wrong offset!");

// Function PerkWidgetNew.PerkWidgetNew_C.InitializeHeroBonusIcon
// 0x00B0 (0x00B0 - 0x0000)
struct PerkWidgetNew_C_InitializeHeroBonusIcon final
{
public:
	EFortSupportBonusType                         SupportPerkType;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortSupportBonusType                         Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable2;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable3;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortSupportBonusType                         CallFunc_GetSupportBonusType_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0030(0x0078)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PerkWidgetNew_C_InitializeHeroBonusIcon) == 0x000008, "Wrong alignment on PerkWidgetNew_C_InitializeHeroBonusIcon");
static_assert(sizeof(PerkWidgetNew_C_InitializeHeroBonusIcon) == 0x0000B0, "Wrong size on PerkWidgetNew_C_InitializeHeroBonusIcon");
static_assert(offsetof(PerkWidgetNew_C_InitializeHeroBonusIcon, SupportPerkType) == 0x000000, "Member 'PerkWidgetNew_C_InitializeHeroBonusIcon::SupportPerkType' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_InitializeHeroBonusIcon, Temp_byte_Variable) == 0x000001, "Member 'PerkWidgetNew_C_InitializeHeroBonusIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_InitializeHeroBonusIcon, Temp_object_Variable) == 0x000008, "Member 'PerkWidgetNew_C_InitializeHeroBonusIcon::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_InitializeHeroBonusIcon, Temp_object_Variable2) == 0x000010, "Member 'PerkWidgetNew_C_InitializeHeroBonusIcon::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_InitializeHeroBonusIcon, Temp_object_Variable3) == 0x000018, "Member 'PerkWidgetNew_C_InitializeHeroBonusIcon::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_InitializeHeroBonusIcon, CallFunc_GetSupportBonusType_ReturnValue) == 0x000020, "Member 'PerkWidgetNew_C_InitializeHeroBonusIcon::CallFunc_GetSupportBonusType_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_InitializeHeroBonusIcon, K2Node_Select_Default) == 0x000028, "Member 'PerkWidgetNew_C_InitializeHeroBonusIcon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_InitializeHeroBonusIcon, K2Node_MakeStruct_SlateBrush) == 0x000030, "Member 'PerkWidgetNew_C_InitializeHeroBonusIcon::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_InitializeHeroBonusIcon, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000A8, "Member 'PerkWidgetNew_C_InitializeHeroBonusIcon::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function PerkWidgetNew.PerkWidgetNew_C.SetupBadge
// 0x00A0 (0x00A0 - 0x0000)
struct PerkWidgetNew_C_SetupBadge final
{
public:
	EFortSupportBonusType                         SupportPerkType;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_GetTierAbilityBrush_SlateBrush;           // 0x0008(0x0078)()
	bool                                          CallFunc_IsTierPerk_ReturnValue;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRequiredLevel_ReturnValue;             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0088(0x0018)()
};
static_assert(alignof(PerkWidgetNew_C_SetupBadge) == 0x000008, "Wrong alignment on PerkWidgetNew_C_SetupBadge");
static_assert(sizeof(PerkWidgetNew_C_SetupBadge) == 0x0000A0, "Wrong size on PerkWidgetNew_C_SetupBadge");
static_assert(offsetof(PerkWidgetNew_C_SetupBadge, SupportPerkType) == 0x000000, "Member 'PerkWidgetNew_C_SetupBadge::SupportPerkType' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_SetupBadge, CallFunc_GetTierAbilityBrush_SlateBrush) == 0x000008, "Member 'PerkWidgetNew_C_SetupBadge::CallFunc_GetTierAbilityBrush_SlateBrush' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_SetupBadge, CallFunc_IsTierPerk_ReturnValue) == 0x000080, "Member 'PerkWidgetNew_C_SetupBadge::CallFunc_IsTierPerk_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_SetupBadge, CallFunc_GetRequiredLevel_ReturnValue) == 0x000084, "Member 'PerkWidgetNew_C_SetupBadge::CallFunc_GetRequiredLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_SetupBadge, CallFunc_Conv_IntToText_ReturnValue) == 0x000088, "Member 'PerkWidgetNew_C_SetupBadge::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function PerkWidgetNew.PerkWidgetNew_C.GetPerkStat
// 0x0258 (0x0258 - 0x0000)
struct PerkWidgetNew_C_GetPerkStat final
{
public:
	struct FTooltipStat                           TooltipStat;                                       // 0x0000(0x0038)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemTier                                 CallFunc_GetPerkTier_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetTooltipTitle_ReturnValue;              // 0x0040(0x0018)()
	bool                                          CallFunc_IsTierPerk_ReturnValue;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetTooltipTitle_ReturnValue2;             // 0x00A0(0x0018)()
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x00C0(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetTierText_ReturnValue;                  // 0x0100(0x0018)()
	int32                                         CallFunc_GetRequiredLevel_ReturnValue;             // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData3;             // 0x0120(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0160(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0178(0x0010)(ZeroConstructor, ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData4;             // 0x0188(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01C8(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array2;                           // 0x01E0(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue2;                      // 0x01F0(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0208(0x0018)()
	struct FTooltipStat                           K2Node_MakeStruct_TooltipStat;                     // 0x0220(0x0038)(HasGetValueTypeHash)
};
static_assert(alignof(PerkWidgetNew_C_GetPerkStat) == 0x000008, "Wrong alignment on PerkWidgetNew_C_GetPerkStat");
static_assert(sizeof(PerkWidgetNew_C_GetPerkStat) == 0x000258, "Wrong size on PerkWidgetNew_C_GetPerkStat");
static_assert(offsetof(PerkWidgetNew_C_GetPerkStat, TooltipStat) == 0x000000, "Member 'PerkWidgetNew_C_GetPerkStat::TooltipStat' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetPerkStat, Temp_bool_Variable) == 0x000038, "Member 'PerkWidgetNew_C_GetPerkStat::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetPerkStat, CallFunc_GetPerkTier_ReturnValue) == 0x000039, "Member 'PerkWidgetNew_C_GetPerkStat::CallFunc_GetPerkTier_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetPerkStat, CallFunc_GetTooltipTitle_ReturnValue) == 0x000040, "Member 'PerkWidgetNew_C_GetPerkStat::CallFunc_GetTooltipTitle_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetPerkStat, CallFunc_IsTierPerk_ReturnValue) == 0x000058, "Member 'PerkWidgetNew_C_GetPerkStat::CallFunc_IsTierPerk_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetPerkStat, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'PerkWidgetNew_C_GetPerkStat::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetPerkStat, CallFunc_GetTooltipTitle_ReturnValue2) == 0x0000A0, "Member 'PerkWidgetNew_C_GetPerkStat::CallFunc_GetTooltipTitle_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetPerkStat, CallFunc_GetContext_ReturnValue) == 0x0000B8, "Member 'PerkWidgetNew_C_GetPerkStat::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetPerkStat, K2Node_MakeStruct_FormatArgumentData2) == 0x0000C0, "Member 'PerkWidgetNew_C_GetPerkStat::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetPerkStat, CallFunc_GetTierText_ReturnValue) == 0x000100, "Member 'PerkWidgetNew_C_GetPerkStat::CallFunc_GetTierText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetPerkStat, CallFunc_GetRequiredLevel_ReturnValue) == 0x000118, "Member 'PerkWidgetNew_C_GetPerkStat::CallFunc_GetRequiredLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetPerkStat, K2Node_MakeStruct_FormatArgumentData3) == 0x000120, "Member 'PerkWidgetNew_C_GetPerkStat::K2Node_MakeStruct_FormatArgumentData3' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetPerkStat, CallFunc_Conv_IntToText_ReturnValue) == 0x000160, "Member 'PerkWidgetNew_C_GetPerkStat::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetPerkStat, K2Node_MakeArray_Array) == 0x000178, "Member 'PerkWidgetNew_C_GetPerkStat::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetPerkStat, K2Node_MakeStruct_FormatArgumentData4) == 0x000188, "Member 'PerkWidgetNew_C_GetPerkStat::K2Node_MakeStruct_FormatArgumentData4' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetPerkStat, CallFunc_Format_ReturnValue) == 0x0001C8, "Member 'PerkWidgetNew_C_GetPerkStat::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetPerkStat, K2Node_MakeArray_Array2) == 0x0001E0, "Member 'PerkWidgetNew_C_GetPerkStat::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetPerkStat, CallFunc_Format_ReturnValue2) == 0x0001F0, "Member 'PerkWidgetNew_C_GetPerkStat::CallFunc_Format_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetPerkStat, K2Node_Select_Default) == 0x000208, "Member 'PerkWidgetNew_C_GetPerkStat::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_GetPerkStat, K2Node_MakeStruct_TooltipStat) == 0x000220, "Member 'PerkWidgetNew_C_GetPerkStat::K2Node_MakeStruct_TooltipStat' has a wrong offset!");

// Function PerkWidgetNew.PerkWidgetNew_C.HighlightBadge
// 0x0048 (0x0048 - 0x0000)
struct PerkWidgetNew_C_HighlightBadge final
{
public:
	struct FLinearColor                           CallFunc_GetHighlightColor_Color;                  // 0x0000(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetHighlightColor_Color2;                 // 0x0010(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0020(0x0028)()
};
static_assert(alignof(PerkWidgetNew_C_HighlightBadge) == 0x000008, "Wrong alignment on PerkWidgetNew_C_HighlightBadge");
static_assert(sizeof(PerkWidgetNew_C_HighlightBadge) == 0x000048, "Wrong size on PerkWidgetNew_C_HighlightBadge");
static_assert(offsetof(PerkWidgetNew_C_HighlightBadge, CallFunc_GetHighlightColor_Color) == 0x000000, "Member 'PerkWidgetNew_C_HighlightBadge::CallFunc_GetHighlightColor_Color' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_HighlightBadge, CallFunc_GetHighlightColor_Color2) == 0x000010, "Member 'PerkWidgetNew_C_HighlightBadge::CallFunc_GetHighlightColor_Color2' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_HighlightBadge, K2Node_MakeStruct_SlateColor) == 0x000020, "Member 'PerkWidgetNew_C_HighlightBadge::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function PerkWidgetNew.PerkWidgetNew_C.InitializeSettings
// 0x00A8 (0x00A8 - 0x0000)
struct PerkWidgetNew_C_InitializeSettings final
{
public:
	bool                                          Param_bIncludeName;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Param_bIncludeDescription;                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortBrushSize                                Param_IconSize;                                    // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_bUseLargeFormatName;                         // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortUIPerk                            Param_Perk;                                        // 0x0008(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          ShowMouseTooltips;                                 // 0x00A0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PerkWidgetNew_C_InitializeSettings) == 0x000008, "Wrong alignment on PerkWidgetNew_C_InitializeSettings");
static_assert(sizeof(PerkWidgetNew_C_InitializeSettings) == 0x0000A8, "Wrong size on PerkWidgetNew_C_InitializeSettings");
static_assert(offsetof(PerkWidgetNew_C_InitializeSettings, Param_bIncludeName) == 0x000000, "Member 'PerkWidgetNew_C_InitializeSettings::Param_bIncludeName' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_InitializeSettings, Param_bIncludeDescription) == 0x000001, "Member 'PerkWidgetNew_C_InitializeSettings::Param_bIncludeDescription' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_InitializeSettings, Param_IconSize) == 0x000002, "Member 'PerkWidgetNew_C_InitializeSettings::Param_IconSize' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_InitializeSettings, Param_bUseLargeFormatName) == 0x000003, "Member 'PerkWidgetNew_C_InitializeSettings::Param_bUseLargeFormatName' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_InitializeSettings, Param_Perk) == 0x000008, "Member 'PerkWidgetNew_C_InitializeSettings::Param_Perk' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_InitializeSettings, ShowMouseTooltips) == 0x0000A0, "Member 'PerkWidgetNew_C_InitializeSettings::ShowMouseTooltips' has a wrong offset!");

// Function PerkWidgetNew.PerkWidgetNew_C.Get_OverlayAbilityPerk_ToolTipWidget
// 0x0058 (0x0058 - 0x0000)
struct PerkWidgetNew_C_Get_OverlayAbilityPerk_ToolTipWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetTooltipTitle_ReturnValue;              // 0x0008(0x0018)()
	class FText                                   CallFunc_GetCombinedTooltipDescription_ReturnValue; // 0x0020(0x0018)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_Basic_Tooltip_Output;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PerkWidgetNew_C_Get_OverlayAbilityPerk_ToolTipWidget) == 0x000008, "Wrong alignment on PerkWidgetNew_C_Get_OverlayAbilityPerk_ToolTipWidget");
static_assert(sizeof(PerkWidgetNew_C_Get_OverlayAbilityPerk_ToolTipWidget) == 0x000058, "Wrong size on PerkWidgetNew_C_Get_OverlayAbilityPerk_ToolTipWidget");
static_assert(offsetof(PerkWidgetNew_C_Get_OverlayAbilityPerk_ToolTipWidget, ReturnValue) == 0x000000, "Member 'PerkWidgetNew_C_Get_OverlayAbilityPerk_ToolTipWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkWidgetNew_C_Get_OverlayAbilityPerk_ToolTipWidget, CallFunc_GetTooltipTitle_ReturnValue) == 0x000008, "Member 'PerkWidgetNew_C_Get_OverlayAbilityPerk_ToolTipWidget::CallFunc_GetTooltipTitle_ReturnValue' has a wrong offset!");
