#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerChoiceButtonWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerChoiceButtonWidget.PlayerChoiceButtonWidget_C
// 0x0020 (0x0780 - 0x0760)
class UPlayerChoiceButtonWidget_C final : public UFortBaseButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0760(0x0008)(Transient, DuplicateTransient)
	class ULegacyButtonIconText_C*                Button;                                            // 0x0768(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ChoiceID;                                          // 0x0770(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_774[0x4];                                      // 0x0774(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerChoiceWidget_C*                  Owner;                                             // 0x0778(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Button_K2Node_ComponentBoundEvent_98_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Param_Button);
	void ConfigureChoice(const struct FChoiceDataEntry& Choice, int32 Param_ChoiceID, class UPlayerChoiceWidget_C* Param_Owner);
	void ExecuteUbergraph_PlayerChoiceButtonWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerChoiceButtonWidget_C">();
	}
	static class UPlayerChoiceButtonWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerChoiceButtonWidget_C>();
	}
};
static_assert(alignof(UPlayerChoiceButtonWidget_C) == 0x000008, "Wrong alignment on UPlayerChoiceButtonWidget_C");
static_assert(sizeof(UPlayerChoiceButtonWidget_C) == 0x000780, "Wrong size on UPlayerChoiceButtonWidget_C");
static_assert(offsetof(UPlayerChoiceButtonWidget_C, UberGraphFrame) == 0x000760, "Member 'UPlayerChoiceButtonWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerChoiceButtonWidget_C, Button) == 0x000768, "Member 'UPlayerChoiceButtonWidget_C::Button' has a wrong offset!");
static_assert(offsetof(UPlayerChoiceButtonWidget_C, ChoiceID) == 0x000770, "Member 'UPlayerChoiceButtonWidget_C::ChoiceID' has a wrong offset!");
static_assert(offsetof(UPlayerChoiceButtonWidget_C, Owner) == 0x000778, "Member 'UPlayerChoiceButtonWidget_C::Owner' has a wrong offset!");

}

