#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerChoiceWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerChoiceWidget.PlayerChoiceWidget_C
// 0x00B0 (0x02C8 - 0x0218)
class UPlayerChoiceWidget_C final : public UFortUserChoiceWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0218(0x0008)(Transient, DuplicateTransient)
	class UBasicStrokeBox_C*                      BasicStrokeBox_26;                                 // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ChoicePanel;                                       // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DecriptionText;                                    // 0x0230(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_21;                                          // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollButtonPanel;                                 // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Choice1Text;                                       // 0x0248(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Choice2Text;                                       // 0x0260(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	UMulticastDelegateProperty_                   SurvivorStoryChoiceSelected;                       // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         SelectedChoice;                                    // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Choice3Text;                                       // 0x0290(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Description;                                       // 0x02A8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MenuID;                                            // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CompletedSuccessfully;                             // 0x02C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void SurvivorStoryChoiceSelected__DelegateSignature(int32 Param_SelectedChoice);
	void ExecuteUbergraph_PlayerChoiceWidget(int32 EntryPoint);
	void ChoiceSelected(int32 ChoiceID);
	void Construct();
	class UPlayerChoiceButtonWidget_C* CreateButtonAndSetText(const struct FChoiceDataEntry& ChoiceData, int32 ChoiceID);
	void Destruct();
	void Get_TextBlock_Choice1_Text_0();
	void Get_TextBlock_Choice2_Text_0();
	void Get_TextBlock_Choice3_Text_0();
	class FText GetText_0();
	void SetChoices(const struct FChoiceData& ChoiceItems);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerChoiceWidget_C">();
	}
	static class UPlayerChoiceWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerChoiceWidget_C>();
	}
};
static_assert(alignof(UPlayerChoiceWidget_C) == 0x000008, "Wrong alignment on UPlayerChoiceWidget_C");
static_assert(sizeof(UPlayerChoiceWidget_C) == 0x0002C8, "Wrong size on UPlayerChoiceWidget_C");
static_assert(offsetof(UPlayerChoiceWidget_C, UberGraphFrame) == 0x000218, "Member 'UPlayerChoiceWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPlayerChoiceWidget_C, BasicStrokeBox_26) == 0x000220, "Member 'UPlayerChoiceWidget_C::BasicStrokeBox_26' has a wrong offset!");
static_assert(offsetof(UPlayerChoiceWidget_C, ChoicePanel) == 0x000228, "Member 'UPlayerChoiceWidget_C::ChoicePanel' has a wrong offset!");
static_assert(offsetof(UPlayerChoiceWidget_C, DecriptionText) == 0x000230, "Member 'UPlayerChoiceWidget_C::DecriptionText' has a wrong offset!");
static_assert(offsetof(UPlayerChoiceWidget_C, Image_21) == 0x000238, "Member 'UPlayerChoiceWidget_C::Image_21' has a wrong offset!");
static_assert(offsetof(UPlayerChoiceWidget_C, ScrollButtonPanel) == 0x000240, "Member 'UPlayerChoiceWidget_C::ScrollButtonPanel' has a wrong offset!");
static_assert(offsetof(UPlayerChoiceWidget_C, Choice1Text) == 0x000248, "Member 'UPlayerChoiceWidget_C::Choice1Text' has a wrong offset!");
static_assert(offsetof(UPlayerChoiceWidget_C, Choice2Text) == 0x000260, "Member 'UPlayerChoiceWidget_C::Choice2Text' has a wrong offset!");
static_assert(offsetof(UPlayerChoiceWidget_C, SurvivorStoryChoiceSelected) == 0x000278, "Member 'UPlayerChoiceWidget_C::SurvivorStoryChoiceSelected' has a wrong offset!");
static_assert(offsetof(UPlayerChoiceWidget_C, SelectedChoice) == 0x000288, "Member 'UPlayerChoiceWidget_C::SelectedChoice' has a wrong offset!");
static_assert(offsetof(UPlayerChoiceWidget_C, Choice3Text) == 0x000290, "Member 'UPlayerChoiceWidget_C::Choice3Text' has a wrong offset!");
static_assert(offsetof(UPlayerChoiceWidget_C, Description) == 0x0002A8, "Member 'UPlayerChoiceWidget_C::Description' has a wrong offset!");
static_assert(offsetof(UPlayerChoiceWidget_C, MenuID) == 0x0002C0, "Member 'UPlayerChoiceWidget_C::MenuID' has a wrong offset!");
static_assert(offsetof(UPlayerChoiceWidget_C, CompletedSuccessfully) == 0x0002C4, "Member 'UPlayerChoiceWidget_C::CompletedSuccessfully' has a wrong offset!");

}

