#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PowerRequirement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PowerRequirement.PowerRequirement_C
// 0x0028 (0x0230 - 0x0208)
class UPowerRequirement_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UHorizontalBox*                         PowerRequirementHB;                                // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULegacyRatingWidget_C*                  RatingWidget;                                      // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         RecommendedPower;                                  // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RequiredPower;                                     // 0x022C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PowerRequirement(int32 EntryPoint);
	void PlayerInfoChanged(const struct FUniqueNetIdRepl& UniqueId);
	void Construct();
	void SetRequirements(int32 Param_RequiredPower, int32 Param_RecommendedPower);
	void Update();
	void SetUIForRecommended(int32 PartyPower);
	void SetUIForRequired(int32 PartyPower);
	class UWidget* GenerateToolTipWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PowerRequirement_C">();
	}
	static class UPowerRequirement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPowerRequirement_C>();
	}
};
static_assert(alignof(UPowerRequirement_C) == 0x000008, "Wrong alignment on UPowerRequirement_C");
static_assert(sizeof(UPowerRequirement_C) == 0x000230, "Wrong size on UPowerRequirement_C");
static_assert(offsetof(UPowerRequirement_C, UberGraphFrame) == 0x000208, "Member 'UPowerRequirement_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPowerRequirement_C, PowerRequirementHB) == 0x000210, "Member 'UPowerRequirement_C::PowerRequirementHB' has a wrong offset!");
static_assert(offsetof(UPowerRequirement_C, RatingWidget) == 0x000218, "Member 'UPowerRequirement_C::RatingWidget' has a wrong offset!");
static_assert(offsetof(UPowerRequirement_C, TextBlock) == 0x000220, "Member 'UPowerRequirement_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UPowerRequirement_C, RecommendedPower) == 0x000228, "Member 'UPowerRequirement_C::RecommendedPower' has a wrong offset!");
static_assert(offsetof(UPowerRequirement_C, RequiredPower) == 0x00022C, "Member 'UPowerRequirement_C::RequiredPower' has a wrong offset!");

}

