#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrimaryHeroActiveAbilitiesListDetailWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PrimaryHeroActiveAbilitiesListDetailWidget.PrimaryHeroActiveAbilitiesListDetailWidget_C
// 0x0018 (0x0298 - 0x0280)
class UPrimaryHeroActiveAbilitiesListDetailWidget_C final : public UFortSquadSlotItemDetailElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(Transient, DuplicateTransient)
	class UPerksList_C*                           PerksList;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          EnableMouseTooltips;                               // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          DisplayOutsideOfHeroSquad;                         // 0x0291(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_PrimaryHeroActiveAbilitiesListDetailWidget(int32 EntryPoint);
	void Construct();
	void HandlePostDifferentItemToDetailSet();
	void HandlePostDifferentSquadSlotSetBP();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PrimaryHeroActiveAbilitiesListDetailWidget_C">();
	}
	static class UPrimaryHeroActiveAbilitiesListDetailWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrimaryHeroActiveAbilitiesListDetailWidget_C>();
	}
};
static_assert(alignof(UPrimaryHeroActiveAbilitiesListDetailWidget_C) == 0x000008, "Wrong alignment on UPrimaryHeroActiveAbilitiesListDetailWidget_C");
static_assert(sizeof(UPrimaryHeroActiveAbilitiesListDetailWidget_C) == 0x000298, "Wrong size on UPrimaryHeroActiveAbilitiesListDetailWidget_C");
static_assert(offsetof(UPrimaryHeroActiveAbilitiesListDetailWidget_C, UberGraphFrame) == 0x000280, "Member 'UPrimaryHeroActiveAbilitiesListDetailWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPrimaryHeroActiveAbilitiesListDetailWidget_C, PerksList) == 0x000288, "Member 'UPrimaryHeroActiveAbilitiesListDetailWidget_C::PerksList' has a wrong offset!");
static_assert(offsetof(UPrimaryHeroActiveAbilitiesListDetailWidget_C, EnableMouseTooltips) == 0x000290, "Member 'UPrimaryHeroActiveAbilitiesListDetailWidget_C::EnableMouseTooltips' has a wrong offset!");
static_assert(offsetof(UPrimaryHeroActiveAbilitiesListDetailWidget_C, DisplayOutsideOfHeroSquad) == 0x000291, "Member 'UPrimaryHeroActiveAbilitiesListDetailWidget_C::DisplayOutsideOfHeroSquad' has a wrong offset!");

}

