#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProjectileHuskRanged

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ProjectileHuskRanged.ProjectileHuskRanged_C
// 0x0030 (0x0808 - 0x07D8)
class AProjectileHuskRanged_C final : public AFortProjectileBase
{
public:
	uint8                                         Pad_7D8[0x8];                                      // 0x07D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07E0(0x0008)(Transient, DuplicateTransient)
	class UAudioComponent*                        Ranged_Projectile_Sound;                           // 0x07E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ProjectileParticleSystem;                          // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 GoalActor;                                         // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Exploded;                                          // 0x0800(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ProjectileHuskRanged(int32 EntryPoint);
	void OnStoppedOnServer();
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void StopHoming();
	void ProjectileCheck();
	void ReceiveBeginPlay();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ProjectileHuskRanged_C">();
	}
	static class AProjectileHuskRanged_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProjectileHuskRanged_C>();
	}
};
static_assert(alignof(AProjectileHuskRanged_C) == 0x000008, "Wrong alignment on AProjectileHuskRanged_C");
static_assert(sizeof(AProjectileHuskRanged_C) == 0x000808, "Wrong size on AProjectileHuskRanged_C");
static_assert(offsetof(AProjectileHuskRanged_C, UberGraphFrame) == 0x0007E0, "Member 'AProjectileHuskRanged_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AProjectileHuskRanged_C, Ranged_Projectile_Sound) == 0x0007E8, "Member 'AProjectileHuskRanged_C::Ranged_Projectile_Sound' has a wrong offset!");
static_assert(offsetof(AProjectileHuskRanged_C, ProjectileParticleSystem) == 0x0007F0, "Member 'AProjectileHuskRanged_C::ProjectileParticleSystem' has a wrong offset!");
static_assert(offsetof(AProjectileHuskRanged_C, GoalActor) == 0x0007F8, "Member 'AProjectileHuskRanged_C::GoalActor' has a wrong offset!");
static_assert(offsetof(AProjectileHuskRanged_C, Exploded) == 0x000800, "Member 'AProjectileHuskRanged_C::Exploded' has a wrong offset!");

}

