#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestUpdateEntry

#include "Basic.hpp"

#include "DynamicQuestUpdateInfo_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function QuestUpdateEntry.QuestUpdateEntry_C.AllQuestUpdatesFinished__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct QuestUpdateEntry_C_AllQuestUpdatesFinished__DelegateSignature final
{
public:
	class UQuestUpdateEntry_C*                    UpdateWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestUpdateEntry_C_AllQuestUpdatesFinished__DelegateSignature) == 0x000008, "Wrong alignment on QuestUpdateEntry_C_AllQuestUpdatesFinished__DelegateSignature");
static_assert(sizeof(QuestUpdateEntry_C_AllQuestUpdatesFinished__DelegateSignature) == 0x000008, "Wrong size on QuestUpdateEntry_C_AllQuestUpdatesFinished__DelegateSignature");
static_assert(offsetof(QuestUpdateEntry_C_AllQuestUpdatesFinished__DelegateSignature, UpdateWidget) == 0x000000, "Member 'QuestUpdateEntry_C_AllQuestUpdatesFinished__DelegateSignature::UpdateWidget' has a wrong offset!");

// Function QuestUpdateEntry.QuestUpdateEntry_C.ExecuteUbergraph_QuestUpdateEntry
// 0x0108 (0x0108 - 0x0000)
struct QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_GetContentSlot_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBorderSlot*                            K2Node_DynamicCast_AsBorder_Slot;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0024(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDynamicQuestUpdateInfo                CallFunc_Array_Get_Item;                           // 0x0070(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_IsUpdateActive_Result;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuestObjectiveEntry_C*                 CallFunc_GetObjectiveWidget_ObjectiveWidget;       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDynamicQuestUpdateInfo                K2Node_MakeStruct_DynamicQuestUpdateInfo;          // 0x00B0(0x0020)(HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUpdateFinished_Result;                 // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x00F0(0x0010)(NoDestructor)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue2;       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry) == 0x000008, "Wrong alignment on QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry");
static_assert(sizeof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry) == 0x000108, "Wrong size on QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, EntryPoint) == 0x000000, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, CallFunc_GetContentSlot_ReturnValue) == 0x000008, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::CallFunc_GetContentSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, K2Node_DynamicCast_AsBorder_Slot) == 0x000010, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::K2Node_DynamicCast_AsBorder_Slot' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, K2Node_Event_MyGeometry) == 0x000024, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, K2Node_Event_InDeltaTime) == 0x00005C, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, Temp_int_Array_Index_Variable) == 0x000068, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, CallFunc_Array_Get_Item) == 0x000070, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, CallFunc_IsUpdateActive_Result) == 0x000090, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::CallFunc_IsUpdateActive_Result' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000094, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, CallFunc_GetObjectiveWidget_ObjectiveWidget) == 0x000098, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::CallFunc_GetObjectiveWidget_ObjectiveWidget' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, CallFunc_FMax_ReturnValue) == 0x0000A0, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, CallFunc_IsValid_ReturnValue) == 0x0000A4, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000A8, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x0000AC, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, K2Node_MakeStruct_DynamicQuestUpdateInfo) == 0x0000B0, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::K2Node_MakeStruct_DynamicQuestUpdateInfo' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000D0, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, CallFunc_HasUpdateFinished_Result) == 0x0000D4, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::CallFunc_HasUpdateFinished_Result' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x0000D8, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, CallFunc_Lerp_ReturnValue) == 0x0000DC, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, CallFunc_FTrunc_ReturnValue) == 0x0000E0, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x0000E8, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, K2Node_MakeStruct_Margin) == 0x0000F0, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry, CallFunc_SlotAsVerticalBoxSlot_ReturnValue2) == 0x000100, "Member 'QuestUpdateEntry_C_ExecuteUbergraph_QuestUpdateEntry::CallFunc_SlotAsVerticalBoxSlot_ReturnValue2' has a wrong offset!");

// Function QuestUpdateEntry.QuestUpdateEntry_C.Tick
// 0x003C (0x003C - 0x0000)
struct QuestUpdateEntry_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestUpdateEntry_C_Tick) == 0x000004, "Wrong alignment on QuestUpdateEntry_C_Tick");
static_assert(sizeof(QuestUpdateEntry_C_Tick) == 0x00003C, "Wrong size on QuestUpdateEntry_C_Tick");
static_assert(offsetof(QuestUpdateEntry_C_Tick, MyGeometry) == 0x000000, "Member 'QuestUpdateEntry_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_Tick, InDeltaTime) == 0x000038, "Member 'QuestUpdateEntry_C_Tick::InDeltaTime' has a wrong offset!");

// Function QuestUpdateEntry.QuestUpdateEntry_C.OnReceiveQuestUpdate
// 0x0070 (0x0070 - 0x0000)
struct QuestUpdateEntry_C_OnReceiveQuestUpdate final
{
public:
	struct FDynamicQuestUpdateInfo                QuestUpdateInfo;                                   // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsFirstUpdate;                                    // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItemDefinition*               CallFunc_GetQuestDefinitionBP_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAddUpdate_Result;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0038(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestUpdateEntry_C_OnReceiveQuestUpdate) == 0x000008, "Wrong alignment on QuestUpdateEntry_C_OnReceiveQuestUpdate");
static_assert(sizeof(QuestUpdateEntry_C_OnReceiveQuestUpdate) == 0x000070, "Wrong size on QuestUpdateEntry_C_OnReceiveQuestUpdate");
static_assert(offsetof(QuestUpdateEntry_C_OnReceiveQuestUpdate, QuestUpdateInfo) == 0x000000, "Member 'QuestUpdateEntry_C_OnReceiveQuestUpdate::QuestUpdateInfo' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_OnReceiveQuestUpdate, Success) == 0x000020, "Member 'QuestUpdateEntry_C_OnReceiveQuestUpdate::Success' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_OnReceiveQuestUpdate, bIsFirstUpdate) == 0x000021, "Member 'QuestUpdateEntry_C_OnReceiveQuestUpdate::bIsFirstUpdate' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_OnReceiveQuestUpdate, CallFunc_GetQuestDefinitionBP_ReturnValue) == 0x000028, "Member 'QuestUpdateEntry_C_OnReceiveQuestUpdate::CallFunc_GetQuestDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_OnReceiveQuestUpdate, CallFunc_CanAddUpdate_Result) == 0x000030, "Member 'QuestUpdateEntry_C_OnReceiveQuestUpdate::CallFunc_CanAddUpdate_Result' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_OnReceiveQuestUpdate, CallFunc_GetDisplayName_ReturnValue) == 0x000038, "Member 'QuestUpdateEntry_C_OnReceiveQuestUpdate::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_OnReceiveQuestUpdate, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'QuestUpdateEntry_C_OnReceiveQuestUpdate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_OnReceiveQuestUpdate, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'QuestUpdateEntry_C_OnReceiveQuestUpdate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_OnReceiveQuestUpdate, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000064, "Member 'QuestUpdateEntry_C_OnReceiveQuestUpdate::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_OnReceiveQuestUpdate, CallFunc_Array_Add_ReturnValue) == 0x000068, "Member 'QuestUpdateEntry_C_OnReceiveQuestUpdate::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function QuestUpdateEntry.QuestUpdateEntry_C.CanAddUpdate
// 0x0068 (0x0068 - 0x0000)
struct QuestUpdateEntry_C_CanAddUpdate final
{
public:
	struct FDynamicQuestUpdateInfo                UpdateToAdd;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bCanAddUpdate;                                     // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDynamicQuestUpdateInfo                CallFunc_Array_Get_Item;                           // 0x0040(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestUpdateEntry_C_CanAddUpdate) == 0x000008, "Wrong alignment on QuestUpdateEntry_C_CanAddUpdate");
static_assert(sizeof(QuestUpdateEntry_C_CanAddUpdate) == 0x000068, "Wrong size on QuestUpdateEntry_C_CanAddUpdate");
static_assert(offsetof(QuestUpdateEntry_C_CanAddUpdate, UpdateToAdd) == 0x000000, "Member 'QuestUpdateEntry_C_CanAddUpdate::UpdateToAdd' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanAddUpdate, Result) == 0x000020, "Member 'QuestUpdateEntry_C_CanAddUpdate::Result' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanAddUpdate, bCanAddUpdate) == 0x000021, "Member 'QuestUpdateEntry_C_CanAddUpdate::bCanAddUpdate' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanAddUpdate, Temp_bool_True_if_break_was_hit_Variable) == 0x000022, "Member 'QuestUpdateEntry_C_CanAddUpdate::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanAddUpdate, Temp_int_Array_Index_Variable) == 0x000024, "Member 'QuestUpdateEntry_C_CanAddUpdate::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanAddUpdate, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'QuestUpdateEntry_C_CanAddUpdate::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanAddUpdate, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'QuestUpdateEntry_C_CanAddUpdate::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanAddUpdate, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'QuestUpdateEntry_C_CanAddUpdate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanAddUpdate, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000034, "Member 'QuestUpdateEntry_C_CanAddUpdate::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanAddUpdate, CallFunc_Not_PreBool_ReturnValue2) == 0x000035, "Member 'QuestUpdateEntry_C_CanAddUpdate::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanAddUpdate, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'QuestUpdateEntry_C_CanAddUpdate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanAddUpdate, CallFunc_Array_Get_Item) == 0x000040, "Member 'QuestUpdateEntry_C_CanAddUpdate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanAddUpdate, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'QuestUpdateEntry_C_CanAddUpdate::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanAddUpdate, CallFunc_BooleanAND_ReturnValue) == 0x000061, "Member 'QuestUpdateEntry_C_CanAddUpdate::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanAddUpdate, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000062, "Member 'QuestUpdateEntry_C_CanAddUpdate::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function QuestUpdateEntry.QuestUpdateEntry_C.TryStartUpdates
// 0x0070 (0x0070 - 0x0000)
struct QuestUpdateEntry_C_TryStartUpdates final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartUpdate_Result;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDynamicQuestUpdateInfo                CallFunc_Array_Get_Item;                           // 0x0010(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestObjectiveEntry_C*                 CallFunc_GetObjectiveWidget_ObjectiveWidget;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDynamicQuestUpdateInfo                K2Node_MakeStruct_DynamicQuestUpdateInfo;          // 0x0040(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestUpdateEntry_C_TryStartUpdates) == 0x000008, "Wrong alignment on QuestUpdateEntry_C_TryStartUpdates");
static_assert(sizeof(QuestUpdateEntry_C_TryStartUpdates) == 0x000070, "Wrong size on QuestUpdateEntry_C_TryStartUpdates");
static_assert(offsetof(QuestUpdateEntry_C_TryStartUpdates, Temp_int_Array_Index_Variable) == 0x000000, "Member 'QuestUpdateEntry_C_TryStartUpdates::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_TryStartUpdates, CallFunc_CanStartUpdate_Result) == 0x000004, "Member 'QuestUpdateEntry_C_TryStartUpdates::CallFunc_CanStartUpdate_Result' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_TryStartUpdates, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'QuestUpdateEntry_C_TryStartUpdates::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_TryStartUpdates, CallFunc_Array_Get_Item) == 0x000010, "Member 'QuestUpdateEntry_C_TryStartUpdates::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_TryStartUpdates, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'QuestUpdateEntry_C_TryStartUpdates::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_TryStartUpdates, CallFunc_GetObjectiveWidget_ObjectiveWidget) == 0x000038, "Member 'QuestUpdateEntry_C_TryStartUpdates::CallFunc_GetObjectiveWidget_ObjectiveWidget' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_TryStartUpdates, K2Node_MakeStruct_DynamicQuestUpdateInfo) == 0x000040, "Member 'QuestUpdateEntry_C_TryStartUpdates::K2Node_MakeStruct_DynamicQuestUpdateInfo' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_TryStartUpdates, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'QuestUpdateEntry_C_TryStartUpdates::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_TryStartUpdates, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'QuestUpdateEntry_C_TryStartUpdates::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_TryStartUpdates, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'QuestUpdateEntry_C_TryStartUpdates::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function QuestUpdateEntry.QuestUpdateEntry_C.CanStartUpdate
// 0x0098 (0x0098 - 0x0000)
struct QuestUpdateEntry_C_CanStartUpdate final
{
public:
	int32                                         UpdateIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bCanStart;                                         // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDynamicQuestUpdateInfo                UpdateToTest;                                      // 0x0008(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDynamicQuestUpdateInfo                CallFunc_Array_Get_Item;                           // 0x0040(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUpdateActive_Result;                    // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDynamicQuestUpdateInfo                CallFunc_Array_Get_Item2;                          // 0x0070(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasUpdateStarted_Result;                  // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestUpdateEntry_C_CanStartUpdate) == 0x000008, "Wrong alignment on QuestUpdateEntry_C_CanStartUpdate");
static_assert(sizeof(QuestUpdateEntry_C_CanStartUpdate) == 0x000098, "Wrong size on QuestUpdateEntry_C_CanStartUpdate");
static_assert(offsetof(QuestUpdateEntry_C_CanStartUpdate, UpdateIndex) == 0x000000, "Member 'QuestUpdateEntry_C_CanStartUpdate::UpdateIndex' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanStartUpdate, Result) == 0x000004, "Member 'QuestUpdateEntry_C_CanStartUpdate::Result' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanStartUpdate, bCanStart) == 0x000005, "Member 'QuestUpdateEntry_C_CanStartUpdate::bCanStart' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanStartUpdate, UpdateToTest) == 0x000008, "Member 'QuestUpdateEntry_C_CanStartUpdate::UpdateToTest' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanStartUpdate, Temp_int_Array_Index_Variable) == 0x000028, "Member 'QuestUpdateEntry_C_CanStartUpdate::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanStartUpdate, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'QuestUpdateEntry_C_CanStartUpdate::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanStartUpdate, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000030, "Member 'QuestUpdateEntry_C_CanStartUpdate::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanStartUpdate, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'QuestUpdateEntry_C_CanStartUpdate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanStartUpdate, Temp_bool_True_if_break_was_hit_Variable) == 0x000038, "Member 'QuestUpdateEntry_C_CanStartUpdate::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanStartUpdate, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'QuestUpdateEntry_C_CanStartUpdate::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanStartUpdate, CallFunc_Array_Get_Item) == 0x000040, "Member 'QuestUpdateEntry_C_CanStartUpdate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanStartUpdate, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'QuestUpdateEntry_C_CanStartUpdate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanStartUpdate, CallFunc_IsUpdateActive_Result) == 0x000064, "Member 'QuestUpdateEntry_C_CanStartUpdate::CallFunc_IsUpdateActive_Result' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanStartUpdate, CallFunc_Less_IntInt_ReturnValue) == 0x000065, "Member 'QuestUpdateEntry_C_CanStartUpdate::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanStartUpdate, CallFunc_BooleanAND_ReturnValue) == 0x000066, "Member 'QuestUpdateEntry_C_CanStartUpdate::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanStartUpdate, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000067, "Member 'QuestUpdateEntry_C_CanStartUpdate::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanStartUpdate, CallFunc_BooleanAND_ReturnValue2) == 0x000068, "Member 'QuestUpdateEntry_C_CanStartUpdate::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanStartUpdate, CallFunc_Array_Get_Item2) == 0x000070, "Member 'QuestUpdateEntry_C_CanStartUpdate::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanStartUpdate, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000090, "Member 'QuestUpdateEntry_C_CanStartUpdate::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanStartUpdate, CallFunc_HasUpdateStarted_Result) == 0x000091, "Member 'QuestUpdateEntry_C_CanStartUpdate::CallFunc_HasUpdateStarted_Result' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_CanStartUpdate, CallFunc_Not_PreBool_ReturnValue2) == 0x000092, "Member 'QuestUpdateEntry_C_CanStartUpdate::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");

// Function QuestUpdateEntry.QuestUpdateEntry_C.HasUpdateFinished
// 0x0028 (0x0028 - 0x0000)
struct QuestUpdateEntry_C_HasUpdateFinished final
{
public:
	struct FDynamicQuestUpdateInfo                Update;                                            // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestUpdateEntry_C_HasUpdateFinished) == 0x000008, "Wrong alignment on QuestUpdateEntry_C_HasUpdateFinished");
static_assert(sizeof(QuestUpdateEntry_C_HasUpdateFinished) == 0x000028, "Wrong size on QuestUpdateEntry_C_HasUpdateFinished");
static_assert(offsetof(QuestUpdateEntry_C_HasUpdateFinished, Update) == 0x000000, "Member 'QuestUpdateEntry_C_HasUpdateFinished::Update' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_HasUpdateFinished, Result) == 0x000020, "Member 'QuestUpdateEntry_C_HasUpdateFinished::Result' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_HasUpdateFinished, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000021, "Member 'QuestUpdateEntry_C_HasUpdateFinished::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_HasUpdateFinished, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'QuestUpdateEntry_C_HasUpdateFinished::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function QuestUpdateEntry.QuestUpdateEntry_C.OnUpdateFinished
// 0x0020 (0x0020 - 0x0000)
struct QuestUpdateEntry_C_OnUpdateFinished final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HaveAllUpdatesFinished_Result;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor)
};
static_assert(alignof(QuestUpdateEntry_C_OnUpdateFinished) == 0x000008, "Wrong alignment on QuestUpdateEntry_C_OnUpdateFinished");
static_assert(sizeof(QuestUpdateEntry_C_OnUpdateFinished) == 0x000020, "Wrong size on QuestUpdateEntry_C_OnUpdateFinished");
static_assert(offsetof(QuestUpdateEntry_C_OnUpdateFinished, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'QuestUpdateEntry_C_OnUpdateFinished::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_OnUpdateFinished, CallFunc_HaveAllUpdatesFinished_Result) == 0x000010, "Member 'QuestUpdateEntry_C_OnUpdateFinished::CallFunc_HaveAllUpdatesFinished_Result' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_OnUpdateFinished, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'QuestUpdateEntry_C_OnUpdateFinished::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function QuestUpdateEntry.QuestUpdateEntry_C.HasUpdateStarted
// 0x0028 (0x0028 - 0x0000)
struct QuestUpdateEntry_C_HasUpdateStarted final
{
public:
	struct FDynamicQuestUpdateInfo                Update;                                            // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestUpdateEntry_C_HasUpdateStarted) == 0x000008, "Wrong alignment on QuestUpdateEntry_C_HasUpdateStarted");
static_assert(sizeof(QuestUpdateEntry_C_HasUpdateStarted) == 0x000028, "Wrong size on QuestUpdateEntry_C_HasUpdateStarted");
static_assert(offsetof(QuestUpdateEntry_C_HasUpdateStarted, Update) == 0x000000, "Member 'QuestUpdateEntry_C_HasUpdateStarted::Update' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_HasUpdateStarted, Result) == 0x000020, "Member 'QuestUpdateEntry_C_HasUpdateStarted::Result' has a wrong offset!");

// Function QuestUpdateEntry.QuestUpdateEntry_C.GetObjectiveWidget
// 0x0050 (0x0050 - 0x0000)
struct QuestUpdateEntry_C_GetObjectiveWidget final
{
public:
	class UFortQuestObjectiveInfo*                QuestObjective;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuestObjectiveEntry_C*                 ObjectiveWidget;                                   // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuestObjectiveEntry_C*                 FoundWidget;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestObjectiveEntry_C*                 K2Node_DynamicCast_AsQuest_Objective_Entry;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestUpdateEntry_C_GetObjectiveWidget) == 0x000008, "Wrong alignment on QuestUpdateEntry_C_GetObjectiveWidget");
static_assert(sizeof(QuestUpdateEntry_C_GetObjectiveWidget) == 0x000050, "Wrong size on QuestUpdateEntry_C_GetObjectiveWidget");
static_assert(offsetof(QuestUpdateEntry_C_GetObjectiveWidget, QuestObjective) == 0x000000, "Member 'QuestUpdateEntry_C_GetObjectiveWidget::QuestObjective' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_GetObjectiveWidget, ObjectiveWidget) == 0x000008, "Member 'QuestUpdateEntry_C_GetObjectiveWidget::ObjectiveWidget' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_GetObjectiveWidget, FoundWidget) == 0x000010, "Member 'QuestUpdateEntry_C_GetObjectiveWidget::FoundWidget' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_GetObjectiveWidget, Temp_bool_Variable) == 0x000018, "Member 'QuestUpdateEntry_C_GetObjectiveWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_GetObjectiveWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'QuestUpdateEntry_C_GetObjectiveWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_GetObjectiveWidget, Temp_int_Variable) == 0x00001C, "Member 'QuestUpdateEntry_C_GetObjectiveWidget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_GetObjectiveWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'QuestUpdateEntry_C_GetObjectiveWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_GetObjectiveWidget, CallFunc_GetChildAt_ReturnValue) == 0x000028, "Member 'QuestUpdateEntry_C_GetObjectiveWidget::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_GetObjectiveWidget, CallFunc_GetChildrenCount_ReturnValue) == 0x000030, "Member 'QuestUpdateEntry_C_GetObjectiveWidget::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_GetObjectiveWidget, K2Node_DynamicCast_AsQuest_Objective_Entry) == 0x000038, "Member 'QuestUpdateEntry_C_GetObjectiveWidget::K2Node_DynamicCast_AsQuest_Objective_Entry' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_GetObjectiveWidget, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'QuestUpdateEntry_C_GetObjectiveWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_GetObjectiveWidget, CallFunc_Subtract_IntInt_ReturnValue) == 0x000044, "Member 'QuestUpdateEntry_C_GetObjectiveWidget::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_GetObjectiveWidget, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000048, "Member 'QuestUpdateEntry_C_GetObjectiveWidget::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_GetObjectiveWidget, CallFunc_BooleanAND_ReturnValue) == 0x000049, "Member 'QuestUpdateEntry_C_GetObjectiveWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_GetObjectiveWidget, CallFunc_IsValid_ReturnValue) == 0x00004A, "Member 'QuestUpdateEntry_C_GetObjectiveWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_GetObjectiveWidget, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00004B, "Member 'QuestUpdateEntry_C_GetObjectiveWidget::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function QuestUpdateEntry.QuestUpdateEntry_C.IsUpdateActive
// 0x0028 (0x0028 - 0x0000)
struct QuestUpdateEntry_C_IsUpdateActive final
{
public:
	struct FDynamicQuestUpdateInfo                Update;                                            // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasUpdateStarted_Result;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasUpdateFinished_Result;                 // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestUpdateEntry_C_IsUpdateActive) == 0x000008, "Wrong alignment on QuestUpdateEntry_C_IsUpdateActive");
static_assert(sizeof(QuestUpdateEntry_C_IsUpdateActive) == 0x000028, "Wrong size on QuestUpdateEntry_C_IsUpdateActive");
static_assert(offsetof(QuestUpdateEntry_C_IsUpdateActive, Update) == 0x000000, "Member 'QuestUpdateEntry_C_IsUpdateActive::Update' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_IsUpdateActive, Result) == 0x000020, "Member 'QuestUpdateEntry_C_IsUpdateActive::Result' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_IsUpdateActive, CallFunc_HasUpdateStarted_Result) == 0x000021, "Member 'QuestUpdateEntry_C_IsUpdateActive::CallFunc_HasUpdateStarted_Result' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_IsUpdateActive, CallFunc_HasUpdateFinished_Result) == 0x000022, "Member 'QuestUpdateEntry_C_IsUpdateActive::CallFunc_HasUpdateFinished_Result' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_IsUpdateActive, CallFunc_Not_PreBool_ReturnValue) == 0x000023, "Member 'QuestUpdateEntry_C_IsUpdateActive::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_IsUpdateActive, CallFunc_BooleanAND_ReturnValue) == 0x000024, "Member 'QuestUpdateEntry_C_IsUpdateActive::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function QuestUpdateEntry.QuestUpdateEntry_C.HaveAllUpdatesFinished
// 0x0040 (0x0040 - 0x0000)
struct QuestUpdateEntry_C_HaveAllUpdatesFinished final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bAllUpdatesFinished;                               // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDynamicQuestUpdateInfo                CallFunc_Array_Get_Item;                           // 0x0018(0x0020)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasUpdateFinished_Result;                 // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestUpdateEntry_C_HaveAllUpdatesFinished) == 0x000008, "Wrong alignment on QuestUpdateEntry_C_HaveAllUpdatesFinished");
static_assert(sizeof(QuestUpdateEntry_C_HaveAllUpdatesFinished) == 0x000040, "Wrong size on QuestUpdateEntry_C_HaveAllUpdatesFinished");
static_assert(offsetof(QuestUpdateEntry_C_HaveAllUpdatesFinished, Result) == 0x000000, "Member 'QuestUpdateEntry_C_HaveAllUpdatesFinished::Result' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_HaveAllUpdatesFinished, bAllUpdatesFinished) == 0x000001, "Member 'QuestUpdateEntry_C_HaveAllUpdatesFinished::bAllUpdatesFinished' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_HaveAllUpdatesFinished, Temp_bool_True_if_break_was_hit_Variable) == 0x000002, "Member 'QuestUpdateEntry_C_HaveAllUpdatesFinished::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_HaveAllUpdatesFinished, Temp_int_Array_Index_Variable) == 0x000004, "Member 'QuestUpdateEntry_C_HaveAllUpdatesFinished::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_HaveAllUpdatesFinished, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'QuestUpdateEntry_C_HaveAllUpdatesFinished::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_HaveAllUpdatesFinished, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'QuestUpdateEntry_C_HaveAllUpdatesFinished::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_HaveAllUpdatesFinished, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'QuestUpdateEntry_C_HaveAllUpdatesFinished::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestUpdateEntry_C_HaveAllUpdatesFinished, CallFunc_Array_Get_Item) == 0x000018, "Member 'QuestUpdateEntry_C_HaveAllUpdatesFinished::CallFunc_Array_Get_Item' has a wrong offset!");
