#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestInfo_BulletListEntry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function QuestInfo_BulletListEntry.QuestInfo_BulletListEntry_C.InitBullet
// 0x0018 (0x0018 - 0x0000)
struct QuestInfo_BulletListEntry_C_InitBullet final
{
public:
	class FText                                   EntryText;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(QuestInfo_BulletListEntry_C_InitBullet) == 0x000008, "Wrong alignment on QuestInfo_BulletListEntry_C_InitBullet");
static_assert(sizeof(QuestInfo_BulletListEntry_C_InitBullet) == 0x000018, "Wrong size on QuestInfo_BulletListEntry_C_InitBullet");
static_assert(offsetof(QuestInfo_BulletListEntry_C_InitBullet, EntryText) == 0x000000, "Member 'QuestInfo_BulletListEntry_C_InitBullet::EntryText' has a wrong offset!");

// Function QuestInfo_BulletListEntry.QuestInfo_BulletListEntry_C.InitBrush
// 0x0098 (0x0098 - 0x0000)
struct QuestInfo_BulletListEntry_C_InitBrush final
{
public:
	class FText                                   EntryText;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FSlateBrush                            EntryIconBrush;                                    // 0x0018(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FVector2D                              CallFunc_CalcBrushSize_ReturnValue;                // 0x0090(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestInfo_BulletListEntry_C_InitBrush) == 0x000008, "Wrong alignment on QuestInfo_BulletListEntry_C_InitBrush");
static_assert(sizeof(QuestInfo_BulletListEntry_C_InitBrush) == 0x000098, "Wrong size on QuestInfo_BulletListEntry_C_InitBrush");
static_assert(offsetof(QuestInfo_BulletListEntry_C_InitBrush, EntryText) == 0x000000, "Member 'QuestInfo_BulletListEntry_C_InitBrush::EntryText' has a wrong offset!");
static_assert(offsetof(QuestInfo_BulletListEntry_C_InitBrush, EntryIconBrush) == 0x000018, "Member 'QuestInfo_BulletListEntry_C_InitBrush::EntryIconBrush' has a wrong offset!");
static_assert(offsetof(QuestInfo_BulletListEntry_C_InitBrush, CallFunc_CalcBrushSize_ReturnValue) == 0x000090, "Member 'QuestInfo_BulletListEntry_C_InitBrush::CallFunc_CalcBrushSize_ReturnValue' has a wrong offset!");

// Function QuestInfo_BulletListEntry.QuestInfo_BulletListEntry_C.CalcBrushSize
// 0x0044 (0x0044 - 0x0000)
struct QuestInfo_BulletListEntry_C_CalcBrushSize final
{
public:
	struct FVector2D                              InImageSize;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Min;                                               // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Scale;                                             // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0018(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X2;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y2;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X3;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y3;                         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestInfo_BulletListEntry_C_CalcBrushSize) == 0x000004, "Wrong alignment on QuestInfo_BulletListEntry_C_CalcBrushSize");
static_assert(sizeof(QuestInfo_BulletListEntry_C_CalcBrushSize) == 0x000044, "Wrong size on QuestInfo_BulletListEntry_C_CalcBrushSize");
static_assert(offsetof(QuestInfo_BulletListEntry_C_CalcBrushSize, InImageSize) == 0x000000, "Member 'QuestInfo_BulletListEntry_C_CalcBrushSize::InImageSize' has a wrong offset!");
static_assert(offsetof(QuestInfo_BulletListEntry_C_CalcBrushSize, ReturnValue) == 0x000008, "Member 'QuestInfo_BulletListEntry_C_CalcBrushSize::ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestInfo_BulletListEntry_C_CalcBrushSize, Min) == 0x000010, "Member 'QuestInfo_BulletListEntry_C_CalcBrushSize::Min' has a wrong offset!");
static_assert(offsetof(QuestInfo_BulletListEntry_C_CalcBrushSize, Scale) == 0x000014, "Member 'QuestInfo_BulletListEntry_C_CalcBrushSize::Scale' has a wrong offset!");
static_assert(offsetof(QuestInfo_BulletListEntry_C_CalcBrushSize, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000018, "Member 'QuestInfo_BulletListEntry_C_CalcBrushSize::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestInfo_BulletListEntry_C_CalcBrushSize, CallFunc_BreakVector2D_X) == 0x000020, "Member 'QuestInfo_BulletListEntry_C_CalcBrushSize::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(QuestInfo_BulletListEntry_C_CalcBrushSize, CallFunc_BreakVector2D_Y) == 0x000024, "Member 'QuestInfo_BulletListEntry_C_CalcBrushSize::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(QuestInfo_BulletListEntry_C_CalcBrushSize, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000028, "Member 'QuestInfo_BulletListEntry_C_CalcBrushSize::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestInfo_BulletListEntry_C_CalcBrushSize, CallFunc_BreakVector2D_X2) == 0x00002C, "Member 'QuestInfo_BulletListEntry_C_CalcBrushSize::CallFunc_BreakVector2D_X2' has a wrong offset!");
static_assert(offsetof(QuestInfo_BulletListEntry_C_CalcBrushSize, CallFunc_BreakVector2D_Y2) == 0x000030, "Member 'QuestInfo_BulletListEntry_C_CalcBrushSize::CallFunc_BreakVector2D_Y2' has a wrong offset!");
static_assert(offsetof(QuestInfo_BulletListEntry_C_CalcBrushSize, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x000034, "Member 'QuestInfo_BulletListEntry_C_CalcBrushSize::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(QuestInfo_BulletListEntry_C_CalcBrushSize, CallFunc_BreakVector2D_X3) == 0x000038, "Member 'QuestInfo_BulletListEntry_C_CalcBrushSize::CallFunc_BreakVector2D_X3' has a wrong offset!");
static_assert(offsetof(QuestInfo_BulletListEntry_C_CalcBrushSize, CallFunc_BreakVector2D_Y3) == 0x00003C, "Member 'QuestInfo_BulletListEntry_C_CalcBrushSize::CallFunc_BreakVector2D_Y3' has a wrong offset!");
static_assert(offsetof(QuestInfo_BulletListEntry_C_CalcBrushSize, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000040, "Member 'QuestInfo_BulletListEntry_C_CalcBrushSize::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

}

