#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestInfo_Widget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QuestInfo_Widget.QuestInfo_Widget_C
// 0x0040 (0x0250 - 0x0210)
class UQuestInfo_Widget_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 ImageQuestIcon;                                    // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestInfo_BulletList_C*                ObjectiveList;                                     // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestInfo_BulletList_C*                RewardList;                                        // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBoxDescription;                              // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlockQuestDescription;                         // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBlockQuestName;                                // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortQuestItem*                         Quest;                                             // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_QuestInfo_Widget(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void PopulateFromQuest(class UFortQuestItem*& InQuest);
	void InitDesignView();
	void Reset();
	void PopulateObjectives();
	void PopulateRewards();
	void SetQuestIcon();
	void SetQuestText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuestInfo_Widget_C">();
	}
	static class UQuestInfo_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestInfo_Widget_C>();
	}
};
static_assert(alignof(UQuestInfo_Widget_C) == 0x000008, "Wrong alignment on UQuestInfo_Widget_C");
static_assert(sizeof(UQuestInfo_Widget_C) == 0x000250, "Wrong size on UQuestInfo_Widget_C");
static_assert(offsetof(UQuestInfo_Widget_C, UberGraphFrame) == 0x000210, "Member 'UQuestInfo_Widget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQuestInfo_Widget_C, ImageQuestIcon) == 0x000218, "Member 'UQuestInfo_Widget_C::ImageQuestIcon' has a wrong offset!");
static_assert(offsetof(UQuestInfo_Widget_C, ObjectiveList) == 0x000220, "Member 'UQuestInfo_Widget_C::ObjectiveList' has a wrong offset!");
static_assert(offsetof(UQuestInfo_Widget_C, RewardList) == 0x000228, "Member 'UQuestInfo_Widget_C::RewardList' has a wrong offset!");
static_assert(offsetof(UQuestInfo_Widget_C, ScrollBoxDescription) == 0x000230, "Member 'UQuestInfo_Widget_C::ScrollBoxDescription' has a wrong offset!");
static_assert(offsetof(UQuestInfo_Widget_C, TextBlockQuestDescription) == 0x000238, "Member 'UQuestInfo_Widget_C::TextBlockQuestDescription' has a wrong offset!");
static_assert(offsetof(UQuestInfo_Widget_C, TextBlockQuestName) == 0x000240, "Member 'UQuestInfo_Widget_C::TextBlockQuestName' has a wrong offset!");
static_assert(offsetof(UQuestInfo_Widget_C, Quest) == 0x000248, "Member 'UQuestInfo_Widget_C::Quest' has a wrong offset!");

}

