#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuickbarSecondary

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function QuickbarSecondary.QuickbarSecondary_C.ExecuteUbergraph_QuickbarSecondary
// 0x0068 (0x0068 - 0x0000)
struct QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UQuickbarSlot_C*>                K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuickbarSlot_C*                        CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bUsingGamepad;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bUsingGamepad)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue2;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bUsingGamepad)>           K2Node_CreateDelegate_OutputDelegate2;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary) == 0x000008, "Wrong alignment on QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary");
static_assert(sizeof(QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary) == 0x000068, "Wrong size on QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary");
static_assert(offsetof(QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary, EntryPoint) == 0x000000, "Member 'QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary::EntryPoint' has a wrong offset!");
static_assert(offsetof(QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary, Temp_int_Array_Index_Variable) == 0x000004, "Member 'QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary, K2Node_MakeArray_Array) == 0x000008, "Member 'QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary, CallFunc_Array_Get_Item) == 0x000020, "Member 'QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary, K2Node_CustomEvent_bUsingGamepad) == 0x00002C, "Member 'QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary::K2Node_CustomEvent_bUsingGamepad' has a wrong offset!");
static_assert(offsetof(QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary, CallFunc_GetContext_ReturnValue2) == 0x000050, "Member 'QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary, K2Node_CreateDelegate_OutputDelegate2) == 0x000058, "Member 'QuickbarSecondary_C_ExecuteUbergraph_QuickbarSecondary::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");

// Function QuickbarSecondary.QuickbarSecondary_C.HandleInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct QuickbarSecondary_C_HandleInputMethodChanged final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuickbarSecondary_C_HandleInputMethodChanged) == 0x000001, "Wrong alignment on QuickbarSecondary_C_HandleInputMethodChanged");
static_assert(sizeof(QuickbarSecondary_C_HandleInputMethodChanged) == 0x000001, "Wrong size on QuickbarSecondary_C_HandleInputMethodChanged");
static_assert(offsetof(QuickbarSecondary_C_HandleInputMethodChanged, bUsingGamepad) == 0x000000, "Member 'QuickbarSecondary_C_HandleInputMethodChanged::bUsingGamepad' has a wrong offset!");

// Function QuickbarSecondary.QuickbarSecondary_C.Show Secondary Quickbar Rail
// 0x0005 (0x0005 - 0x0000)
struct QuickbarSecondary_C_Show_Secondary_Quickbar_Rail final
{
public:
	bool                                          Show;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuickbarSecondary_C_Show_Secondary_Quickbar_Rail) == 0x000001, "Wrong alignment on QuickbarSecondary_C_Show_Secondary_Quickbar_Rail");
static_assert(sizeof(QuickbarSecondary_C_Show_Secondary_Quickbar_Rail) == 0x000005, "Wrong size on QuickbarSecondary_C_Show_Secondary_Quickbar_Rail");
static_assert(offsetof(QuickbarSecondary_C_Show_Secondary_Quickbar_Rail, Show) == 0x000000, "Member 'QuickbarSecondary_C_Show_Secondary_Quickbar_Rail::Show' has a wrong offset!");
static_assert(offsetof(QuickbarSecondary_C_Show_Secondary_Quickbar_Rail, Temp_bool_Variable) == 0x000001, "Member 'QuickbarSecondary_C_Show_Secondary_Quickbar_Rail::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(QuickbarSecondary_C_Show_Secondary_Quickbar_Rail, Temp_byte_Variable) == 0x000002, "Member 'QuickbarSecondary_C_Show_Secondary_Quickbar_Rail::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(QuickbarSecondary_C_Show_Secondary_Quickbar_Rail, Temp_byte_Variable2) == 0x000003, "Member 'QuickbarSecondary_C_Show_Secondary_Quickbar_Rail::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(QuickbarSecondary_C_Show_Secondary_Quickbar_Rail, K2Node_Select_Default) == 0x000004, "Member 'QuickbarSecondary_C_Show_Secondary_Quickbar_Rail::K2Node_Select_Default' has a wrong offset!");

}

