#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RadialPickerItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RadialPickerItem.RadialPickerItem_C
// 0x0058 (0x0268 - 0x0210)
class URadialPickerItem_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UCommonBorder*                          BorderItemBorder;                                  // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageItemNotSelected;                              // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  ImageOrItemSwitcher;                               // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindWidget;                                     // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 PickerItem;                                        // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextLabel;                                         // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   PickerItemText;                                    // 0x0250(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_RadialPickerItem(int32 EntryPoint);
	void Construct();
	void SetImageAndLabelContent(const class FText& Text, const struct FSlateBrush& Brush, bool Option_Enabled, int32 RadialItemIndex);
	void SetSelected(bool IsSelected);
	void SetItemContent(class UFortItem* Item, bool Option_Enabled, int32 Radial_Item_Index);
	void SetShowImageAndLabel(bool ShowImageAndLabel);
	void SetKeybindVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RadialPickerItem_C">();
	}
	static class URadialPickerItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URadialPickerItem_C>();
	}
};
static_assert(alignof(URadialPickerItem_C) == 0x000008, "Wrong alignment on URadialPickerItem_C");
static_assert(sizeof(URadialPickerItem_C) == 0x000268, "Wrong size on URadialPickerItem_C");
static_assert(offsetof(URadialPickerItem_C, UberGraphFrame) == 0x000210, "Member 'URadialPickerItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URadialPickerItem_C, BorderItemBorder) == 0x000218, "Member 'URadialPickerItem_C::BorderItemBorder' has a wrong offset!");
static_assert(offsetof(URadialPickerItem_C, Image) == 0x000220, "Member 'URadialPickerItem_C::Image' has a wrong offset!");
static_assert(offsetof(URadialPickerItem_C, ImageItemNotSelected) == 0x000228, "Member 'URadialPickerItem_C::ImageItemNotSelected' has a wrong offset!");
static_assert(offsetof(URadialPickerItem_C, ImageOrItemSwitcher) == 0x000230, "Member 'URadialPickerItem_C::ImageOrItemSwitcher' has a wrong offset!");
static_assert(offsetof(URadialPickerItem_C, KeybindWidget) == 0x000238, "Member 'URadialPickerItem_C::KeybindWidget' has a wrong offset!");
static_assert(offsetof(URadialPickerItem_C, PickerItem) == 0x000240, "Member 'URadialPickerItem_C::PickerItem' has a wrong offset!");
static_assert(offsetof(URadialPickerItem_C, TextLabel) == 0x000248, "Member 'URadialPickerItem_C::TextLabel' has a wrong offset!");
static_assert(offsetof(URadialPickerItem_C, PickerItemText) == 0x000250, "Member 'URadialPickerItem_C::PickerItemText' has a wrong offset!");

}

