#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Results_TeleportPad

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Results_TeleportPad.Results_TeleportPad_C
// 0x00F0 (0x0360 - 0x0270)
class UResults_TeleportPad_C final : public UFortResultsTeleportScreenWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_ExitButtonIntro;                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_ExitTimeTick;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_ExitEnabled;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ButtonExit;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageTimer;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayRoot;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayTimer;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UResults_TeleportPadPlayer_C*           Pad1;                                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UResults_TeleportPadPlayer_C*           Pad2;                                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UResults_TeleportPadPlayer_C*           Pad3;                                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UResults_TeleportPadPlayer_C*           Pad4;                                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                TextExitTime;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UResults_TeleportPadPlayer_C*>   TeleportPadsOrdered;                               // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	UMulticastDelegateProperty_                   OnMissionStatsClicked;                             // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnExitClicked;                                     // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class USoundBase*                             ExitButtonIntro;                                   // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bExitTimeFinished;                                 // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ExitingText;                                       // 0x0320(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	UMulticastDelegateProperty_                   OnAddFriendClicked;                                // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnUpVoteClicked;                                   // 0x0348(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsSolo;                                           // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EFortCompletionResult                         CompletionResult;                                  // 0x0359(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnMissionStatsClicked__DelegateSignature();
	void OnExitClicked__DelegateSignature();
	void OnAddFriendClicked__DelegateSignature(const struct FUniqueNetIdRepl& TargetId, const class FString& TargetName);
	void OnUpVoteClicked__DelegateSignature(const struct FUniqueNetIdRepl& TargetId, const class FString& TargetName);
	void ExecuteUbergraph_Results_TeleportPad(int32 EntryPoint);
	void BndEvt__Pad4_K2Node_ComponentBoundEvent_7_OnTeleportPadIntroFinished__DelegateSignature(class UResults_TeleportPadPlayer_C* TeleportPadPlayer);
	void BndEvt__Pad3_K2Node_ComponentBoundEvent_6_OnTeleportPadIntroFinished__DelegateSignature(class UResults_TeleportPadPlayer_C* TeleportPadPlayer);
	void BndEvt__Pad2_K2Node_ComponentBoundEvent_5_OnTeleportPadIntroFinished__DelegateSignature(class UResults_TeleportPadPlayer_C* TeleportPadPlayer);
	void BndEvt__Pad1_K2Node_ComponentBoundEvent_4_OnTeleportPadIntroFinished__DelegateSignature(class UResults_TeleportPadPlayer_C* TeleportPadPlayer);
	void BndEvt__ButtonReturnHome_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__TeleportPad4_K2Node_ComponentBoundEvent_6_OnUpVoteClicked__DelegateSignature(const struct FUniqueNetIdRepl& TargetId, const class FString& TargetName);
	void BndEvt__TeleportPad3_K2Node_ComponentBoundEvent_5_OnUpVoteClicked__DelegateSignature(const struct FUniqueNetIdRepl& TargetId, const class FString& TargetName);
	void BndEvt__TeleportPad2_K2Node_ComponentBoundEvent_4_OnUpVoteClicked__DelegateSignature(const struct FUniqueNetIdRepl& TargetId, const class FString& TargetName);
	void BndEvt__TeleportPad1_K2Node_ComponentBoundEvent_3_OnUpVoteClicked__DelegateSignature(const struct FUniqueNetIdRepl& TargetId, const class FString& TargetName);
	void BndEvt__TeleportPad4_K2Node_ComponentBoundEvent_2_OnAddFriendClicked__DelegateSignature(const struct FUniqueNetIdRepl& TargetId, const class FString& TargetName);
	void BndEvt__TeleportPad3_K2Node_ComponentBoundEvent_1_OnAddFriendClicked__DelegateSignature(const struct FUniqueNetIdRepl& TargetId, const class FString& TargetName);
	void BndEvt__TeleportPad2_K2Node_ComponentBoundEvent_0_OnAddFriendClicked__DelegateSignature(const struct FUniqueNetIdRepl& TargetId, const class FString& TargetName);
	void BndEvt__TeleportPad1_K2Node_ComponentBoundEvent_35_OnAddFriendClicked__DelegateSignature(const struct FUniqueNetIdRepl& TargetId, const class FString& TargetName);
	void OnExitTimePercentagePassedUpdated(float Percent);
	void OnExitTimeRemainingUpdated(int32 TimeRemainingSeconds);
	void OnExitTimerFinished();
	void BndEvt__Anim_ExitEnabled_K2Node_ComponentBoundEvent_1_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature();
	void BndEvt__Anim_ExitButtonIntro_K2Node_ComponentBoundEvent_0_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature();
	void ExitButtonShown();
	void BndEvt__TeleportPad4_K2Node_ComponentBoundEvent_4_OnMissionStatsClicked__DelegateSignature();
	void BndEvt__TeleportPad3_K2Node_ComponentBoundEvent_3_OnMissionStatsClicked__DelegateSignature();
	void BndEvt__TeleportPad2_K2Node_ComponentBoundEvent_2_OnMissionStatsClicked__DelegateSignature();
	void BndEvt__TeleportPad1_K2Node_ComponentBoundEvent_1_OnMissionStatsClicked__DelegateSignature();
	void Teleport_Pad_Screen_Intro();
	void Team_Score_Screen_Outro();
	void Team_Score_Screen_Intro();
	void Initialize(class UFortUIScoreReport* InScoreReport, EFortCompletionResult Param_CompletionResult);
	void Focus();
	void Disable();
	void Enable();
	void Should_Hide_Exit_Timer(bool* bHideExitTimer);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Results_TeleportPad_C">();
	}
	static class UResults_TeleportPad_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UResults_TeleportPad_C>();
	}
};
static_assert(alignof(UResults_TeleportPad_C) == 0x000008, "Wrong alignment on UResults_TeleportPad_C");
static_assert(sizeof(UResults_TeleportPad_C) == 0x000360, "Wrong size on UResults_TeleportPad_C");
static_assert(offsetof(UResults_TeleportPad_C, UberGraphFrame) == 0x000270, "Member 'UResults_TeleportPad_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UResults_TeleportPad_C, Anim_ExitButtonIntro) == 0x000278, "Member 'UResults_TeleportPad_C::Anim_ExitButtonIntro' has a wrong offset!");
static_assert(offsetof(UResults_TeleportPad_C, Anim_ExitTimeTick) == 0x000280, "Member 'UResults_TeleportPad_C::Anim_ExitTimeTick' has a wrong offset!");
static_assert(offsetof(UResults_TeleportPad_C, Anim_ExitEnabled) == 0x000288, "Member 'UResults_TeleportPad_C::Anim_ExitEnabled' has a wrong offset!");
static_assert(offsetof(UResults_TeleportPad_C, ButtonExit) == 0x000290, "Member 'UResults_TeleportPad_C::ButtonExit' has a wrong offset!");
static_assert(offsetof(UResults_TeleportPad_C, ImageTimer) == 0x000298, "Member 'UResults_TeleportPad_C::ImageTimer' has a wrong offset!");
static_assert(offsetof(UResults_TeleportPad_C, OverlayRoot) == 0x0002A0, "Member 'UResults_TeleportPad_C::OverlayRoot' has a wrong offset!");
static_assert(offsetof(UResults_TeleportPad_C, OverlayTimer) == 0x0002A8, "Member 'UResults_TeleportPad_C::OverlayTimer' has a wrong offset!");
static_assert(offsetof(UResults_TeleportPad_C, Pad1) == 0x0002B0, "Member 'UResults_TeleportPad_C::Pad1' has a wrong offset!");
static_assert(offsetof(UResults_TeleportPad_C, Pad2) == 0x0002B8, "Member 'UResults_TeleportPad_C::Pad2' has a wrong offset!");
static_assert(offsetof(UResults_TeleportPad_C, Pad3) == 0x0002C0, "Member 'UResults_TeleportPad_C::Pad3' has a wrong offset!");
static_assert(offsetof(UResults_TeleportPad_C, Pad4) == 0x0002C8, "Member 'UResults_TeleportPad_C::Pad4' has a wrong offset!");
static_assert(offsetof(UResults_TeleportPad_C, SafeZone_0) == 0x0002D0, "Member 'UResults_TeleportPad_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UResults_TeleportPad_C, TextExitTime) == 0x0002D8, "Member 'UResults_TeleportPad_C::TextExitTime' has a wrong offset!");
static_assert(offsetof(UResults_TeleportPad_C, TeleportPadsOrdered) == 0x0002E0, "Member 'UResults_TeleportPad_C::TeleportPadsOrdered' has a wrong offset!");
static_assert(offsetof(UResults_TeleportPad_C, OnMissionStatsClicked) == 0x0002F0, "Member 'UResults_TeleportPad_C::OnMissionStatsClicked' has a wrong offset!");
static_assert(offsetof(UResults_TeleportPad_C, OnExitClicked) == 0x000300, "Member 'UResults_TeleportPad_C::OnExitClicked' has a wrong offset!");
static_assert(offsetof(UResults_TeleportPad_C, ExitButtonIntro) == 0x000310, "Member 'UResults_TeleportPad_C::ExitButtonIntro' has a wrong offset!");
static_assert(offsetof(UResults_TeleportPad_C, bExitTimeFinished) == 0x000318, "Member 'UResults_TeleportPad_C::bExitTimeFinished' has a wrong offset!");
static_assert(offsetof(UResults_TeleportPad_C, ExitingText) == 0x000320, "Member 'UResults_TeleportPad_C::ExitingText' has a wrong offset!");
static_assert(offsetof(UResults_TeleportPad_C, OnAddFriendClicked) == 0x000338, "Member 'UResults_TeleportPad_C::OnAddFriendClicked' has a wrong offset!");
static_assert(offsetof(UResults_TeleportPad_C, OnUpVoteClicked) == 0x000348, "Member 'UResults_TeleportPad_C::OnUpVoteClicked' has a wrong offset!");
static_assert(offsetof(UResults_TeleportPad_C, bIsSolo) == 0x000358, "Member 'UResults_TeleportPad_C::bIsSolo' has a wrong offset!");
static_assert(offsetof(UResults_TeleportPad_C, CompletionResult) == 0x000359, "Member 'UResults_TeleportPad_C::CompletionResult' has a wrong offset!");

}

