#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Results_CommanderXP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function Results_CommanderXP.Results_CommanderXP_C.ExecuteUbergraph_Results_CommanderXP
// 0x0020 (0x0020 - 0x0000)
struct Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue4;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_NewLevel;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_B_Execution_Happened_Variable;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_A_Execution_Happened_Variable;           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue2;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue3;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_B_Execution_Happened_Variable2;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_A_Execution_Happened_Variable2;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP) == 0x000008, "Wrong alignment on Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP");
static_assert(sizeof(Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP) == 0x000020, "Wrong size on Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP");
static_assert(offsetof(Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP, EntryPoint) == 0x000000, "Member 'Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP, CallFunc_BooleanOR_ReturnValue2) == 0x000005, "Member 'Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP, CallFunc_BooleanOR_ReturnValue3) == 0x000006, "Member 'Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP, CallFunc_BooleanOR_ReturnValue4) == 0x000007, "Member 'Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP::CallFunc_BooleanOR_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP, K2Node_ComponentBoundEvent_NewLevel) == 0x000008, "Member 'Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP::K2Node_ComponentBoundEvent_NewLevel' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP, Temp_bool_B_Execution_Happened_Variable) == 0x00000C, "Member 'Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP::Temp_bool_B_Execution_Happened_Variable' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP, Temp_bool_A_Execution_Happened_Variable) == 0x00000D, "Member 'Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP::Temp_bool_A_Execution_Happened_Variable' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP, CallFunc_BooleanAND_ReturnValue) == 0x00000E, "Member 'Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP, CallFunc_IsAnimationPlaying_ReturnValue) == 0x00000F, "Member 'Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP, CallFunc_IsAnimationPlaying_ReturnValue2) == 0x000010, "Member 'Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP::CallFunc_IsAnimationPlaying_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP, CallFunc_IsAnimationPlaying_ReturnValue3) == 0x000011, "Member 'Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP::CallFunc_IsAnimationPlaying_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP, Temp_bool_B_Execution_Happened_Variable2) == 0x000012, "Member 'Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP::Temp_bool_B_Execution_Happened_Variable2' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP, Temp_bool_A_Execution_Happened_Variable2) == 0x000013, "Member 'Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP::Temp_bool_A_Execution_Happened_Variable2' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP, CallFunc_BooleanAND_ReturnValue2) == 0x000014, "Member 'Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP, K2Node_ComponentBoundEvent_Button) == 0x000018, "Member 'Results_CommanderXP_C_ExecuteUbergraph_Results_CommanderXP::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function Results_CommanderXP.Results_CommanderXP_C.BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Results_CommanderXP_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_CommanderXP_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on Results_CommanderXP_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(Results_CommanderXP_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on Results_CommanderXP_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(Results_CommanderXP_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'Results_CommanderXP_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function Results_CommanderXP.Results_CommanderXP_C.BndEvt__Results_CommanderXPBar_K2Node_ComponentBoundEvent_1_LeveledUp__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct Results_CommanderXP_C_BndEvt__Results_CommanderXPBar_K2Node_ComponentBoundEvent_1_LeveledUp__DelegateSignature final
{
public:
	int32                                         NewLevel;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_CommanderXP_C_BndEvt__Results_CommanderXPBar_K2Node_ComponentBoundEvent_1_LeveledUp__DelegateSignature) == 0x000004, "Wrong alignment on Results_CommanderXP_C_BndEvt__Results_CommanderXPBar_K2Node_ComponentBoundEvent_1_LeveledUp__DelegateSignature");
static_assert(sizeof(Results_CommanderXP_C_BndEvt__Results_CommanderXPBar_K2Node_ComponentBoundEvent_1_LeveledUp__DelegateSignature) == 0x000004, "Wrong size on Results_CommanderXP_C_BndEvt__Results_CommanderXPBar_K2Node_ComponentBoundEvent_1_LeveledUp__DelegateSignature");
static_assert(offsetof(Results_CommanderXP_C_BndEvt__Results_CommanderXPBar_K2Node_ComponentBoundEvent_1_LeveledUp__DelegateSignature, NewLevel) == 0x000000, "Member 'Results_CommanderXP_C_BndEvt__Results_CommanderXPBar_K2Node_ComponentBoundEvent_1_LeveledUp__DelegateSignature::NewLevel' has a wrong offset!");

// Function Results_CommanderXP.Results_CommanderXP_C.Initialize
// 0x0200 (0x0200 - 0x0000)
struct Results_CommanderXP_C_Initialize final
{
public:
	class UFortUIScoreReport*                     InScoreReport;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UResults_TeamTotalScore_C*              Param_TeamTotalScore;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SkillPoints;                                       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FinalLevel;                                        // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InitialLevel;                                      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIScoreReport*                     ScoreReport;                                       // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue2;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortHomeBaseInfo                      CallFunc_GetHomeBaseInfo_Result;                   // 0x0038(0x0040)()
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSmallPreviewImage_ReturnValue;         // 0x0078(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue2;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue3;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue3;                  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortHomeBaseInfo                      CallFunc_GetHomeBaseInfo_Result2;                  // 0x00D8(0x0040)()
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue2;           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortItemQuantityPair>          CallFunc_GetAccountLevelUpRewards_Rewards;         // 0x0138(0x0010)(ZeroConstructor, ReferenceParm)
	struct FFortItemQuantityPair                  CallFunc_Array_Get_Item;                           // 0x0148(0x0030)()
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerState*                       K2Node_DynamicCast_AsFort_Player_State;            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetUniqueID_ReturnValue;                  // 0x01A0(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_GetScoreReportIndex_ReturnValue;          // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortUIXpInfo                          CallFunc_GetXpInfo_OutXpInfo;                      // 0x01CC(0x002C)(NoDestructor)
	bool                                          CallFunc_GetXpInfo_ReturnValue;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_CommanderXP_C_Initialize) == 0x000008, "Wrong alignment on Results_CommanderXP_C_Initialize");
static_assert(sizeof(Results_CommanderXP_C_Initialize) == 0x000200, "Wrong size on Results_CommanderXP_C_Initialize");
static_assert(offsetof(Results_CommanderXP_C_Initialize, InScoreReport) == 0x000000, "Member 'Results_CommanderXP_C_Initialize::InScoreReport' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, Param_TeamTotalScore) == 0x000008, "Member 'Results_CommanderXP_C_Initialize::Param_TeamTotalScore' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, SkillPoints) == 0x000010, "Member 'Results_CommanderXP_C_Initialize::SkillPoints' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, FinalLevel) == 0x000014, "Member 'Results_CommanderXP_C_Initialize::FinalLevel' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, InitialLevel) == 0x000018, "Member 'Results_CommanderXP_C_Initialize::InitialLevel' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, ScoreReport) == 0x000020, "Member 'Results_CommanderXP_C_Initialize::ScoreReport' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, CallFunc_GetContext_ReturnValue) == 0x000028, "Member 'Results_CommanderXP_C_Initialize::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, CallFunc_GetContext_ReturnValue2) == 0x000030, "Member 'Results_CommanderXP_C_Initialize::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, CallFunc_GetHomeBaseInfo_Result) == 0x000038, "Member 'Results_CommanderXP_C_Initialize::CallFunc_GetHomeBaseInfo_Result' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, CallFunc_GetSmallPreviewImage_ReturnValue) == 0x000078, "Member 'Results_CommanderXP_C_Initialize::CallFunc_GetSmallPreviewImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x0000A0, "Member 'Results_CommanderXP_C_Initialize::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, K2Node_DynamicCast_AsTexture_2D) == 0x0000A8, "Member 'Results_CommanderXP_C_Initialize::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'Results_CommanderXP_C_Initialize::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000B8, "Member 'Results_CommanderXP_C_Initialize::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, CallFunc_GetDynamicMaterial_ReturnValue2) == 0x0000C0, "Member 'Results_CommanderXP_C_Initialize::CallFunc_GetDynamicMaterial_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, CallFunc_GetDynamicMaterial_ReturnValue3) == 0x0000C8, "Member 'Results_CommanderXP_C_Initialize::CallFunc_GetDynamicMaterial_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, CallFunc_GetContext_ReturnValue3) == 0x0000D0, "Member 'Results_CommanderXP_C_Initialize::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, CallFunc_GetHomeBaseInfo_Result2) == 0x0000D8, "Member 'Results_CommanderXP_C_Initialize::CallFunc_GetHomeBaseInfo_Result2' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, CallFunc_Conv_StringToName_ReturnValue) == 0x000118, "Member 'Results_CommanderXP_C_Initialize::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, CallFunc_Add_IntInt_ReturnValue) == 0x000120, "Member 'Results_CommanderXP_C_Initialize::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, CallFunc_Conv_StringToName_ReturnValue2) == 0x000128, "Member 'Results_CommanderXP_C_Initialize::CallFunc_Conv_StringToName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, Temp_int_Variable) == 0x000130, "Member 'Results_CommanderXP_C_Initialize::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, CallFunc_GetAccountLevelUpRewards_Rewards) == 0x000138, "Member 'Results_CommanderXP_C_Initialize::CallFunc_GetAccountLevelUpRewards_Rewards' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, CallFunc_Array_Get_Item) == 0x000148, "Member 'Results_CommanderXP_C_Initialize::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000178, "Member 'Results_CommanderXP_C_Initialize::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, CallFunc_Add_IntInt_ReturnValue2) == 0x00017C, "Member 'Results_CommanderXP_C_Initialize::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, CallFunc_Add_IntInt_ReturnValue3) == 0x000180, "Member 'Results_CommanderXP_C_Initialize::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000188, "Member 'Results_CommanderXP_C_Initialize::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, K2Node_DynamicCast_AsFort_Player_State) == 0x000190, "Member 'Results_CommanderXP_C_Initialize::K2Node_DynamicCast_AsFort_Player_State' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, K2Node_DynamicCast_bSuccess2) == 0x000198, "Member 'Results_CommanderXP_C_Initialize::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, CallFunc_GetUniqueID_ReturnValue) == 0x0001A0, "Member 'Results_CommanderXP_C_Initialize::CallFunc_GetUniqueID_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, CallFunc_GetScoreReportIndex_ReturnValue) == 0x0001C8, "Member 'Results_CommanderXP_C_Initialize::CallFunc_GetScoreReportIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, CallFunc_GetXpInfo_OutXpInfo) == 0x0001CC, "Member 'Results_CommanderXP_C_Initialize::CallFunc_GetXpInfo_OutXpInfo' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, CallFunc_GetXpInfo_ReturnValue) == 0x0001F8, "Member 'Results_CommanderXP_C_Initialize::CallFunc_GetXpInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_Initialize, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001FC, "Member 'Results_CommanderXP_C_Initialize::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function Results_CommanderXP.Results_CommanderXP_C.UpdatePointsForLevel
// 0x00D8 (0x00D8 - 0x0000)
struct Results_CommanderXP_C_UpdatePointsForLevel final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RewardedPoints;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0018)()
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFortItemQuantityPair>          CallFunc_GetAccountLevelUpRewards_Rewards;         // 0x0098(0x0010)(ZeroConstructor, ReferenceParm)
	struct FFortItemQuantityPair                  CallFunc_Array_Get_Item;                           // 0x00A8(0x0030)()
};
static_assert(alignof(Results_CommanderXP_C_UpdatePointsForLevel) == 0x000008, "Wrong alignment on Results_CommanderXP_C_UpdatePointsForLevel");
static_assert(sizeof(Results_CommanderXP_C_UpdatePointsForLevel) == 0x0000D8, "Wrong size on Results_CommanderXP_C_UpdatePointsForLevel");
static_assert(offsetof(Results_CommanderXP_C_UpdatePointsForLevel, Level) == 0x000000, "Member 'Results_CommanderXP_C_UpdatePointsForLevel::Level' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_UpdatePointsForLevel, RewardedPoints) == 0x000004, "Member 'Results_CommanderXP_C_UpdatePointsForLevel::RewardedPoints' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_UpdatePointsForLevel, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'Results_CommanderXP_C_UpdatePointsForLevel::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_UpdatePointsForLevel, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'Results_CommanderXP_C_UpdatePointsForLevel::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_UpdatePointsForLevel, K2Node_MakeArray_Array) == 0x000060, "Member 'Results_CommanderXP_C_UpdatePointsForLevel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_UpdatePointsForLevel, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'Results_CommanderXP_C_UpdatePointsForLevel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_UpdatePointsForLevel, CallFunc_Format_ReturnValue) == 0x000078, "Member 'Results_CommanderXP_C_UpdatePointsForLevel::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_UpdatePointsForLevel, CallFunc_GetContext_ReturnValue) == 0x000090, "Member 'Results_CommanderXP_C_UpdatePointsForLevel::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_UpdatePointsForLevel, CallFunc_GetAccountLevelUpRewards_Rewards) == 0x000098, "Member 'Results_CommanderXP_C_UpdatePointsForLevel::CallFunc_GetAccountLevelUpRewards_Rewards' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_UpdatePointsForLevel, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'Results_CommanderXP_C_UpdatePointsForLevel::CallFunc_Array_Get_Item' has a wrong offset!");

// Function Results_CommanderXP.Results_CommanderXP_C.UpdatePointsText
// 0x0068 (0x0068 - 0x0000)
struct Results_CommanderXP_C_UpdatePointsText final
{
public:
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0000(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0050(0x0018)()
};
static_assert(alignof(Results_CommanderXP_C_UpdatePointsText) == 0x000008, "Wrong alignment on Results_CommanderXP_C_UpdatePointsText");
static_assert(sizeof(Results_CommanderXP_C_UpdatePointsText) == 0x000068, "Wrong size on Results_CommanderXP_C_UpdatePointsText");
static_assert(offsetof(Results_CommanderXP_C_UpdatePointsText, K2Node_MakeStruct_FormatArgumentData) == 0x000000, "Member 'Results_CommanderXP_C_UpdatePointsText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_UpdatePointsText, K2Node_MakeArray_Array) == 0x000040, "Member 'Results_CommanderXP_C_UpdatePointsText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_UpdatePointsText, CallFunc_Format_ReturnValue) == 0x000050, "Member 'Results_CommanderXP_C_UpdatePointsText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function Results_CommanderXP.Results_CommanderXP_C.SkipToFinalState
// 0x0001 (0x0001 - 0x0000)
struct Results_CommanderXP_C_SkipToFinalState final
{
public:
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_CommanderXP_C_SkipToFinalState) == 0x000001, "Wrong alignment on Results_CommanderXP_C_SkipToFinalState");
static_assert(sizeof(Results_CommanderXP_C_SkipToFinalState) == 0x000001, "Wrong size on Results_CommanderXP_C_SkipToFinalState");
static_assert(offsetof(Results_CommanderXP_C_SkipToFinalState, CallFunc_Greater_IntInt_ReturnValue) == 0x000000, "Member 'Results_CommanderXP_C_SkipToFinalState::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function Results_CommanderXP.Results_CommanderXP_C.SetSkippingToEnd
// 0x0003 (0x0003 - 0x0000)
struct Results_CommanderXP_C_SetSkippingToEnd final
{
public:
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue2;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue3;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_CommanderXP_C_SetSkippingToEnd) == 0x000001, "Wrong alignment on Results_CommanderXP_C_SetSkippingToEnd");
static_assert(sizeof(Results_CommanderXP_C_SetSkippingToEnd) == 0x000003, "Wrong size on Results_CommanderXP_C_SetSkippingToEnd");
static_assert(offsetof(Results_CommanderXP_C_SetSkippingToEnd, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000000, "Member 'Results_CommanderXP_C_SetSkippingToEnd::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_SetSkippingToEnd, CallFunc_IsAnimationPlaying_ReturnValue2) == 0x000001, "Member 'Results_CommanderXP_C_SetSkippingToEnd::CallFunc_IsAnimationPlaying_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_CommanderXP_C_SetSkippingToEnd, CallFunc_IsAnimationPlaying_ReturnValue3) == 0x000002, "Member 'Results_CommanderXP_C_SetSkippingToEnd::CallFunc_IsAnimationPlaying_ReturnValue3' has a wrong offset!");

// Function Results_CommanderXP.Results_CommanderXP_C.Focus
// 0x0008 (0x0008 - 0x0000)
struct Results_CommanderXP_C_Focus final
{
public:
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_CommanderXP_C_Focus) == 0x000008, "Wrong alignment on Results_CommanderXP_C_Focus");
static_assert(sizeof(Results_CommanderXP_C_Focus) == 0x000008, "Wrong size on Results_CommanderXP_C_Focus");
static_assert(offsetof(Results_CommanderXP_C_Focus, CallFunc_GetUINavigationManager_ReturnValue) == 0x000000, "Member 'Results_CommanderXP_C_Focus::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

// Function Results_CommanderXP.Results_CommanderXP_C.PlayAnimationCommon
// 0x0008 (0x0008 - 0x0000)
struct Results_CommanderXP_C_PlayAnimationCommon final
{
public:
	class UWidgetAnimation*                       Animation;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_CommanderXP_C_PlayAnimationCommon) == 0x000008, "Wrong alignment on Results_CommanderXP_C_PlayAnimationCommon");
static_assert(sizeof(Results_CommanderXP_C_PlayAnimationCommon) == 0x000008, "Wrong size on Results_CommanderXP_C_PlayAnimationCommon");
static_assert(offsetof(Results_CommanderXP_C_PlayAnimationCommon, Animation) == 0x000000, "Member 'Results_CommanderXP_C_PlayAnimationCommon::Animation' has a wrong offset!");

}

