#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Results_Summary

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Results_Summary.Results_Summary_C.ExecuteUbergraph_Results_Summary
// 0x0018 (0x0018 - 0x0000)
struct Results_Summary_C_ExecuteUbergraph_Results_Summary final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_Summary_C_ExecuteUbergraph_Results_Summary) == 0x000008, "Wrong alignment on Results_Summary_C_ExecuteUbergraph_Results_Summary");
static_assert(sizeof(Results_Summary_C_ExecuteUbergraph_Results_Summary) == 0x000018, "Wrong size on Results_Summary_C_ExecuteUbergraph_Results_Summary");
static_assert(offsetof(Results_Summary_C_ExecuteUbergraph_Results_Summary, EntryPoint) == 0x000000, "Member 'Results_Summary_C_ExecuteUbergraph_Results_Summary::EntryPoint' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_ExecuteUbergraph_Results_Summary, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'Results_Summary_C_ExecuteUbergraph_Results_Summary::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_ExecuteUbergraph_Results_Summary, K2Node_Event_IsDesignTime) == 0x000010, "Member 'Results_Summary_C_ExecuteUbergraph_Results_Summary::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function Results_Summary.Results_Summary_C.BndEvt__ButtonClose_K2Node_ComponentBoundEvent_65_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Results_Summary_C_BndEvt__ButtonClose_K2Node_ComponentBoundEvent_65_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_Summary_C_BndEvt__ButtonClose_K2Node_ComponentBoundEvent_65_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on Results_Summary_C_BndEvt__ButtonClose_K2Node_ComponentBoundEvent_65_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(Results_Summary_C_BndEvt__ButtonClose_K2Node_ComponentBoundEvent_65_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on Results_Summary_C_BndEvt__ButtonClose_K2Node_ComponentBoundEvent_65_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(Results_Summary_C_BndEvt__ButtonClose_K2Node_ComponentBoundEvent_65_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'Results_Summary_C_BndEvt__ButtonClose_K2Node_ComponentBoundEvent_65_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function Results_Summary.Results_Summary_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Results_Summary_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_Summary_C_PreConstruct) == 0x000001, "Wrong alignment on Results_Summary_C_PreConstruct");
static_assert(sizeof(Results_Summary_C_PreConstruct) == 0x000001, "Wrong size on Results_Summary_C_PreConstruct");
static_assert(offsetof(Results_Summary_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Results_Summary_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function Results_Summary.Results_Summary_C.InitializeLootChest
// 0x0090 (0x0090 - 0x0000)
struct Results_Summary_C_InitializeLootChest final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewLocalVar_0;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0018)()
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_Summary_C_InitializeLootChest) == 0x000008, "Wrong alignment on Results_Summary_C_InitializeLootChest");
static_assert(sizeof(Results_Summary_C_InitializeLootChest) == 0x000090, "Wrong size on Results_Summary_C_InitializeLootChest");
static_assert(offsetof(Results_Summary_C_InitializeLootChest, Level) == 0x000000, "Member 'Results_Summary_C_InitializeLootChest::Level' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_InitializeLootChest, NewLocalVar_0) == 0x000004, "Member 'Results_Summary_C_InitializeLootChest::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_InitializeLootChest, Texture) == 0x000008, "Member 'Results_Summary_C_InitializeLootChest::Texture' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_InitializeLootChest, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'Results_Summary_C_InitializeLootChest::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_InitializeLootChest, CallFunc_Array_Get_Item) == 0x000018, "Member 'Results_Summary_C_InitializeLootChest::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_InitializeLootChest, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'Results_Summary_C_InitializeLootChest::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_InitializeLootChest, K2Node_MakeArray_Array) == 0x000060, "Member 'Results_Summary_C_InitializeLootChest::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_InitializeLootChest, CallFunc_Format_ReturnValue) == 0x000070, "Member 'Results_Summary_C_InitializeLootChest::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_InitializeLootChest, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000088, "Member 'Results_Summary_C_InitializeLootChest::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function Results_Summary.Results_Summary_C.Initialize
// 0x0098 (0x0098 - 0x0000)
struct Results_Summary_C_Initialize final
{
public:
	class UFortUIScoreReport*                     InScoreReport;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortItem*>                      InRewardItems;                                     // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         InTotalMissionPoints;                              // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortItem*>                      RewardItems;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class UFortUIScoreReport*                     ScoreReport;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTeamScore_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTeamScore_ReturnValue2;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTeamScore_ReturnValue3;                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTeamScore_ReturnValue4;                // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UResults_PlayerScoreRow_C*              CallFunc_Create_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_GetTotalScoreSortedScoreIndices_OutSortedScoreIndices; // 0x0070(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_Summary_C_Initialize) == 0x000008, "Wrong alignment on Results_Summary_C_Initialize");
static_assert(sizeof(Results_Summary_C_Initialize) == 0x000098, "Wrong size on Results_Summary_C_Initialize");
static_assert(offsetof(Results_Summary_C_Initialize, InScoreReport) == 0x000000, "Member 'Results_Summary_C_Initialize::InScoreReport' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_Initialize, InRewardItems) == 0x000008, "Member 'Results_Summary_C_Initialize::InRewardItems' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_Initialize, InTotalMissionPoints) == 0x000018, "Member 'Results_Summary_C_Initialize::InTotalMissionPoints' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_Initialize, RewardItems) == 0x000020, "Member 'Results_Summary_C_Initialize::RewardItems' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_Initialize, ScoreReport) == 0x000030, "Member 'Results_Summary_C_Initialize::ScoreReport' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_Initialize, Temp_int_Array_Index_Variable) == 0x000038, "Member 'Results_Summary_C_Initialize::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_Initialize, CallFunc_GetTeamScore_ReturnValue) == 0x00003C, "Member 'Results_Summary_C_Initialize::CallFunc_GetTeamScore_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_Initialize, CallFunc_GetTeamScore_ReturnValue2) == 0x000040, "Member 'Results_Summary_C_Initialize::CallFunc_GetTeamScore_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_Initialize, CallFunc_GetTeamScore_ReturnValue3) == 0x000044, "Member 'Results_Summary_C_Initialize::CallFunc_GetTeamScore_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_Initialize, CallFunc_GetTeamScore_ReturnValue4) == 0x000048, "Member 'Results_Summary_C_Initialize::CallFunc_GetTeamScore_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_Initialize, Temp_int_Loop_Counter_Variable) == 0x00004C, "Member 'Results_Summary_C_Initialize::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_Initialize, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'Results_Summary_C_Initialize::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_Initialize, CallFunc_Add_IntInt_ReturnValue2) == 0x000054, "Member 'Results_Summary_C_Initialize::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_Initialize, CallFunc_Add_IntInt_ReturnValue3) == 0x000058, "Member 'Results_Summary_C_Initialize::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_Initialize, CallFunc_Add_IntInt_ReturnValue4) == 0x00005C, "Member 'Results_Summary_C_Initialize::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_Initialize, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000060, "Member 'Results_Summary_C_Initialize::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_Initialize, CallFunc_Create_ReturnValue) == 0x000068, "Member 'Results_Summary_C_Initialize::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_Initialize, CallFunc_GetTotalScoreSortedScoreIndices_OutSortedScoreIndices) == 0x000070, "Member 'Results_Summary_C_Initialize::CallFunc_GetTotalScoreSortedScoreIndices_OutSortedScoreIndices' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_Initialize, CallFunc_Array_Get_Item) == 0x000080, "Member 'Results_Summary_C_Initialize::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_Initialize, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000088, "Member 'Results_Summary_C_Initialize::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_Initialize, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'Results_Summary_C_Initialize::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_Initialize, CallFunc_Less_IntInt_ReturnValue) == 0x000094, "Member 'Results_Summary_C_Initialize::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function Results_Summary.Results_Summary_C.DoDesignTimeRandomization
// 0x0058 (0x0058 - 0x0000)
struct Results_Summary_C_DoDesignTimeRandomization final
{
public:
	int32                                         Row;                                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Column;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable2;                                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue2;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UResults_PlayerScoreRow_C*              CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UResults_SummaryBadge_C*                CallFunc_Create_ReturnValue2;                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_Summary_C_DoDesignTimeRandomization) == 0x000008, "Wrong alignment on Results_Summary_C_DoDesignTimeRandomization");
static_assert(sizeof(Results_Summary_C_DoDesignTimeRandomization) == 0x000058, "Wrong size on Results_Summary_C_DoDesignTimeRandomization");
static_assert(offsetof(Results_Summary_C_DoDesignTimeRandomization, Row) == 0x000000, "Member 'Results_Summary_C_DoDesignTimeRandomization::Row' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_DoDesignTimeRandomization, Column) == 0x000004, "Member 'Results_Summary_C_DoDesignTimeRandomization::Column' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_DoDesignTimeRandomization, CallFunc_RandomInteger_ReturnValue) == 0x000008, "Member 'Results_Summary_C_DoDesignTimeRandomization::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_DoDesignTimeRandomization, CallFunc_RandomIntegerInRange_ReturnValue) == 0x00000C, "Member 'Results_Summary_C_DoDesignTimeRandomization::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_DoDesignTimeRandomization, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000010, "Member 'Results_Summary_C_DoDesignTimeRandomization::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_DoDesignTimeRandomization, Temp_int_Variable) == 0x000014, "Member 'Results_Summary_C_DoDesignTimeRandomization::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_DoDesignTimeRandomization, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'Results_Summary_C_DoDesignTimeRandomization::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_DoDesignTimeRandomization, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'Results_Summary_C_DoDesignTimeRandomization::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_DoDesignTimeRandomization, CallFunc_Add_IntInt_ReturnValue2) == 0x000020, "Member 'Results_Summary_C_DoDesignTimeRandomization::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_DoDesignTimeRandomization, CallFunc_Add_IntInt_ReturnValue3) == 0x000024, "Member 'Results_Summary_C_DoDesignTimeRandomization::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_DoDesignTimeRandomization, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000028, "Member 'Results_Summary_C_DoDesignTimeRandomization::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_DoDesignTimeRandomization, Temp_int_Variable2) == 0x00002C, "Member 'Results_Summary_C_DoDesignTimeRandomization::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_DoDesignTimeRandomization, CallFunc_LessEqual_IntInt_ReturnValue2) == 0x000030, "Member 'Results_Summary_C_DoDesignTimeRandomization::CallFunc_LessEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_DoDesignTimeRandomization, CallFunc_Add_IntInt_ReturnValue4) == 0x000034, "Member 'Results_Summary_C_DoDesignTimeRandomization::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_DoDesignTimeRandomization, CallFunc_Create_ReturnValue) == 0x000038, "Member 'Results_Summary_C_DoDesignTimeRandomization::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_DoDesignTimeRandomization, CallFunc_Create_ReturnValue2) == 0x000040, "Member 'Results_Summary_C_DoDesignTimeRandomization::CallFunc_Create_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_DoDesignTimeRandomization, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000048, "Member 'Results_Summary_C_DoDesignTimeRandomization::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_DoDesignTimeRandomization, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000050, "Member 'Results_Summary_C_DoDesignTimeRandomization::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function Results_Summary.Results_Summary_C.InitializeRewards
// 0x0068 (0x0068 - 0x0000)
struct Results_Summary_C_InitializeRewards final
{
public:
	TArray<class UFortItem*>                      Items;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         InTotalMissionPoints;                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Row;                                               // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Column;                                            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalBadgePoints;                                  // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UResults_SummaryBadge_C*                CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_Summary_C_InitializeRewards) == 0x000008, "Wrong alignment on Results_Summary_C_InitializeRewards");
static_assert(sizeof(Results_Summary_C_InitializeRewards) == 0x000068, "Wrong size on Results_Summary_C_InitializeRewards");
static_assert(offsetof(Results_Summary_C_InitializeRewards, Items) == 0x000000, "Member 'Results_Summary_C_InitializeRewards::Items' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_InitializeRewards, InTotalMissionPoints) == 0x000010, "Member 'Results_Summary_C_InitializeRewards::InTotalMissionPoints' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_InitializeRewards, Row) == 0x000014, "Member 'Results_Summary_C_InitializeRewards::Row' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_InitializeRewards, Column) == 0x000018, "Member 'Results_Summary_C_InitializeRewards::Column' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_InitializeRewards, TotalBadgePoints) == 0x00001C, "Member 'Results_Summary_C_InitializeRewards::TotalBadgePoints' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_InitializeRewards, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'Results_Summary_C_InitializeRewards::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_InitializeRewards, Temp_int_Array_Index_Variable) == 0x000024, "Member 'Results_Summary_C_InitializeRewards::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_InitializeRewards, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'Results_Summary_C_InitializeRewards::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_InitializeRewards, CallFunc_Add_IntInt_ReturnValue2) == 0x00002C, "Member 'Results_Summary_C_InitializeRewards::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_InitializeRewards, CallFunc_Add_IntInt_ReturnValue3) == 0x000030, "Member 'Results_Summary_C_InitializeRewards::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_InitializeRewards, CallFunc_Array_Get_Item) == 0x000038, "Member 'Results_Summary_C_InitializeRewards::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_InitializeRewards, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'Results_Summary_C_InitializeRewards::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_InitializeRewards, CallFunc_Array_Length_ReturnValue2) == 0x000044, "Member 'Results_Summary_C_InitializeRewards::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_InitializeRewards, CallFunc_Greater_IntInt_ReturnValue) == 0x000048, "Member 'Results_Summary_C_InitializeRewards::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_InitializeRewards, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'Results_Summary_C_InitializeRewards::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_InitializeRewards, CallFunc_Divide_IntInt_ReturnValue) == 0x00004C, "Member 'Results_Summary_C_InitializeRewards::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_InitializeRewards, CallFunc_Greater_IntInt_ReturnValue2) == 0x000050, "Member 'Results_Summary_C_InitializeRewards::CallFunc_Greater_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_InitializeRewards, CallFunc_Create_ReturnValue) == 0x000058, "Member 'Results_Summary_C_InitializeRewards::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_Summary_C_InitializeRewards, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000060, "Member 'Results_Summary_C_InitializeRewards::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");

// Function Results_Summary.Results_Summary_C.Focus
// 0x0008 (0x0008 - 0x0000)
struct Results_Summary_C_Focus final
{
public:
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_Summary_C_Focus) == 0x000008, "Wrong alignment on Results_Summary_C_Focus");
static_assert(sizeof(Results_Summary_C_Focus) == 0x000008, "Wrong size on Results_Summary_C_Focus");
static_assert(offsetof(Results_Summary_C_Focus, CallFunc_GetUINavigationManager_ReturnValue) == 0x000000, "Member 'Results_Summary_C_Focus::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

}

