#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Results_SummaryBadge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Results_SummaryBadge.Results_SummaryBadge_C
// 0x0018 (0x0228 - 0x0210)
class UResults_SummaryBadge_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UFortItemIcon*                          Badge;                                             // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBadgeName;                                     // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Results_SummaryBadge(int32 EntryPoint);
	void Manual_Pre_Construct();
	void PreConstruct(bool IsDesignTime);
	void Initialize(class UFortItem* BadgeItem);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Results_SummaryBadge_C">();
	}
	static class UResults_SummaryBadge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UResults_SummaryBadge_C>();
	}
};
static_assert(alignof(UResults_SummaryBadge_C) == 0x000008, "Wrong alignment on UResults_SummaryBadge_C");
static_assert(sizeof(UResults_SummaryBadge_C) == 0x000228, "Wrong size on UResults_SummaryBadge_C");
static_assert(offsetof(UResults_SummaryBadge_C, UberGraphFrame) == 0x000210, "Member 'UResults_SummaryBadge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UResults_SummaryBadge_C, Badge) == 0x000218, "Member 'UResults_SummaryBadge_C::Badge' has a wrong offset!");
static_assert(offsetof(UResults_SummaryBadge_C, TextBadgeName) == 0x000220, "Member 'UResults_SummaryBadge_C::TextBadgeName' has a wrong offset!");

}

