#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Results_NameplateWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function Results_NameplateWidget.Results_NameplateWidget_C.ExecuteUbergraph_Results_NameplateWidget
// 0x0010 (0x0010 - 0x0000)
struct Results_NameplateWidget_C_ExecuteUbergraph_Results_NameplateWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_NameplateWidget_C_ExecuteUbergraph_Results_NameplateWidget) == 0x000004, "Wrong alignment on Results_NameplateWidget_C_ExecuteUbergraph_Results_NameplateWidget");
static_assert(sizeof(Results_NameplateWidget_C_ExecuteUbergraph_Results_NameplateWidget) == 0x000010, "Wrong size on Results_NameplateWidget_C_ExecuteUbergraph_Results_NameplateWidget");
static_assert(offsetof(Results_NameplateWidget_C_ExecuteUbergraph_Results_NameplateWidget, EntryPoint) == 0x000000, "Member 'Results_NameplateWidget_C_ExecuteUbergraph_Results_NameplateWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(Results_NameplateWidget_C_ExecuteUbergraph_Results_NameplateWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'Results_NameplateWidget_C_ExecuteUbergraph_Results_NameplateWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_NameplateWidget_C_ExecuteUbergraph_Results_NameplateWidget, CallFunc_GetEndTime_ReturnValue) == 0x000008, "Member 'Results_NameplateWidget_C_ExecuteUbergraph_Results_NameplateWidget::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_NameplateWidget_C_ExecuteUbergraph_Results_NameplateWidget, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'Results_NameplateWidget_C_ExecuteUbergraph_Results_NameplateWidget::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function Results_NameplateWidget.Results_NameplateWidget_C.Initialize
// 0x0080 (0x0080 - 0x0000)
struct Results_NameplateWidget_C_Initialize final
{
public:
	EFortCompletionResult                         Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCompletionResult                         Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable3;                               // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable4;                               // 0x0050(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0068(0x0018)()
};
static_assert(alignof(Results_NameplateWidget_C_Initialize) == 0x000008, "Wrong alignment on Results_NameplateWidget_C_Initialize");
static_assert(sizeof(Results_NameplateWidget_C_Initialize) == 0x000080, "Wrong size on Results_NameplateWidget_C_Initialize");
static_assert(offsetof(Results_NameplateWidget_C_Initialize, Result) == 0x000000, "Member 'Results_NameplateWidget_C_Initialize::Result' has a wrong offset!");
static_assert(offsetof(Results_NameplateWidget_C_Initialize, Temp_byte_Variable) == 0x000001, "Member 'Results_NameplateWidget_C_Initialize::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Results_NameplateWidget_C_Initialize, Temp_text_Variable) == 0x000008, "Member 'Results_NameplateWidget_C_Initialize::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(Results_NameplateWidget_C_Initialize, Temp_text_Variable2) == 0x000020, "Member 'Results_NameplateWidget_C_Initialize::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(Results_NameplateWidget_C_Initialize, Temp_text_Variable3) == 0x000038, "Member 'Results_NameplateWidget_C_Initialize::Temp_text_Variable3' has a wrong offset!");
static_assert(offsetof(Results_NameplateWidget_C_Initialize, Temp_text_Variable4) == 0x000050, "Member 'Results_NameplateWidget_C_Initialize::Temp_text_Variable4' has a wrong offset!");
static_assert(offsetof(Results_NameplateWidget_C_Initialize, K2Node_Select_Default) == 0x000068, "Member 'Results_NameplateWidget_C_Initialize::K2Node_Select_Default' has a wrong offset!");

// Function Results_NameplateWidget.Results_NameplateWidget_C.Outro
// 0x0001 (0x0001 - 0x0000)
struct Results_NameplateWidget_C_Outro final
{
public:
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_NameplateWidget_C_Outro) == 0x000001, "Wrong alignment on Results_NameplateWidget_C_Outro");
static_assert(sizeof(Results_NameplateWidget_C_Outro) == 0x000001, "Wrong size on Results_NameplateWidget_C_Outro");
static_assert(offsetof(Results_NameplateWidget_C_Outro, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000000, "Member 'Results_NameplateWidget_C_Outro::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");

}

