#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Results_TeamScoreRow

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function Results_TeamScoreRow.Results_TeamScoreRow_C.ExecuteUbergraph_Results_TeamScoreRow
// 0x0038 (0x0038 - 0x0000)
struct Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue4;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue5;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue6;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UResults_PlayerScoreBox_C*              CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsValidScoreBox_bIsValidScoreBox;      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue7;                   // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue8;                   // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow) == 0x000008, "Wrong alignment on Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow");
static_assert(sizeof(Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow) == 0x000038, "Wrong size on Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow");
static_assert(offsetof(Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow, EntryPoint) == 0x000000, "Member 'Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow::EntryPoint' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow, CallFunc_BooleanOR_ReturnValue2) == 0x000005, "Member 'Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow, CallFunc_BooleanOR_ReturnValue3) == 0x000006, "Member 'Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow, CallFunc_BooleanOR_ReturnValue4) == 0x000007, "Member 'Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow::CallFunc_BooleanOR_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow, CallFunc_BooleanOR_ReturnValue5) == 0x000008, "Member 'Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow::CallFunc_BooleanOR_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow, CallFunc_BooleanOR_ReturnValue6) == 0x000010, "Member 'Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow::CallFunc_BooleanOR_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow, CallFunc_Array_Get_Item) == 0x000018, "Member 'Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow, CallFunc_GetIsValidScoreBox_bIsValidScoreBox) == 0x000024, "Member 'Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow::CallFunc_GetIsValidScoreBox_bIsValidScoreBox' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow, CallFunc_BooleanOR_ReturnValue7) == 0x000025, "Member 'Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow::CallFunc_BooleanOR_ReturnValue7' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow, CallFunc_BooleanOR_ReturnValue8) == 0x000034, "Member 'Results_TeamScoreRow_C_ExecuteUbergraph_Results_TeamScoreRow::CallFunc_BooleanOR_ReturnValue8' has a wrong offset!");

// Function Results_TeamScoreRow.Results_TeamScoreRow_C.Initialize
// 0x0118 (0x0118 - 0x0000)
struct Results_TeamScoreRow_C_Initialize final
{
public:
	class UFortUIScoreReport*                     InScoreReport;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_PlayRate;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonNumericTextBlock*                CurrentResidualScoreText;                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentScoreReportIndex;                           // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UResults_PlayerScoreBox_C*              CurrentScoreBox;                                   // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIScoreReport*                     ScoreReport;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BestScore;                                         // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UResults_PlayerScoreBox_C*              ScoreBoxBest;                                      // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UCommonNumericTextBlock*>        K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetScoreReportIndicesByPlayerID_SortedScoreReportIndices; // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonNumericTextBlock*                CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UResults_PlayerScoreBox_C*              CallFunc_Array_Get_Item2;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item3;                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonNumericTextBlock*                CallFunc_Array_Get_Item4;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerCount_ReturnValue;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UResults_PlayerScoreBox_C*>      K2Node_MakeArray_Array2;                           // 0x00B0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTeamScore_ReturnValue;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UResults_PlayerScoreBox_C*              CallFunc_Array_Get_Item5;                          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00E0(0x0028)()
	bool                                          CallFunc_GetIsValidScoreBox_bIsValidScoreBox;      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayerScore_ReturnValue;               // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeamScoreRow_C_Initialize) == 0x000008, "Wrong alignment on Results_TeamScoreRow_C_Initialize");
static_assert(sizeof(Results_TeamScoreRow_C_Initialize) == 0x000118, "Wrong size on Results_TeamScoreRow_C_Initialize");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, InScoreReport) == 0x000000, "Member 'Results_TeamScoreRow_C_Initialize::InScoreReport' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, Param_PlayRate) == 0x000008, "Member 'Results_TeamScoreRow_C_Initialize::Param_PlayRate' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, CurrentResidualScoreText) == 0x000010, "Member 'Results_TeamScoreRow_C_Initialize::CurrentResidualScoreText' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, CurrentScoreReportIndex) == 0x000018, "Member 'Results_TeamScoreRow_C_Initialize::CurrentScoreReportIndex' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, CurrentScoreBox) == 0x000020, "Member 'Results_TeamScoreRow_C_Initialize::CurrentScoreBox' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, ScoreReport) == 0x000028, "Member 'Results_TeamScoreRow_C_Initialize::ScoreReport' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, BestScore) == 0x000030, "Member 'Results_TeamScoreRow_C_Initialize::BestScore' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, ScoreBoxBest) == 0x000038, "Member 'Results_TeamScoreRow_C_Initialize::ScoreBoxBest' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, K2Node_MakeArray_Array) == 0x000040, "Member 'Results_TeamScoreRow_C_Initialize::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000050, "Member 'Results_TeamScoreRow_C_Initialize::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, CallFunc_GetScoreReportIndicesByPlayerID_SortedScoreReportIndices) == 0x000058, "Member 'Results_TeamScoreRow_C_Initialize::CallFunc_GetScoreReportIndicesByPlayerID_SortedScoreReportIndices' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'Results_TeamScoreRow_C_Initialize::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, Temp_int_Variable) == 0x00006C, "Member 'Results_TeamScoreRow_C_Initialize::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, CallFunc_Subtract_IntInt_ReturnValue) == 0x000070, "Member 'Results_TeamScoreRow_C_Initialize::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, CallFunc_Array_Get_Item) == 0x000078, "Member 'Results_TeamScoreRow_C_Initialize::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000080, "Member 'Results_TeamScoreRow_C_Initialize::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, CallFunc_Array_Get_Item2) == 0x000088, "Member 'Results_TeamScoreRow_C_Initialize::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, CallFunc_Array_Get_Item3) == 0x000090, "Member 'Results_TeamScoreRow_C_Initialize::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, CallFunc_Add_IntInt_ReturnValue) == 0x000094, "Member 'Results_TeamScoreRow_C_Initialize::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, Temp_int_Array_Index_Variable) == 0x000098, "Member 'Results_TeamScoreRow_C_Initialize::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, CallFunc_Array_Get_Item4) == 0x0000A0, "Member 'Results_TeamScoreRow_C_Initialize::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, CallFunc_GetPlayerCount_ReturnValue) == 0x0000A8, "Member 'Results_TeamScoreRow_C_Initialize::CallFunc_GetPlayerCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, CallFunc_Greater_IntInt_ReturnValue) == 0x0000AC, "Member 'Results_TeamScoreRow_C_Initialize::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, K2Node_MakeArray_Array2) == 0x0000B0, "Member 'Results_TeamScoreRow_C_Initialize::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, Temp_int_Loop_Counter_Variable) == 0x0000C0, "Member 'Results_TeamScoreRow_C_Initialize::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, CallFunc_GetTeamScore_ReturnValue) == 0x0000C4, "Member 'Results_TeamScoreRow_C_Initialize::CallFunc_GetTeamScore_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, CallFunc_Add_IntInt_ReturnValue2) == 0x0000C8, "Member 'Results_TeamScoreRow_C_Initialize::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, CallFunc_Array_Get_Item5) == 0x0000D0, "Member 'Results_TeamScoreRow_C_Initialize::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, CallFunc_Array_Length_ReturnValue2) == 0x0000D8, "Member 'Results_TeamScoreRow_C_Initialize::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, CallFunc_Less_IntInt_ReturnValue) == 0x0000DC, "Member 'Results_TeamScoreRow_C_Initialize::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, K2Node_MakeStruct_SlateColor) == 0x0000E0, "Member 'Results_TeamScoreRow_C_Initialize::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, CallFunc_GetIsValidScoreBox_bIsValidScoreBox) == 0x000108, "Member 'Results_TeamScoreRow_C_Initialize::CallFunc_GetIsValidScoreBox_bIsValidScoreBox' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000109, "Member 'Results_TeamScoreRow_C_Initialize::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, CallFunc_GetPlayerScore_ReturnValue) == 0x00010C, "Member 'Results_TeamScoreRow_C_Initialize::CallFunc_GetPlayerScore_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, CallFunc_Max_ReturnValue) == 0x000110, "Member 'Results_TeamScoreRow_C_Initialize::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_Initialize, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000114, "Member 'Results_TeamScoreRow_C_Initialize::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");

// Function Results_TeamScoreRow.Results_TeamScoreRow_C.SetSkippingToEnd
// 0x0001 (0x0001 - 0x0000)
struct Results_TeamScoreRow_C_SetSkippingToEnd final
{
public:
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_TeamScoreRow_C_SetSkippingToEnd) == 0x000001, "Wrong alignment on Results_TeamScoreRow_C_SetSkippingToEnd");
static_assert(sizeof(Results_TeamScoreRow_C_SetSkippingToEnd) == 0x000001, "Wrong size on Results_TeamScoreRow_C_SetSkippingToEnd");
static_assert(offsetof(Results_TeamScoreRow_C_SetSkippingToEnd, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000000, "Member 'Results_TeamScoreRow_C_SetSkippingToEnd::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");

// Function Results_TeamScoreRow.Results_TeamScoreRow_C.ShowValidResidualScores
// 0x0030 (0x0030 - 0x0000)
struct Results_TeamScoreRow_C_ShowValidResidualScores final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonNumericTextBlock*                CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UResults_PlayerScoreBox_C*              CallFunc_Array_Get_Item2;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsValidScoreBox_bIsValidScoreBox;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_TeamScoreRow_C_ShowValidResidualScores) == 0x000008, "Wrong alignment on Results_TeamScoreRow_C_ShowValidResidualScores");
static_assert(sizeof(Results_TeamScoreRow_C_ShowValidResidualScores) == 0x000030, "Wrong size on Results_TeamScoreRow_C_ShowValidResidualScores");
static_assert(offsetof(Results_TeamScoreRow_C_ShowValidResidualScores, Temp_int_Array_Index_Variable) == 0x000000, "Member 'Results_TeamScoreRow_C_ShowValidResidualScores::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_ShowValidResidualScores, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Results_TeamScoreRow_C_ShowValidResidualScores::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_ShowValidResidualScores, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Results_TeamScoreRow_C_ShowValidResidualScores::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_ShowValidResidualScores, CallFunc_Array_Get_Item) == 0x000010, "Member 'Results_TeamScoreRow_C_ShowValidResidualScores::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_ShowValidResidualScores, CallFunc_Array_Get_Item2) == 0x000018, "Member 'Results_TeamScoreRow_C_ShowValidResidualScores::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_ShowValidResidualScores, CallFunc_GetIsValidScoreBox_bIsValidScoreBox) == 0x000020, "Member 'Results_TeamScoreRow_C_ShowValidResidualScores::CallFunc_GetIsValidScoreBox_bIsValidScoreBox' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_ShowValidResidualScores, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'Results_TeamScoreRow_C_ShowValidResidualScores::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreRow_C_ShowValidResidualScores, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'Results_TeamScoreRow_C_ShowValidResidualScores::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

