#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Results_TeleportPadPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Results_TeleportPadPlayer.Results_TeleportPadPlayer_C.OnAddFriendClicked__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct Results_TeleportPadPlayer_C_OnAddFriendClicked__DelegateSignature final
{
public:
	struct FUniqueNetIdRepl                       TargetId;                                          // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FString                                 TargetName;                                        // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeleportPadPlayer_C_OnAddFriendClicked__DelegateSignature) == 0x000008, "Wrong alignment on Results_TeleportPadPlayer_C_OnAddFriendClicked__DelegateSignature");
static_assert(sizeof(Results_TeleportPadPlayer_C_OnAddFriendClicked__DelegateSignature) == 0x000038, "Wrong size on Results_TeleportPadPlayer_C_OnAddFriendClicked__DelegateSignature");
static_assert(offsetof(Results_TeleportPadPlayer_C_OnAddFriendClicked__DelegateSignature, TargetId) == 0x000000, "Member 'Results_TeleportPadPlayer_C_OnAddFriendClicked__DelegateSignature::TargetId' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_OnAddFriendClicked__DelegateSignature, TargetName) == 0x000028, "Member 'Results_TeleportPadPlayer_C_OnAddFriendClicked__DelegateSignature::TargetName' has a wrong offset!");

// Function Results_TeleportPadPlayer.Results_TeleportPadPlayer_C.OnUpVoteClicked__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct Results_TeleportPadPlayer_C_OnUpVoteClicked__DelegateSignature final
{
public:
	struct FUniqueNetIdRepl                       TargetId;                                          // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FString                                 TargetName;                                        // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeleportPadPlayer_C_OnUpVoteClicked__DelegateSignature) == 0x000008, "Wrong alignment on Results_TeleportPadPlayer_C_OnUpVoteClicked__DelegateSignature");
static_assert(sizeof(Results_TeleportPadPlayer_C_OnUpVoteClicked__DelegateSignature) == 0x000038, "Wrong size on Results_TeleportPadPlayer_C_OnUpVoteClicked__DelegateSignature");
static_assert(offsetof(Results_TeleportPadPlayer_C_OnUpVoteClicked__DelegateSignature, TargetId) == 0x000000, "Member 'Results_TeleportPadPlayer_C_OnUpVoteClicked__DelegateSignature::TargetId' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_OnUpVoteClicked__DelegateSignature, TargetName) == 0x000028, "Member 'Results_TeleportPadPlayer_C_OnUpVoteClicked__DelegateSignature::TargetName' has a wrong offset!");

// Function Results_TeleportPadPlayer.Results_TeleportPadPlayer_C.OnTeleportPadIntroFinished__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Results_TeleportPadPlayer_C_OnTeleportPadIntroFinished__DelegateSignature final
{
public:
	class UResults_TeleportPadPlayer_C*           TeleportPadPlayer;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeleportPadPlayer_C_OnTeleportPadIntroFinished__DelegateSignature) == 0x000008, "Wrong alignment on Results_TeleportPadPlayer_C_OnTeleportPadIntroFinished__DelegateSignature");
static_assert(sizeof(Results_TeleportPadPlayer_C_OnTeleportPadIntroFinished__DelegateSignature) == 0x000008, "Wrong size on Results_TeleportPadPlayer_C_OnTeleportPadIntroFinished__DelegateSignature");
static_assert(offsetof(Results_TeleportPadPlayer_C_OnTeleportPadIntroFinished__DelegateSignature, TeleportPadPlayer) == 0x000000, "Member 'Results_TeleportPadPlayer_C_OnTeleportPadIntroFinished__DelegateSignature::TeleportPadPlayer' has a wrong offset!");

// Function Results_TeleportPadPlayer.Results_TeleportPadPlayer_C.ExecuteUbergraph_Results_TeleportPadPlayer
// 0x00D8 (0x00D8 - 0x0000)
struct Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanInviteParty_bCanInvitePlayer;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanFriend_bCanFriendPlayer;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button3;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0018(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0030(0x0028)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0058(0x0078)()
	bool                                          CallFunc_IsTencentBuild_ReturnValue;               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer) == 0x000008, "Wrong alignment on Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer");
static_assert(sizeof(Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer) == 0x0000D8, "Wrong size on Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer");
static_assert(offsetof(Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer, EntryPoint) == 0x000000, "Member 'Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer, CallFunc_CanInviteParty_bCanInvitePlayer) == 0x000004, "Member 'Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer::CallFunc_CanInviteParty_bCanInvitePlayer' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer, CallFunc_CanFriend_bCanFriendPlayer) == 0x000005, "Member 'Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer::CallFunc_CanFriend_bCanFriendPlayer' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer, CallFunc_BooleanOR_ReturnValue) == 0x000006, "Member 'Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer, K2Node_ComponentBoundEvent_Button3) == 0x000008, "Member 'Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer, K2Node_ComponentBoundEvent_Button2) == 0x000010, "Member 'Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer, K2Node_MakeStruct_LinearColor) == 0x000018, "Member 'Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer, K2Node_ComponentBoundEvent_Button) == 0x000028, "Member 'Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer, K2Node_MakeStruct_SlateColor) == 0x000030, "Member 'Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer, K2Node_MakeStruct_SlateBrush) == 0x000058, "Member 'Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer, CallFunc_IsTencentBuild_ReturnValue) == 0x0000D0, "Member 'Results_TeleportPadPlayer_C_ExecuteUbergraph_Results_TeleportPadPlayer::CallFunc_IsTencentBuild_ReturnValue' has a wrong offset!");

// Function Results_TeleportPadPlayer.Results_TeleportPadPlayer_C.BndEvt__ButtonThumbs_K2Node_ComponentBoundEvent_24_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Results_TeleportPadPlayer_C_BndEvt__ButtonThumbs_K2Node_ComponentBoundEvent_24_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeleportPadPlayer_C_BndEvt__ButtonThumbs_K2Node_ComponentBoundEvent_24_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on Results_TeleportPadPlayer_C_BndEvt__ButtonThumbs_K2Node_ComponentBoundEvent_24_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(Results_TeleportPadPlayer_C_BndEvt__ButtonThumbs_K2Node_ComponentBoundEvent_24_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on Results_TeleportPadPlayer_C_BndEvt__ButtonThumbs_K2Node_ComponentBoundEvent_24_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(Results_TeleportPadPlayer_C_BndEvt__ButtonThumbs_K2Node_ComponentBoundEvent_24_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'Results_TeleportPadPlayer_C_BndEvt__ButtonThumbs_K2Node_ComponentBoundEvent_24_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function Results_TeleportPadPlayer.Results_TeleportPadPlayer_C.BndEvt__ButtonInvite_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Results_TeleportPadPlayer_C_BndEvt__ButtonInvite_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeleportPadPlayer_C_BndEvt__ButtonInvite_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on Results_TeleportPadPlayer_C_BndEvt__ButtonInvite_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(Results_TeleportPadPlayer_C_BndEvt__ButtonInvite_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on Results_TeleportPadPlayer_C_BndEvt__ButtonInvite_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(Results_TeleportPadPlayer_C_BndEvt__ButtonInvite_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'Results_TeleportPadPlayer_C_BndEvt__ButtonInvite_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function Results_TeleportPadPlayer.Results_TeleportPadPlayer_C.BndEvt__ButtonStats_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Results_TeleportPadPlayer_C_BndEvt__ButtonStats_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeleportPadPlayer_C_BndEvt__ButtonStats_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on Results_TeleportPadPlayer_C_BndEvt__ButtonStats_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(Results_TeleportPadPlayer_C_BndEvt__ButtonStats_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on Results_TeleportPadPlayer_C_BndEvt__ButtonStats_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(Results_TeleportPadPlayer_C_BndEvt__ButtonStats_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'Results_TeleportPadPlayer_C_BndEvt__ButtonStats_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function Results_TeleportPadPlayer.Results_TeleportPadPlayer_C.Initialize
// 0x0090 (0x0090 - 0x0000)
struct Results_TeleportPadPlayer_C_Initialize final
{
public:
	struct FUniqueNetIdRepl                       InUniqueId;                                        // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class UFortUIScoreReport*                     InScoreReport;                                     // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       InConsoleUniqueId;                                 // 0x0030(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	int32                                         ScoreReportIndex;                                  // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIScoreReport*                     ScoreReport;                                       // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanFriend_bCanFriendPlayer;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocalPlayer_ReturnValue;                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetPlayerName_ReturnValue;                // 0x0070(0x0018)()
	int32                                         CallFunc_GetScoreReportIndex_ReturnValue;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeleportPadPlayer_C_Initialize) == 0x000008, "Wrong alignment on Results_TeleportPadPlayer_C_Initialize");
static_assert(sizeof(Results_TeleportPadPlayer_C_Initialize) == 0x000090, "Wrong size on Results_TeleportPadPlayer_C_Initialize");
static_assert(offsetof(Results_TeleportPadPlayer_C_Initialize, InUniqueId) == 0x000000, "Member 'Results_TeleportPadPlayer_C_Initialize::InUniqueId' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_Initialize, InScoreReport) == 0x000028, "Member 'Results_TeleportPadPlayer_C_Initialize::InScoreReport' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_Initialize, InConsoleUniqueId) == 0x000030, "Member 'Results_TeleportPadPlayer_C_Initialize::InConsoleUniqueId' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_Initialize, ScoreReportIndex) == 0x000058, "Member 'Results_TeleportPadPlayer_C_Initialize::ScoreReportIndex' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_Initialize, ScoreReport) == 0x000060, "Member 'Results_TeleportPadPlayer_C_Initialize::ScoreReport' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_Initialize, CallFunc_CanFriend_bCanFriendPlayer) == 0x000068, "Member 'Results_TeleportPadPlayer_C_Initialize::CallFunc_CanFriend_bCanFriendPlayer' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_Initialize, CallFunc_IsLocalPlayer_ReturnValue) == 0x000069, "Member 'Results_TeleportPadPlayer_C_Initialize::CallFunc_IsLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_Initialize, CallFunc_GetPlayerName_ReturnValue) == 0x000070, "Member 'Results_TeleportPadPlayer_C_Initialize::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_Initialize, CallFunc_GetScoreReportIndex_ReturnValue) == 0x000088, "Member 'Results_TeleportPadPlayer_C_Initialize::CallFunc_GetScoreReportIndex_ReturnValue' has a wrong offset!");

// Function Results_TeleportPadPlayer.Results_TeleportPadPlayer_C.IsValidPad
// 0x0001 (0x0001 - 0x0000)
struct Results_TeleportPadPlayer_C_IsValidPad final
{
public:
	bool                                          Param_bIsValid;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_TeleportPadPlayer_C_IsValidPad) == 0x000001, "Wrong alignment on Results_TeleportPadPlayer_C_IsValidPad");
static_assert(sizeof(Results_TeleportPadPlayer_C_IsValidPad) == 0x000001, "Wrong size on Results_TeleportPadPlayer_C_IsValidPad");
static_assert(offsetof(Results_TeleportPadPlayer_C_IsValidPad, Param_bIsValid) == 0x000000, "Member 'Results_TeleportPadPlayer_C_IsValidPad::Param_bIsValid' has a wrong offset!");

// Function Results_TeleportPadPlayer.Results_TeleportPadPlayer_C.ThumbsUpPlayer
// 0x0010 (0x0010 - 0x0000)
struct Results_TeleportPadPlayer_C_ThumbsUpPlayer final
{
public:
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeleportPadPlayer_C_ThumbsUpPlayer) == 0x000008, "Wrong alignment on Results_TeleportPadPlayer_C_ThumbsUpPlayer");
static_assert(sizeof(Results_TeleportPadPlayer_C_ThumbsUpPlayer) == 0x000010, "Wrong size on Results_TeleportPadPlayer_C_ThumbsUpPlayer");
static_assert(offsetof(Results_TeleportPadPlayer_C_ThumbsUpPlayer, CallFunc_Conv_TextToString_ReturnValue) == 0x000000, "Member 'Results_TeleportPadPlayer_C_ThumbsUpPlayer::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function Results_TeleportPadPlayer.Results_TeleportPadPlayer_C.InvitePlayer
// 0x0058 (0x0058 - 0x0000)
struct Results_TeleportPadPlayer_C_InvitePlayer final
{
public:
	struct FUniqueNetIdRepl                       NetIdToUse;                                        // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsolePlatform_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue2;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanInviteParty_bCanInvitePlayer;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanFriend_bCanFriendPlayer;               // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_TeleportPadPlayer_C_InvitePlayer) == 0x000008, "Wrong alignment on Results_TeleportPadPlayer_C_InvitePlayer");
static_assert(sizeof(Results_TeleportPadPlayer_C_InvitePlayer) == 0x000058, "Wrong size on Results_TeleportPadPlayer_C_InvitePlayer");
static_assert(offsetof(Results_TeleportPadPlayer_C_InvitePlayer, NetIdToUse) == 0x000000, "Member 'Results_TeleportPadPlayer_C_InvitePlayer::NetIdToUse' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_InvitePlayer, CallFunc_IsConsolePlatform_ReturnValue) == 0x000028, "Member 'Results_TeleportPadPlayer_C_InvitePlayer::CallFunc_IsConsolePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_InvitePlayer, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'Results_TeleportPadPlayer_C_InvitePlayer::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_InvitePlayer, CallFunc_Conv_TextToString_ReturnValue) == 0x000038, "Member 'Results_TeleportPadPlayer_C_InvitePlayer::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_InvitePlayer, CallFunc_GetContext_ReturnValue2) == 0x000048, "Member 'Results_TeleportPadPlayer_C_InvitePlayer::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_InvitePlayer, CallFunc_CanInviteParty_bCanInvitePlayer) == 0x000050, "Member 'Results_TeleportPadPlayer_C_InvitePlayer::CallFunc_CanInviteParty_bCanInvitePlayer' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_InvitePlayer, CallFunc_CanFriend_bCanFriendPlayer) == 0x000051, "Member 'Results_TeleportPadPlayer_C_InvitePlayer::CallFunc_CanFriend_bCanFriendPlayer' has a wrong offset!");

// Function Results_TeleportPadPlayer.Results_TeleportPadPlayer_C.CanInviteParty
// 0x0030 (0x0030 - 0x0000)
struct Results_TeleportPadPlayer_C_CanInviteParty final
{
public:
	bool                                          bCanInvitePlayer;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue2;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortPartyRestriction                         CallFunc_CanBeInvitedNetID_FailReason;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBeInvitedNetID_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_TeleportPadPlayer_C_CanInviteParty) == 0x000008, "Wrong alignment on Results_TeleportPadPlayer_C_CanInviteParty");
static_assert(sizeof(Results_TeleportPadPlayer_C_CanInviteParty) == 0x000030, "Wrong size on Results_TeleportPadPlayer_C_CanInviteParty");
static_assert(offsetof(Results_TeleportPadPlayer_C_CanInviteParty, bCanInvitePlayer) == 0x000000, "Member 'Results_TeleportPadPlayer_C_CanInviteParty::bCanInvitePlayer' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_CanInviteParty, CallFunc_GetPlatformName_ReturnValue) == 0x000008, "Member 'Results_TeleportPadPlayer_C_CanInviteParty::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_CanInviteParty, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000018, "Member 'Results_TeleportPadPlayer_C_CanInviteParty::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_CanInviteParty, CallFunc_EqualEqual_StrStr_ReturnValue2) == 0x000019, "Member 'Results_TeleportPadPlayer_C_CanInviteParty::CallFunc_EqualEqual_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_CanInviteParty, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'Results_TeleportPadPlayer_C_CanInviteParty::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_CanInviteParty, CallFunc_CanBeInvitedNetID_FailReason) == 0x000028, "Member 'Results_TeleportPadPlayer_C_CanInviteParty::CallFunc_CanBeInvitedNetID_FailReason' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_CanInviteParty, CallFunc_CanBeInvitedNetID_ReturnValue) == 0x000029, "Member 'Results_TeleportPadPlayer_C_CanInviteParty::CallFunc_CanBeInvitedNetID_ReturnValue' has a wrong offset!");

// Function Results_TeleportPadPlayer.Results_TeleportPadPlayer_C.CanFriend
// 0x0048 (0x0048 - 0x0000)
struct Results_TeleportPadPlayer_C_CanFriend final
{
public:
	bool                                          bCanFriendPlayer;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       NetIdToUse;                                        // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	EFortFriendRequestStatus                      FriendRequestStatus;                               // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortFriendRequestStatus                      Temp_byte_Variable;                                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsolePlatform_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortFriendRequestStatus                      CallFunc_GetFriendRequestStatusForPlayer_ReturnValue; // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_TeleportPadPlayer_C_CanFriend) == 0x000008, "Wrong alignment on Results_TeleportPadPlayer_C_CanFriend");
static_assert(sizeof(Results_TeleportPadPlayer_C_CanFriend) == 0x000048, "Wrong size on Results_TeleportPadPlayer_C_CanFriend");
static_assert(offsetof(Results_TeleportPadPlayer_C_CanFriend, bCanFriendPlayer) == 0x000000, "Member 'Results_TeleportPadPlayer_C_CanFriend::bCanFriendPlayer' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_CanFriend, NetIdToUse) == 0x000008, "Member 'Results_TeleportPadPlayer_C_CanFriend::NetIdToUse' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_CanFriend, FriendRequestStatus) == 0x000030, "Member 'Results_TeleportPadPlayer_C_CanFriend::FriendRequestStatus' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_CanFriend, Temp_byte_Variable) == 0x000031, "Member 'Results_TeleportPadPlayer_C_CanFriend::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_CanFriend, Temp_bool_Variable) == 0x000032, "Member 'Results_TeleportPadPlayer_C_CanFriend::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_CanFriend, Temp_bool_Variable2) == 0x000033, "Member 'Results_TeleportPadPlayer_C_CanFriend::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_CanFriend, Temp_bool_Variable3) == 0x000034, "Member 'Results_TeleportPadPlayer_C_CanFriend::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_CanFriend, Temp_bool_Variable4) == 0x000035, "Member 'Results_TeleportPadPlayer_C_CanFriend::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_CanFriend, CallFunc_GetContext_ReturnValue) == 0x000038, "Member 'Results_TeleportPadPlayer_C_CanFriend::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_CanFriend, CallFunc_IsConsolePlatform_ReturnValue) == 0x000040, "Member 'Results_TeleportPadPlayer_C_CanFriend::CallFunc_IsConsolePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_CanFriend, CallFunc_GetFriendRequestStatusForPlayer_ReturnValue) == 0x000041, "Member 'Results_TeleportPadPlayer_C_CanFriend::CallFunc_GetFriendRequestStatusForPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeleportPadPlayer_C_CanFriend, K2Node_Select_Default) == 0x000042, "Member 'Results_TeleportPadPlayer_C_CanFriend::K2Node_Select_Default' has a wrong offset!");

// Function Results_TeleportPadPlayer.Results_TeleportPadPlayer_C.Focus
// 0x0008 (0x0008 - 0x0000)
struct Results_TeleportPadPlayer_C_Focus final
{
public:
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeleportPadPlayer_C_Focus) == 0x000008, "Wrong alignment on Results_TeleportPadPlayer_C_Focus");
static_assert(sizeof(Results_TeleportPadPlayer_C_Focus) == 0x000008, "Wrong size on Results_TeleportPadPlayer_C_Focus");
static_assert(offsetof(Results_TeleportPadPlayer_C_Focus, CallFunc_GetUINavigationManager_ReturnValue) == 0x000000, "Member 'Results_TeleportPadPlayer_C_Focus::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

// Function Results_TeleportPadPlayer.Results_TeleportPadPlayer_C.IsLocalPlayersPad
// 0x0001 (0x0001 - 0x0000)
struct Results_TeleportPadPlayer_C_IsLocalPlayersPad final
{
public:
	bool                                          bIsLocalPlayersPad;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_TeleportPadPlayer_C_IsLocalPlayersPad) == 0x000001, "Wrong alignment on Results_TeleportPadPlayer_C_IsLocalPlayersPad");
static_assert(sizeof(Results_TeleportPadPlayer_C_IsLocalPlayersPad) == 0x000001, "Wrong size on Results_TeleportPadPlayer_C_IsLocalPlayersPad");
static_assert(offsetof(Results_TeleportPadPlayer_C_IsLocalPlayersPad, bIsLocalPlayersPad) == 0x000000, "Member 'Results_TeleportPadPlayer_C_IsLocalPlayersPad::bIsLocalPlayersPad' has a wrong offset!");

}

