#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Results_TeleportPad

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Results_TeleportPad.Results_TeleportPad_C.OnAddFriendClicked__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct Results_TeleportPad_C_OnAddFriendClicked__DelegateSignature final
{
public:
	struct FUniqueNetIdRepl                       TargetId;                                          // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FString                                 TargetName;                                        // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeleportPad_C_OnAddFriendClicked__DelegateSignature) == 0x000008, "Wrong alignment on Results_TeleportPad_C_OnAddFriendClicked__DelegateSignature");
static_assert(sizeof(Results_TeleportPad_C_OnAddFriendClicked__DelegateSignature) == 0x000038, "Wrong size on Results_TeleportPad_C_OnAddFriendClicked__DelegateSignature");
static_assert(offsetof(Results_TeleportPad_C_OnAddFriendClicked__DelegateSignature, TargetId) == 0x000000, "Member 'Results_TeleportPad_C_OnAddFriendClicked__DelegateSignature::TargetId' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_OnAddFriendClicked__DelegateSignature, TargetName) == 0x000028, "Member 'Results_TeleportPad_C_OnAddFriendClicked__DelegateSignature::TargetName' has a wrong offset!");

// Function Results_TeleportPad.Results_TeleportPad_C.OnUpVoteClicked__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct Results_TeleportPad_C_OnUpVoteClicked__DelegateSignature final
{
public:
	struct FUniqueNetIdRepl                       TargetId;                                          // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FString                                 TargetName;                                        // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeleportPad_C_OnUpVoteClicked__DelegateSignature) == 0x000008, "Wrong alignment on Results_TeleportPad_C_OnUpVoteClicked__DelegateSignature");
static_assert(sizeof(Results_TeleportPad_C_OnUpVoteClicked__DelegateSignature) == 0x000038, "Wrong size on Results_TeleportPad_C_OnUpVoteClicked__DelegateSignature");
static_assert(offsetof(Results_TeleportPad_C_OnUpVoteClicked__DelegateSignature, TargetId) == 0x000000, "Member 'Results_TeleportPad_C_OnUpVoteClicked__DelegateSignature::TargetId' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_OnUpVoteClicked__DelegateSignature, TargetName) == 0x000028, "Member 'Results_TeleportPad_C_OnUpVoteClicked__DelegateSignature::TargetName' has a wrong offset!");

// Function Results_TeleportPad.Results_TeleportPad_C.ExecuteUbergraph_Results_TeleportPad
// 0x02A0 (0x02A0 - 0x0000)
struct Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Should_Hide_Exit_Timer_bHideExitTimer;    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_A_Execution_Happened_Variable;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_B_Execution_Happened_Variable;           // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UResults_TeleportPadPlayer_C*           CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidPad_bIsValid;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UResults_TeleportPadPlayer_C*           CallFunc_Array_Get_Item2;                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidPad_bIsValid2;                     // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_TimeRemainingSeconds;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Percent;                              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_ComponentBoundEvent_TargetId8;              // 0x0070(0x0028)(HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_TargetName8;            // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UResults_TeleportPadPlayer_C*           CallFunc_Array_Get_Item3;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidPad_bIsValid3;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       K2Node_ComponentBoundEvent_TargetId7;              // 0x00C0(0x0028)(HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_TargetName7;            // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_ComponentBoundEvent_TargetId6;              // 0x00F8(0x0028)(HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_TargetName6;            // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_ComponentBoundEvent_TargetId5;              // 0x0130(0x0028)(HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_TargetName5;            // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_ComponentBoundEvent_TargetId4;              // 0x0168(0x0028)(HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_TargetName4;            // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_ComponentBoundEvent_TargetId3;              // 0x01A0(0x0028)(HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_TargetName3;            // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_ComponentBoundEvent_TargetId2;              // 0x01D8(0x0028)(HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_TargetName2;            // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       K2Node_ComponentBoundEvent_TargetId;               // 0x0210(0x0028)(HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_TargetName;             // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UResults_TeleportPadPlayer_C*           K2Node_ComponentBoundEvent_TeleportPadPlayer4;     // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UResults_TeleportPadPlayer_C*           K2Node_ComponentBoundEvent_TeleportPadPlayer3;     // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayersPad_bIsLocalPlayersPad;     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocalPlayersPad_bIsLocalPlayersPad2;    // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_262[0x6];                                      // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UResults_TeleportPadPlayer_C*           K2Node_ComponentBoundEvent_TeleportPadPlayer2;     // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UResults_TeleportPadPlayer_C*           K2Node_ComponentBoundEvent_TeleportPadPlayer;      // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayersPad_bIsLocalPlayersPad3;    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocalPlayersPad_bIsLocalPlayersPad4;    // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A[0x2];                                      // 0x027A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable4;                   // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable4;                    // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UResults_TeleportPadPlayer_C*           CallFunc_Array_Get_Item4;                          // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidPad_bIsValid4;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_292[0x2];                                      // 0x0292(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Should_Hide_Exit_Timer_bHideExitTimer2;   // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad) == 0x000008, "Wrong alignment on Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad");
static_assert(sizeof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad) == 0x0002A0, "Wrong size on Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, EntryPoint) == 0x000000, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::EntryPoint' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_Should_Hide_Exit_Timer_bHideExitTimer) == 0x000004, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_Should_Hide_Exit_Timer_bHideExitTimer' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, Temp_bool_A_Execution_Happened_Variable) == 0x000005, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::Temp_bool_A_Execution_Happened_Variable' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, Temp_bool_B_Execution_Happened_Variable) == 0x000006, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::Temp_bool_B_Execution_Happened_Variable' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_BooleanAND_ReturnValue) == 0x000007, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, Temp_int_Loop_Counter_Variable2) == 0x00000C, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_Add_IntInt_ReturnValue2) == 0x000014, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, Temp_int_Array_Index_Variable) == 0x000018, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, Temp_int_Loop_Counter_Variable3) == 0x00001C, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_Add_IntInt_ReturnValue3) == 0x000020, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_Array_Length_ReturnValue2) == 0x000028, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_Less_IntInt_ReturnValue2) == 0x00002D, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, Temp_int_Array_Index_Variable2) == 0x000030, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, Temp_int_Array_Index_Variable3) == 0x000034, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_Array_Get_Item) == 0x000038, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_IsValidPad_bIsValid) == 0x000040, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_IsValidPad_bIsValid' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_Array_Get_Item2) == 0x000048, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_Array_Length_ReturnValue3) == 0x000050, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_IsValidPad_bIsValid2) == 0x000054, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_IsValidPad_bIsValid2' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, K2Node_Event_TimeRemainingSeconds) == 0x000058, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::K2Node_Event_TimeRemainingSeconds' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00005C, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, K2Node_Event_Percent) == 0x000060, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::K2Node_Event_Percent' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000068, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, K2Node_ComponentBoundEvent_TargetId8) == 0x000070, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::K2Node_ComponentBoundEvent_TargetId8' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, K2Node_ComponentBoundEvent_TargetName8) == 0x000098, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::K2Node_ComponentBoundEvent_TargetName8' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_Array_Get_Item3) == 0x0000A8, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_IsValidPad_bIsValid3) == 0x0000B0, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_IsValidPad_bIsValid3' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_Array_Length_ReturnValue4) == 0x0000B4, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_Less_IntInt_ReturnValue3) == 0x0000B8, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, K2Node_ComponentBoundEvent_TargetId7) == 0x0000C0, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::K2Node_ComponentBoundEvent_TargetId7' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, K2Node_ComponentBoundEvent_TargetName7) == 0x0000E8, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::K2Node_ComponentBoundEvent_TargetName7' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, K2Node_ComponentBoundEvent_TargetId6) == 0x0000F8, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::K2Node_ComponentBoundEvent_TargetId6' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, K2Node_ComponentBoundEvent_TargetName6) == 0x000120, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::K2Node_ComponentBoundEvent_TargetName6' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, K2Node_ComponentBoundEvent_TargetId5) == 0x000130, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::K2Node_ComponentBoundEvent_TargetId5' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, K2Node_ComponentBoundEvent_TargetName5) == 0x000158, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::K2Node_ComponentBoundEvent_TargetName5' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, K2Node_ComponentBoundEvent_TargetId4) == 0x000168, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::K2Node_ComponentBoundEvent_TargetId4' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, K2Node_ComponentBoundEvent_TargetName4) == 0x000190, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::K2Node_ComponentBoundEvent_TargetName4' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, K2Node_ComponentBoundEvent_TargetId3) == 0x0001A0, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::K2Node_ComponentBoundEvent_TargetId3' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, K2Node_ComponentBoundEvent_TargetName3) == 0x0001C8, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::K2Node_ComponentBoundEvent_TargetName3' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, K2Node_ComponentBoundEvent_TargetId2) == 0x0001D8, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::K2Node_ComponentBoundEvent_TargetId2' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, K2Node_ComponentBoundEvent_TargetName2) == 0x000200, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::K2Node_ComponentBoundEvent_TargetName2' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, K2Node_ComponentBoundEvent_TargetId) == 0x000210, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::K2Node_ComponentBoundEvent_TargetId' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, K2Node_ComponentBoundEvent_TargetName) == 0x000238, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::K2Node_ComponentBoundEvent_TargetName' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, K2Node_ComponentBoundEvent_Button) == 0x000248, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, K2Node_ComponentBoundEvent_TeleportPadPlayer4) == 0x000250, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::K2Node_ComponentBoundEvent_TeleportPadPlayer4' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, K2Node_ComponentBoundEvent_TeleportPadPlayer3) == 0x000258, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::K2Node_ComponentBoundEvent_TeleportPadPlayer3' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_IsLocalPlayersPad_bIsLocalPlayersPad) == 0x000260, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_IsLocalPlayersPad_bIsLocalPlayersPad' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_IsLocalPlayersPad_bIsLocalPlayersPad2) == 0x000261, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_IsLocalPlayersPad_bIsLocalPlayersPad2' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, K2Node_ComponentBoundEvent_TeleportPadPlayer2) == 0x000268, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::K2Node_ComponentBoundEvent_TeleportPadPlayer2' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, K2Node_ComponentBoundEvent_TeleportPadPlayer) == 0x000270, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::K2Node_ComponentBoundEvent_TeleportPadPlayer' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_IsLocalPlayersPad_bIsLocalPlayersPad3) == 0x000278, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_IsLocalPlayersPad_bIsLocalPlayersPad3' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_IsLocalPlayersPad_bIsLocalPlayersPad4) == 0x000279, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_IsLocalPlayersPad_bIsLocalPlayersPad4' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, Temp_int_Loop_Counter_Variable4) == 0x00027C, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::Temp_int_Loop_Counter_Variable4' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, Temp_int_Array_Index_Variable4) == 0x000280, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::Temp_int_Array_Index_Variable4' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_Array_Get_Item4) == 0x000288, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_IsValidPad_bIsValid4) == 0x000290, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_IsValidPad_bIsValid4' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_Less_IntInt_ReturnValue4) == 0x000291, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_Less_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_Add_IntInt_ReturnValue4) == 0x000294, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad, CallFunc_Should_Hide_Exit_Timer_bHideExitTimer2) == 0x000298, "Member 'Results_TeleportPad_C_ExecuteUbergraph_Results_TeleportPad::CallFunc_Should_Hide_Exit_Timer_bHideExitTimer2' has a wrong offset!");

// Function Results_TeleportPad.Results_TeleportPad_C.BndEvt__Pad4_K2Node_ComponentBoundEvent_7_OnTeleportPadIntroFinished__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Results_TeleportPad_C_BndEvt__Pad4_K2Node_ComponentBoundEvent_7_OnTeleportPadIntroFinished__DelegateSignature final
{
public:
	class UResults_TeleportPadPlayer_C*           TeleportPadPlayer;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeleportPad_C_BndEvt__Pad4_K2Node_ComponentBoundEvent_7_OnTeleportPadIntroFinished__DelegateSignature) == 0x000008, "Wrong alignment on Results_TeleportPad_C_BndEvt__Pad4_K2Node_ComponentBoundEvent_7_OnTeleportPadIntroFinished__DelegateSignature");
static_assert(sizeof(Results_TeleportPad_C_BndEvt__Pad4_K2Node_ComponentBoundEvent_7_OnTeleportPadIntroFinished__DelegateSignature) == 0x000008, "Wrong size on Results_TeleportPad_C_BndEvt__Pad4_K2Node_ComponentBoundEvent_7_OnTeleportPadIntroFinished__DelegateSignature");
static_assert(offsetof(Results_TeleportPad_C_BndEvt__Pad4_K2Node_ComponentBoundEvent_7_OnTeleportPadIntroFinished__DelegateSignature, TeleportPadPlayer) == 0x000000, "Member 'Results_TeleportPad_C_BndEvt__Pad4_K2Node_ComponentBoundEvent_7_OnTeleportPadIntroFinished__DelegateSignature::TeleportPadPlayer' has a wrong offset!");

// Function Results_TeleportPad.Results_TeleportPad_C.BndEvt__Pad3_K2Node_ComponentBoundEvent_6_OnTeleportPadIntroFinished__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Results_TeleportPad_C_BndEvt__Pad3_K2Node_ComponentBoundEvent_6_OnTeleportPadIntroFinished__DelegateSignature final
{
public:
	class UResults_TeleportPadPlayer_C*           TeleportPadPlayer;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeleportPad_C_BndEvt__Pad3_K2Node_ComponentBoundEvent_6_OnTeleportPadIntroFinished__DelegateSignature) == 0x000008, "Wrong alignment on Results_TeleportPad_C_BndEvt__Pad3_K2Node_ComponentBoundEvent_6_OnTeleportPadIntroFinished__DelegateSignature");
static_assert(sizeof(Results_TeleportPad_C_BndEvt__Pad3_K2Node_ComponentBoundEvent_6_OnTeleportPadIntroFinished__DelegateSignature) == 0x000008, "Wrong size on Results_TeleportPad_C_BndEvt__Pad3_K2Node_ComponentBoundEvent_6_OnTeleportPadIntroFinished__DelegateSignature");
static_assert(offsetof(Results_TeleportPad_C_BndEvt__Pad3_K2Node_ComponentBoundEvent_6_OnTeleportPadIntroFinished__DelegateSignature, TeleportPadPlayer) == 0x000000, "Member 'Results_TeleportPad_C_BndEvt__Pad3_K2Node_ComponentBoundEvent_6_OnTeleportPadIntroFinished__DelegateSignature::TeleportPadPlayer' has a wrong offset!");

// Function Results_TeleportPad.Results_TeleportPad_C.BndEvt__Pad2_K2Node_ComponentBoundEvent_5_OnTeleportPadIntroFinished__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Results_TeleportPad_C_BndEvt__Pad2_K2Node_ComponentBoundEvent_5_OnTeleportPadIntroFinished__DelegateSignature final
{
public:
	class UResults_TeleportPadPlayer_C*           TeleportPadPlayer;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeleportPad_C_BndEvt__Pad2_K2Node_ComponentBoundEvent_5_OnTeleportPadIntroFinished__DelegateSignature) == 0x000008, "Wrong alignment on Results_TeleportPad_C_BndEvt__Pad2_K2Node_ComponentBoundEvent_5_OnTeleportPadIntroFinished__DelegateSignature");
static_assert(sizeof(Results_TeleportPad_C_BndEvt__Pad2_K2Node_ComponentBoundEvent_5_OnTeleportPadIntroFinished__DelegateSignature) == 0x000008, "Wrong size on Results_TeleportPad_C_BndEvt__Pad2_K2Node_ComponentBoundEvent_5_OnTeleportPadIntroFinished__DelegateSignature");
static_assert(offsetof(Results_TeleportPad_C_BndEvt__Pad2_K2Node_ComponentBoundEvent_5_OnTeleportPadIntroFinished__DelegateSignature, TeleportPadPlayer) == 0x000000, "Member 'Results_TeleportPad_C_BndEvt__Pad2_K2Node_ComponentBoundEvent_5_OnTeleportPadIntroFinished__DelegateSignature::TeleportPadPlayer' has a wrong offset!");

// Function Results_TeleportPad.Results_TeleportPad_C.BndEvt__Pad1_K2Node_ComponentBoundEvent_4_OnTeleportPadIntroFinished__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Results_TeleportPad_C_BndEvt__Pad1_K2Node_ComponentBoundEvent_4_OnTeleportPadIntroFinished__DelegateSignature final
{
public:
	class UResults_TeleportPadPlayer_C*           TeleportPadPlayer;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeleportPad_C_BndEvt__Pad1_K2Node_ComponentBoundEvent_4_OnTeleportPadIntroFinished__DelegateSignature) == 0x000008, "Wrong alignment on Results_TeleportPad_C_BndEvt__Pad1_K2Node_ComponentBoundEvent_4_OnTeleportPadIntroFinished__DelegateSignature");
static_assert(sizeof(Results_TeleportPad_C_BndEvt__Pad1_K2Node_ComponentBoundEvent_4_OnTeleportPadIntroFinished__DelegateSignature) == 0x000008, "Wrong size on Results_TeleportPad_C_BndEvt__Pad1_K2Node_ComponentBoundEvent_4_OnTeleportPadIntroFinished__DelegateSignature");
static_assert(offsetof(Results_TeleportPad_C_BndEvt__Pad1_K2Node_ComponentBoundEvent_4_OnTeleportPadIntroFinished__DelegateSignature, TeleportPadPlayer) == 0x000000, "Member 'Results_TeleportPad_C_BndEvt__Pad1_K2Node_ComponentBoundEvent_4_OnTeleportPadIntroFinished__DelegateSignature::TeleportPadPlayer' has a wrong offset!");

// Function Results_TeleportPad.Results_TeleportPad_C.BndEvt__ButtonReturnHome_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Results_TeleportPad_C_BndEvt__ButtonReturnHome_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeleportPad_C_BndEvt__ButtonReturnHome_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on Results_TeleportPad_C_BndEvt__ButtonReturnHome_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(Results_TeleportPad_C_BndEvt__ButtonReturnHome_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on Results_TeleportPad_C_BndEvt__ButtonReturnHome_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(Results_TeleportPad_C_BndEvt__ButtonReturnHome_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'Results_TeleportPad_C_BndEvt__ButtonReturnHome_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function Results_TeleportPad.Results_TeleportPad_C.BndEvt__TeleportPad4_K2Node_ComponentBoundEvent_6_OnUpVoteClicked__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct Results_TeleportPad_C_BndEvt__TeleportPad4_K2Node_ComponentBoundEvent_6_OnUpVoteClicked__DelegateSignature final
{
public:
	struct FUniqueNetIdRepl                       TargetId;                                          // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FString                                 TargetName;                                        // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeleportPad_C_BndEvt__TeleportPad4_K2Node_ComponentBoundEvent_6_OnUpVoteClicked__DelegateSignature) == 0x000008, "Wrong alignment on Results_TeleportPad_C_BndEvt__TeleportPad4_K2Node_ComponentBoundEvent_6_OnUpVoteClicked__DelegateSignature");
static_assert(sizeof(Results_TeleportPad_C_BndEvt__TeleportPad4_K2Node_ComponentBoundEvent_6_OnUpVoteClicked__DelegateSignature) == 0x000038, "Wrong size on Results_TeleportPad_C_BndEvt__TeleportPad4_K2Node_ComponentBoundEvent_6_OnUpVoteClicked__DelegateSignature");
static_assert(offsetof(Results_TeleportPad_C_BndEvt__TeleportPad4_K2Node_ComponentBoundEvent_6_OnUpVoteClicked__DelegateSignature, TargetId) == 0x000000, "Member 'Results_TeleportPad_C_BndEvt__TeleportPad4_K2Node_ComponentBoundEvent_6_OnUpVoteClicked__DelegateSignature::TargetId' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_BndEvt__TeleportPad4_K2Node_ComponentBoundEvent_6_OnUpVoteClicked__DelegateSignature, TargetName) == 0x000028, "Member 'Results_TeleportPad_C_BndEvt__TeleportPad4_K2Node_ComponentBoundEvent_6_OnUpVoteClicked__DelegateSignature::TargetName' has a wrong offset!");

// Function Results_TeleportPad.Results_TeleportPad_C.BndEvt__TeleportPad3_K2Node_ComponentBoundEvent_5_OnUpVoteClicked__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct Results_TeleportPad_C_BndEvt__TeleportPad3_K2Node_ComponentBoundEvent_5_OnUpVoteClicked__DelegateSignature final
{
public:
	struct FUniqueNetIdRepl                       TargetId;                                          // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FString                                 TargetName;                                        // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeleportPad_C_BndEvt__TeleportPad3_K2Node_ComponentBoundEvent_5_OnUpVoteClicked__DelegateSignature) == 0x000008, "Wrong alignment on Results_TeleportPad_C_BndEvt__TeleportPad3_K2Node_ComponentBoundEvent_5_OnUpVoteClicked__DelegateSignature");
static_assert(sizeof(Results_TeleportPad_C_BndEvt__TeleportPad3_K2Node_ComponentBoundEvent_5_OnUpVoteClicked__DelegateSignature) == 0x000038, "Wrong size on Results_TeleportPad_C_BndEvt__TeleportPad3_K2Node_ComponentBoundEvent_5_OnUpVoteClicked__DelegateSignature");
static_assert(offsetof(Results_TeleportPad_C_BndEvt__TeleportPad3_K2Node_ComponentBoundEvent_5_OnUpVoteClicked__DelegateSignature, TargetId) == 0x000000, "Member 'Results_TeleportPad_C_BndEvt__TeleportPad3_K2Node_ComponentBoundEvent_5_OnUpVoteClicked__DelegateSignature::TargetId' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_BndEvt__TeleportPad3_K2Node_ComponentBoundEvent_5_OnUpVoteClicked__DelegateSignature, TargetName) == 0x000028, "Member 'Results_TeleportPad_C_BndEvt__TeleportPad3_K2Node_ComponentBoundEvent_5_OnUpVoteClicked__DelegateSignature::TargetName' has a wrong offset!");

// Function Results_TeleportPad.Results_TeleportPad_C.BndEvt__TeleportPad2_K2Node_ComponentBoundEvent_4_OnUpVoteClicked__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct Results_TeleportPad_C_BndEvt__TeleportPad2_K2Node_ComponentBoundEvent_4_OnUpVoteClicked__DelegateSignature final
{
public:
	struct FUniqueNetIdRepl                       TargetId;                                          // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FString                                 TargetName;                                        // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeleportPad_C_BndEvt__TeleportPad2_K2Node_ComponentBoundEvent_4_OnUpVoteClicked__DelegateSignature) == 0x000008, "Wrong alignment on Results_TeleportPad_C_BndEvt__TeleportPad2_K2Node_ComponentBoundEvent_4_OnUpVoteClicked__DelegateSignature");
static_assert(sizeof(Results_TeleportPad_C_BndEvt__TeleportPad2_K2Node_ComponentBoundEvent_4_OnUpVoteClicked__DelegateSignature) == 0x000038, "Wrong size on Results_TeleportPad_C_BndEvt__TeleportPad2_K2Node_ComponentBoundEvent_4_OnUpVoteClicked__DelegateSignature");
static_assert(offsetof(Results_TeleportPad_C_BndEvt__TeleportPad2_K2Node_ComponentBoundEvent_4_OnUpVoteClicked__DelegateSignature, TargetId) == 0x000000, "Member 'Results_TeleportPad_C_BndEvt__TeleportPad2_K2Node_ComponentBoundEvent_4_OnUpVoteClicked__DelegateSignature::TargetId' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_BndEvt__TeleportPad2_K2Node_ComponentBoundEvent_4_OnUpVoteClicked__DelegateSignature, TargetName) == 0x000028, "Member 'Results_TeleportPad_C_BndEvt__TeleportPad2_K2Node_ComponentBoundEvent_4_OnUpVoteClicked__DelegateSignature::TargetName' has a wrong offset!");

// Function Results_TeleportPad.Results_TeleportPad_C.BndEvt__TeleportPad1_K2Node_ComponentBoundEvent_3_OnUpVoteClicked__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct Results_TeleportPad_C_BndEvt__TeleportPad1_K2Node_ComponentBoundEvent_3_OnUpVoteClicked__DelegateSignature final
{
public:
	struct FUniqueNetIdRepl                       TargetId;                                          // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FString                                 TargetName;                                        // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeleportPad_C_BndEvt__TeleportPad1_K2Node_ComponentBoundEvent_3_OnUpVoteClicked__DelegateSignature) == 0x000008, "Wrong alignment on Results_TeleportPad_C_BndEvt__TeleportPad1_K2Node_ComponentBoundEvent_3_OnUpVoteClicked__DelegateSignature");
static_assert(sizeof(Results_TeleportPad_C_BndEvt__TeleportPad1_K2Node_ComponentBoundEvent_3_OnUpVoteClicked__DelegateSignature) == 0x000038, "Wrong size on Results_TeleportPad_C_BndEvt__TeleportPad1_K2Node_ComponentBoundEvent_3_OnUpVoteClicked__DelegateSignature");
static_assert(offsetof(Results_TeleportPad_C_BndEvt__TeleportPad1_K2Node_ComponentBoundEvent_3_OnUpVoteClicked__DelegateSignature, TargetId) == 0x000000, "Member 'Results_TeleportPad_C_BndEvt__TeleportPad1_K2Node_ComponentBoundEvent_3_OnUpVoteClicked__DelegateSignature::TargetId' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_BndEvt__TeleportPad1_K2Node_ComponentBoundEvent_3_OnUpVoteClicked__DelegateSignature, TargetName) == 0x000028, "Member 'Results_TeleportPad_C_BndEvt__TeleportPad1_K2Node_ComponentBoundEvent_3_OnUpVoteClicked__DelegateSignature::TargetName' has a wrong offset!");

// Function Results_TeleportPad.Results_TeleportPad_C.BndEvt__TeleportPad4_K2Node_ComponentBoundEvent_2_OnAddFriendClicked__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct Results_TeleportPad_C_BndEvt__TeleportPad4_K2Node_ComponentBoundEvent_2_OnAddFriendClicked__DelegateSignature final
{
public:
	struct FUniqueNetIdRepl                       TargetId;                                          // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FString                                 TargetName;                                        // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeleportPad_C_BndEvt__TeleportPad4_K2Node_ComponentBoundEvent_2_OnAddFriendClicked__DelegateSignature) == 0x000008, "Wrong alignment on Results_TeleportPad_C_BndEvt__TeleportPad4_K2Node_ComponentBoundEvent_2_OnAddFriendClicked__DelegateSignature");
static_assert(sizeof(Results_TeleportPad_C_BndEvt__TeleportPad4_K2Node_ComponentBoundEvent_2_OnAddFriendClicked__DelegateSignature) == 0x000038, "Wrong size on Results_TeleportPad_C_BndEvt__TeleportPad4_K2Node_ComponentBoundEvent_2_OnAddFriendClicked__DelegateSignature");
static_assert(offsetof(Results_TeleportPad_C_BndEvt__TeleportPad4_K2Node_ComponentBoundEvent_2_OnAddFriendClicked__DelegateSignature, TargetId) == 0x000000, "Member 'Results_TeleportPad_C_BndEvt__TeleportPad4_K2Node_ComponentBoundEvent_2_OnAddFriendClicked__DelegateSignature::TargetId' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_BndEvt__TeleportPad4_K2Node_ComponentBoundEvent_2_OnAddFriendClicked__DelegateSignature, TargetName) == 0x000028, "Member 'Results_TeleportPad_C_BndEvt__TeleportPad4_K2Node_ComponentBoundEvent_2_OnAddFriendClicked__DelegateSignature::TargetName' has a wrong offset!");

// Function Results_TeleportPad.Results_TeleportPad_C.BndEvt__TeleportPad3_K2Node_ComponentBoundEvent_1_OnAddFriendClicked__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct Results_TeleportPad_C_BndEvt__TeleportPad3_K2Node_ComponentBoundEvent_1_OnAddFriendClicked__DelegateSignature final
{
public:
	struct FUniqueNetIdRepl                       TargetId;                                          // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FString                                 TargetName;                                        // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeleportPad_C_BndEvt__TeleportPad3_K2Node_ComponentBoundEvent_1_OnAddFriendClicked__DelegateSignature) == 0x000008, "Wrong alignment on Results_TeleportPad_C_BndEvt__TeleportPad3_K2Node_ComponentBoundEvent_1_OnAddFriendClicked__DelegateSignature");
static_assert(sizeof(Results_TeleportPad_C_BndEvt__TeleportPad3_K2Node_ComponentBoundEvent_1_OnAddFriendClicked__DelegateSignature) == 0x000038, "Wrong size on Results_TeleportPad_C_BndEvt__TeleportPad3_K2Node_ComponentBoundEvent_1_OnAddFriendClicked__DelegateSignature");
static_assert(offsetof(Results_TeleportPad_C_BndEvt__TeleportPad3_K2Node_ComponentBoundEvent_1_OnAddFriendClicked__DelegateSignature, TargetId) == 0x000000, "Member 'Results_TeleportPad_C_BndEvt__TeleportPad3_K2Node_ComponentBoundEvent_1_OnAddFriendClicked__DelegateSignature::TargetId' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_BndEvt__TeleportPad3_K2Node_ComponentBoundEvent_1_OnAddFriendClicked__DelegateSignature, TargetName) == 0x000028, "Member 'Results_TeleportPad_C_BndEvt__TeleportPad3_K2Node_ComponentBoundEvent_1_OnAddFriendClicked__DelegateSignature::TargetName' has a wrong offset!");

// Function Results_TeleportPad.Results_TeleportPad_C.BndEvt__TeleportPad2_K2Node_ComponentBoundEvent_0_OnAddFriendClicked__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct Results_TeleportPad_C_BndEvt__TeleportPad2_K2Node_ComponentBoundEvent_0_OnAddFriendClicked__DelegateSignature final
{
public:
	struct FUniqueNetIdRepl                       TargetId;                                          // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FString                                 TargetName;                                        // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeleportPad_C_BndEvt__TeleportPad2_K2Node_ComponentBoundEvent_0_OnAddFriendClicked__DelegateSignature) == 0x000008, "Wrong alignment on Results_TeleportPad_C_BndEvt__TeleportPad2_K2Node_ComponentBoundEvent_0_OnAddFriendClicked__DelegateSignature");
static_assert(sizeof(Results_TeleportPad_C_BndEvt__TeleportPad2_K2Node_ComponentBoundEvent_0_OnAddFriendClicked__DelegateSignature) == 0x000038, "Wrong size on Results_TeleportPad_C_BndEvt__TeleportPad2_K2Node_ComponentBoundEvent_0_OnAddFriendClicked__DelegateSignature");
static_assert(offsetof(Results_TeleportPad_C_BndEvt__TeleportPad2_K2Node_ComponentBoundEvent_0_OnAddFriendClicked__DelegateSignature, TargetId) == 0x000000, "Member 'Results_TeleportPad_C_BndEvt__TeleportPad2_K2Node_ComponentBoundEvent_0_OnAddFriendClicked__DelegateSignature::TargetId' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_BndEvt__TeleportPad2_K2Node_ComponentBoundEvent_0_OnAddFriendClicked__DelegateSignature, TargetName) == 0x000028, "Member 'Results_TeleportPad_C_BndEvt__TeleportPad2_K2Node_ComponentBoundEvent_0_OnAddFriendClicked__DelegateSignature::TargetName' has a wrong offset!");

// Function Results_TeleportPad.Results_TeleportPad_C.BndEvt__TeleportPad1_K2Node_ComponentBoundEvent_35_OnAddFriendClicked__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct Results_TeleportPad_C_BndEvt__TeleportPad1_K2Node_ComponentBoundEvent_35_OnAddFriendClicked__DelegateSignature final
{
public:
	struct FUniqueNetIdRepl                       TargetId;                                          // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FString                                 TargetName;                                        // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeleportPad_C_BndEvt__TeleportPad1_K2Node_ComponentBoundEvent_35_OnAddFriendClicked__DelegateSignature) == 0x000008, "Wrong alignment on Results_TeleportPad_C_BndEvt__TeleportPad1_K2Node_ComponentBoundEvent_35_OnAddFriendClicked__DelegateSignature");
static_assert(sizeof(Results_TeleportPad_C_BndEvt__TeleportPad1_K2Node_ComponentBoundEvent_35_OnAddFriendClicked__DelegateSignature) == 0x000038, "Wrong size on Results_TeleportPad_C_BndEvt__TeleportPad1_K2Node_ComponentBoundEvent_35_OnAddFriendClicked__DelegateSignature");
static_assert(offsetof(Results_TeleportPad_C_BndEvt__TeleportPad1_K2Node_ComponentBoundEvent_35_OnAddFriendClicked__DelegateSignature, TargetId) == 0x000000, "Member 'Results_TeleportPad_C_BndEvt__TeleportPad1_K2Node_ComponentBoundEvent_35_OnAddFriendClicked__DelegateSignature::TargetId' has a wrong offset!");
static_assert(offsetof(Results_TeleportPad_C_BndEvt__TeleportPad1_K2Node_ComponentBoundEvent_35_OnAddFriendClicked__DelegateSignature, TargetName) == 0x000028, "Member 'Results_TeleportPad_C_BndEvt__TeleportPad1_K2Node_ComponentBoundEvent_35_OnAddFriendClicked__DelegateSignature::TargetName' has a wrong offset!");

// Function Results_TeleportPad.Results_TeleportPad_C.OnExitTimePercentagePassedUpdated
// 0x0004 (0x0004 - 0x0000)
struct Results_TeleportPad_C_OnExitTimePercentagePassedUpdated final
{
public:
	float                                         Percent;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeleportPad_C_OnExitTimePercentagePassedUpdated) == 0x000004, "Wrong alignment on Results_TeleportPad_C_OnExitTimePercentagePassedUpdated");
static_assert(sizeof(Results_TeleportPad_C_OnExitTimePercentagePassedUpdated) == 0x000004, "Wrong size on Results_TeleportPad_C_OnExitTimePercentagePassedUpdated");
static_assert(offsetof(Results_TeleportPad_C_OnExitTimePercentagePassedUpdated, Percent) == 0x000000, "Member 'Results_TeleportPad_C_OnExitTimePercentagePassedUpdated::Percent' has a wrong offset!");

// Function Results_TeleportPad.Results_TeleportPad_C.OnExitTimeRemainingUpdated
// 0x0004 (0x0004 - 0x0000)
struct Results_TeleportPad_C_OnExitTimeRemainingUpdated final
{
public:
	int32                                         TimeRemainingSeconds;                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeleportPad_C_OnExitTimeRemainingUpdated) == 0x000004, "Wrong alignment on Results_TeleportPad_C_OnExitTimeRemainingUpdated");
static_assert(sizeof(Results_TeleportPad_C_OnExitTimeRemainingUpdated) == 0x000004, "Wrong size on Results_TeleportPad_C_OnExitTimeRemainingUpdated");
static_assert(offsetof(Results_TeleportPad_C_OnExitTimeRemainingUpdated, TimeRemainingSeconds) == 0x000000, "Member 'Results_TeleportPad_C_OnExitTimeRemainingUpdated::TimeRemainingSeconds' has a wrong offset!");

// Function Results_TeleportPad.Results_TeleportPad_C.Initialize
// 0x00F0 (0x00F0 - 0x0000)
struct Results_TeleportPad_C_Initialize final
{
public:
	class UFortUIScoreReport*                     InScoreReport;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCompletionResult                         Param_CompletionResult;                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UResults_TeleportPadPlayer_C*           CurrentTeleportPad;                                // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentScoreReportIndex;                           // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIScoreReport*                     ScoreReport;                                       // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayerCount_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_GetScoreReportIndicesByPlayerID_SortedScoreReportIndices; // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerCount_ReturnValue2;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UResults_TeleportPadPlayer_C*           CallFunc_Array_Get_Item2;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
