#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Results_TeamScoreBox

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function Results_TeamScoreBox.Results_TeamScoreBox_C.ExecuteUbergraph_Results_TeamScoreBox
// 0x0030 (0x0030 - 0x0000)
struct Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue2;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue4;                   // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue5;                   // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCommonNumericTextBlock*                K2Node_ComponentBoundEvent_NumericTextBlock;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_HadCompleted;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue6;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue2;         // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox) == 0x000008, "Wrong alignment on Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox");
static_assert(sizeof(Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox) == 0x000030, "Wrong size on Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox");
static_assert(offsetof(Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox, EntryPoint) == 0x000000, "Member 'Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox, CallFunc_BooleanOR_ReturnValue2) == 0x000005, "Member 'Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox, CallFunc_BooleanOR_ReturnValue3) == 0x000006, "Member 'Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000008, "Member 'Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox, K2Node_Event_IsDesignTime) == 0x00000C, "Member 'Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000010, "Member 'Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x000014, "Member 'Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox, CallFunc_RandomIntegerInRange_ReturnValue2) == 0x000018, "Member 'Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox::CallFunc_RandomIntegerInRange_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox, CallFunc_Conv_IntToByte_ReturnValue) == 0x00001C, "Member 'Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox, CallFunc_GetValidValue_ReturnValue) == 0x00001D, "Member 'Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox, CallFunc_BooleanOR_ReturnValue4) == 0x00001E, "Member 'Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox::CallFunc_BooleanOR_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox, CallFunc_BooleanOR_ReturnValue5) == 0x00001F, "Member 'Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox::CallFunc_BooleanOR_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox, K2Node_ComponentBoundEvent_NumericTextBlock) == 0x000020, "Member 'Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox::K2Node_ComponentBoundEvent_NumericTextBlock' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox, K2Node_ComponentBoundEvent_HadCompleted) == 0x000028, "Member 'Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox::K2Node_ComponentBoundEvent_HadCompleted' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000029, "Member 'Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox, CallFunc_BooleanOR_ReturnValue6) == 0x00002A, "Member 'Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox::CallFunc_BooleanOR_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox, CallFunc_NotEqual_FloatFloat_ReturnValue2) == 0x00002B, "Member 'Results_TeamScoreBox_C_ExecuteUbergraph_Results_TeamScoreBox::CallFunc_NotEqual_FloatFloat_ReturnValue2' has a wrong offset!");

// Function Results_TeamScoreBox.Results_TeamScoreBox_C.BndEvt__TextScore_K2Node_ComponentBoundEvent_0_OnInterpolationEnded__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Results_TeamScoreBox_C_BndEvt__TextScore_K2Node_ComponentBoundEvent_0_OnInterpolationEnded__DelegateSignature final
{
public:
	class UCommonNumericTextBlock*                NumericTextBlock;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HadCompleted;                                      // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_TeamScoreBox_C_BndEvt__TextScore_K2Node_ComponentBoundEvent_0_OnInterpolationEnded__DelegateSignature) == 0x000008, "Wrong alignment on Results_TeamScoreBox_C_BndEvt__TextScore_K2Node_ComponentBoundEvent_0_OnInterpolationEnded__DelegateSignature");
static_assert(sizeof(Results_TeamScoreBox_C_BndEvt__TextScore_K2Node_ComponentBoundEvent_0_OnInterpolationEnded__DelegateSignature) == 0x000010, "Wrong size on Results_TeamScoreBox_C_BndEvt__TextScore_K2Node_ComponentBoundEvent_0_OnInterpolationEnded__DelegateSignature");
static_assert(offsetof(Results_TeamScoreBox_C_BndEvt__TextScore_K2Node_ComponentBoundEvent_0_OnInterpolationEnded__DelegateSignature, NumericTextBlock) == 0x000000, "Member 'Results_TeamScoreBox_C_BndEvt__TextScore_K2Node_ComponentBoundEvent_0_OnInterpolationEnded__DelegateSignature::NumericTextBlock' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_BndEvt__TextScore_K2Node_ComponentBoundEvent_0_OnInterpolationEnded__DelegateSignature, HadCompleted) == 0x000008, "Member 'Results_TeamScoreBox_C_BndEvt__TextScore_K2Node_ComponentBoundEvent_0_OnInterpolationEnded__DelegateSignature::HadCompleted' has a wrong offset!");

// Function Results_TeamScoreBox.Results_TeamScoreBox_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Results_TeamScoreBox_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_TeamScoreBox_C_PreConstruct) == 0x000001, "Wrong alignment on Results_TeamScoreBox_C_PreConstruct");
static_assert(sizeof(Results_TeamScoreBox_C_PreConstruct) == 0x000001, "Wrong size on Results_TeamScoreBox_C_PreConstruct");
static_assert(offsetof(Results_TeamScoreBox_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Results_TeamScoreBox_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function Results_TeamScoreBox.Results_TeamScoreBox_C.InitializeScoreType
// 0x0368 (0x0368 - 0x0000)
struct Results_TeamScoreBox_C_InitializeScoreType final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0008(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0018(0x0018)(Edit, BlueprintVisible)
	struct FFortScoreStylingInfo                  CallFunc_GetScoreStylingData_ScoreStylingInfo;     // 0x0030(0x02F8)()
	bool                                          CallFunc_GetScoreStylingData_ReturnValue;          // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0330(0x0028)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_TeamScoreBox_C_InitializeScoreType) == 0x000008, "Wrong alignment on Results_TeamScoreBox_C_InitializeScoreType");
static_assert(sizeof(Results_TeamScoreBox_C_InitializeScoreType) == 0x000368, "Wrong size on Results_TeamScoreBox_C_InitializeScoreType");
static_assert(offsetof(Results_TeamScoreBox_C_InitializeScoreType, Texture) == 0x000000, "Member 'Results_TeamScoreBox_C_InitializeScoreType::Texture' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_InitializeScoreType, Color) == 0x000008, "Member 'Results_TeamScoreBox_C_InitializeScoreType::Color' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_InitializeScoreType, Text) == 0x000018, "Member 'Results_TeamScoreBox_C_InitializeScoreType::Text' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_InitializeScoreType, CallFunc_GetScoreStylingData_ScoreStylingInfo) == 0x000030, "Member 'Results_TeamScoreBox_C_InitializeScoreType::CallFunc_GetScoreStylingData_ScoreStylingInfo' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_InitializeScoreType, CallFunc_GetScoreStylingData_ReturnValue) == 0x000328, "Member 'Results_TeamScoreBox_C_InitializeScoreType::CallFunc_GetScoreStylingData_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_InitializeScoreType, K2Node_MakeStruct_SlateColor) == 0x000330, "Member 'Results_TeamScoreBox_C_InitializeScoreType::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_InitializeScoreType, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000358, "Member 'Results_TeamScoreBox_C_InitializeScoreType::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_InitializeScoreType, K2Node_SwitchEnum_CmpSuccess) == 0x000360, "Member 'Results_TeamScoreBox_C_InitializeScoreType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function Results_TeamScoreBox.Results_TeamScoreBox_C.Initialize
// 0x0010 (0x0010 - 0x0000)
struct Results_TeamScoreBox_C_Initialize final
{
public:
	EFortUIScoreType                              Param_ScoreType;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param_Score;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_PlayRate;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeamScoreBox_C_Initialize) == 0x000004, "Wrong alignment on Results_TeamScoreBox_C_Initialize");
static_assert(sizeof(Results_TeamScoreBox_C_Initialize) == 0x000010, "Wrong size on Results_TeamScoreBox_C_Initialize");
static_assert(offsetof(Results_TeamScoreBox_C_Initialize, Param_ScoreType) == 0x000000, "Member 'Results_TeamScoreBox_C_Initialize::Param_ScoreType' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_Initialize, Param_Score) == 0x000004, "Member 'Results_TeamScoreBox_C_Initialize::Param_Score' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_Initialize, Param_PlayRate) == 0x000008, "Member 'Results_TeamScoreBox_C_Initialize::Param_PlayRate' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_Initialize, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'Results_TeamScoreBox_C_Initialize::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function Results_TeamScoreBox.Results_TeamScoreBox_C.FlashTextType
// 0x0020 (0x0020 - 0x0000)
struct Results_TeamScoreBox_C_FlashTextType final
{
public:
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor)
};
static_assert(alignof(Results_TeamScoreBox_C_FlashTextType) == 0x000008, "Wrong alignment on Results_TeamScoreBox_C_FlashTextType");
static_assert(sizeof(Results_TeamScoreBox_C_FlashTextType) == 0x000020, "Wrong size on Results_TeamScoreBox_C_FlashTextType");
static_assert(offsetof(Results_TeamScoreBox_C_FlashTextType, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000000, "Member 'Results_TeamScoreBox_C_FlashTextType::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_FlashTextType, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Results_TeamScoreBox_C_FlashTextType::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_FlashTextType, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'Results_TeamScoreBox_C_FlashTextType::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function Results_TeamScoreBox.Results_TeamScoreBox_C.UpdateFlashTextType
// 0x0060 (0x0060 - 0x0000)
struct Results_TeamScoreBox_C_UpdateFlashTextType final
{
public:
	struct FLinearColor                           ColorWhite;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimePassed;                                        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0028(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0038(0x0028)()
};
static_assert(alignof(Results_TeamScoreBox_C_UpdateFlashTextType) == 0x000008, "Wrong alignment on Results_TeamScoreBox_C_UpdateFlashTextType");
static_assert(sizeof(Results_TeamScoreBox_C_UpdateFlashTextType) == 0x000060, "Wrong size on Results_TeamScoreBox_C_UpdateFlashTextType");
static_assert(offsetof(Results_TeamScoreBox_C_UpdateFlashTextType, ColorWhite) == 0x000000, "Member 'Results_TeamScoreBox_C_UpdateFlashTextType::ColorWhite' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_UpdateFlashTextType, TimePassed) == 0x000010, "Member 'Results_TeamScoreBox_C_UpdateFlashTextType::TimePassed' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_UpdateFlashTextType, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000014, "Member 'Results_TeamScoreBox_C_UpdateFlashTextType::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_UpdateFlashTextType, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'Results_TeamScoreBox_C_UpdateFlashTextType::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_UpdateFlashTextType, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x00001C, "Member 'Results_TeamScoreBox_C_UpdateFlashTextType::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_UpdateFlashTextType, CallFunc_FClamp_ReturnValue) == 0x000020, "Member 'Results_TeamScoreBox_C_UpdateFlashTextType::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_UpdateFlashTextType, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000024, "Member 'Results_TeamScoreBox_C_UpdateFlashTextType::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_UpdateFlashTextType, CallFunc_LinearColorLerp_ReturnValue) == 0x000028, "Member 'Results_TeamScoreBox_C_UpdateFlashTextType::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_UpdateFlashTextType, K2Node_MakeStruct_SlateColor) == 0x000038, "Member 'Results_TeamScoreBox_C_UpdateFlashTextType::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function Results_TeamScoreBox.Results_TeamScoreBox_C.SetSkippingToEnd
// 0x0002 (0x0002 - 0x0000)
struct Results_TeamScoreBox_C_SetSkippingToEnd final
{
public:
	bool                                          CallFunc_IsInterpolatingNumericValue_ReturnValue;  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_TeamScoreBox_C_SetSkippingToEnd) == 0x000001, "Wrong alignment on Results_TeamScoreBox_C_SetSkippingToEnd");
static_assert(sizeof(Results_TeamScoreBox_C_SetSkippingToEnd) == 0x000002, "Wrong size on Results_TeamScoreBox_C_SetSkippingToEnd");
static_assert(offsetof(Results_TeamScoreBox_C_SetSkippingToEnd, CallFunc_IsInterpolatingNumericValue_ReturnValue) == 0x000000, "Member 'Results_TeamScoreBox_C_SetSkippingToEnd::CallFunc_IsInterpolatingNumericValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScoreBox_C_SetSkippingToEnd, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000001, "Member 'Results_TeamScoreBox_C_SetSkippingToEnd::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");

}

