#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Results_BadgeLoot

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function Results_BadgeLoot.Results_BadgeLoot_C.ExecuteUbergraph_Results_BadgeLoot
// 0x0118 (0x0118 - 0x0000)
struct Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue4;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue5;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue6;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue7;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue8;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue9;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_A_Execution_Happened_Variable;           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_B_Execution_Happened_Variable;           // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_A_Execution_Happened_Variable2;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_B_Execution_Happened_Variable2;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasValidItem_HasValidItem;                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasValidItem_HasValidItem2;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasValidItem_HasValidItem3;               // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UResults_Badge_C*                       CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasValidItem_HasValidItem4;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue10;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       CallFunc_Array_Get_Item2;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasValidItem_HasValidItem5;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasValidItem_HasValidItem6;               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue11;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                K2Node_HandleClientEvent_EventSource4;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventFocus4;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent4;             // 0x0058(0x0020)(NoDestructor)
	class UObject*                                K2Node_HandleClientEvent_EventSource3;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventFocus3;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent3;             // 0x0088(0x0020)(NoDestructor)
	class UObject*                                K2Node_HandleClientEvent_EventSource2;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventFocus2;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent2;             // 0x00B8(0x0020)(NoDestructor)
	class UObject*                                K2Node_HandleClientEvent_EventSource;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_HandleClientEvent_EventFocus;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       K2Node_HandleClientEvent_ClientEvent;              // 0x00E8(0x0020)(NoDestructor)
	bool                                          CallFunc_HasMoreBadgesToShow_bMoreBadgesToShow;    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot) == 0x000008, "Wrong alignment on Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot");
static_assert(sizeof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot) == 0x000118, "Wrong size on Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, EntryPoint) == 0x000000, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::EntryPoint' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, CallFunc_BooleanOR_ReturnValue2) == 0x000005, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, CallFunc_BooleanOR_ReturnValue3) == 0x000006, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, CallFunc_BooleanOR_ReturnValue4) == 0x000007, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::CallFunc_BooleanOR_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, CallFunc_BooleanOR_ReturnValue5) == 0x000008, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::CallFunc_BooleanOR_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, CallFunc_BooleanOR_ReturnValue6) == 0x000009, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::CallFunc_BooleanOR_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, CallFunc_BooleanOR_ReturnValue7) == 0x00000A, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::CallFunc_BooleanOR_ReturnValue7' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, CallFunc_BooleanOR_ReturnValue8) == 0x00000B, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::CallFunc_BooleanOR_ReturnValue8' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, CallFunc_BooleanOR_ReturnValue9) == 0x00000C, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::CallFunc_BooleanOR_ReturnValue9' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, Temp_bool_A_Execution_Happened_Variable) == 0x00000D, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::Temp_bool_A_Execution_Happened_Variable' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, Temp_bool_B_Execution_Happened_Variable) == 0x00000E, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::Temp_bool_B_Execution_Happened_Variable' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, CallFunc_BooleanAND_ReturnValue) == 0x00000F, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, Temp_bool_A_Execution_Happened_Variable2) == 0x000010, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::Temp_bool_A_Execution_Happened_Variable2' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, Temp_bool_B_Execution_Happened_Variable2) == 0x000011, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::Temp_bool_B_Execution_Happened_Variable2' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, CallFunc_BooleanAND_ReturnValue2) == 0x000012, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, CallFunc_HasValidItem_HasValidItem) == 0x000013, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::CallFunc_HasValidItem_HasValidItem' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, CallFunc_HasValidItem_HasValidItem2) == 0x000014, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::CallFunc_HasValidItem_HasValidItem2' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, CallFunc_HasValidItem_HasValidItem3) == 0x000015, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::CallFunc_HasValidItem_HasValidItem3' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, CallFunc_Array_Get_Item) == 0x000018, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, CallFunc_HasValidItem_HasValidItem4) == 0x000020, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::CallFunc_HasValidItem_HasValidItem4' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, CallFunc_BooleanOR_ReturnValue10) == 0x000021, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::CallFunc_BooleanOR_ReturnValue10' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, CallFunc_Array_Get_Item2) == 0x000028, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, CallFunc_HasValidItem_HasValidItem5) == 0x000030, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::CallFunc_HasValidItem_HasValidItem5' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, CallFunc_HasValidItem_HasValidItem6) == 0x000031, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::CallFunc_HasValidItem_HasValidItem6' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, CallFunc_BooleanOR_ReturnValue11) == 0x000032, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::CallFunc_BooleanOR_ReturnValue11' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, K2Node_HandleClientEvent_EventSource4) == 0x000048, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::K2Node_HandleClientEvent_EventSource4' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, K2Node_HandleClientEvent_EventFocus4) == 0x000050, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::K2Node_HandleClientEvent_EventFocus4' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, K2Node_HandleClientEvent_ClientEvent4) == 0x000058, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::K2Node_HandleClientEvent_ClientEvent4' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, K2Node_HandleClientEvent_EventSource3) == 0x000078, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::K2Node_HandleClientEvent_EventSource3' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, K2Node_HandleClientEvent_EventFocus3) == 0x000080, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::K2Node_HandleClientEvent_EventFocus3' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, K2Node_HandleClientEvent_ClientEvent3) == 0x000088, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::K2Node_HandleClientEvent_ClientEvent3' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, K2Node_HandleClientEvent_EventSource2) == 0x0000A8, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::K2Node_HandleClientEvent_EventSource2' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, K2Node_HandleClientEvent_EventFocus2) == 0x0000B0, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::K2Node_HandleClientEvent_EventFocus2' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, K2Node_HandleClientEvent_ClientEvent2) == 0x0000B8, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::K2Node_HandleClientEvent_ClientEvent2' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, K2Node_HandleClientEvent_EventSource) == 0x0000D8, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::K2Node_HandleClientEvent_EventSource' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, K2Node_HandleClientEvent_EventFocus) == 0x0000E0, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::K2Node_HandleClientEvent_EventFocus' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, K2Node_HandleClientEvent_ClientEvent) == 0x0000E8, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::K2Node_HandleClientEvent_ClientEvent' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, CallFunc_HasMoreBadgesToShow_bMoreBadgesToShow) == 0x000108, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::CallFunc_HasMoreBadgesToShow_bMoreBadgesToShow' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot, K2Node_ComponentBoundEvent_Button) == 0x000110, "Member 'Results_BadgeLoot_C_ExecuteUbergraph_Results_BadgeLoot::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function Results_BadgeLoot.Results_BadgeLoot_C.BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_279_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Results_BadgeLoot_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_279_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_BadgeLoot_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_279_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on Results_BadgeLoot_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_279_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(Results_BadgeLoot_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_279_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on Results_BadgeLoot_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_279_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(Results_BadgeLoot_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_279_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'Results_BadgeLoot_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_279_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function Results_BadgeLoot.Results_BadgeLoot_C.HandleClientEvent_ChestOutroDone
// 0x0030 (0x0030 - 0x0000)
struct Results_BadgeLoot_C_HandleClientEvent_ChestOutroDone final
{
public:
	class UObject*                                EventSource;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                EventFocus;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       ClientEvent;                                       // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(Results_BadgeLoot_C_HandleClientEvent_ChestOutroDone) == 0x000008, "Wrong alignment on Results_BadgeLoot_C_HandleClientEvent_ChestOutroDone");
static_assert(sizeof(Results_BadgeLoot_C_HandleClientEvent_ChestOutroDone) == 0x000030, "Wrong size on Results_BadgeLoot_C_HandleClientEvent_ChestOutroDone");
static_assert(offsetof(Results_BadgeLoot_C_HandleClientEvent_ChestOutroDone, EventSource) == 0x000000, "Member 'Results_BadgeLoot_C_HandleClientEvent_ChestOutroDone::EventSource' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_HandleClientEvent_ChestOutroDone, EventFocus) == 0x000008, "Member 'Results_BadgeLoot_C_HandleClientEvent_ChestOutroDone::EventFocus' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_HandleClientEvent_ChestOutroDone, ClientEvent) == 0x000010, "Member 'Results_BadgeLoot_C_HandleClientEvent_ChestOutroDone::ClientEvent' has a wrong offset!");

// Function Results_BadgeLoot.Results_BadgeLoot_C.HandleClientEvent_ChestResultFocusDone
// 0x0030 (0x0030 - 0x0000)
struct Results_BadgeLoot_C_HandleClientEvent_ChestResultFocusDone final
{
public:
	class UObject*                                EventSource;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                EventFocus;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       ClientEvent;                                       // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(Results_BadgeLoot_C_HandleClientEvent_ChestResultFocusDone) == 0x000008, "Wrong alignment on Results_BadgeLoot_C_HandleClientEvent_ChestResultFocusDone");
static_assert(sizeof(Results_BadgeLoot_C_HandleClientEvent_ChestResultFocusDone) == 0x000030, "Wrong size on Results_BadgeLoot_C_HandleClientEvent_ChestResultFocusDone");
static_assert(offsetof(Results_BadgeLoot_C_HandleClientEvent_ChestResultFocusDone, EventSource) == 0x000000, "Member 'Results_BadgeLoot_C_HandleClientEvent_ChestResultFocusDone::EventSource' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_HandleClientEvent_ChestResultFocusDone, EventFocus) == 0x000008, "Member 'Results_BadgeLoot_C_HandleClientEvent_ChestResultFocusDone::EventFocus' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_HandleClientEvent_ChestResultFocusDone, ClientEvent) == 0x000010, "Member 'Results_BadgeLoot_C_HandleClientEvent_ChestResultFocusDone::ClientEvent' has a wrong offset!");

// Function Results_BadgeLoot.Results_BadgeLoot_C.HandleClientEvent_ChestProgressionDone
// 0x0030 (0x0030 - 0x0000)
struct Results_BadgeLoot_C_HandleClientEvent_ChestProgressionDone final
{
public:
	class UObject*                                EventSource;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                EventFocus;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       ClientEvent;                                       // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(Results_BadgeLoot_C_HandleClientEvent_ChestProgressionDone) == 0x000008, "Wrong alignment on Results_BadgeLoot_C_HandleClientEvent_ChestProgressionDone");
static_assert(sizeof(Results_BadgeLoot_C_HandleClientEvent_ChestProgressionDone) == 0x000030, "Wrong size on Results_BadgeLoot_C_HandleClientEvent_ChestProgressionDone");
static_assert(offsetof(Results_BadgeLoot_C_HandleClientEvent_ChestProgressionDone, EventSource) == 0x000000, "Member 'Results_BadgeLoot_C_HandleClientEvent_ChestProgressionDone::EventSource' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_HandleClientEvent_ChestProgressionDone, EventFocus) == 0x000008, "Member 'Results_BadgeLoot_C_HandleClientEvent_ChestProgressionDone::EventFocus' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_HandleClientEvent_ChestProgressionDone, ClientEvent) == 0x000010, "Member 'Results_BadgeLoot_C_HandleClientEvent_ChestProgressionDone::ClientEvent' has a wrong offset!");

// Function Results_BadgeLoot.Results_BadgeLoot_C.HandleClientEvent_ChestIntroDone
// 0x0030 (0x0030 - 0x0000)
struct Results_BadgeLoot_C_HandleClientEvent_ChestIntroDone final
{
public:
	class UObject*                                EventSource;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                EventFocus;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortClientEvent                       ClientEvent;                                       // 0x0010(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(Results_BadgeLoot_C_HandleClientEvent_ChestIntroDone) == 0x000008, "Wrong alignment on Results_BadgeLoot_C_HandleClientEvent_ChestIntroDone");
static_assert(sizeof(Results_BadgeLoot_C_HandleClientEvent_ChestIntroDone) == 0x000030, "Wrong size on Results_BadgeLoot_C_HandleClientEvent_ChestIntroDone");
static_assert(offsetof(Results_BadgeLoot_C_HandleClientEvent_ChestIntroDone, EventSource) == 0x000000, "Member 'Results_BadgeLoot_C_HandleClientEvent_ChestIntroDone::EventSource' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_HandleClientEvent_ChestIntroDone, EventFocus) == 0x000008, "Member 'Results_BadgeLoot_C_HandleClientEvent_ChestIntroDone::EventFocus' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_HandleClientEvent_ChestIntroDone, ClientEvent) == 0x000010, "Member 'Results_BadgeLoot_C_HandleClientEvent_ChestIntroDone::ClientEvent' has a wrong offset!");

// Function Results_BadgeLoot.Results_BadgeLoot_C.Initialize
// 0x0050 (0x0050 - 0x0000)
struct Results_BadgeLoot_C_Initialize final
{
public:
	TArray<class UFortItem*>                      RewardItems;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UResults_Badge_C*                       CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidgetAnimation*>               K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UResults_Badge_C*>               K2Node_MakeArray_Array2;                           // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(Results_BadgeLoot_C_Initialize) == 0x000008, "Wrong alignment on Results_BadgeLoot_C_Initialize");
static_assert(sizeof(Results_BadgeLoot_C_Initialize) == 0x000050, "Wrong size on Results_BadgeLoot_C_Initialize");
static_assert(offsetof(Results_BadgeLoot_C_Initialize, RewardItems) == 0x000000, "Member 'Results_BadgeLoot_C_Initialize::RewardItems' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_Initialize, Temp_int_Array_Index_Variable) == 0x000010, "Member 'Results_BadgeLoot_C_Initialize::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_Initialize, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'Results_BadgeLoot_C_Initialize::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_Initialize, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'Results_BadgeLoot_C_Initialize::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_Initialize, CallFunc_Array_Get_Item) == 0x000020, "Member 'Results_BadgeLoot_C_Initialize::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_Initialize, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'Results_BadgeLoot_C_Initialize::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_Initialize, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'Results_BadgeLoot_C_Initialize::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_Initialize, K2Node_MakeArray_Array) == 0x000030, "Member 'Results_BadgeLoot_C_Initialize::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_Initialize, K2Node_MakeArray_Array2) == 0x000040, "Member 'Results_BadgeLoot_C_Initialize::K2Node_MakeArray_Array2' has a wrong offset!");

// Function Results_BadgeLoot.Results_BadgeLoot_C.PopulateNextBadge
// 0x0028 (0x0028 - 0x0000)
struct Results_BadgeLoot_C_PopulateNextBadge final
{
public:
	class UResults_Badge_C*                       Badge;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldBadgeBeShown_ShownBadgeBeShown;     // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMoreBadgesToShow_bMoreBadgesToShow;    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_Array_Get_Item2;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_BadgeLoot_C_PopulateNextBadge) == 0x000008, "Wrong alignment on Results_BadgeLoot_C_PopulateNextBadge");
static_assert(sizeof(Results_BadgeLoot_C_PopulateNextBadge) == 0x000028, "Wrong size on Results_BadgeLoot_C_PopulateNextBadge");
static_assert(offsetof(Results_BadgeLoot_C_PopulateNextBadge, Badge) == 0x000000, "Member 'Results_BadgeLoot_C_PopulateNextBadge::Badge' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_PopulateNextBadge, CallFunc_Array_Get_Item) == 0x000008, "Member 'Results_BadgeLoot_C_PopulateNextBadge::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_PopulateNextBadge, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'Results_BadgeLoot_C_PopulateNextBadge::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_PopulateNextBadge, CallFunc_ShouldBadgeBeShown_ShownBadgeBeShown) == 0x000014, "Member 'Results_BadgeLoot_C_PopulateNextBadge::CallFunc_ShouldBadgeBeShown_ShownBadgeBeShown' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_PopulateNextBadge, CallFunc_HasMoreBadgesToShow_bMoreBadgesToShow) == 0x000015, "Member 'Results_BadgeLoot_C_PopulateNextBadge::CallFunc_HasMoreBadgesToShow_bMoreBadgesToShow' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_PopulateNextBadge, CallFunc_Add_IntInt_ReturnValue2) == 0x000018, "Member 'Results_BadgeLoot_C_PopulateNextBadge::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_PopulateNextBadge, CallFunc_Array_Get_Item2) == 0x000020, "Member 'Results_BadgeLoot_C_PopulateNextBadge::CallFunc_Array_Get_Item2' has a wrong offset!");

// Function Results_BadgeLoot.Results_BadgeLoot_C.HasMoreBadgesToShow
// 0x000C (0x000C - 0x0000)
struct Results_BadgeLoot_C_HasMoreBadgesToShow final
{
public:
	bool                                          bMoreBadgesToShow;                                 // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_BadgeLoot_C_HasMoreBadgesToShow) == 0x000004, "Wrong alignment on Results_BadgeLoot_C_HasMoreBadgesToShow");
static_assert(sizeof(Results_BadgeLoot_C_HasMoreBadgesToShow) == 0x00000C, "Wrong size on Results_BadgeLoot_C_HasMoreBadgesToShow");
static_assert(offsetof(Results_BadgeLoot_C_HasMoreBadgesToShow, bMoreBadgesToShow) == 0x000000, "Member 'Results_BadgeLoot_C_HasMoreBadgesToShow::bMoreBadgesToShow' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_HasMoreBadgesToShow, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'Results_BadgeLoot_C_HasMoreBadgesToShow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_HasMoreBadgesToShow, CallFunc_Less_IntInt_ReturnValue) == 0x000008, "Member 'Results_BadgeLoot_C_HasMoreBadgesToShow::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function Results_BadgeLoot.Results_BadgeLoot_C.StepBadgeQueues
// 0x0030 (0x0030 - 0x0000)
struct Results_BadgeLoot_C_StepBadgeQueues final
{
public:
	class UWidgetAnimation*                       BadgeAnimation;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UResults_Badge_C*                       Badge;                                             // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UResults_Badge_C*                       CallFunc_Array_Get_Item2;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_BadgeLoot_C_StepBadgeQueues) == 0x000008, "Wrong alignment on Results_BadgeLoot_C_StepBadgeQueues");
static_assert(sizeof(Results_BadgeLoot_C_StepBadgeQueues) == 0x000030, "Wrong size on Results_BadgeLoot_C_StepBadgeQueues");
static_assert(offsetof(Results_BadgeLoot_C_StepBadgeQueues, BadgeAnimation) == 0x000000, "Member 'Results_BadgeLoot_C_StepBadgeQueues::BadgeAnimation' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_StepBadgeQueues, Badge) == 0x000008, "Member 'Results_BadgeLoot_C_StepBadgeQueues::Badge' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_StepBadgeQueues, CallFunc_Array_Add_ReturnValue) == 0x000010, "Member 'Results_BadgeLoot_C_StepBadgeQueues::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_StepBadgeQueues, CallFunc_Array_Get_Item) == 0x000018, "Member 'Results_BadgeLoot_C_StepBadgeQueues::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_StepBadgeQueues, CallFunc_Array_Get_Item2) == 0x000020, "Member 'Results_BadgeLoot_C_StepBadgeQueues::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_StepBadgeQueues, CallFunc_Array_Add_ReturnValue2) == 0x000028, "Member 'Results_BadgeLoot_C_StepBadgeQueues::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");

// Function Results_BadgeLoot.Results_BadgeLoot_C.PlayAnimationCommon
// 0x0008 (0x0008 - 0x0000)
struct Results_BadgeLoot_C_PlayAnimationCommon final
{
public:
	class UWidgetAnimation*                       Animation;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_BadgeLoot_C_PlayAnimationCommon) == 0x000008, "Wrong alignment on Results_BadgeLoot_C_PlayAnimationCommon");
static_assert(sizeof(Results_BadgeLoot_C_PlayAnimationCommon) == 0x000008, "Wrong size on Results_BadgeLoot_C_PlayAnimationCommon");
static_assert(offsetof(Results_BadgeLoot_C_PlayAnimationCommon, Animation) == 0x000000, "Member 'Results_BadgeLoot_C_PlayAnimationCommon::Animation' has a wrong offset!");

// Function Results_BadgeLoot.Results_BadgeLoot_C.InitializeDelays
// 0x0018 (0x0018 - 0x0000)
struct Results_BadgeLoot_C_InitializeDelays final
{
public:
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue3;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue4;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue5;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue6;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_BadgeLoot_C_InitializeDelays) == 0x000004, "Wrong alignment on Results_BadgeLoot_C_InitializeDelays");
static_assert(sizeof(Results_BadgeLoot_C_InitializeDelays) == 0x000018, "Wrong size on Results_BadgeLoot_C_InitializeDelays");
static_assert(offsetof(Results_BadgeLoot_C_InitializeDelays, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000000, "Member 'Results_BadgeLoot_C_InitializeDelays::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_InitializeDelays, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x000004, "Member 'Results_BadgeLoot_C_InitializeDelays::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_InitializeDelays, CallFunc_Divide_FloatFloat_ReturnValue3) == 0x000008, "Member 'Results_BadgeLoot_C_InitializeDelays::CallFunc_Divide_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_InitializeDelays, CallFunc_Divide_FloatFloat_ReturnValue4) == 0x00000C, "Member 'Results_BadgeLoot_C_InitializeDelays::CallFunc_Divide_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_InitializeDelays, CallFunc_Divide_FloatFloat_ReturnValue5) == 0x000010, "Member 'Results_BadgeLoot_C_InitializeDelays::CallFunc_Divide_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_InitializeDelays, CallFunc_Divide_FloatFloat_ReturnValue6) == 0x000014, "Member 'Results_BadgeLoot_C_InitializeDelays::CallFunc_Divide_FloatFloat_ReturnValue6' has a wrong offset!");

// Function Results_BadgeLoot.Results_BadgeLoot_C.SkipToFinalState
// 0x0030 (0x0030 - 0x0000)
struct Results_BadgeLoot_C_SkipToFinalState final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidgetAnimation*>               K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	class UWidgetAnimation*                       CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_BadgeLoot_C_SkipToFinalState) == 0x000008, "Wrong alignment on Results_BadgeLoot_C_SkipToFinalState");
static_assert(sizeof(Results_BadgeLoot_C_SkipToFinalState) == 0x000030, "Wrong size on Results_BadgeLoot_C_SkipToFinalState");
static_assert(offsetof(Results_BadgeLoot_C_SkipToFinalState, Temp_int_Array_Index_Variable) == 0x000000, "Member 'Results_BadgeLoot_C_SkipToFinalState::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_SkipToFinalState, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Results_BadgeLoot_C_SkipToFinalState::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_SkipToFinalState, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Results_BadgeLoot_C_SkipToFinalState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_SkipToFinalState, K2Node_MakeArray_Array) == 0x000010, "Member 'Results_BadgeLoot_C_SkipToFinalState::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_SkipToFinalState, CallFunc_Array_Get_Item) == 0x000020, "Member 'Results_BadgeLoot_C_SkipToFinalState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_SkipToFinalState, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'Results_BadgeLoot_C_SkipToFinalState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_SkipToFinalState, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'Results_BadgeLoot_C_SkipToFinalState::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function Results_BadgeLoot.Results_BadgeLoot_C.ShouldBadgeBeShown
// 0x0030 (0x0030 - 0x0000)
struct Results_BadgeLoot_C_ShouldBadgeBeShown final
{
public:
	class UFortItem*                              Badge;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShownBadgeBeShown;                                 // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortBadgeItemDefinition*               K2Node_DynamicCast_AsFort_Badge_Item_Definition;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMissionPoints_ReturnValue;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_BadgeLoot_C_ShouldBadgeBeShown) == 0x000008, "Wrong alignment on Results_BadgeLoot_C_ShouldBadgeBeShown");
static_assert(sizeof(Results_BadgeLoot_C_ShouldBadgeBeShown) == 0x000030, "Wrong size on Results_BadgeLoot_C_ShouldBadgeBeShown");
static_assert(offsetof(Results_BadgeLoot_C_ShouldBadgeBeShown, Badge) == 0x000000, "Member 'Results_BadgeLoot_C_ShouldBadgeBeShown::Badge' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ShouldBadgeBeShown, ShownBadgeBeShown) == 0x000008, "Member 'Results_BadgeLoot_C_ShouldBadgeBeShown::ShownBadgeBeShown' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ShouldBadgeBeShown, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000010, "Member 'Results_BadgeLoot_C_ShouldBadgeBeShown::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ShouldBadgeBeShown, K2Node_DynamicCast_AsFort_Badge_Item_Definition) == 0x000018, "Member 'Results_BadgeLoot_C_ShouldBadgeBeShown::K2Node_DynamicCast_AsFort_Badge_Item_Definition' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ShouldBadgeBeShown, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Results_BadgeLoot_C_ShouldBadgeBeShown::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ShouldBadgeBeShown, CallFunc_GetMissionPoints_ReturnValue) == 0x000024, "Member 'Results_BadgeLoot_C_ShouldBadgeBeShown::CallFunc_GetMissionPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_BadgeLoot_C_ShouldBadgeBeShown, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'Results_BadgeLoot_C_ShouldBadgeBeShown::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function Results_BadgeLoot.Results_BadgeLoot_C.Focus
// 0x0008 (0x0008 - 0x0000)
struct Results_BadgeLoot_C_Focus final
{
public:
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_BadgeLoot_C_Focus) == 0x000008, "Wrong alignment on Results_BadgeLoot_C_Focus");
static_assert(sizeof(Results_BadgeLoot_C_Focus) == 0x000008, "Wrong size on Results_BadgeLoot_C_Focus");
static_assert(offsetof(Results_BadgeLoot_C_Focus, CallFunc_GetUINavigationManager_ReturnValue) == 0x000000, "Member 'Results_BadgeLoot_C_Focus::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

}

