#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScoreMessageNumber

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ScoreMessageNumber.ScoreMessageNumber_C
// 0x0030 (0x0240 - 0x0210)
class UScoreMessageNumber_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UCommonTextBlock*                       ScoreValue;                                        // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Score;                                             // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnScoreValueSet;                                   // 0x0228(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	EStatCategory                                 ScoreCategory;                                     // 0x0238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnScoreValueSet__DelegateSignature(EStatCategory ChangedScoreCategory);
	void ExecuteUbergraph_ScoreMessageNumber(int32 EntryPoint);
	void Construct();
	void UpdateScoreText();
	void SetScore(int32 InScore);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ScoreMessageNumber_C">();
	}
	static class UScoreMessageNumber_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScoreMessageNumber_C>();
	}
};
static_assert(alignof(UScoreMessageNumber_C) == 0x000008, "Wrong alignment on UScoreMessageNumber_C");
static_assert(sizeof(UScoreMessageNumber_C) == 0x000240, "Wrong size on UScoreMessageNumber_C");
static_assert(offsetof(UScoreMessageNumber_C, UberGraphFrame) == 0x000210, "Member 'UScoreMessageNumber_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UScoreMessageNumber_C, ScoreValue) == 0x000218, "Member 'UScoreMessageNumber_C::ScoreValue' has a wrong offset!");
static_assert(offsetof(UScoreMessageNumber_C, Score) == 0x000220, "Member 'UScoreMessageNumber_C::Score' has a wrong offset!");
static_assert(offsetof(UScoreMessageNumber_C, OnScoreValueSet) == 0x000228, "Member 'UScoreMessageNumber_C::OnScoreValueSet' has a wrong offset!");
static_assert(offsetof(UScoreMessageNumber_C, ScoreCategory) == 0x000238, "Member 'UScoreMessageNumber_C::ScoreCategory' has a wrong offset!");

}

