#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ShowFriendCodesSelection

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function ShowFriendCodesSelection.ShowFriendCodesSelection_C.ExecuteUbergraph_ShowFriendCodesSelection
// 0x00D0 (0x00D0 - 0x0000)
struct ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDesktopPlatform_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue2;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFriendCode                            CallFunc_Array_Get_Item;                           // 0x0040(0x0020)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFriendCodePC_C*                        CallFunc_Create_ReturnValue;                       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFriendCodeConsole_C*                   CallFunc_Create_ReturnValue2;                      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScrollBoxSlot*                         K2Node_DynamicCast_AsScroll_Box_Slot;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue2;                    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScrollBoxSlot*                         K2Node_DynamicCast_AsScroll_Box_Slot2;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin2;                         // 0x00BC(0x0010)(NoDestructor)
};
static_assert(alignof(ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection) == 0x000008, "Wrong alignment on ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection");
static_assert(sizeof(ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection) == 0x0000D0, "Wrong size on ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection");
static_assert(offsetof(ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection, EntryPoint) == 0x000000, "Member 'ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection::EntryPoint' has a wrong offset!");
static_assert(offsetof(ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection, K2Node_MakeStruct_Margin) == 0x000004, "Member 'ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection, Temp_int_Array_Index_Variable) == 0x000014, "Member 'ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection, CallFunc_IsDesktopPlatform_ReturnValue) == 0x000028, "Member 'ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection::CallFunc_IsDesktopPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection, CallFunc_GetContext_ReturnValue2) == 0x000030, "Member 'ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection, K2Node_ComponentBoundEvent_Button) == 0x000038, "Member 'ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection, CallFunc_Array_Get_Item) == 0x000040, "Member 'ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000068, "Member 'ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection, CallFunc_GetOwningPlayer_ReturnValue) == 0x000078, "Member 'ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection, CallFunc_Create_ReturnValue) == 0x000080, "Member 'ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection, CallFunc_Create_ReturnValue2) == 0x000088, "Member 'ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection::CallFunc_Create_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection, CallFunc_AddChild_ReturnValue) == 0x000090, "Member 'ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection, K2Node_DynamicCast_AsScroll_Box_Slot) == 0x000098, "Member 'ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection::K2Node_DynamicCast_AsScroll_Box_Slot' has a wrong offset!");
static_assert(offsetof(ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection, CallFunc_AddChild_ReturnValue2) == 0x0000A8, "Member 'ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection::CallFunc_AddChild_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection, K2Node_DynamicCast_AsScroll_Box_Slot2) == 0x0000B0, "Member 'ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection::K2Node_DynamicCast_AsScroll_Box_Slot2' has a wrong offset!");
static_assert(offsetof(ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection, K2Node_DynamicCast_bSuccess2) == 0x0000B8, "Member 'ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection, K2Node_MakeStruct_Margin2) == 0x0000BC, "Member 'ShowFriendCodesSelection_C_ExecuteUbergraph_ShowFriendCodesSelection::K2Node_MakeStruct_Margin2' has a wrong offset!");

// Function ShowFriendCodesSelection.ShowFriendCodesSelection_C.BndEvt__IconTextButton_K2Node_ComponentBoundEvent_39_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ShowFriendCodesSelection_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_39_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowFriendCodesSelection_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_39_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ShowFriendCodesSelection_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_39_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ShowFriendCodesSelection_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_39_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ShowFriendCodesSelection_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_39_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ShowFriendCodesSelection_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_39_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ShowFriendCodesSelection_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_39_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ShowFriendCodesSelection.ShowFriendCodesSelection_C.SetFocus
// 0x0020 (0x0020 - 0x0000)
struct ShowFriendCodesSelection_C_SetFocus final
{
public:
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ShowFriendCodesSelection_C_SetFocus) == 0x000008, "Wrong alignment on ShowFriendCodesSelection_C_SetFocus");
static_assert(sizeof(ShowFriendCodesSelection_C_SetFocus) == 0x000020, "Wrong size on ShowFriendCodesSelection_C_SetFocus");
static_assert(offsetof(ShowFriendCodesSelection_C_SetFocus, CallFunc_GetChildrenCount_ReturnValue) == 0x000000, "Member 'ShowFriendCodesSelection_C_SetFocus::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowFriendCodesSelection_C_SetFocus, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'ShowFriendCodesSelection_C_SetFocus::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowFriendCodesSelection_C_SetFocus, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'ShowFriendCodesSelection_C_SetFocus::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ShowFriendCodesSelection_C_SetFocus, CallFunc_GetUINavigationManager_ReturnValue) == 0x000018, "Member 'ShowFriendCodesSelection_C_SetFocus::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

}

