#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SignInWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function SignInWidget.SignInWidget_C.ExecuteUbergraph_SignInWidget
// 0x0090 (0x0090 - 0x0000)
struct SignInWidget_C_ExecuteUbergraph_SignInWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text4;                  // 0x0008(0x0018)()
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod2;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text3;                  // 0x0028(0x0018)()
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text2;                  // 0x0050(0x0018)()
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0068(0x0018)()
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SignInWidget_C_ExecuteUbergraph_SignInWidget) == 0x000008, "Wrong alignment on SignInWidget_C_ExecuteUbergraph_SignInWidget");
static_assert(sizeof(SignInWidget_C_ExecuteUbergraph_SignInWidget) == 0x000090, "Wrong size on SignInWidget_C_ExecuteUbergraph_SignInWidget");
static_assert(offsetof(SignInWidget_C_ExecuteUbergraph_SignInWidget, EntryPoint) == 0x000000, "Member 'SignInWidget_C_ExecuteUbergraph_SignInWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(SignInWidget_C_ExecuteUbergraph_SignInWidget, K2Node_ComponentBoundEvent_Text4) == 0x000008, "Member 'SignInWidget_C_ExecuteUbergraph_SignInWidget::K2Node_ComponentBoundEvent_Text4' has a wrong offset!");
static_assert(offsetof(SignInWidget_C_ExecuteUbergraph_SignInWidget, K2Node_ComponentBoundEvent_CommitMethod2) == 0x000020, "Member 'SignInWidget_C_ExecuteUbergraph_SignInWidget::K2Node_ComponentBoundEvent_CommitMethod2' has a wrong offset!");
static_assert(offsetof(SignInWidget_C_ExecuteUbergraph_SignInWidget, K2Node_ComponentBoundEvent_Text3) == 0x000028, "Member 'SignInWidget_C_ExecuteUbergraph_SignInWidget::K2Node_ComponentBoundEvent_Text3' has a wrong offset!");
static_assert(offsetof(SignInWidget_C_ExecuteUbergraph_SignInWidget, K2Node_ComponentBoundEvent_CommitMethod) == 0x000040, "Member 'SignInWidget_C_ExecuteUbergraph_SignInWidget::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(SignInWidget_C_ExecuteUbergraph_SignInWidget, CallFunc_GetUINavigationManager_ReturnValue) == 0x000048, "Member 'SignInWidget_C_ExecuteUbergraph_SignInWidget::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(SignInWidget_C_ExecuteUbergraph_SignInWidget, K2Node_ComponentBoundEvent_Text2) == 0x000050, "Member 'SignInWidget_C_ExecuteUbergraph_SignInWidget::K2Node_ComponentBoundEvent_Text2' has a wrong offset!");
static_assert(offsetof(SignInWidget_C_ExecuteUbergraph_SignInWidget, K2Node_ComponentBoundEvent_Text) == 0x000068, "Member 'SignInWidget_C_ExecuteUbergraph_SignInWidget::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(SignInWidget_C_ExecuteUbergraph_SignInWidget, K2Node_ComponentBoundEvent_Button2) == 0x000080, "Member 'SignInWidget_C_ExecuteUbergraph_SignInWidget::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(SignInWidget_C_ExecuteUbergraph_SignInWidget, K2Node_ComponentBoundEvent_Button) == 0x000088, "Member 'SignInWidget_C_ExecuteUbergraph_SignInWidget::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function SignInWidget.SignInWidget_C.BndEvt__IconTextButton_K2Node_ComponentBoundEvent_40_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SignInWidget_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_40_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SignInWidget_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_40_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on SignInWidget_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_40_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(SignInWidget_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_40_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on SignInWidget_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_40_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(SignInWidget_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_40_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'SignInWidget_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_40_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function SignInWidget.SignInWidget_C.BndEvt__SignInButton_K2Node_ComponentBoundEvent_45_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SignInWidget_C_BndEvt__SignInButton_K2Node_ComponentBoundEvent_45_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SignInWidget_C_BndEvt__SignInButton_K2Node_ComponentBoundEvent_45_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on SignInWidget_C_BndEvt__SignInButton_K2Node_ComponentBoundEvent_45_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(SignInWidget_C_BndEvt__SignInButton_K2Node_ComponentBoundEvent_45_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on SignInWidget_C_BndEvt__SignInButton_K2Node_ComponentBoundEvent_45_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(SignInWidget_C_BndEvt__SignInButton_K2Node_ComponentBoundEvent_45_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'SignInWidget_C_BndEvt__SignInButton_K2Node_ComponentBoundEvent_45_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function SignInWidget.SignInWidget_C.BndEvt__PasswordEditText_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct SignInWidget_C_BndEvt__PasswordEditText_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SignInWidget_C_BndEvt__PasswordEditText_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on SignInWidget_C_BndEvt__PasswordEditText_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature");
static_assert(sizeof(SignInWidget_C_BndEvt__PasswordEditText_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature) == 0x000018, "Wrong size on SignInWidget_C_BndEvt__PasswordEditText_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature");
static_assert(offsetof(SignInWidget_C_BndEvt__PasswordEditText_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'SignInWidget_C_BndEvt__PasswordEditText_K2Node_ComponentBoundEvent_1_OnEditableTextChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function SignInWidget.SignInWidget_C.BndEvt__EmailEditText_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct SignInWidget_C_BndEvt__EmailEditText_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SignInWidget_C_BndEvt__EmailEditText_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on SignInWidget_C_BndEvt__EmailEditText_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature");
static_assert(sizeof(SignInWidget_C_BndEvt__EmailEditText_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature) == 0x000018, "Wrong size on SignInWidget_C_BndEvt__EmailEditText_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature");
static_assert(offsetof(SignInWidget_C_BndEvt__EmailEditText_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'SignInWidget_C_BndEvt__EmailEditText_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function SignInWidget.SignInWidget_C.BndEvt__EmailEditText_K2Node_ComponentBoundEvent_1_OnEditableTextCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct SignInWidget_C_BndEvt__EmailEditText_K2Node_ComponentBoundEvent_1_OnEditableTextCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SignInWidget_C_BndEvt__EmailEditText_K2Node_ComponentBoundEvent_1_OnEditableTextCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on SignInWidget_C_BndEvt__EmailEditText_K2Node_ComponentBoundEvent_1_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(sizeof(SignInWidget_C_BndEvt__EmailEditText_K2Node_ComponentBoundEvent_1_OnEditableTextCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on SignInWidget_C_BndEvt__EmailEditText_K2Node_ComponentBoundEvent_1_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(offsetof(SignInWidget_C_BndEvt__EmailEditText_K2Node_ComponentBoundEvent_1_OnEditableTextCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'SignInWidget_C_BndEvt__EmailEditText_K2Node_ComponentBoundEvent_1_OnEditableTextCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(SignInWidget_C_BndEvt__EmailEditText_K2Node_ComponentBoundEvent_1_OnEditableTextCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'SignInWidget_C_BndEvt__EmailEditText_K2Node_ComponentBoundEvent_1_OnEditableTextCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function SignInWidget.SignInWidget_C.BndEvt__PasswordEditText_K2Node_ComponentBoundEvent_86_OnEditableTextCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct SignInWidget_C_BndEvt__PasswordEditText_K2Node_ComponentBoundEvent_86_OnEditableTextCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SignInWidget_C_BndEvt__PasswordEditText_K2Node_ComponentBoundEvent_86_OnEditableTextCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on SignInWidget_C_BndEvt__PasswordEditText_K2Node_ComponentBoundEvent_86_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(sizeof(SignInWidget_C_BndEvt__PasswordEditText_K2Node_ComponentBoundEvent_86_OnEditableTextCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on SignInWidget_C_BndEvt__PasswordEditText_K2Node_ComponentBoundEvent_86_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(offsetof(SignInWidget_C_BndEvt__PasswordEditText_K2Node_ComponentBoundEvent_86_OnEditableTextCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'SignInWidget_C_BndEvt__PasswordEditText_K2Node_ComponentBoundEvent_86_OnEditableTextCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(SignInWidget_C_BndEvt__PasswordEditText_K2Node_ComponentBoundEvent_86_OnEditableTextCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'SignInWidget_C_BndEvt__PasswordEditText_K2Node_ComponentBoundEvent_86_OnEditableTextCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function SignInWidget.SignInWidget_C.HandleTextCommited
// 0x0038 (0x0038 - 0x0000)
struct SignInWidget_C_HandleTextCommited final
{
public:
	ETextCommit                                   TextCommitType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonBorder*                          HighlightBorder;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          NormalBorder;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasKeyboardFocus_ReturnValue;             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasKeyboardFocus_ReturnValue2;            // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select2_Default;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SignInWidget_C_HandleTextCommited) == 0x000008, "Wrong alignment on SignInWidget_C_HandleTextCommited");
static_assert(sizeof(SignInWidget_C_HandleTextCommited) == 0x000038, "Wrong size on SignInWidget_C_HandleTextCommited");
static_assert(offsetof(SignInWidget_C_HandleTextCommited, TextCommitType) == 0x000000, "Member 'SignInWidget_C_HandleTextCommited::TextCommitType' has a wrong offset!");
static_assert(offsetof(SignInWidget_C_HandleTextCommited, HighlightBorder) == 0x000008, "Member 'SignInWidget_C_HandleTextCommited::HighlightBorder' has a wrong offset!");
static_assert(offsetof(SignInWidget_C_HandleTextCommited, NormalBorder) == 0x000010, "Member 'SignInWidget_C_HandleTextCommited::NormalBorder' has a wrong offset!");
static_assert(offsetof(SignInWidget_C_HandleTextCommited, Temp_bool_Variable) == 0x000018, "Member 'SignInWidget_C_HandleTextCommited::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SignInWidget_C_HandleTextCommited, Temp_bool_Variable2) == 0x000019, "Member 'SignInWidget_C_HandleTextCommited::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(SignInWidget_C_HandleTextCommited, CallFunc_HasKeyboardFocus_ReturnValue) == 0x00001A, "Member 'SignInWidget_C_HandleTextCommited::CallFunc_HasKeyboardFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(SignInWidget_C_HandleTextCommited, CallFunc_HasKeyboardFocus_ReturnValue2) == 0x00001B, "Member 'SignInWidget_C_HandleTextCommited::CallFunc_HasKeyboardFocus_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SignInWidget_C_HandleTextCommited, K2Node_Select_Default) == 0x000020, "Member 'SignInWidget_C_HandleTextCommited::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SignInWidget_C_HandleTextCommited, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000028, "Member 'SignInWidget_C_HandleTextCommited::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SignInWidget_C_HandleTextCommited, K2Node_Select2_Default) == 0x000030, "Member 'SignInWidget_C_HandleTextCommited::K2Node_Select2_Default' has a wrong offset!");

}

