#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleSquadSlotButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function SimpleSquadSlotButton.SimpleSquadSlotButton_C.ExecuteUbergraph_SimpleSquadSlotButton
// 0x0088 (0x0088 - 0x0000)
struct SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UHomeBaseContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemCardSize                             Temp_byte_Variable3;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetActiveCombatSquadId_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable2;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable3;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable4;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable5;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable6;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable7;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId;    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x5];                                       // 0x007B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select2_Default;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton) == 0x000008, "Wrong alignment on SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton");
static_assert(sizeof(SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton) == 0x000088, "Wrong size on SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton");
static_assert(offsetof(SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton, EntryPoint) == 0x000000, "Member 'SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton, Temp_bool_Variable) == 0x000004, "Member 'SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton, Temp_byte_Variable) == 0x000005, "Member 'SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton, Temp_byte_Variable2) == 0x000006, "Member 'SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton, Temp_byte_Variable3) == 0x000010, "Member 'SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton, CallFunc_GetActiveCombatSquadId_ReturnValue) == 0x000018, "Member 'SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton::CallFunc_GetActiveCombatSquadId_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton, Temp_class_Variable) == 0x000020, "Member 'SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton, Temp_class_Variable2) == 0x000028, "Member 'SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton::Temp_class_Variable2' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton, Temp_class_Variable3) == 0x000030, "Member 'SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton::Temp_class_Variable3' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton, Temp_class_Variable4) == 0x000038, "Member 'SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton::Temp_class_Variable4' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton, Temp_class_Variable5) == 0x000040, "Member 'SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton::Temp_class_Variable5' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton, Temp_class_Variable6) == 0x000048, "Member 'SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton::Temp_class_Variable6' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton, Temp_class_Variable7) == 0x000050, "Member 'SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton::Temp_class_Variable7' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton, K2Node_Event_IsDesignTime) == 0x000058, "Member 'SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton, CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId) == 0x000060, "Member 'SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton::CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton, CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex) == 0x000068, "Member 'SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton::CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton, CallFunc_GetContext_ReturnValue2) == 0x000070, "Member 'SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000078, "Member 'SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton, CallFunc_IsInZone_ReturnValue) == 0x000079, "Member 'SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton, K2Node_Select_Default) == 0x00007A, "Member 'SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton, K2Node_Select2_Default) == 0x000080, "Member 'SimpleSquadSlotButton_C_ExecuteUbergraph_SimpleSquadSlotButton::K2Node_Select2_Default' has a wrong offset!");

// Function SimpleSquadSlotButton.SimpleSquadSlotButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SimpleSquadSlotButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SimpleSquadSlotButton_C_PreConstruct) == 0x000001, "Wrong alignment on SimpleSquadSlotButton_C_PreConstruct");
static_assert(sizeof(SimpleSquadSlotButton_C_PreConstruct) == 0x000001, "Wrong size on SimpleSquadSlotButton_C_PreConstruct");
static_assert(offsetof(SimpleSquadSlotButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SimpleSquadSlotButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SimpleSquadSlotButton.SimpleSquadSlotButton_C.GetSimpleSquadButtonTooltipWidget
// 0x0028 (0x0028 - 0x0000)
struct SimpleSquadSlotButton_C_GetSimpleSquadButtonTooltipWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_Basic_Tooltip_Output;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SimpleSquadSlotButton_C_GetSimpleSquadButtonTooltipWidget) == 0x000008, "Wrong alignment on SimpleSquadSlotButton_C_GetSimpleSquadButtonTooltipWidget");
static_assert(sizeof(SimpleSquadSlotButton_C_GetSimpleSquadButtonTooltipWidget) == 0x000028, "Wrong size on SimpleSquadSlotButton_C_GetSimpleSquadButtonTooltipWidget");
static_assert(offsetof(SimpleSquadSlotButton_C_GetSimpleSquadButtonTooltipWidget, ReturnValue) == 0x000000, "Member 'SimpleSquadSlotButton_C_GetSimpleSquadButtonTooltipWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_GetSimpleSquadButtonTooltipWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'SimpleSquadSlotButton_C_GetSimpleSquadButtonTooltipWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_GetSimpleSquadButtonTooltipWidget, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'SimpleSquadSlotButton_C_GetSimpleSquadButtonTooltipWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_GetSimpleSquadButtonTooltipWidget, CallFunc_Create_Basic_Tooltip_Output) == 0x000018, "Member 'SimpleSquadSlotButton_C_GetSimpleSquadButtonTooltipWidget::CallFunc_Create_Basic_Tooltip_Output' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_GetSimpleSquadButtonTooltipWidget, CallFunc_IsUsingGamepad_ReturnValue) == 0x000020, "Member 'SimpleSquadSlotButton_C_GetSimpleSquadButtonTooltipWidget::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");

// Function SimpleSquadSlotButton.SimpleSquadSlotButton_C.Update Bang State
// 0x0028 (0x0028 - 0x0000)
struct SimpleSquadSlotButton_C_Update_Bang_State final
{
public:
	class FName                                   CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId;    // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSquadSlotUnseen_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SimpleSquadSlotButton_C_Update_Bang_State) == 0x000008, "Wrong alignment on SimpleSquadSlotButton_C_Update_Bang_State");
static_assert(sizeof(SimpleSquadSlotButton_C_Update_Bang_State) == 0x000028, "Wrong size on SimpleSquadSlotButton_C_Update_Bang_State");
static_assert(offsetof(SimpleSquadSlotButton_C_Update_Bang_State, CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId) == 0x000000, "Member 'SimpleSquadSlotButton_C_Update_Bang_State::CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_Update_Bang_State, CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex) == 0x000008, "Member 'SimpleSquadSlotButton_C_Update_Bang_State::CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_Update_Bang_State, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'SimpleSquadSlotButton_C_Update_Bang_State::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_Update_Bang_State, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000018, "Member 'SimpleSquadSlotButton_C_Update_Bang_State::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_Update_Bang_State, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'SimpleSquadSlotButton_C_Update_Bang_State::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_Update_Bang_State, CallFunc_IsSquadSlotUnseen_ReturnValue) == 0x000021, "Member 'SimpleSquadSlotButton_C_Update_Bang_State::CallFunc_IsSquadSlotUnseen_ReturnValue' has a wrong offset!");

// Function SimpleSquadSlotButton.SimpleSquadSlotButton_C.Mark Squad Slot Seen State
// 0x0040 (0x0040 - 0x0000)
struct SimpleSquadSlotButton_C_Mark_Squad_Slot_Seen_State final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHomeBaseContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHomebaseNodeItem*                  CallFunc_GetHomebaseNodeItemForSquadSlot_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SimpleSquadSlotButton_C_Mark_Squad_Slot_Seen_State) == 0x000008, "Wrong alignment on SimpleSquadSlotButton_C_Mark_Squad_Slot_Seen_State");
static_assert(sizeof(SimpleSquadSlotButton_C_Mark_Squad_Slot_Seen_State) == 0x000040, "Wrong size on SimpleSquadSlotButton_C_Mark_Squad_Slot_Seen_State");
static_assert(offsetof(SimpleSquadSlotButton_C_Mark_Squad_Slot_Seen_State, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'SimpleSquadSlotButton_C_Mark_Squad_Slot_Seen_State::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_Mark_Squad_Slot_Seen_State, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'SimpleSquadSlotButton_C_Mark_Squad_Slot_Seen_State::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_Mark_Squad_Slot_Seen_State, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000010, "Member 'SimpleSquadSlotButton_C_Mark_Squad_Slot_Seen_State::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_Mark_Squad_Slot_Seen_State, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'SimpleSquadSlotButton_C_Mark_Squad_Slot_Seen_State::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_Mark_Squad_Slot_Seen_State, CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId) == 0x000020, "Member 'SimpleSquadSlotButton_C_Mark_Squad_Slot_Seen_State::CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_Mark_Squad_Slot_Seen_State, CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex) == 0x000028, "Member 'SimpleSquadSlotButton_C_Mark_Squad_Slot_Seen_State::CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_Mark_Squad_Slot_Seen_State, CallFunc_GetHomebaseNodeItemForSquadSlot_ReturnValue) == 0x000030, "Member 'SimpleSquadSlotButton_C_Mark_Squad_Slot_Seen_State::CallFunc_GetHomebaseNodeItemForSquadSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_Mark_Squad_Slot_Seen_State, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'SimpleSquadSlotButton_C_Mark_Squad_Slot_Seen_State::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function SimpleSquadSlotButton.SimpleSquadSlotButton_C.IsSlotEmpty
// 0x0020 (0x0020 - 0x0000)
struct SimpleSquadSlotButton_C_IsSlotEmpty final
{
public:
	bool                                          IsEmpty;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_GetItemInSquadSlotBP_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SimpleSquadSlotButton_C_IsSlotEmpty) == 0x000008, "Wrong alignment on SimpleSquadSlotButton_C_IsSlotEmpty");
static_assert(sizeof(SimpleSquadSlotButton_C_IsSlotEmpty) == 0x000020, "Wrong size on SimpleSquadSlotButton_C_IsSlotEmpty");
static_assert(offsetof(SimpleSquadSlotButton_C_IsSlotEmpty, IsEmpty) == 0x000000, "Member 'SimpleSquadSlotButton_C_IsSlotEmpty::IsEmpty' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_IsSlotEmpty, CallFunc_GetOwningLocalPlayer_ReturnValue) == 0x000008, "Member 'SimpleSquadSlotButton_C_IsSlotEmpty::CallFunc_GetOwningLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_IsSlotEmpty, CallFunc_GetItemInSquadSlotBP_ReturnValue) == 0x000010, "Member 'SimpleSquadSlotButton_C_IsSlotEmpty::CallFunc_GetItemInSquadSlotBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_IsSlotEmpty, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'SimpleSquadSlotButton_C_IsSlotEmpty::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function SimpleSquadSlotButton.SimpleSquadSlotButton_C.Update SubType Icon Glow
// 0x00F8 (0x00F8 - 0x0000)
struct SimpleSquadSlotButton_C_Update_SubType_Icon_Glow final
{
public:
	bool                                          GlowIcon;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor2;                     // 0x0030(0x0028)()
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0058(0x0028)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0080(0x0078)()
};
static_assert(alignof(SimpleSquadSlotButton_C_Update_SubType_Icon_Glow) == 0x000008, "Wrong alignment on SimpleSquadSlotButton_C_Update_SubType_Icon_Glow");
static_assert(sizeof(SimpleSquadSlotButton_C_Update_SubType_Icon_Glow) == 0x0000F8, "Wrong size on SimpleSquadSlotButton_C_Update_SubType_Icon_Glow");
static_assert(offsetof(SimpleSquadSlotButton_C_Update_SubType_Icon_Glow, GlowIcon) == 0x000000, "Member 'SimpleSquadSlotButton_C_Update_SubType_Icon_Glow::GlowIcon' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_Update_SubType_Icon_Glow, Temp_bool_Variable) == 0x000001, "Member 'SimpleSquadSlotButton_C_Update_SubType_Icon_Glow::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_Update_SubType_Icon_Glow, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'SimpleSquadSlotButton_C_Update_SubType_Icon_Glow::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_Update_SubType_Icon_Glow, K2Node_MakeStruct_SlateColor2) == 0x000030, "Member 'SimpleSquadSlotButton_C_Update_SubType_Icon_Glow::K2Node_MakeStruct_SlateColor2' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_Update_SubType_Icon_Glow, K2Node_Select_Default) == 0x000058, "Member 'SimpleSquadSlotButton_C_Update_SubType_Icon_Glow::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_Update_SubType_Icon_Glow, K2Node_MakeStruct_SlateBrush) == 0x000080, "Member 'SimpleSquadSlotButton_C_Update_SubType_Icon_Glow::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

// Function SimpleSquadSlotButton.SimpleSquadSlotButton_C.UpdateTypeIconOffset
// 0x0028 (0x0028 - 0x0000)
struct SimpleSquadSlotButton_C_UpdateTypeIconOffset final
{
public:
	float                                         VerticalOffset;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0004(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x000C(0x001C)(NoDestructor)
};
static_assert(alignof(SimpleSquadSlotButton_C_UpdateTypeIconOffset) == 0x000004, "Wrong alignment on SimpleSquadSlotButton_C_UpdateTypeIconOffset");
static_assert(sizeof(SimpleSquadSlotButton_C_UpdateTypeIconOffset) == 0x000028, "Wrong size on SimpleSquadSlotButton_C_UpdateTypeIconOffset");
static_assert(offsetof(SimpleSquadSlotButton_C_UpdateTypeIconOffset, VerticalOffset) == 0x000000, "Member 'SimpleSquadSlotButton_C_UpdateTypeIconOffset::VerticalOffset' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_UpdateTypeIconOffset, CallFunc_MakeVector2D_ReturnValue) == 0x000004, "Member 'SimpleSquadSlotButton_C_UpdateTypeIconOffset::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(SimpleSquadSlotButton_C_UpdateTypeIconOffset, K2Node_MakeStruct_WidgetTransform) == 0x00000C, "Member 'SimpleSquadSlotButton_C_UpdateTypeIconOffset::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");

}

