#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_PickAxe_Jaws_Skeleton_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ImmediatePhysics_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SK_PickAxe_Jaws_Skeleton_AnimBP.SK_PickAxe_Jaws_Skeleton_AnimBP_C
// 0x0390 (0x0800 - 0x0470)
class USK_PickAxe_Jaws_Skeleton_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_SubInput                     AnimGraphNode_SubInput_6B147D6642EFDBB249D21998BE4ED15C; // 0x0478(0x0068)()
	struct FAnimNode_Root                         AnimGraphNode_Root_85E18924481875C844C3A3A7EA0A5DAF; // 0x04E0(0x0048)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_E40FC2B6491B2E41E87B22BE74EFDBED; // 0x0528(0x0240)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_D00AF4E743A94A1AD17B36A5F9F03EEA; // 0x0768(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_DB4BDBBD424FBEF62E5517A65A3B4597; // 0x07B0(0x0048)()
	class USkeletalMeshComponent*                 MeshToCopy;                                        // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SK_PickAxe_Jaws_Skeleton_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SK_PickAxe_Jaws_Skeleton_AnimBP_C">();
	}
	static class USK_PickAxe_Jaws_Skeleton_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_PickAxe_Jaws_Skeleton_AnimBP_C>();
	}
};
static_assert(alignof(USK_PickAxe_Jaws_Skeleton_AnimBP_C) == 0x000008, "Wrong alignment on USK_PickAxe_Jaws_Skeleton_AnimBP_C");
static_assert(sizeof(USK_PickAxe_Jaws_Skeleton_AnimBP_C) == 0x000800, "Wrong size on USK_PickAxe_Jaws_Skeleton_AnimBP_C");
static_assert(offsetof(USK_PickAxe_Jaws_Skeleton_AnimBP_C, UberGraphFrame) == 0x000470, "Member 'USK_PickAxe_Jaws_Skeleton_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USK_PickAxe_Jaws_Skeleton_AnimBP_C, AnimGraphNode_SubInput_6B147D6642EFDBB249D21998BE4ED15C) == 0x000478, "Member 'USK_PickAxe_Jaws_Skeleton_AnimBP_C::AnimGraphNode_SubInput_6B147D6642EFDBB249D21998BE4ED15C' has a wrong offset!");
static_assert(offsetof(USK_PickAxe_Jaws_Skeleton_AnimBP_C, AnimGraphNode_Root_85E18924481875C844C3A3A7EA0A5DAF) == 0x0004E0, "Member 'USK_PickAxe_Jaws_Skeleton_AnimBP_C::AnimGraphNode_Root_85E18924481875C844C3A3A7EA0A5DAF' has a wrong offset!");
static_assert(offsetof(USK_PickAxe_Jaws_Skeleton_AnimBP_C, AnimGraphNode_RigidBody_E40FC2B6491B2E41E87B22BE74EFDBED) == 0x000528, "Member 'USK_PickAxe_Jaws_Skeleton_AnimBP_C::AnimGraphNode_RigidBody_E40FC2B6491B2E41E87B22BE74EFDBED' has a wrong offset!");
static_assert(offsetof(USK_PickAxe_Jaws_Skeleton_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_D00AF4E743A94A1AD17B36A5F9F03EEA) == 0x000768, "Member 'USK_PickAxe_Jaws_Skeleton_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_D00AF4E743A94A1AD17B36A5F9F03EEA' has a wrong offset!");
static_assert(offsetof(USK_PickAxe_Jaws_Skeleton_AnimBP_C, AnimGraphNode_LocalToComponentSpace_DB4BDBBD424FBEF62E5517A65A3B4597) == 0x0007B0, "Member 'USK_PickAxe_Jaws_Skeleton_AnimBP_C::AnimGraphNode_LocalToComponentSpace_DB4BDBBD424FBEF62E5517A65A3B4597' has a wrong offset!");
static_assert(offsetof(USK_PickAxe_Jaws_Skeleton_AnimBP_C, MeshToCopy) == 0x0007F8, "Member 'USK_PickAxe_Jaws_Skeleton_AnimBP_C::MeshToCopy' has a wrong offset!");

}

