#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkillTreepAGEColors

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct SkillTreepAGEColors.SkillTreePageColors
// 0x00C0 (0x00C0 - 0x0000)
struct FSkillTreePageColors final
{
public:
	struct FLinearColor                           T1BG0_10_39FEA5C7443546B90BA85BBBC67C96D2;         // 0x0000(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           T1BG1_9_91F62BB74BD541D20CC6EE8BEB5B0CB7;          // 0x0010(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           T1Grid_11_6B9B0EBA4C99CAB1254B3EA7B751F220;        // 0x0020(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           T2BG0_24_D91F4CC2428FE301E9AFA5A43E9EAA2A;         // 0x0030(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           T2BG1_25_FD5C9F034E713574DDD437A9305F10B0;         // 0x0040(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           T2Grid_30_EA0C673D4AC076F4C72827BFFF9FDCA1;        // 0x0050(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           T3BG0_26_654D1F82476D069B1AC07E918AEDC2F9;         // 0x0060(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           T3BG1_27_55A78A2A4AE1A70DFFAF038D9C75D0D7;         // 0x0070(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           T3Grid_31_2560DD1A4AA0EA071F4553B630D5C68C;        // 0x0080(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           T4BG0_28_4307BC624FD8965A5838D4BE7D38E4AB;         // 0x0090(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           T4BG1_29_EFAEB9A448F3D7FCF8E3F8832E3D1DB7;         // 0x00A0(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           T4Grid_32_2972154648B9DB30252D0DBAA218D0A2;        // 0x00B0(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FSkillTreePageColors) == 0x000004, "Wrong alignment on FSkillTreePageColors");
static_assert(sizeof(FSkillTreePageColors) == 0x0000C0, "Wrong size on FSkillTreePageColors");
static_assert(offsetof(FSkillTreePageColors, T1BG0_10_39FEA5C7443546B90BA85BBBC67C96D2) == 0x000000, "Member 'FSkillTreePageColors::T1BG0_10_39FEA5C7443546B90BA85BBBC67C96D2' has a wrong offset!");
static_assert(offsetof(FSkillTreePageColors, T1BG1_9_91F62BB74BD541D20CC6EE8BEB5B0CB7) == 0x000010, "Member 'FSkillTreePageColors::T1BG1_9_91F62BB74BD541D20CC6EE8BEB5B0CB7' has a wrong offset!");
static_assert(offsetof(FSkillTreePageColors, T1Grid_11_6B9B0EBA4C99CAB1254B3EA7B751F220) == 0x000020, "Member 'FSkillTreePageColors::T1Grid_11_6B9B0EBA4C99CAB1254B3EA7B751F220' has a wrong offset!");
static_assert(offsetof(FSkillTreePageColors, T2BG0_24_D91F4CC2428FE301E9AFA5A43E9EAA2A) == 0x000030, "Member 'FSkillTreePageColors::T2BG0_24_D91F4CC2428FE301E9AFA5A43E9EAA2A' has a wrong offset!");
static_assert(offsetof(FSkillTreePageColors, T2BG1_25_FD5C9F034E713574DDD437A9305F10B0) == 0x000040, "Member 'FSkillTreePageColors::T2BG1_25_FD5C9F034E713574DDD437A9305F10B0' has a wrong offset!");
static_assert(offsetof(FSkillTreePageColors, T2Grid_30_EA0C673D4AC076F4C72827BFFF9FDCA1) == 0x000050, "Member 'FSkillTreePageColors::T2Grid_30_EA0C673D4AC076F4C72827BFFF9FDCA1' has a wrong offset!");
static_assert(offsetof(FSkillTreePageColors, T3BG0_26_654D1F82476D069B1AC07E918AEDC2F9) == 0x000060, "Member 'FSkillTreePageColors::T3BG0_26_654D1F82476D069B1AC07E918AEDC2F9' has a wrong offset!");
static_assert(offsetof(FSkillTreePageColors, T3BG1_27_55A78A2A4AE1A70DFFAF038D9C75D0D7) == 0x000070, "Member 'FSkillTreePageColors::T3BG1_27_55A78A2A4AE1A70DFFAF038D9C75D0D7' has a wrong offset!");
static_assert(offsetof(FSkillTreePageColors, T3Grid_31_2560DD1A4AA0EA071F4553B630D5C68C) == 0x000080, "Member 'FSkillTreePageColors::T3Grid_31_2560DD1A4AA0EA071F4553B630D5C68C' has a wrong offset!");
static_assert(offsetof(FSkillTreePageColors, T4BG0_28_4307BC624FD8965A5838D4BE7D38E4AB) == 0x000090, "Member 'FSkillTreePageColors::T4BG0_28_4307BC624FD8965A5838D4BE7D38E4AB' has a wrong offset!");
static_assert(offsetof(FSkillTreePageColors, T4BG1_29_EFAEB9A448F3D7FCF8E3F8832E3D1DB7) == 0x0000A0, "Member 'FSkillTreePageColors::T4BG1_29_EFAEB9A448F3D7FCF8E3F8832E3D1DB7' has a wrong offset!");
static_assert(offsetof(FSkillTreePageColors, T4Grid_32_2972154648B9DB30252D0DBAA218D0A2) == 0x0000B0, "Member 'FSkillTreePageColors::T4Grid_32_2972154648B9DB30252D0DBAA218D0A2' has a wrong offset!");

}

