#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SplashScreenWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function SplashScreenWidget.SplashScreenWidget_C.ExecuteUbergraph_SplashScreenWidget
// 0x0068 (0x0068 - 0x0000)
struct SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileApp_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue2;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bUsingGamepad)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_bUsingGamepad;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue3;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_UserIndex;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select2_Default;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select3_Default;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget) == 0x000008, "Wrong alignment on SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget");
static_assert(sizeof(SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget) == 0x000068, "Wrong size on SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget");
static_assert(offsetof(SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget, EntryPoint) == 0x000000, "Member 'SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget, Temp_bool_Variable) == 0x000004, "Member 'SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget, Temp_bool_Variable2) == 0x000005, "Member 'SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget, CallFunc_IsMobileApp_ReturnValue) == 0x000010, "Member 'SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget::CallFunc_IsMobileApp_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget, CallFunc_GetContext_ReturnValue2) == 0x000018, "Member 'SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget, K2Node_CustomEvent_bUsingGamepad) == 0x000030, "Member 'SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget::K2Node_CustomEvent_bUsingGamepad' has a wrong offset!");
static_assert(offsetof(SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget, CallFunc_GetContext_ReturnValue3) == 0x000038, "Member 'SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget, K2Node_Select_Default) == 0x000040, "Member 'SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget, CallFunc_IsUsingGamepad_ReturnValue) == 0x000048, "Member 'SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget, Temp_bool_Variable3) == 0x000049, "Member 'SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget, K2Node_Event_UserIndex) == 0x00004C, "Member 'SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget::K2Node_Event_UserIndex' has a wrong offset!");
static_assert(offsetof(SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget, K2Node_Select2_Default) == 0x000050, "Member 'SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget, K2Node_Select3_Default) == 0x000058, "Member 'SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget, CallFunc_GetUINavigationManager_ReturnValue) == 0x000060, "Member 'SplashScreenWidget_C_ExecuteUbergraph_SplashScreenWidget::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

// Function SplashScreenWidget.SplashScreenWidget_C.OnGameBootableInviteReceived
// 0x0004 (0x0004 - 0x0000)
struct SplashScreenWidget_C_OnGameBootableInviteReceived final
{
public:
	int32                                         UserIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SplashScreenWidget_C_OnGameBootableInviteReceived) == 0x000004, "Wrong alignment on SplashScreenWidget_C_OnGameBootableInviteReceived");
static_assert(sizeof(SplashScreenWidget_C_OnGameBootableInviteReceived) == 0x000004, "Wrong size on SplashScreenWidget_C_OnGameBootableInviteReceived");
static_assert(offsetof(SplashScreenWidget_C_OnGameBootableInviteReceived, UserIndex) == 0x000000, "Member 'SplashScreenWidget_C_OnGameBootableInviteReceived::UserIndex' has a wrong offset!");

// Function SplashScreenWidget.SplashScreenWidget_C.OnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct SplashScreenWidget_C_OnInputMethodChanged final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SplashScreenWidget_C_OnInputMethodChanged) == 0x000001, "Wrong alignment on SplashScreenWidget_C_OnInputMethodChanged");
static_assert(sizeof(SplashScreenWidget_C_OnInputMethodChanged) == 0x000001, "Wrong size on SplashScreenWidget_C_OnInputMethodChanged");
static_assert(offsetof(SplashScreenWidget_C_OnInputMethodChanged, bUsingGamepad) == 0x000000, "Member 'SplashScreenWidget_C_OnInputMethodChanged::bUsingGamepad' has a wrong offset!");

// Function SplashScreenWidget.SplashScreenWidget_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct SplashScreenWidget_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(SplashScreenWidget_C_OnFocusReceived) == 0x000008, "Wrong alignment on SplashScreenWidget_C_OnFocusReceived");
static_assert(sizeof(SplashScreenWidget_C_OnFocusReceived) == 0x0001B0, "Wrong size on SplashScreenWidget_C_OnFocusReceived");
static_assert(offsetof(SplashScreenWidget_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'SplashScreenWidget_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(SplashScreenWidget_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'SplashScreenWidget_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(SplashScreenWidget_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'SplashScreenWidget_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(SplashScreenWidget_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'SplashScreenWidget_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function SplashScreenWidget.SplashScreenWidget_C.OnMouseButtonDown
// 0x0220 (0x0220 - 0x0000)
struct SplashScreenWidget_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	int32                                         CallFunc_PointerEvent_GetUserIndex_ReturnValue;    // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0168(0x00B8)()
};
static_assert(alignof(SplashScreenWidget_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on SplashScreenWidget_C_OnMouseButtonDown");
static_assert(sizeof(SplashScreenWidget_C_OnMouseButtonDown) == 0x000220, "Wrong size on SplashScreenWidget_C_OnMouseButtonDown");
static_assert(offsetof(SplashScreenWidget_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'SplashScreenWidget_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(SplashScreenWidget_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'SplashScreenWidget_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(SplashScreenWidget_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'SplashScreenWidget_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(SplashScreenWidget_C_OnMouseButtonDown, CallFunc_PointerEvent_GetUserIndex_ReturnValue) == 0x000160, "Member 'SplashScreenWidget_C_OnMouseButtonDown::CallFunc_PointerEvent_GetUserIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplashScreenWidget_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000168, "Member 'SplashScreenWidget_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function SplashScreenWidget.SplashScreenWidget_C.RelinquishInputFocus
// 0x0008 (0x0008 - 0x0000)
struct SplashScreenWidget_C_RelinquishInputFocus final
{
public:
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SplashScreenWidget_C_RelinquishInputFocus) == 0x000008, "Wrong alignment on SplashScreenWidget_C_RelinquishInputFocus");
static_assert(sizeof(SplashScreenWidget_C_RelinquishInputFocus) == 0x000008, "Wrong size on SplashScreenWidget_C_RelinquishInputFocus");
static_assert(offsetof(SplashScreenWidget_C_RelinquishInputFocus, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'SplashScreenWidget_C_RelinquishInputFocus::CallFunc_GetContext_ReturnValue' has a wrong offset!");

// Function SplashScreenWidget.SplashScreenWidget_C.SetInputFocus
// 0x0008 (0x0008 - 0x0000)
struct SplashScreenWidget_C_SetInputFocus final
{
public:
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SplashScreenWidget_C_SetInputFocus) == 0x000008, "Wrong alignment on SplashScreenWidget_C_SetInputFocus");
static_assert(sizeof(SplashScreenWidget_C_SetInputFocus) == 0x000008, "Wrong size on SplashScreenWidget_C_SetInputFocus");
static_assert(offsetof(SplashScreenWidget_C_SetInputFocus, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'SplashScreenWidget_C_SetInputFocus::CallFunc_GetContext_ReturnValue' has a wrong offset!");

}

