#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SquadStatsWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SquadStatsWidget.SquadStatsWidget_C
// 0x0118 (0x0360 - 0x0248)
class USquadStatsWidget_C final : public UFortSquadStatsWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(Transient, DuplicateTransient)
	class UCommonBorder*                          BasicStatsBorder;                                  // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderFortitude;                                   // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderOffense;                                     // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderResist;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderTech;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BordertFortitide;                                  // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BordertOffense;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BordertResist;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BordertTech;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CloseDetailedStats;                                // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStatsListItemWIdget_C*                 CoreStat0;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStatsListItemWIdget_C*                 CoreStat1;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStatsListItemWIdget_C*                 CoreStat2;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStatsListItemWIdget_C*                 CoreStat3;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          DetailedStatsBorder;                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          DetailedStatsCommonBorder;                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           DetailedStatsVbox;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             ExtraContentSlot;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStatItemLarge_C*                       LargeStat0;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStatItemLarge_C*                       LargeStat1;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      SeeDetailedStats;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  StatsSwitcher;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStatsListItemWIdget_C*                 TeamCoreStat0;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStatsListItemWIdget_C*                 TeamCoreStat1;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStatsListItemWIdget_C*                 TeamCoreStat2;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStatsListItemWIdget_C*                 TeamCoreStat3;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBonuses;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bViewingDetailedStats;                             // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   DetailedStatsClosed;                               // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bStatsNeedUpdate;                                  // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsActive;                                         // 0x0341(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Bonus_Label;                                       // 0x0348(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void DetailedStatsClosed__DelegateSignature();
	void ExecuteUbergraph_SquadStatsWidget(int32 EntryPoint);
	void HandleSquadSlottingPreviewStateChanged();
	void Destruct();
	void BndEvt__CloseDetailedStats_K2Node_ComponentBoundEvent_119_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__IconTextButton_K2Node_ComponentBoundEvent_37_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void InitCoreStatsWidgetArray();
	void BindDelegates();
	void ToggleBetweenStats();
	void UnbindDelegates();
	void RefreshScroll();
	void HighlightStat(int32 InStatIndex);
	void HandleAttributeChanged();
	void HandleActivityChanged(bool IsActive);
	void BindToAttributeChanges();
	void HandleAbilitySystemChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SquadStatsWidget_C">();
	}
	static class USquadStatsWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USquadStatsWidget_C>();
	}
};
static_assert(alignof(USquadStatsWidget_C) == 0x000008, "Wrong alignment on USquadStatsWidget_C");
static_assert(sizeof(USquadStatsWidget_C) == 0x000360, "Wrong size on USquadStatsWidget_C");
static_assert(offsetof(USquadStatsWidget_C, UberGraphFrame) == 0x000248, "Member 'USquadStatsWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, BasicStatsBorder) == 0x000250, "Member 'USquadStatsWidget_C::BasicStatsBorder' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, BorderFortitude) == 0x000258, "Member 'USquadStatsWidget_C::BorderFortitude' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, BorderOffense) == 0x000260, "Member 'USquadStatsWidget_C::BorderOffense' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, BorderResist) == 0x000268, "Member 'USquadStatsWidget_C::BorderResist' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, BorderTech) == 0x000270, "Member 'USquadStatsWidget_C::BorderTech' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, BordertFortitide) == 0x000278, "Member 'USquadStatsWidget_C::BordertFortitide' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, BordertOffense) == 0x000280, "Member 'USquadStatsWidget_C::BordertOffense' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, BordertResist) == 0x000288, "Member 'USquadStatsWidget_C::BordertResist' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, BordertTech) == 0x000290, "Member 'USquadStatsWidget_C::BordertTech' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, CloseDetailedStats) == 0x000298, "Member 'USquadStatsWidget_C::CloseDetailedStats' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, CoreStat0) == 0x0002A0, "Member 'USquadStatsWidget_C::CoreStat0' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, CoreStat1) == 0x0002A8, "Member 'USquadStatsWidget_C::CoreStat1' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, CoreStat2) == 0x0002B0, "Member 'USquadStatsWidget_C::CoreStat2' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, CoreStat3) == 0x0002B8, "Member 'USquadStatsWidget_C::CoreStat3' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, DetailedStatsBorder) == 0x0002C0, "Member 'USquadStatsWidget_C::DetailedStatsBorder' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, DetailedStatsCommonBorder) == 0x0002C8, "Member 'USquadStatsWidget_C::DetailedStatsCommonBorder' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, DetailedStatsVbox) == 0x0002D0, "Member 'USquadStatsWidget_C::DetailedStatsVbox' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, ExtraContentSlot) == 0x0002D8, "Member 'USquadStatsWidget_C::ExtraContentSlot' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, LargeStat0) == 0x0002E0, "Member 'USquadStatsWidget_C::LargeStat0' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, LargeStat1) == 0x0002E8, "Member 'USquadStatsWidget_C::LargeStat1' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, SeeDetailedStats) == 0x0002F0, "Member 'USquadStatsWidget_C::SeeDetailedStats' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, StatsSwitcher) == 0x0002F8, "Member 'USquadStatsWidget_C::StatsSwitcher' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, TeamCoreStat0) == 0x000300, "Member 'USquadStatsWidget_C::TeamCoreStat0' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, TeamCoreStat1) == 0x000308, "Member 'USquadStatsWidget_C::TeamCoreStat1' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, TeamCoreStat2) == 0x000310, "Member 'USquadStatsWidget_C::TeamCoreStat2' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, TeamCoreStat3) == 0x000318, "Member 'USquadStatsWidget_C::TeamCoreStat3' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, TextBonuses) == 0x000320, "Member 'USquadStatsWidget_C::TextBonuses' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, bViewingDetailedStats) == 0x000328, "Member 'USquadStatsWidget_C::bViewingDetailedStats' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, DetailedStatsClosed) == 0x000330, "Member 'USquadStatsWidget_C::DetailedStatsClosed' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, bStatsNeedUpdate) == 0x000340, "Member 'USquadStatsWidget_C::bStatsNeedUpdate' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, bIsActive) == 0x000341, "Member 'USquadStatsWidget_C::bIsActive' has a wrong offset!");
static_assert(offsetof(USquadStatsWidget_C, Bonus_Label) == 0x000348, "Member 'USquadStatsWidget_C::Bonus_Label' has a wrong offset!");

}

