#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SquadSlotDetailsPanel

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function SquadSlotDetailsPanel.SquadSlotDetailsPanel_C.ExecuteUbergraph_SquadSlotDetailsPanel
// 0x0320 (0x0320 - 0x0000)
struct SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_GetItemInSquadSlotBP_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_TryGetItemToPreviewInSlot_OutItemToPreviewInSlot; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetItemToPreviewInSlot_ReturnValue;    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSquadSlotLockedBP_ReturnValue;          // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId;    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId2;   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex2; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHomeBaseContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHomebaseSquad                         CallFunc_TryGetHomebaseSquadData_OutHomebaseSquad; // 0x0070(0x0088)()
	bool                                          CallFunc_TryGetHomebaseSquadData_ReturnValue;      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHomebaseSquadSlot                     CallFunc_Array_Get_Item;                           // 0x0108(0x0060)()
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemType                                 CallFunc_Array_Get_Item2;                          // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16B[0x5];                                      // 0x016B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_ToText_ReturnValue;                       // 0x0170(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18B[0x5];                                      // 0x018B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFortSquadSlottingRestrictionReason>   CallFunc_GetSlottingRestrictionReasons_ReturnValue; // 0x0190(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetRestrictionReasonsAsText_Text;         // 0x01A8(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHomeBaseContext*                       CallFunc_GetContext_ReturnValue3;                  // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetUnlockingHomebaseNodeIdForSquadSlot_ReturnValue; // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E2[0x6];                                      // 0x01E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01E8(0x0040)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0230(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0270(0x0010)(ZeroConstructor, ReferenceParm)
	class UWidget*                                K2Node_Select3_Default;                            // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0288(0x0018)()
	bool                                          Temp_bool_Variable5;                               // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select4_Default;                            // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData3;             // 0x02B0(0x0040)(HasGetValueTypeHash)
	class UWidget*                                K2Node_Select5_Default;                            // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array2;                           // 0x02F8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue2;                      // 0x0308(0x0018)()
};
static_assert(alignof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel) == 0x000008, "Wrong alignment on SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel");
static_assert(sizeof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel) == 0x000320, "Wrong size on SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, EntryPoint) == 0x000000, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, Temp_bool_Variable) == 0x000004, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, Temp_byte_Variable) == 0x000005, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_GetOwningLocalPlayer_ReturnValue) == 0x000008, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_GetOwningLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_GetItemInSquadSlotBP_ReturnValue) == 0x000010, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_GetItemInSquadSlotBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_TryGetItemToPreviewInSlot_OutItemToPreviewInSlot) == 0x000020, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_TryGetItemToPreviewInSlot_OutItemToPreviewInSlot' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_TryGetItemToPreviewInSlot_ReturnValue) == 0x000028, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_TryGetItemToPreviewInSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, Temp_byte_Variable2) == 0x000029, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_IsValid_ReturnValue2) == 0x00002A, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_IsSquadSlotLockedBP_ReturnValue) == 0x00002B, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_IsSquadSlotLockedBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, K2Node_Select_Default) == 0x000030, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId) == 0x000038, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex) == 0x000040, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000044, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, K2Node_ComponentBoundEvent_Button) == 0x000048, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_GetUINavigationManager_ReturnValue) == 0x000050, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId2) == 0x000058, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId2' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex2) == 0x000060, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex2' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, Temp_bool_Variable2) == 0x000064, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_GetContext_ReturnValue) == 0x000068, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_TryGetHomebaseSquadData_OutHomebaseSquad) == 0x000070, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_TryGetHomebaseSquadData_OutHomebaseSquad' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_TryGetHomebaseSquadData_ReturnValue) == 0x0000F8, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_TryGetHomebaseSquadData_ReturnValue' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_GetContext_ReturnValue2) == 0x000100, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_Array_Get_Item) == 0x000108, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_IsValid_ReturnValue3) == 0x000168, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_Array_Get_Item2) == 0x000169, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00016A, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_ToText_ReturnValue) == 0x000170, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_ToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_BooleanAND_ReturnValue) == 0x000188, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_IsInZone_ReturnValue) == 0x000189, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00018A, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_GetSlottingRestrictionReasons_ReturnValue) == 0x000190, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_GetSlottingRestrictionReasons_ReturnValue' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_Array_Length_ReturnValue) == 0x0001A0, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_GetRestrictionReasonsAsText_Text) == 0x0001A8, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_GetRestrictionReasonsAsText_Text' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_Greater_IntInt_ReturnValue) == 0x0001C0, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_GetContext_ReturnValue3) == 0x0001C8, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, K2Node_Select2_Default) == 0x0001D0, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_GetUnlockingHomebaseNodeIdForSquadSlot_ReturnValue) == 0x0001D8, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_GetUnlockingHomebaseNodeIdForSquadSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_NotEqual_NameName_ReturnValue) == 0x0001E0, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, Temp_bool_Variable3) == 0x0001E1, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, K2Node_MakeStruct_FormatArgumentData) == 0x0001E8, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, Temp_bool_Variable4) == 0x000228, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, K2Node_MakeStruct_FormatArgumentData2) == 0x000230, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, K2Node_MakeArray_Array) == 0x000270, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, K2Node_Select3_Default) == 0x000280, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_Format_ReturnValue) == 0x000288, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, Temp_bool_Variable5) == 0x0002A0, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, K2Node_Select4_Default) == 0x0002A8, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, K2Node_MakeStruct_FormatArgumentData3) == 0x0002B0, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::K2Node_MakeStruct_FormatArgumentData3' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, K2Node_Select5_Default) == 0x0002F0, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::K2Node_Select5_Default' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, K2Node_MakeArray_Array2) == 0x0002F8, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel, CallFunc_Format_ReturnValue2) == 0x000308, "Member 'SquadSlotDetailsPanel_C_ExecuteUbergraph_SquadSlotDetailsPanel::CallFunc_Format_ReturnValue2' has a wrong offset!");

// Function SquadSlotDetailsPanel.SquadSlotDetailsPanel_C.BndEvt__ShowInSkillTreeButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SquadSlotDetailsPanel_C_BndEvt__ShowInSkillTreeButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SquadSlotDetailsPanel_C_BndEvt__ShowInSkillTreeButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on SquadSlotDetailsPanel_C_BndEvt__ShowInSkillTreeButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(SquadSlotDetailsPanel_C_BndEvt__ShowInSkillTreeButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on SquadSlotDetailsPanel_C_BndEvt__ShowInSkillTreeButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(SquadSlotDetailsPanel_C_BndEvt__ShowInSkillTreeButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'SquadSlotDetailsPanel_C_BndEvt__ShowInSkillTreeButton_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function SquadSlotDetailsPanel.SquadSlotDetailsPanel_C.UpdateSkillTreeButtonVisibility
// 0x0040 (0x0040 - 0x0000)
struct SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHomeBaseContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetUnlockingHomebaseNodeIdForSquadSlot_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility) == 0x000008, "Wrong alignment on SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility");
static_assert(sizeof(SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility) == 0x000040, "Wrong size on SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility");
static_assert(offsetof(SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility, Temp_byte_Variable) == 0x000000, "Member 'SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility, Temp_byte_Variable2) == 0x000001, "Member 'SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility, CallFunc_GetContext_ReturnValue2) == 0x000010, "Member 'SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility, CallFunc_IsInZone_ReturnValue) == 0x000018, "Member 'SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility, CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId) == 0x000020, "Member 'SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility::CallFunc_GetIdOfSquadSlotToManageBP_OutSquadId' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility, CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex) == 0x000028, "Member 'SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility::CallFunc_GetIdOfSquadSlotToManageBP_OutSquadSlotIndex' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility, Temp_bool_Variable) == 0x00002C, "Member 'SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility, CallFunc_GetUnlockingHomebaseNodeIdForSquadSlot_ReturnValue) == 0x000030, "Member 'SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility::CallFunc_GetUnlockingHomebaseNodeIdForSquadSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000038, "Member 'SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility, CallFunc_BooleanOR_ReturnValue) == 0x000039, "Member 'SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility, K2Node_Select_Default) == 0x00003A, "Member 'SquadSlotDetailsPanel_C_UpdateSkillTreeButtonVisibility::K2Node_Select_Default' has a wrong offset!");

// Function SquadSlotDetailsPanel.SquadSlotDetailsPanel_C.GetRestrictionReasonsAsText
// 0x0188 (0x0188 - 0x0000)
struct SquadSlotDetailsPanel_C_GetRestrictionReasonsAsText final
{
public:
	TArray<EFortSquadSlottingRestrictionReason>   Reasons;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class FText                                   Text;                                              // 0x0010(0x0018)(Parm, OutParm)
	class FText                                   Result;                                            // 0x0028(0x0018)(Edit, BlueprintVisible)
	class FText                                   Temp_text_Variable;                                // 0x0040(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable2;                               // 0x0060(0x0018)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortSquadSlottingRestrictionReason           CallFunc_Array_Get_Item;                           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable3;                               // 0x0088(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00A0(0x0040)(HasGetValueTypeHash)
	class FText                                   Temp_text_Variable4;                               // 0x00E0(0x0018)()
	EFortSquadSlottingRestrictionReason           Temp_byte_Variable;                                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0100(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0120(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0160(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0170(0x0018)()
};
static_assert(alignof(SquadSlotDetailsPanel_C_GetRestrictionReasonsAsText) == 0x000008, "Wrong alignment on SquadSlotDetailsPanel_C_GetRestrictionReasonsAsText");
static_assert(sizeof(SquadSlotDetailsPanel_C_GetRestrictionReasonsAsText) == 0x000188, "Wrong size on SquadSlotDetailsPanel_C_GetRestrictionReasonsAsText");
static_assert(offsetof(SquadSlotDetailsPanel_C_GetRestrictionReasonsAsText, Reasons) == 0x000000, "Member 'SquadSlotDetailsPanel_C_GetRestrictionReasonsAsText::Reasons' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_GetRestrictionReasonsAsText, Text) == 0x000010, "Member 'SquadSlotDetailsPanel_C_GetRestrictionReasonsAsText::Text' has a wrong offset!");
static_assert(offsetof(SquadSlotDetailsPanel_C_GetRestrictionReasonsAsText, Result) == 0x000028, "Member 'SquadSlotDetailsPanel_C_GetRestrictionReasonsAsText::Result' has a wrong offset!");
