#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StickyNotification

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function StickyNotification.StickyNotification_C.ExecuteUbergraph_StickyNotification
// 0x0148 (0x0148 - 0x0000)
struct StickyNotification_C_ExecuteUbergraph_StickyNotification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortBaseButton*                        K2Node_ComponentBoundEvent_Button2;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent2;                          // 0x0018(0x0070)()
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0088(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00C0(0x0070)()
	bool                                          K2Node_ComponentBoundEvent_Is_Hovered;             // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortBaseButton*                        K2Node_ComponentBoundEvent_Button;                 // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StickyNotification_C_ExecuteUbergraph_StickyNotification) == 0x000008, "Wrong alignment on StickyNotification_C_ExecuteUbergraph_StickyNotification");
static_assert(sizeof(StickyNotification_C_ExecuteUbergraph_StickyNotification) == 0x000148, "Wrong size on StickyNotification_C_ExecuteUbergraph_StickyNotification");
static_assert(offsetof(StickyNotification_C_ExecuteUbergraph_StickyNotification, EntryPoint) == 0x000000, "Member 'StickyNotification_C_ExecuteUbergraph_StickyNotification::EntryPoint' has a wrong offset!");
static_assert(offsetof(StickyNotification_C_ExecuteUbergraph_StickyNotification, K2Node_ComponentBoundEvent_Button2) == 0x000008, "Member 'StickyNotification_C_ExecuteUbergraph_StickyNotification::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(StickyNotification_C_ExecuteUbergraph_StickyNotification, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'StickyNotification_C_ExecuteUbergraph_StickyNotification::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(StickyNotification_C_ExecuteUbergraph_StickyNotification, K2Node_Event_MouseEvent2) == 0x000018, "Member 'StickyNotification_C_ExecuteUbergraph_StickyNotification::K2Node_Event_MouseEvent2' has a wrong offset!");
static_assert(offsetof(StickyNotification_C_ExecuteUbergraph_StickyNotification, K2Node_Event_MyGeometry) == 0x000088, "Member 'StickyNotification_C_ExecuteUbergraph_StickyNotification::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(StickyNotification_C_ExecuteUbergraph_StickyNotification, K2Node_Event_MouseEvent) == 0x0000C0, "Member 'StickyNotification_C_ExecuteUbergraph_StickyNotification::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(StickyNotification_C_ExecuteUbergraph_StickyNotification, K2Node_ComponentBoundEvent_Is_Hovered) == 0x000130, "Member 'StickyNotification_C_ExecuteUbergraph_StickyNotification::K2Node_ComponentBoundEvent_Is_Hovered' has a wrong offset!");
static_assert(offsetof(StickyNotification_C_ExecuteUbergraph_StickyNotification, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000131, "Member 'StickyNotification_C_ExecuteUbergraph_StickyNotification::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(StickyNotification_C_ExecuteUbergraph_StickyNotification, K2Node_ComponentBoundEvent_Button) == 0x000138, "Member 'StickyNotification_C_ExecuteUbergraph_StickyNotification::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(StickyNotification_C_ExecuteUbergraph_StickyNotification, CallFunc_BooleanOR_ReturnValue) == 0x000140, "Member 'StickyNotification_C_ExecuteUbergraph_StickyNotification::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function StickyNotification.StickyNotification_C.BndEvt__ButtonIconText_Close_K2Node_ComponentBoundEvent_1644_FortBaseButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct StickyNotification_C_BndEvt__ButtonIconText_Close_K2Node_ComponentBoundEvent_1644_FortBaseButtonClicked__DelegateSignature final
{
public:
	class UFortBaseButton*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StickyNotification_C_BndEvt__ButtonIconText_Close_K2Node_ComponentBoundEvent_1644_FortBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on StickyNotification_C_BndEvt__ButtonIconText_Close_K2Node_ComponentBoundEvent_1644_FortBaseButtonClicked__DelegateSignature");
static_assert(sizeof(StickyNotification_C_BndEvt__ButtonIconText_Close_K2Node_ComponentBoundEvent_1644_FortBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong size on StickyNotification_C_BndEvt__ButtonIconText_Close_K2Node_ComponentBoundEvent_1644_FortBaseButtonClicked__DelegateSignature");
static_assert(offsetof(StickyNotification_C_BndEvt__ButtonIconText_Close_K2Node_ComponentBoundEvent_1644_FortBaseButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'StickyNotification_C_BndEvt__ButtonIconText_Close_K2Node_ComponentBoundEvent_1644_FortBaseButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function StickyNotification.StickyNotification_C.BndEvt__ButtonIconText_Go_K2Node_ComponentBoundEvent_1161_On Mouse Hovered Changed__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct StickyNotification_C_BndEvt__ButtonIconText_Go_K2Node_ComponentBoundEvent_1161_On_Mouse_Hovered_Changed__DelegateSignature final
{
public:
	bool                                          Is_Hovered;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StickyNotification_C_BndEvt__ButtonIconText_Go_K2Node_ComponentBoundEvent_1161_On_Mouse_Hovered_Changed__DelegateSignature) == 0x000001, "Wrong alignment on StickyNotification_C_BndEvt__ButtonIconText_Go_K2Node_ComponentBoundEvent_1161_On_Mouse_Hovered_Changed__DelegateSignature");
static_assert(sizeof(StickyNotification_C_BndEvt__ButtonIconText_Go_K2Node_ComponentBoundEvent_1161_On_Mouse_Hovered_Changed__DelegateSignature) == 0x000001, "Wrong size on StickyNotification_C_BndEvt__ButtonIconText_Go_K2Node_ComponentBoundEvent_1161_On_Mouse_Hovered_Changed__DelegateSignature");
static_assert(offsetof(StickyNotification_C_BndEvt__ButtonIconText_Go_K2Node_ComponentBoundEvent_1161_On_Mouse_Hovered_Changed__DelegateSignature, Is_Hovered) == 0x000000, "Member 'StickyNotification_C_BndEvt__ButtonIconText_Go_K2Node_ComponentBoundEvent_1161_On_Mouse_Hovered_Changed__DelegateSignature::Is_Hovered' has a wrong offset!");

// Function StickyNotification.StickyNotification_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct StickyNotification_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(StickyNotification_C_OnMouseEnter) == 0x000008, "Wrong alignment on StickyNotification_C_OnMouseEnter");
static_assert(sizeof(StickyNotification_C_OnMouseEnter) == 0x0000A8, "Wrong size on StickyNotification_C_OnMouseEnter");
static_assert(offsetof(StickyNotification_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'StickyNotification_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(StickyNotification_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'StickyNotification_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function StickyNotification.StickyNotification_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct StickyNotification_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(StickyNotification_C_OnMouseLeave) == 0x000008, "Wrong alignment on StickyNotification_C_OnMouseLeave");
static_assert(sizeof(StickyNotification_C_OnMouseLeave) == 0x000070, "Wrong size on StickyNotification_C_OnMouseLeave");
static_assert(offsetof(StickyNotification_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'StickyNotification_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function StickyNotification.StickyNotification_C.BndEvt__ButtonIconText_Go_K2Node_ComponentBoundEvent_826_FortBaseButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct StickyNotification_C_BndEvt__ButtonIconText_Go_K2Node_ComponentBoundEvent_826_FortBaseButtonClicked__DelegateSignature final
{
public:
	class UFortBaseButton*                        Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StickyNotification_C_BndEvt__ButtonIconText_Go_K2Node_ComponentBoundEvent_826_FortBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on StickyNotification_C_BndEvt__ButtonIconText_Go_K2Node_ComponentBoundEvent_826_FortBaseButtonClicked__DelegateSignature");
static_assert(sizeof(StickyNotification_C_BndEvt__ButtonIconText_Go_K2Node_ComponentBoundEvent_826_FortBaseButtonClicked__DelegateSignature) == 0x000008, "Wrong size on StickyNotification_C_BndEvt__ButtonIconText_Go_K2Node_ComponentBoundEvent_826_FortBaseButtonClicked__DelegateSignature");
static_assert(offsetof(StickyNotification_C_BndEvt__ButtonIconText_Go_K2Node_ComponentBoundEvent_826_FortBaseButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'StickyNotification_C_BndEvt__ButtonIconText_Go_K2Node_ComponentBoundEvent_826_FortBaseButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function StickyNotification.StickyNotification_C.BindDelegates
// 0x0090 (0x0090 - 0x0000)
struct StickyNotification_C_BindDelegates final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UFortDialogNotificationHandler*         K2Node_DynamicCast_AsFort_Dialog_Notification_Handler; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(StickyNotification_C_BindDelegates) == 0x000008, "Wrong alignment on StickyNotification_C_BindDelegates");
static_assert(sizeof(StickyNotification_C_BindDelegates) == 0x000090, "Wrong size on StickyNotification_C_BindDelegates");
static_assert(offsetof(StickyNotification_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'StickyNotification_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(StickyNotification_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate2) == 0x000010, "Member 'StickyNotification_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(StickyNotification_C_BindDelegates, K2Node_DynamicCast_AsFort_Dialog_Notification_Handler) == 0x000020, "Member 'StickyNotification_C_BindDelegates::K2Node_DynamicCast_AsFort_Dialog_Notification_Handler' has a wrong offset!");
static_assert(offsetof(StickyNotification_C_BindDelegates, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'StickyNotification_C_BindDelegates::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(StickyNotification_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate3) == 0x000030, "Member 'StickyNotification_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(StickyNotification_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate4) == 0x000040, "Member 'StickyNotification_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(StickyNotification_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate5) == 0x000050, "Member 'StickyNotification_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(StickyNotification_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate6) == 0x000060, "Member 'StickyNotification_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(StickyNotification_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate7) == 0x000070, "Member 'StickyNotification_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(StickyNotification_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate8) == 0x000080, "Member 'StickyNotification_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");

// Function StickyNotification.StickyNotification_C.CloseSticky
// 0x0010 (0x0010 - 0x0000)
struct StickyNotification_C_CloseSticky final
{
public:
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StickyNotification_C_CloseSticky) == 0x000008, "Wrong alignment on StickyNotification_C_CloseSticky");
static_assert(sizeof(StickyNotification_C_CloseSticky) == 0x000010, "Wrong size on StickyNotification_C_CloseSticky");
static_assert(offsetof(StickyNotification_C_CloseSticky, CallFunc_SpawnSound2D_ReturnValue) == 0x000000, "Member 'StickyNotification_C_CloseSticky::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(StickyNotification_C_CloseSticky, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'StickyNotification_C_CloseSticky::CallFunc_GetContext_ReturnValue' has a wrong offset!");

}

