#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreMain_OfferDetails

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function StoreMain_OfferDetails.StoreMain_OfferDetails_C.ExecuteUbergraph_StoreMain_OfferDetails
// 0x0078 (0x0078 - 0x0000)
struct StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue2;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetOfferId_ReturnValue;                   // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bSuccess)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class UFortStoreContext*                      CallFunc_GetContext_ReturnValue3;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0050(0x0010)(NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate2;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails) == 0x000008, "Wrong alignment on StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails");
static_assert(sizeof(StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails) == 0x000078, "Wrong size on StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails");
static_assert(offsetof(StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails, EntryPoint) == 0x000000, "Member 'StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails::EntryPoint' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails, CallFunc_GetContext_ReturnValue2) == 0x000018, "Member 'StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails, CallFunc_GetOfferId_ReturnValue) == 0x000020, "Member 'StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails::CallFunc_GetOfferId_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails, K2Node_CustomEvent_bSuccess) == 0x000030, "Member 'StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails::K2Node_CustomEvent_bSuccess' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails, CallFunc_GetContext_ReturnValue3) == 0x000048, "Member 'StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails, K2Node_MakeStruct_DataTableRowHandle) == 0x000050, "Member 'StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails, K2Node_CreateDelegate_OutputDelegate2) == 0x000060, "Member 'StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails, CallFunc_GetUINavigationManager_ReturnValue) == 0x000070, "Member 'StoreMain_OfferDetails_C_ExecuteUbergraph_StoreMain_OfferDetails::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

// Function StoreMain_OfferDetails.StoreMain_OfferDetails_C.HandlePurchaseComplete
// 0x0001 (0x0001 - 0x0000)
struct StoreMain_OfferDetails_C_HandlePurchaseComplete final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreMain_OfferDetails_C_HandlePurchaseComplete) == 0x000001, "Wrong alignment on StoreMain_OfferDetails_C_HandlePurchaseComplete");
static_assert(sizeof(StoreMain_OfferDetails_C_HandlePurchaseComplete) == 0x000001, "Wrong size on StoreMain_OfferDetails_C_HandlePurchaseComplete");
static_assert(offsetof(StoreMain_OfferDetails_C_HandlePurchaseComplete, bSuccess) == 0x000000, "Member 'StoreMain_OfferDetails_C_HandlePurchaseComplete::bSuccess' has a wrong offset!");

// Function StoreMain_OfferDetails.StoreMain_OfferDetails_C.BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_16_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct StoreMain_OfferDetails_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_16_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_OfferDetails_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_16_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on StoreMain_OfferDetails_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_16_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(StoreMain_OfferDetails_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_16_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on StoreMain_OfferDetails_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_16_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(StoreMain_OfferDetails_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_16_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'StoreMain_OfferDetails_C_BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_16_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function StoreMain_OfferDetails.StoreMain_OfferDetails_C.HandleBack
// 0x0001 (0x0001 - 0x0000)
struct StoreMain_OfferDetails_C_HandleBack final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreMain_OfferDetails_C_HandleBack) == 0x000001, "Wrong alignment on StoreMain_OfferDetails_C_HandleBack");
static_assert(sizeof(StoreMain_OfferDetails_C_HandleBack) == 0x000001, "Wrong size on StoreMain_OfferDetails_C_HandleBack");
static_assert(offsetof(StoreMain_OfferDetails_C_HandleBack, Passthrough) == 0x000000, "Member 'StoreMain_OfferDetails_C_HandleBack::Passthrough' has a wrong offset!");

// Function StoreMain_OfferDetails.StoreMain_OfferDetails_C.Init
// 0x0210 (0x0210 - 0x0000)
struct StoreMain_OfferDetails_C_Init final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMtxStoreOfferType                        Temp_byte_Variable5;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable8;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable9;                               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable10;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable11;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMtxStoreOfferType                        CallFunc_GetStoreOfferType_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable12;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDescription_ReturnValue;               // 0x0028(0x0018)()
	EFortMtxStoreOfferType                        CallFunc_GetStoreOfferType_ReturnValue2;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBonusQuantity_ReturnValue;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable13;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortMtxStoreOfferType                        CallFunc_GetStoreOfferType_ReturnValue3;           // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBonusQuantity_ReturnValue2;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0068(0x0018)()
	int32                                         CallFunc_GetBaseQuantity_ReturnValue;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue2;              // 0x0088(0x0018)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStoreMain_OfferDetailsAttribute_C*     CallFunc_Create_ReturnValue;                       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFortMtxDetailsAttribute>       CallFunc_GetDetailsAttributes_ReturnValue;         // 0x00B0(0x0010)(ZeroConstructor, ReferenceParm)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortMtxDetailsAttribute               CallFunc_Array_Get_Item;                           // 0x00C8(0x0030)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortMtxStoreOfferType                        CallFunc_GetStoreOfferType_ReturnValue4;           // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue4;         // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FF[0x1];                                       // 0x00FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetNormalPrice_ReturnValue;               // 0x0100(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select4_Default;                            // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11B[0x5];                                      // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetSalePrice_SalePrice;                   // 0x0120(0x0018)()
	bool                                          CallFunc_GetSalePrice_ReturnValue;                 // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select5_Default;                            // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetName_ReturnValue;                      // 0x0140(0x0018)()
	ESlateVisibility                              Temp_byte_Variable14;                              // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable5;                               // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15A[0x2];                                      // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMtxGradient                       CallFunc_GetGradient_ReturnValue;                  // 0x015C(0x0020)(NoDestructor)
	ESlateVisibility                              K2Node_Select6_Default;                            // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue2;          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetBackground_ReturnValue;                // 0x0188(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_GetDetailsImage_ReturnValue;              // 0x0198(0x0078)()
};
static_assert(alignof(StoreMain_OfferDetails_C_Init) == 0x000008, "Wrong alignment on StoreMain_OfferDetails_C_Init");
static_assert(sizeof(StoreMain_OfferDetails_C_Init) == 0x000210, "Wrong size on StoreMain_OfferDetails_C_Init");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, Temp_bool_Variable) == 0x000000, "Member 'StoreMain_OfferDetails_C_Init::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, Temp_byte_Variable) == 0x000001, "Member 'StoreMain_OfferDetails_C_Init::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, Temp_byte_Variable2) == 0x000002, "Member 'StoreMain_OfferDetails_C_Init::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, Temp_bool_Variable2) == 0x000003, "Member 'StoreMain_OfferDetails_C_Init::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, Temp_byte_Variable3) == 0x000004, "Member 'StoreMain_OfferDetails_C_Init::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, Temp_byte_Variable4) == 0x000005, "Member 'StoreMain_OfferDetails_C_Init::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, Temp_byte_Variable5) == 0x000006, "Member 'StoreMain_OfferDetails_C_Init::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, Temp_byte_Variable6) == 0x000007, "Member 'StoreMain_OfferDetails_C_Init::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, Temp_byte_Variable7) == 0x000008, "Member 'StoreMain_OfferDetails_C_Init::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, Temp_byte_Variable8) == 0x000009, "Member 'StoreMain_OfferDetails_C_Init::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, Temp_bool_Variable3) == 0x00000A, "Member 'StoreMain_OfferDetails_C_Init::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, Temp_byte_Variable9) == 0x00000B, "Member 'StoreMain_OfferDetails_C_Init::Temp_byte_Variable9' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, Temp_byte_Variable10) == 0x00000C, "Member 'StoreMain_OfferDetails_C_Init::Temp_byte_Variable10' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, Temp_int_Array_Index_Variable) == 0x000010, "Member 'StoreMain_OfferDetails_C_Init::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, Temp_byte_Variable11) == 0x000014, "Member 'StoreMain_OfferDetails_C_Init::Temp_byte_Variable11' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'StoreMain_OfferDetails_C_Init::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_GetStoreOfferType_ReturnValue) == 0x00001C, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_GetStoreOfferType_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001D, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, Temp_byte_Variable12) == 0x000024, "Member 'StoreMain_OfferDetails_C_Init::Temp_byte_Variable12' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_GetDescription_ReturnValue) == 0x000028, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_GetDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_GetStoreOfferType_ReturnValue2) == 0x000040, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_GetStoreOfferType_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000041, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_EqualEqual_ByteByte_ReturnValue3) == 0x000042, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_EqualEqual_ByteByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_BooleanOR_ReturnValue) == 0x000043, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, Temp_bool_Variable4) == 0x000044, "Member 'StoreMain_OfferDetails_C_Init::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000048, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, K2Node_Select_Default) == 0x000050, "Member 'StoreMain_OfferDetails_C_Init::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_GetBonusQuantity_ReturnValue) == 0x000054, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_GetBonusQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, Temp_byte_Variable13) == 0x000058, "Member 'StoreMain_OfferDetails_C_Init::Temp_byte_Variable13' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_Greater_IntInt_ReturnValue) == 0x000059, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_GetStoreOfferType_ReturnValue3) == 0x00005A, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_GetStoreOfferType_ReturnValue3' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_GetBonusQuantity_ReturnValue2) == 0x00005C, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_GetBonusQuantity_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, K2Node_Select2_Default) == 0x000060, "Member 'StoreMain_OfferDetails_C_Init::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_Conv_IntToText_ReturnValue) == 0x000068, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_GetBaseQuantity_ReturnValue) == 0x000080, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_GetBaseQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_Conv_IntToText_ReturnValue2) == 0x000088, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_Conv_IntToText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000A0, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_Create_ReturnValue) == 0x0000A8, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_GetDetailsAttributes_ReturnValue) == 0x0000B0, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_GetDetailsAttributes_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x0000C0, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_Array_Length_ReturnValue) == 0x0000F8, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_Less_IntInt_ReturnValue) == 0x0000FC, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_GetStoreOfferType_ReturnValue4) == 0x0000FD, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_GetStoreOfferType_ReturnValue4' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_EqualEqual_ByteByte_ReturnValue4) == 0x0000FE, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_EqualEqual_ByteByte_ReturnValue4' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_GetNormalPrice_ReturnValue) == 0x000100, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_GetNormalPrice_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_BooleanAND_ReturnValue) == 0x000118, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, K2Node_Select3_Default) == 0x000119, "Member 'StoreMain_OfferDetails_C_Init::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, K2Node_Select4_Default) == 0x00011A, "Member 'StoreMain_OfferDetails_C_Init::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_GetSalePrice_SalePrice) == 0x000120, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_GetSalePrice_SalePrice' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_GetSalePrice_ReturnValue) == 0x000138, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_GetSalePrice_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, K2Node_Select5_Default) == 0x000139, "Member 'StoreMain_OfferDetails_C_Init::K2Node_Select5_Default' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_GetName_ReturnValue) == 0x000140, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_GetName_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, Temp_byte_Variable14) == 0x000158, "Member 'StoreMain_OfferDetails_C_Init::Temp_byte_Variable14' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, Temp_bool_Variable5) == 0x000159, "Member 'StoreMain_OfferDetails_C_Init::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_GetGradient_ReturnValue) == 0x00015C, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_GetGradient_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, K2Node_Select6_Default) == 0x00017C, "Member 'StoreMain_OfferDetails_C_Init::K2Node_Select6_Default' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_GetDynamicMaterial_ReturnValue2) == 0x000180, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_GetDynamicMaterial_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_GetBackground_ReturnValue) == 0x000188, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_GetBackground_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_OfferDetails_C_Init, CallFunc_GetDetailsImage_ReturnValue) == 0x000198, "Member 'StoreMain_OfferDetails_C_Init::CallFunc_GetDetailsImage_ReturnValue' has a wrong offset!");

// Function StoreMain_OfferDetails.StoreMain_OfferDetails_C.PopDetails
// 0x0008 (0x0008 - 0x0000)
struct StoreMain_OfferDetails_C_PopDetails final
{
public:
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_OfferDetails_C_PopDetails) == 0x000008, "Wrong alignment on StoreMain_OfferDetails_C_PopDetails");
static_assert(sizeof(StoreMain_OfferDetails_C_PopDetails) == 0x000008, "Wrong size on StoreMain_OfferDetails_C_PopDetails");
static_assert(offsetof(StoreMain_OfferDetails_C_PopDetails, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000000, "Member 'StoreMain_OfferDetails_C_PopDetails::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

}

