#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreMain_OfferDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StoreMain_OfferDetails.StoreMain_OfferDetails_C
// 0x00C0 (0x0550 - 0x0490)
class UStoreMain_OfferDetails_C final : public UFortMtxOfferDetailsBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 BaseColor;                                         // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BaseColorDetails;                                  // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               BonusCurrencySB;                                   // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderDisclaimer;                                  // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_BaseQuantity;                           // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_BonusQuantity;                          // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       FounderPackLabelText;                              // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Highlight;                                         // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       KeyArt;                                            // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OverlayGradient;                                   // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OverlayGradientDetails;                            // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlaySalePrice;                                  // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      PurchaseButton;                                    // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBoxDetails;                                  // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStoreMain_OfferDetailsAttribute_C*     StoreMain_OfferDetailsAttribute;                   // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStoreMain_OfferDetailsAttribute_C*     StoreMain_OfferDetailsAttribute_C_0;               // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextDescription;                                   // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextName;                                          // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOfferDisplayPrice;                             // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOriginalPrice;                                 // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBoxOfferInfo;                                     // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VBuckHighlight;                                    // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_StoreMain_OfferDetails(int32 EntryPoint);
	void Destruct();
	void Construct();
	void HandlePurchaseComplete(bool bSuccess);
	void BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_16_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnDeactivated();
	void OnActivated();
	void HandleBack(bool* Passthrough);
	void Init();
	void PopDetails();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StoreMain_OfferDetails_C">();
	}
	static class UStoreMain_OfferDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStoreMain_OfferDetails_C>();
	}
};
static_assert(alignof(UStoreMain_OfferDetails_C) == 0x000008, "Wrong alignment on UStoreMain_OfferDetails_C");
static_assert(sizeof(UStoreMain_OfferDetails_C) == 0x000550, "Wrong size on UStoreMain_OfferDetails_C");
static_assert(offsetof(UStoreMain_OfferDetails_C, UberGraphFrame) == 0x000490, "Member 'UStoreMain_OfferDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, BaseColor) == 0x000498, "Member 'UStoreMain_OfferDetails_C::BaseColor' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, BaseColorDetails) == 0x0004A0, "Member 'UStoreMain_OfferDetails_C::BaseColorDetails' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, BonusCurrencySB) == 0x0004A8, "Member 'UStoreMain_OfferDetails_C::BonusCurrencySB' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, BorderDisclaimer) == 0x0004B0, "Member 'UStoreMain_OfferDetails_C::BorderDisclaimer' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, CommonText_BaseQuantity) == 0x0004B8, "Member 'UStoreMain_OfferDetails_C::CommonText_BaseQuantity' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, CommonText_BonusQuantity) == 0x0004C0, "Member 'UStoreMain_OfferDetails_C::CommonText_BonusQuantity' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, FounderPackLabelText) == 0x0004C8, "Member 'UStoreMain_OfferDetails_C::FounderPackLabelText' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, Highlight) == 0x0004D0, "Member 'UStoreMain_OfferDetails_C::Highlight' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, KeyArt) == 0x0004D8, "Member 'UStoreMain_OfferDetails_C::KeyArt' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, OverlayGradient) == 0x0004E0, "Member 'UStoreMain_OfferDetails_C::OverlayGradient' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, OverlayGradientDetails) == 0x0004E8, "Member 'UStoreMain_OfferDetails_C::OverlayGradientDetails' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, OverlaySalePrice) == 0x0004F0, "Member 'UStoreMain_OfferDetails_C::OverlaySalePrice' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, PurchaseButton) == 0x0004F8, "Member 'UStoreMain_OfferDetails_C::PurchaseButton' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, SafeZone_0) == 0x000500, "Member 'UStoreMain_OfferDetails_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, ScrollBoxDetails) == 0x000508, "Member 'UStoreMain_OfferDetails_C::ScrollBoxDetails' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, StoreMain_OfferDetailsAttribute) == 0x000510, "Member 'UStoreMain_OfferDetails_C::StoreMain_OfferDetailsAttribute' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, StoreMain_OfferDetailsAttribute_C_0) == 0x000518, "Member 'UStoreMain_OfferDetails_C::StoreMain_OfferDetailsAttribute_C_0' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, TextDescription) == 0x000520, "Member 'UStoreMain_OfferDetails_C::TextDescription' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, TextName) == 0x000528, "Member 'UStoreMain_OfferDetails_C::TextName' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, TextOfferDisplayPrice) == 0x000530, "Member 'UStoreMain_OfferDetails_C::TextOfferDisplayPrice' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, TextOriginalPrice) == 0x000538, "Member 'UStoreMain_OfferDetails_C::TextOriginalPrice' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, VBoxOfferInfo) == 0x000540, "Member 'UStoreMain_OfferDetails_C::VBoxOfferInfo' has a wrong offset!");
static_assert(offsetof(UStoreMain_OfferDetails_C, VBuckHighlight) == 0x000548, "Member 'UStoreMain_OfferDetails_C::VBuckHighlight' has a wrong offset!");

}

