#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SupportHeroSquadBonusesDetailWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SupportHeroSquadBonusesDetailWidget.SupportHeroSquadBonusesDetailWidget_C
// 0x0020 (0x02A0 - 0x0280)
class USupportHeroSquadBonusesDetailWidget_C final : public UFortSquadSlotItemDetailElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(Transient, DuplicateTransient)
	class UFortHeroSupportPerkWidget_C*           SupportPerkWidget;                                 // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortHeroSupportPerkWidget_C*           TacticalPerkWidget;                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          AlwaysDisplayDescriptions;                         // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_SupportHeroSquadBonusesDetailWidget(int32 EntryPoint);
	void Construct();
	void HandlePostDifferentSquadSlotSetBP();
	void HandlePostDifferentItemToDetailSet();
	void UpdateVisibility();
	void UpdatePerkWidgets();
	void SetState(EFortSupportPerkWidgetState InState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SupportHeroSquadBonusesDetailWidget_C">();
	}
	static class USupportHeroSquadBonusesDetailWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USupportHeroSquadBonusesDetailWidget_C>();
	}
};
static_assert(alignof(USupportHeroSquadBonusesDetailWidget_C) == 0x000008, "Wrong alignment on USupportHeroSquadBonusesDetailWidget_C");
static_assert(sizeof(USupportHeroSquadBonusesDetailWidget_C) == 0x0002A0, "Wrong size on USupportHeroSquadBonusesDetailWidget_C");
static_assert(offsetof(USupportHeroSquadBonusesDetailWidget_C, UberGraphFrame) == 0x000280, "Member 'USupportHeroSquadBonusesDetailWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USupportHeroSquadBonusesDetailWidget_C, SupportPerkWidget) == 0x000288, "Member 'USupportHeroSquadBonusesDetailWidget_C::SupportPerkWidget' has a wrong offset!");
static_assert(offsetof(USupportHeroSquadBonusesDetailWidget_C, TacticalPerkWidget) == 0x000290, "Member 'USupportHeroSquadBonusesDetailWidget_C::TacticalPerkWidget' has a wrong offset!");
static_assert(offsetof(USupportHeroSquadBonusesDetailWidget_C, AlwaysDisplayDescriptions) == 0x000298, "Member 'USupportHeroSquadBonusesDetailWidget_C::AlwaysDisplayDescriptions' has a wrong offset!");

}

