#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SurvivorTraitsDetailWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function SurvivorTraitsDetailWidget.SurvivorTraitsDetailWidget_C.ExecuteUbergraph_SurvivorTraitsDetailWidget
// 0x00E8 (0x00E8 - 0x0000)
struct SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0010(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0028(0x0018)()
	bool                                          CallFunc_IsTemporaryItem_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortInventoryFilter                          CallFunc_GetFilterCategory_ReturnValue;            // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable3;                               // 0x0048(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable4;                               // 0x0068(0x0018)()
	class FText                                   K2Node_Select3_Default;                            // 0x0080(0x0018)()
	class UFortHero*                              K2Node_DynamicCast_AsFort_Hero;                    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWorker*                            K2Node_DynamicCast_AsFort_Worker;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   CallFunc_BreakGameplayTagContainer_GameplayTags;   // 0x00B8(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select4_Default;                            // 0x00D0(0x0018)()
};
static_assert(alignof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget) == 0x000008, "Wrong alignment on SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget");
static_assert(sizeof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget) == 0x0000E8, "Wrong size on SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, EntryPoint) == 0x000000, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, Temp_bool_Variable) == 0x000004, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, Temp_byte_Variable) == 0x000005, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, Temp_byte_Variable2) == 0x000006, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, Temp_bool_Variable2) == 0x000007, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, Temp_byte_Variable3) == 0x000008, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, Temp_byte_Variable4) == 0x000009, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, Temp_bool_Variable3) == 0x00000A, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, Temp_text_Variable) == 0x000010, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, Temp_text_Variable2) == 0x000028, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, CallFunc_IsTemporaryItem_ReturnValue) == 0x000040, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::CallFunc_IsTemporaryItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, Temp_bool_Variable4) == 0x000041, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, CallFunc_GetFilterCategory_ReturnValue) == 0x000042, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::CallFunc_GetFilterCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, Temp_text_Variable3) == 0x000048, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::Temp_text_Variable3' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000060, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000061, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, K2Node_Select_Default) == 0x000062, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, K2Node_Select2_Default) == 0x000063, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, Temp_text_Variable4) == 0x000068, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::Temp_text_Variable4' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, K2Node_Select3_Default) == 0x000080, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, K2Node_DynamicCast_AsFort_Hero) == 0x000098, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::K2Node_DynamicCast_AsFort_Hero' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, K2Node_DynamicCast_AsFort_Worker) == 0x0000A8, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::K2Node_DynamicCast_AsFort_Worker' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, K2Node_DynamicCast_bSuccess2) == 0x0000B0, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, CallFunc_Not_PreBool_ReturnValue2) == 0x0000B1, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, CallFunc_BooleanAND_ReturnValue) == 0x0000B2, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, CallFunc_BreakGameplayTagContainer_GameplayTags) == 0x0000B8, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::CallFunc_BreakGameplayTagContainer_GameplayTags' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, CallFunc_Array_Length_ReturnValue) == 0x0000C8, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x0000CC, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget, K2Node_Select4_Default) == 0x0000D0, "Member 'SurvivorTraitsDetailWidget_C_ExecuteUbergraph_SurvivorTraitsDetailWidget::K2Node_Select4_Default' has a wrong offset!");

}

