#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: T2_Research

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SkillTreepAGEColors_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass T2_Research.T2_Research_C
// 0x0260 (0x0570 - 0x0310)
class UT2_Research_C final : public UFortSkillTreePageWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(Transient, DuplicateTransient)
	class UCommonBorder*                          Background;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_0;                              // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_1;                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_2;                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_3;                              // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_4;                              // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_5;                              // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_6;                              // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_7;                              // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_8;                              // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_9;                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_10;                             // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_11;                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_12;                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_13;                             // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_14;                             // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_15;                             // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_16;                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_17;                             // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_18;                             // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_19;                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_20;                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_21;                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_22;                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_23;                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_24;                             // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_25;                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_26;                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_27;                             // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_28;                             // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_29;                             // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_30;                             // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_31;                             // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_32;                             // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_33;                             // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_34;                             // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_35;                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_36;                             // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_37;                             // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_38;                             // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_39;                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_40;                             // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_41;                             // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_42;                             // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_43;                             // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_44;                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_45;                             // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_46;                             // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_47;                             // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_49;                             // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_50;                             // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSkillTreePageColors                   PageColors;                                        // 0x04B0(0x00C0)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_T2_Research(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"T2_Research_C">();
	}
	static class UT2_Research_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UT2_Research_C>();
	}
};
static_assert(alignof(UT2_Research_C) == 0x000008, "Wrong alignment on UT2_Research_C");
static_assert(sizeof(UT2_Research_C) == 0x000570, "Wrong size on UT2_Research_C");
static_assert(offsetof(UT2_Research_C, UberGraphFrame) == 0x000310, "Member 'UT2_Research_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, Background) == 0x000318, "Member 'UT2_Research_C::Background' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_0) == 0x000320, "Member 'UT2_Research_C::DefaultSkillNode_C_0' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_1) == 0x000328, "Member 'UT2_Research_C::DefaultSkillNode_C_1' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_2) == 0x000330, "Member 'UT2_Research_C::DefaultSkillNode_C_2' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_3) == 0x000338, "Member 'UT2_Research_C::DefaultSkillNode_C_3' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_4) == 0x000340, "Member 'UT2_Research_C::DefaultSkillNode_C_4' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_5) == 0x000348, "Member 'UT2_Research_C::DefaultSkillNode_C_5' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_6) == 0x000350, "Member 'UT2_Research_C::DefaultSkillNode_C_6' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_7) == 0x000358, "Member 'UT2_Research_C::DefaultSkillNode_C_7' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_8) == 0x000360, "Member 'UT2_Research_C::DefaultSkillNode_C_8' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_9) == 0x000368, "Member 'UT2_Research_C::DefaultSkillNode_C_9' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_10) == 0x000370, "Member 'UT2_Research_C::DefaultSkillNode_C_10' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_11) == 0x000378, "Member 'UT2_Research_C::DefaultSkillNode_C_11' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_12) == 0x000380, "Member 'UT2_Research_C::DefaultSkillNode_C_12' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_13) == 0x000388, "Member 'UT2_Research_C::DefaultSkillNode_C_13' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_14) == 0x000390, "Member 'UT2_Research_C::DefaultSkillNode_C_14' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_15) == 0x000398, "Member 'UT2_Research_C::DefaultSkillNode_C_15' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_16) == 0x0003A0, "Member 'UT2_Research_C::DefaultSkillNode_C_16' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_17) == 0x0003A8, "Member 'UT2_Research_C::DefaultSkillNode_C_17' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_18) == 0x0003B0, "Member 'UT2_Research_C::DefaultSkillNode_C_18' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_19) == 0x0003B8, "Member 'UT2_Research_C::DefaultSkillNode_C_19' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_20) == 0x0003C0, "Member 'UT2_Research_C::DefaultSkillNode_C_20' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_21) == 0x0003C8, "Member 'UT2_Research_C::DefaultSkillNode_C_21' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_22) == 0x0003D0, "Member 'UT2_Research_C::DefaultSkillNode_C_22' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_23) == 0x0003D8, "Member 'UT2_Research_C::DefaultSkillNode_C_23' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_24) == 0x0003E0, "Member 'UT2_Research_C::DefaultSkillNode_C_24' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_25) == 0x0003E8, "Member 'UT2_Research_C::DefaultSkillNode_C_25' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_26) == 0x0003F0, "Member 'UT2_Research_C::DefaultSkillNode_C_26' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_27) == 0x0003F8, "Member 'UT2_Research_C::DefaultSkillNode_C_27' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_28) == 0x000400, "Member 'UT2_Research_C::DefaultSkillNode_C_28' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_29) == 0x000408, "Member 'UT2_Research_C::DefaultSkillNode_C_29' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_30) == 0x000410, "Member 'UT2_Research_C::DefaultSkillNode_C_30' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_31) == 0x000418, "Member 'UT2_Research_C::DefaultSkillNode_C_31' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_32) == 0x000420, "Member 'UT2_Research_C::DefaultSkillNode_C_32' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_33) == 0x000428, "Member 'UT2_Research_C::DefaultSkillNode_C_33' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_34) == 0x000430, "Member 'UT2_Research_C::DefaultSkillNode_C_34' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_35) == 0x000438, "Member 'UT2_Research_C::DefaultSkillNode_C_35' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_36) == 0x000440, "Member 'UT2_Research_C::DefaultSkillNode_C_36' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_37) == 0x000448, "Member 'UT2_Research_C::DefaultSkillNode_C_37' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_38) == 0x000450, "Member 'UT2_Research_C::DefaultSkillNode_C_38' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_39) == 0x000458, "Member 'UT2_Research_C::DefaultSkillNode_C_39' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_40) == 0x000460, "Member 'UT2_Research_C::DefaultSkillNode_C_40' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_41) == 0x000468, "Member 'UT2_Research_C::DefaultSkillNode_C_41' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_42) == 0x000470, "Member 'UT2_Research_C::DefaultSkillNode_C_42' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_43) == 0x000478, "Member 'UT2_Research_C::DefaultSkillNode_C_43' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_44) == 0x000480, "Member 'UT2_Research_C::DefaultSkillNode_C_44' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_45) == 0x000488, "Member 'UT2_Research_C::DefaultSkillNode_C_45' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_46) == 0x000490, "Member 'UT2_Research_C::DefaultSkillNode_C_46' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_47) == 0x000498, "Member 'UT2_Research_C::DefaultSkillNode_C_47' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_49) == 0x0004A0, "Member 'UT2_Research_C::DefaultSkillNode_C_49' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, DefaultSkillNode_C_50) == 0x0004A8, "Member 'UT2_Research_C::DefaultSkillNode_C_50' has a wrong offset!");
static_assert(offsetof(UT2_Research_C, PageColors) == 0x0004B0, "Member 'UT2_Research_C::PageColors' has a wrong offset!");

}

