#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: T4_Horde

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SkillTreepAGEColors_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass T4_Horde.T4_Horde_C
// 0x0190 (0x04A0 - 0x0310)
class UT4_Horde_C final : public UFortSkillTreePageWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(Transient, DuplicateTransient)
	class UCommonBorder*                          Background;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_0;                              // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_1;                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_2;                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_3;                              // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_4;                              // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_5;                              // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_6;                              // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_7;                              // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_8;                              // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_9;                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_10;                             // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_11;                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_12;                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_13;                             // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_14;                             // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_15;                             // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_16;                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_17;                             // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_18;                             // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_19;                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_20;                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_21;                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_22;                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDefaultSkillNode_C*                    DefaultSkillNode_C_23;                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSkillTreePageColors                   PageColors;                                        // 0x03E0(0x00C0)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_T4_Horde(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"T4_Horde_C">();
	}
	static class UT4_Horde_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UT4_Horde_C>();
	}
};
static_assert(alignof(UT4_Horde_C) == 0x000008, "Wrong alignment on UT4_Horde_C");
static_assert(sizeof(UT4_Horde_C) == 0x0004A0, "Wrong size on UT4_Horde_C");
static_assert(offsetof(UT4_Horde_C, UberGraphFrame) == 0x000310, "Member 'UT4_Horde_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UT4_Horde_C, Background) == 0x000318, "Member 'UT4_Horde_C::Background' has a wrong offset!");
static_assert(offsetof(UT4_Horde_C, DefaultSkillNode_C_0) == 0x000320, "Member 'UT4_Horde_C::DefaultSkillNode_C_0' has a wrong offset!");
static_assert(offsetof(UT4_Horde_C, DefaultSkillNode_C_1) == 0x000328, "Member 'UT4_Horde_C::DefaultSkillNode_C_1' has a wrong offset!");
static_assert(offsetof(UT4_Horde_C, DefaultSkillNode_C_2) == 0x000330, "Member 'UT4_Horde_C::DefaultSkillNode_C_2' has a wrong offset!");
static_assert(offsetof(UT4_Horde_C, DefaultSkillNode_C_3) == 0x000338, "Member 'UT4_Horde_C::DefaultSkillNode_C_3' has a wrong offset!");
static_assert(offsetof(UT4_Horde_C, DefaultSkillNode_C_4) == 0x000340, "Member 'UT4_Horde_C::DefaultSkillNode_C_4' has a wrong offset!");
static_assert(offsetof(UT4_Horde_C, DefaultSkillNode_C_5) == 0x000348, "Member 'UT4_Horde_C::DefaultSkillNode_C_5' has a wrong offset!");
static_assert(offsetof(UT4_Horde_C, DefaultSkillNode_C_6) == 0x000350, "Member 'UT4_Horde_C::DefaultSkillNode_C_6' has a wrong offset!");
static_assert(offsetof(UT4_Horde_C, DefaultSkillNode_C_7) == 0x000358, "Member 'UT4_Horde_C::DefaultSkillNode_C_7' has a wrong offset!");
static_assert(offsetof(UT4_Horde_C, DefaultSkillNode_C_8) == 0x000360, "Member 'UT4_Horde_C::DefaultSkillNode_C_8' has a wrong offset!");
static_assert(offsetof(UT4_Horde_C, DefaultSkillNode_C_9) == 0x000368, "Member 'UT4_Horde_C::DefaultSkillNode_C_9' has a wrong offset!");
static_assert(offsetof(UT4_Horde_C, DefaultSkillNode_C_10) == 0x000370, "Member 'UT4_Horde_C::DefaultSkillNode_C_10' has a wrong offset!");
static_assert(offsetof(UT4_Horde_C, DefaultSkillNode_C_11) == 0x000378, "Member 'UT4_Horde_C::DefaultSkillNode_C_11' has a wrong offset!");
static_assert(offsetof(UT4_Horde_C, DefaultSkillNode_C_12) == 0x000380, "Member 'UT4_Horde_C::DefaultSkillNode_C_12' has a wrong offset!");
static_assert(offsetof(UT4_Horde_C, DefaultSkillNode_C_13) == 0x000388, "Member 'UT4_Horde_C::DefaultSkillNode_C_13' has a wrong offset!");
static_assert(offsetof(UT4_Horde_C, DefaultSkillNode_C_14) == 0x000390, "Member 'UT4_Horde_C::DefaultSkillNode_C_14' has a wrong offset!");
static_assert(offsetof(UT4_Horde_C, DefaultSkillNode_C_15) == 0x000398, "Member 'UT4_Horde_C::DefaultSkillNode_C_15' has a wrong offset!");
static_assert(offsetof(UT4_Horde_C, DefaultSkillNode_C_16) == 0x0003A0, "Member 'UT4_Horde_C::DefaultSkillNode_C_16' has a wrong offset!");
static_assert(offsetof(UT4_Horde_C, DefaultSkillNode_C_17) == 0x0003A8, "Member 'UT4_Horde_C::DefaultSkillNode_C_17' has a wrong offset!");
static_assert(offsetof(UT4_Horde_C, DefaultSkillNode_C_18) == 0x0003B0, "Member 'UT4_Horde_C::DefaultSkillNode_C_18' has a wrong offset!");
static_assert(offsetof(UT4_Horde_C, DefaultSkillNode_C_19) == 0x0003B8, "Member 'UT4_Horde_C::DefaultSkillNode_C_19' has a wrong offset!");
static_assert(offsetof(UT4_Horde_C, DefaultSkillNode_C_20) == 0x0003C0, "Member 'UT4_Horde_C::DefaultSkillNode_C_20' has a wrong offset!");
static_assert(offsetof(UT4_Horde_C, DefaultSkillNode_C_21) == 0x0003C8, "Member 'UT4_Horde_C::DefaultSkillNode_C_21' has a wrong offset!");
static_assert(offsetof(UT4_Horde_C, DefaultSkillNode_C_22) == 0x0003D0, "Member 'UT4_Horde_C::DefaultSkillNode_C_22' has a wrong offset!");
static_assert(offsetof(UT4_Horde_C, DefaultSkillNode_C_23) == 0x0003D8, "Member 'UT4_Horde_C::DefaultSkillNode_C_23' has a wrong offset!");
static_assert(offsetof(UT4_Horde_C, PageColors) == 0x0003E0, "Member 'UT4_Horde_C::PageColors' has a wrong offset!");

}

