#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TabAccountLinkage

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function TabAccountLinkage.TabAccountLinkage_C.ExecuteUbergraph_TabAccountLinkage
// 0x0078 (0x0078 - 0x0000)
struct TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAccountLinkingUIURLButtonEnabled_ReturnValue; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_NewTooltipText;         // 0x0008(0x0018)()
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetWidgetAtIndex_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetAccountLinkingUIURL_ReturnValue;       // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ShowWebURL_ReturnValue;                   // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage) == 0x000008, "Wrong alignment on TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage");
static_assert(sizeof(TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage) == 0x000078, "Wrong size on TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage");
static_assert(offsetof(TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage, EntryPoint) == 0x000000, "Member 'TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage::EntryPoint' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage, CallFunc_IsAccountLinkingUIURLButtonEnabled_ReturnValue) == 0x000004, "Member 'TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage::CallFunc_IsAccountLinkingUIURLButtonEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage, K2Node_ComponentBoundEvent_NewTooltipText) == 0x000008, "Member 'TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage::K2Node_ComponentBoundEvent_NewTooltipText' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000020, "Member 'TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage, CallFunc_GetWidgetAtIndex_ReturnValue) == 0x000028, "Member 'TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage::CallFunc_GetWidgetAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage, K2Node_ComponentBoundEvent_Button) == 0x000030, "Member 'TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000038, "Member 'TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage, CallFunc_GetAccountLinkingUIURL_ReturnValue) == 0x000040, "Member 'TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage::CallFunc_GetAccountLinkingUIURL_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage, CallFunc_Len_ReturnValue) == 0x000050, "Member 'TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage, CallFunc_Greater_IntInt_ReturnValue) == 0x000054, "Member 'TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage, CallFunc_GetUINavigationManager_ReturnValue) == 0x000058, "Member 'TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage, CallFunc_GetContext_ReturnValue) == 0x000068, "Member 'TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage, CallFunc_BooleanAND_ReturnValue) == 0x000070, "Member 'TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage, CallFunc_ShowWebURL_ReturnValue) == 0x000071, "Member 'TabAccountLinkage_C_ExecuteUbergraph_TabAccountLinkage::CallFunc_ShowWebURL_ReturnValue' has a wrong offset!");

// Function TabAccountLinkage.TabAccountLinkage_C.BndEvt__URLButton_K2Node_ComponentBoundEvent_75_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TabAccountLinkage_C_BndEvt__URLButton_K2Node_ComponentBoundEvent_75_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAccountLinkage_C_BndEvt__URLButton_K2Node_ComponentBoundEvent_75_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on TabAccountLinkage_C_BndEvt__URLButton_K2Node_ComponentBoundEvent_75_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(TabAccountLinkage_C_BndEvt__URLButton_K2Node_ComponentBoundEvent_75_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on TabAccountLinkage_C_BndEvt__URLButton_K2Node_ComponentBoundEvent_75_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(TabAccountLinkage_C_BndEvt__URLButton_K2Node_ComponentBoundEvent_75_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'TabAccountLinkage_C_BndEvt__URLButton_K2Node_ComponentBoundEvent_75_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function TabAccountLinkage.TabAccountLinkage_C.BndEvt__FortTwitchLogin_K2Node_ComponentBoundEvent_0_OnRequestToolTipChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct TabAccountLinkage_C_BndEvt__FortTwitchLogin_K2Node_ComponentBoundEvent_0_OnRequestToolTipChange__DelegateSignature final
{
public:
	class FText                                   NewTooltipText;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(TabAccountLinkage_C_BndEvt__FortTwitchLogin_K2Node_ComponentBoundEvent_0_OnRequestToolTipChange__DelegateSignature) == 0x000008, "Wrong alignment on TabAccountLinkage_C_BndEvt__FortTwitchLogin_K2Node_ComponentBoundEvent_0_OnRequestToolTipChange__DelegateSignature");
static_assert(sizeof(TabAccountLinkage_C_BndEvt__FortTwitchLogin_K2Node_ComponentBoundEvent_0_OnRequestToolTipChange__DelegateSignature) == 0x000018, "Wrong size on TabAccountLinkage_C_BndEvt__FortTwitchLogin_K2Node_ComponentBoundEvent_0_OnRequestToolTipChange__DelegateSignature");
static_assert(offsetof(TabAccountLinkage_C_BndEvt__FortTwitchLogin_K2Node_ComponentBoundEvent_0_OnRequestToolTipChange__DelegateSignature, NewTooltipText) == 0x000000, "Member 'TabAccountLinkage_C_BndEvt__FortTwitchLogin_K2Node_ComponentBoundEvent_0_OnRequestToolTipChange__DelegateSignature::NewTooltipText' has a wrong offset!");

// Function TabAccountLinkage.TabAccountLinkage_C.Initialize Data
// 0x0010 (0x0010 - 0x0000)
struct TabAccountLinkage_C_Initialize_Data final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortAccountLinkingUIConfig                   CallFunc_GetAccountLinkingUIConfig_ReturnValue;    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabAccountLinkage_C_Initialize_Data) == 0x000008, "Wrong alignment on TabAccountLinkage_C_Initialize_Data");
static_assert(sizeof(TabAccountLinkage_C_Initialize_Data) == 0x000010, "Wrong size on TabAccountLinkage_C_Initialize_Data");
static_assert(offsetof(TabAccountLinkage_C_Initialize_Data, Temp_bool_Variable) == 0x000000, "Member 'TabAccountLinkage_C_Initialize_Data::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_Initialize_Data, CallFunc_GetAccountLinkingUIConfig_ReturnValue) == 0x000001, "Member 'TabAccountLinkage_C_Initialize_Data::CallFunc_GetAccountLinkingUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_Initialize_Data, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'TabAccountLinkage_C_Initialize_Data::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_Initialize_Data, K2Node_Select_Default) == 0x000008, "Member 'TabAccountLinkage_C_Initialize_Data::K2Node_Select_Default' has a wrong offset!");

// Function TabAccountLinkage.TabAccountLinkage_C.Fire Enter Live Stream Analytic
// 0x0050 (0x0050 - 0x0000)
struct TabAccountLinkage_C_Fire_Enter_Live_Stream_Analytic final
{
public:
	struct FFortAnalyticsEventAttribute           CallFunc_Build_Player_Id_Analytic_Attribute_ReturnValue; // 0x0000(0x0020)()
	struct FFortAnalyticsEventAttribute           CallFunc_Build_Player_Name_Analytic_Attribute_ReturnValue; // 0x0020(0x0020)()
	TArray<struct FFortAnalyticsEventAttribute>   K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(TabAccountLinkage_C_Fire_Enter_Live_Stream_Analytic) == 0x000008, "Wrong alignment on TabAccountLinkage_C_Fire_Enter_Live_Stream_Analytic");
static_assert(sizeof(TabAccountLinkage_C_Fire_Enter_Live_Stream_Analytic) == 0x000050, "Wrong size on TabAccountLinkage_C_Fire_Enter_Live_Stream_Analytic");
static_assert(offsetof(TabAccountLinkage_C_Fire_Enter_Live_Stream_Analytic, CallFunc_Build_Player_Id_Analytic_Attribute_ReturnValue) == 0x000000, "Member 'TabAccountLinkage_C_Fire_Enter_Live_Stream_Analytic::CallFunc_Build_Player_Id_Analytic_Attribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_Fire_Enter_Live_Stream_Analytic, CallFunc_Build_Player_Name_Analytic_Attribute_ReturnValue) == 0x000020, "Member 'TabAccountLinkage_C_Fire_Enter_Live_Stream_Analytic::CallFunc_Build_Player_Name_Analytic_Attribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_Fire_Enter_Live_Stream_Analytic, K2Node_MakeArray_Array) == 0x000040, "Member 'TabAccountLinkage_C_Fire_Enter_Live_Stream_Analytic::K2Node_MakeArray_Array' has a wrong offset!");

// Function TabAccountLinkage.TabAccountLinkage_C.Build Player Name Analytic Attribute
// 0x0098 (0x0098 - 0x0000)
struct TabAccountLinkage_C_Build_Player_Name_Analytic_Attribute final
{
public:
	struct FFortAnalyticsEventAttribute           ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetGameAccountId_ReturnValue;             // 0x0038(0x0028)(HasGetValueTypeHash)
	class UFortRegisteredPlayerInfo*              CallFunc_GetPlayerInfoFromUniqueID_ReturnValue;    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFortAnalyticsEventAttribute           CallFunc_ConstructAnalyticsAttribute_ReturnValue;  // 0x0078(0x0020)()
};
static_assert(alignof(TabAccountLinkage_C_Build_Player_Name_Analytic_Attribute) == 0x000008, "Wrong alignment on TabAccountLinkage_C_Build_Player_Name_Analytic_Attribute");
static_assert(sizeof(TabAccountLinkage_C_Build_Player_Name_Analytic_Attribute) == 0x000098, "Wrong size on TabAccountLinkage_C_Build_Player_Name_Analytic_Attribute");
static_assert(offsetof(TabAccountLinkage_C_Build_Player_Name_Analytic_Attribute, ReturnValue) == 0x000000, "Member 'TabAccountLinkage_C_Build_Player_Name_Analytic_Attribute::ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_Build_Player_Name_Analytic_Attribute, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'TabAccountLinkage_C_Build_Player_Name_Analytic_Attribute::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_Build_Player_Name_Analytic_Attribute, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000028, "Member 'TabAccountLinkage_C_Build_Player_Name_Analytic_Attribute::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_Build_Player_Name_Analytic_Attribute, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'TabAccountLinkage_C_Build_Player_Name_Analytic_Attribute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_Build_Player_Name_Analytic_Attribute, CallFunc_GetGameAccountId_ReturnValue) == 0x000038, "Member 'TabAccountLinkage_C_Build_Player_Name_Analytic_Attribute::CallFunc_GetGameAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_Build_Player_Name_Analytic_Attribute, CallFunc_GetPlayerInfoFromUniqueID_ReturnValue) == 0x000060, "Member 'TabAccountLinkage_C_Build_Player_Name_Analytic_Attribute::CallFunc_GetPlayerInfoFromUniqueID_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_Build_Player_Name_Analytic_Attribute, CallFunc_GetPlayerName_ReturnValue) == 0x000068, "Member 'TabAccountLinkage_C_Build_Player_Name_Analytic_Attribute::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_Build_Player_Name_Analytic_Attribute, CallFunc_ConstructAnalyticsAttribute_ReturnValue) == 0x000078, "Member 'TabAccountLinkage_C_Build_Player_Name_Analytic_Attribute::CallFunc_ConstructAnalyticsAttribute_ReturnValue' has a wrong offset!");

// Function TabAccountLinkage.TabAccountLinkage_C.Build Player Id Analytic Attribute
// 0x0090 (0x0090 - 0x0000)
struct TabAccountLinkage_C_Build_Player_Id_Analytic_Attribute final
{
public:
	struct FFortAnalyticsEventAttribute           ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetGameAccountId_ReturnValue;             // 0x0038(0x0028)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetDebugStringForUniqueId_ReturnValue;    // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFortAnalyticsEventAttribute           CallFunc_ConstructAnalyticsAttribute_ReturnValue;  // 0x0070(0x0020)()
};
static_assert(alignof(TabAccountLinkage_C_Build_Player_Id_Analytic_Attribute) == 0x000008, "Wrong alignment on TabAccountLinkage_C_Build_Player_Id_Analytic_Attribute");
static_assert(sizeof(TabAccountLinkage_C_Build_Player_Id_Analytic_Attribute) == 0x000090, "Wrong size on TabAccountLinkage_C_Build_Player_Id_Analytic_Attribute");
static_assert(offsetof(TabAccountLinkage_C_Build_Player_Id_Analytic_Attribute, ReturnValue) == 0x000000, "Member 'TabAccountLinkage_C_Build_Player_Id_Analytic_Attribute::ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_Build_Player_Id_Analytic_Attribute, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'TabAccountLinkage_C_Build_Player_Id_Analytic_Attribute::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_Build_Player_Id_Analytic_Attribute, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000028, "Member 'TabAccountLinkage_C_Build_Player_Id_Analytic_Attribute::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_Build_Player_Id_Analytic_Attribute, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'TabAccountLinkage_C_Build_Player_Id_Analytic_Attribute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_Build_Player_Id_Analytic_Attribute, CallFunc_GetGameAccountId_ReturnValue) == 0x000038, "Member 'TabAccountLinkage_C_Build_Player_Id_Analytic_Attribute::CallFunc_GetGameAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_Build_Player_Id_Analytic_Attribute, CallFunc_GetDebugStringForUniqueId_ReturnValue) == 0x000060, "Member 'TabAccountLinkage_C_Build_Player_Id_Analytic_Attribute::CallFunc_GetDebugStringForUniqueId_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_Build_Player_Id_Analytic_Attribute, CallFunc_ConstructAnalyticsAttribute_ReturnValue) == 0x000070, "Member 'TabAccountLinkage_C_Build_Player_Id_Analytic_Attribute::CallFunc_ConstructAnalyticsAttribute_ReturnValue' has a wrong offset!");

// Function TabAccountLinkage.TabAccountLinkage_C.InitializeWebsiteConfiguration
// 0x0088 (0x0088 - 0x0000)
struct TabAccountLinkage_C_InitializeWebsiteConfiguration final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0020(0x0018)()
	bool                                          CallFunc_IsAccountLinkingUIURLButtonEnabled_ReturnValue; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetAccountLinkingUIURL_ReturnValue;       // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortAccountLinkingUIConfig                   CallFunc_GetAccountLinkingUIConfig_ReturnValue;    // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select2_Default;                            // 0x0070(0x0018)()
};
static_assert(alignof(TabAccountLinkage_C_InitializeWebsiteConfiguration) == 0x000008, "Wrong alignment on TabAccountLinkage_C_InitializeWebsiteConfiguration");
static_assert(sizeof(TabAccountLinkage_C_InitializeWebsiteConfiguration) == 0x000088, "Wrong size on TabAccountLinkage_C_InitializeWebsiteConfiguration");
static_assert(offsetof(TabAccountLinkage_C_InitializeWebsiteConfiguration, Temp_bool_Variable) == 0x000000, "Member 'TabAccountLinkage_C_InitializeWebsiteConfiguration::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_InitializeWebsiteConfiguration, Temp_byte_Variable) == 0x000001, "Member 'TabAccountLinkage_C_InitializeWebsiteConfiguration::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_InitializeWebsiteConfiguration, Temp_byte_Variable2) == 0x000002, "Member 'TabAccountLinkage_C_InitializeWebsiteConfiguration::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_InitializeWebsiteConfiguration, Temp_bool_Variable2) == 0x000003, "Member 'TabAccountLinkage_C_InitializeWebsiteConfiguration::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_InitializeWebsiteConfiguration, Temp_text_Variable) == 0x000008, "Member 'TabAccountLinkage_C_InitializeWebsiteConfiguration::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_InitializeWebsiteConfiguration, Temp_text_Variable2) == 0x000020, "Member 'TabAccountLinkage_C_InitializeWebsiteConfiguration::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_InitializeWebsiteConfiguration, CallFunc_IsAccountLinkingUIURLButtonEnabled_ReturnValue) == 0x000038, "Member 'TabAccountLinkage_C_InitializeWebsiteConfiguration::CallFunc_IsAccountLinkingUIURLButtonEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_InitializeWebsiteConfiguration, CallFunc_GetAccountLinkingUIURL_ReturnValue) == 0x000040, "Member 'TabAccountLinkage_C_InitializeWebsiteConfiguration::CallFunc_GetAccountLinkingUIURL_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_InitializeWebsiteConfiguration, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'TabAccountLinkage_C_InitializeWebsiteConfiguration::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_InitializeWebsiteConfiguration, CallFunc_Len_ReturnValue) == 0x000068, "Member 'TabAccountLinkage_C_InitializeWebsiteConfiguration::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_InitializeWebsiteConfiguration, CallFunc_Greater_IntInt_ReturnValue) == 0x00006C, "Member 'TabAccountLinkage_C_InitializeWebsiteConfiguration::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_InitializeWebsiteConfiguration, CallFunc_GetAccountLinkingUIConfig_ReturnValue) == 0x00006D, "Member 'TabAccountLinkage_C_InitializeWebsiteConfiguration::CallFunc_GetAccountLinkingUIConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_InitializeWebsiteConfiguration, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00006E, "Member 'TabAccountLinkage_C_InitializeWebsiteConfiguration::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_InitializeWebsiteConfiguration, K2Node_Select_Default) == 0x00006F, "Member 'TabAccountLinkage_C_InitializeWebsiteConfiguration::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(TabAccountLinkage_C_InitializeWebsiteConfiguration, K2Node_Select2_Default) == 0x000070, "Member 'TabAccountLinkage_C_InitializeWebsiteConfiguration::K2Node_Select2_Default' has a wrong offset!");

}

