#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TabGameOptions

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function TabGameOptions.TabGameOptions_C.ExecuteUbergraph_TabGameOptions
// 0x0238 (0x0238 - 0x0000)
struct TabGameOptions_C_ExecuteUbergraph_TabGameOptions final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetWidgetAtIndex_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumWidgets_ReturnValue;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTabGameOptions_C*                      K2Node_DynamicCast_AsTab_Game_Options;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTabGameOptions_C*                      K2Node_DynamicCast_AsTab_Game_Options2;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_ComponentBoundEvent_ActiveWidget;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ActiveWidgetIndex;      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTabGameOptions_C*                      K2Node_DynamicCast_AsTab_Game_Options3;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTabButtonLabelInfo                K2Node_MakeStruct_FortTabButtonLabelInfo;          // 0x0060(0x0090)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTabGameOptionsMain_C*                  CallFunc_Create_ReturnValue;                       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RegisterFortTab_ReturnValue;              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortTabButtonLabelInfo                K2Node_MakeStruct_FortTabButtonLabelInfo2;         // 0x0118(0x0090)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue2;         // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTabGameOptionsHud_C*                   CallFunc_Create_ReturnValue2;                      // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RegisterFortTab_ReturnValue2;             // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue2;                    // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01C8(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue3;         // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTabGameOptionsMain_C*                  CallFunc_Create_ReturnValue3;                      // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue3;                    // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_TabId;                  // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_TabButton;              // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIconTabButton_C*                       K2Node_DynamicCast_AsIcon_Tab_Button;              // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue2;                  // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTabGameOptions_C*                      K2Node_DynamicCast_AsTab_Game_Options4;            // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue2;            // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions) == 0x000008, "Wrong alignment on TabGameOptions_C_ExecuteUbergraph_TabGameOptions");
static_assert(sizeof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions) == 0x000238, "Wrong size on TabGameOptions_C_ExecuteUbergraph_TabGameOptions");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, EntryPoint) == 0x000000, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::EntryPoint' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000004, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, CallFunc_GetWidgetAtIndex_ReturnValue) == 0x000008, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::CallFunc_GetWidgetAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, CallFunc_GetNumWidgets_ReturnValue) == 0x000010, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::CallFunc_GetNumWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, K2Node_DynamicCast_AsTab_Game_Options) == 0x000018, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::K2Node_DynamicCast_AsTab_Game_Options' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, Temp_int_Variable) == 0x000024, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, CallFunc_GetChildAt_ReturnValue) == 0x000028, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, K2Node_DynamicCast_AsTab_Game_Options2) == 0x000030, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::K2Node_DynamicCast_AsTab_Game_Options2' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, K2Node_DynamicCast_bSuccess2) == 0x000038, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000039, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, K2Node_ComponentBoundEvent_ActiveWidget) == 0x000040, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::K2Node_ComponentBoundEvent_ActiveWidget' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, K2Node_ComponentBoundEvent_ActiveWidgetIndex) == 0x000048, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::K2Node_ComponentBoundEvent_ActiveWidgetIndex' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, K2Node_DynamicCast_AsTab_Game_Options3) == 0x000050, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::K2Node_DynamicCast_AsTab_Game_Options3' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, K2Node_DynamicCast_bSuccess3) == 0x000058, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, K2Node_MakeStruct_FortTabButtonLabelInfo) == 0x000060, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::K2Node_MakeStruct_FortTabButtonLabelInfo' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, CallFunc_GetPlayerController_ReturnValue) == 0x0000F0, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, CallFunc_Create_ReturnValue) == 0x0000F8, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, CallFunc_RegisterFortTab_ReturnValue) == 0x000100, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::CallFunc_RegisterFortTab_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, CallFunc_AddChild_ReturnValue) == 0x000108, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, Temp_int_Variable2) == 0x000110, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, CallFunc_Add_IntInt_ReturnValue2) == 0x000114, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, K2Node_MakeStruct_FortTabButtonLabelInfo2) == 0x000118, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::K2Node_MakeStruct_FortTabButtonLabelInfo2' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, CallFunc_GetPlayerController_ReturnValue2) == 0x0001A8, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::CallFunc_GetPlayerController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, CallFunc_Create_ReturnValue2) == 0x0001B0, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::CallFunc_Create_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, CallFunc_RegisterFortTab_ReturnValue2) == 0x0001B8, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::CallFunc_RegisterFortTab_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, CallFunc_AddChild_ReturnValue2) == 0x0001C0, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::CallFunc_AddChild_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, K2Node_CreateDelegate_OutputDelegate) == 0x0001C8, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, CallFunc_GetPlayerController_ReturnValue3) == 0x0001D8, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::CallFunc_GetPlayerController_ReturnValue3' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, CallFunc_Create_ReturnValue3) == 0x0001E0, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::CallFunc_Create_ReturnValue3' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, CallFunc_AddChild_ReturnValue3) == 0x0001E8, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::CallFunc_AddChild_ReturnValue3' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, K2Node_ComponentBoundEvent_TabId) == 0x0001F0, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::K2Node_ComponentBoundEvent_TabId' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, K2Node_ComponentBoundEvent_TabButton) == 0x0001F8, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::K2Node_ComponentBoundEvent_TabButton' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, K2Node_DynamicCast_AsIcon_Tab_Button) == 0x000200, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::K2Node_DynamicCast_AsIcon_Tab_Button' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, K2Node_DynamicCast_bSuccess4) == 0x000208, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, CallFunc_GetChildAt_ReturnValue2) == 0x000210, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::CallFunc_GetChildAt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, K2Node_DynamicCast_AsTab_Game_Options4) == 0x000218, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::K2Node_DynamicCast_AsTab_Game_Options4' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, K2Node_DynamicCast_bSuccess5) == 0x000220, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, CallFunc_GetChildrenCount_ReturnValue) == 0x000224, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, CallFunc_GetContext_ReturnValue) == 0x000228, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, CallFunc_LessEqual_IntInt_ReturnValue2) == 0x000230, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::CallFunc_LessEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_ExecuteUbergraph_TabGameOptions, CallFunc_IsInZone_ReturnValue) == 0x000231, "Member 'TabGameOptions_C_ExecuteUbergraph_TabGameOptions::CallFunc_IsInZone_ReturnValue' has a wrong offset!");

// Function TabGameOptions.TabGameOptions_C.BndEvt__CommonWidgetSwitcher_0_K2Node_ComponentBoundEvent_1004_OnActiveWidgetChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct TabGameOptions_C_BndEvt__CommonWidgetSwitcher_0_K2Node_ComponentBoundEvent_1004_OnActiveWidgetChanged__DelegateSignature final
{
public:
	class UWidget*                                ActiveWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ActiveWidgetIndex;                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptions_C_BndEvt__CommonWidgetSwitcher_0_K2Node_ComponentBoundEvent_1004_OnActiveWidgetChanged__DelegateSignature) == 0x000008, "Wrong alignment on TabGameOptions_C_BndEvt__CommonWidgetSwitcher_0_K2Node_ComponentBoundEvent_1004_OnActiveWidgetChanged__DelegateSignature");
static_assert(sizeof(TabGameOptions_C_BndEvt__CommonWidgetSwitcher_0_K2Node_ComponentBoundEvent_1004_OnActiveWidgetChanged__DelegateSignature) == 0x000010, "Wrong size on TabGameOptions_C_BndEvt__CommonWidgetSwitcher_0_K2Node_ComponentBoundEvent_1004_OnActiveWidgetChanged__DelegateSignature");
static_assert(offsetof(TabGameOptions_C_BndEvt__CommonWidgetSwitcher_0_K2Node_ComponentBoundEvent_1004_OnActiveWidgetChanged__DelegateSignature, ActiveWidget) == 0x000000, "Member 'TabGameOptions_C_BndEvt__CommonWidgetSwitcher_0_K2Node_ComponentBoundEvent_1004_OnActiveWidgetChanged__DelegateSignature::ActiveWidget' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_BndEvt__CommonWidgetSwitcher_0_K2Node_ComponentBoundEvent_1004_OnActiveWidgetChanged__DelegateSignature, ActiveWidgetIndex) == 0x000008, "Member 'TabGameOptions_C_BndEvt__CommonWidgetSwitcher_0_K2Node_ComponentBoundEvent_1004_OnActiveWidgetChanged__DelegateSignature::ActiveWidgetIndex' has a wrong offset!");

// Function TabGameOptions.TabGameOptions_C.BndEvt__GameTabs_K2Node_ComponentBoundEvent_21_OnTabButtonCreated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct TabGameOptions_C_BndEvt__GameTabs_K2Node_ComponentBoundEvent_21_OnTabButtonCreated__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptions_C_BndEvt__GameTabs_K2Node_ComponentBoundEvent_21_OnTabButtonCreated__DelegateSignature) == 0x000008, "Wrong alignment on TabGameOptions_C_BndEvt__GameTabs_K2Node_ComponentBoundEvent_21_OnTabButtonCreated__DelegateSignature");
static_assert(sizeof(TabGameOptions_C_BndEvt__GameTabs_K2Node_ComponentBoundEvent_21_OnTabButtonCreated__DelegateSignature) == 0x000010, "Wrong size on TabGameOptions_C_BndEvt__GameTabs_K2Node_ComponentBoundEvent_21_OnTabButtonCreated__DelegateSignature");
static_assert(offsetof(TabGameOptions_C_BndEvt__GameTabs_K2Node_ComponentBoundEvent_21_OnTabButtonCreated__DelegateSignature, TabId) == 0x000000, "Member 'TabGameOptions_C_BndEvt__GameTabs_K2Node_ComponentBoundEvent_21_OnTabButtonCreated__DelegateSignature::TabId' has a wrong offset!");
static_assert(offsetof(TabGameOptions_C_BndEvt__GameTabs_K2Node_ComponentBoundEvent_21_OnTabButtonCreated__DelegateSignature, TabButton) == 0x000008, "Member 'TabGameOptions_C_BndEvt__GameTabs_K2Node_ComponentBoundEvent_21_OnTabButtonCreated__DelegateSignature::TabButton' has a wrong offset!");

}

