#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TeamScoreDetailsContent

#include "Basic.hpp"


namespace SDK::Params
{

// Function TeamScoreDetailsContent.TeamScoreDetailsContent_C.ExecuteUbergraph_TeamScoreDetailsContent
// 0x0040 (0x0040 - 0x0000)
struct TeamScoreDetailsContent_C_ExecuteUbergraph_TeamScoreDetailsContent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIScoreReport*                     CallFunc_GetScoreReport_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerCount_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TeamScoreDetailsContent_C_ExecuteUbergraph_TeamScoreDetailsContent) == 0x000008, "Wrong alignment on TeamScoreDetailsContent_C_ExecuteUbergraph_TeamScoreDetailsContent");
static_assert(sizeof(TeamScoreDetailsContent_C_ExecuteUbergraph_TeamScoreDetailsContent) == 0x000040, "Wrong size on TeamScoreDetailsContent_C_ExecuteUbergraph_TeamScoreDetailsContent");
static_assert(offsetof(TeamScoreDetailsContent_C_ExecuteUbergraph_TeamScoreDetailsContent, EntryPoint) == 0x000000, "Member 'TeamScoreDetailsContent_C_ExecuteUbergraph_TeamScoreDetailsContent::EntryPoint' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_ExecuteUbergraph_TeamScoreDetailsContent, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'TeamScoreDetailsContent_C_ExecuteUbergraph_TeamScoreDetailsContent::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_ExecuteUbergraph_TeamScoreDetailsContent, Temp_int_Variable) == 0x000010, "Member 'TeamScoreDetailsContent_C_ExecuteUbergraph_TeamScoreDetailsContent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_ExecuteUbergraph_TeamScoreDetailsContent, CallFunc_GetScoreReport_ReturnValue) == 0x000018, "Member 'TeamScoreDetailsContent_C_ExecuteUbergraph_TeamScoreDetailsContent::CallFunc_GetScoreReport_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_ExecuteUbergraph_TeamScoreDetailsContent, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'TeamScoreDetailsContent_C_ExecuteUbergraph_TeamScoreDetailsContent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_ExecuteUbergraph_TeamScoreDetailsContent, CallFunc_GetPlayerCount_ReturnValue) == 0x000024, "Member 'TeamScoreDetailsContent_C_ExecuteUbergraph_TeamScoreDetailsContent::CallFunc_GetPlayerCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_ExecuteUbergraph_TeamScoreDetailsContent, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'TeamScoreDetailsContent_C_ExecuteUbergraph_TeamScoreDetailsContent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_ExecuteUbergraph_TeamScoreDetailsContent, CallFunc_Subtract_IntInt_ReturnValue) == 0x000038, "Member 'TeamScoreDetailsContent_C_ExecuteUbergraph_TeamScoreDetailsContent::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_ExecuteUbergraph_TeamScoreDetailsContent, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00003C, "Member 'TeamScoreDetailsContent_C_ExecuteUbergraph_TeamScoreDetailsContent::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function TeamScoreDetailsContent.TeamScoreDetailsContent_C.SetRowData
// 0x0070 (0x0070 - 0x0000)
struct TeamScoreDetailsContent_C_SetRowData final
{
public:
	int32                                         RowIdx;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScoreDetailsRow_C*                     K2Node_DynamicCast_AsScore_Details_Row;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayerScore_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerScore_ReturnValue2;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerScore_ReturnValue3;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerScore_ReturnValue4;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetPlayerName_ReturnValue;                // 0x0040(0x0018)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScoreDetailsRow_C*                     CallFunc_Create_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TeamScoreDetailsContent_C_SetRowData) == 0x000008, "Wrong alignment on TeamScoreDetailsContent_C_SetRowData");
static_assert(sizeof(TeamScoreDetailsContent_C_SetRowData) == 0x000070, "Wrong size on TeamScoreDetailsContent_C_SetRowData");
static_assert(offsetof(TeamScoreDetailsContent_C_SetRowData, RowIdx) == 0x000000, "Member 'TeamScoreDetailsContent_C_SetRowData::RowIdx' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_SetRowData, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'TeamScoreDetailsContent_C_SetRowData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_SetRowData, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'TeamScoreDetailsContent_C_SetRowData::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_SetRowData, CallFunc_GetChildrenCount_ReturnValue) == 0x000010, "Member 'TeamScoreDetailsContent_C_SetRowData::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_SetRowData, K2Node_DynamicCast_AsScore_Details_Row) == 0x000018, "Member 'TeamScoreDetailsContent_C_SetRowData::K2Node_DynamicCast_AsScore_Details_Row' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_SetRowData, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'TeamScoreDetailsContent_C_SetRowData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_SetRowData, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'TeamScoreDetailsContent_C_SetRowData::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_SetRowData, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000028, "Member 'TeamScoreDetailsContent_C_SetRowData::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_SetRowData, CallFunc_GetPlayerScore_ReturnValue) == 0x00002C, "Member 'TeamScoreDetailsContent_C_SetRowData::CallFunc_GetPlayerScore_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_SetRowData, CallFunc_GetPlayerScore_ReturnValue2) == 0x000030, "Member 'TeamScoreDetailsContent_C_SetRowData::CallFunc_GetPlayerScore_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_SetRowData, CallFunc_GetPlayerScore_ReturnValue3) == 0x000034, "Member 'TeamScoreDetailsContent_C_SetRowData::CallFunc_GetPlayerScore_ReturnValue3' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_SetRowData, CallFunc_GetPlayerScore_ReturnValue4) == 0x000038, "Member 'TeamScoreDetailsContent_C_SetRowData::CallFunc_GetPlayerScore_ReturnValue4' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_SetRowData, CallFunc_GetPlayerName_ReturnValue) == 0x000040, "Member 'TeamScoreDetailsContent_C_SetRowData::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_SetRowData, CallFunc_GetOwningPlayer_ReturnValue) == 0x000058, "Member 'TeamScoreDetailsContent_C_SetRowData::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_SetRowData, CallFunc_Create_ReturnValue) == 0x000060, "Member 'TeamScoreDetailsContent_C_SetRowData::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_SetRowData, CallFunc_AddChild_ReturnValue) == 0x000068, "Member 'TeamScoreDetailsContent_C_SetRowData::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function TeamScoreDetailsContent.TeamScoreDetailsContent_C.TrimUnusedRows
// 0x001C (0x001C - 0x0000)
struct TeamScoreDetailsContent_C_TrimUnusedRows final
{
public:
	int32                                         CallFunc_GetPlayerCount_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChildAt_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue2;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TeamScoreDetailsContent_C_TrimUnusedRows) == 0x000004, "Wrong alignment on TeamScoreDetailsContent_C_TrimUnusedRows");
static_assert(sizeof(TeamScoreDetailsContent_C_TrimUnusedRows) == 0x00001C, "Wrong size on TeamScoreDetailsContent_C_TrimUnusedRows");
static_assert(offsetof(TeamScoreDetailsContent_C_TrimUnusedRows, CallFunc_GetPlayerCount_ReturnValue) == 0x000000, "Member 'TeamScoreDetailsContent_C_TrimUnusedRows::CallFunc_GetPlayerCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_TrimUnusedRows, CallFunc_GetChildrenCount_ReturnValue) == 0x000004, "Member 'TeamScoreDetailsContent_C_TrimUnusedRows::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_TrimUnusedRows, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'TeamScoreDetailsContent_C_TrimUnusedRows::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_TrimUnusedRows, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'TeamScoreDetailsContent_C_TrimUnusedRows::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_TrimUnusedRows, CallFunc_RemoveChildAt_ReturnValue) == 0x000010, "Member 'TeamScoreDetailsContent_C_TrimUnusedRows::CallFunc_RemoveChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_TrimUnusedRows, CallFunc_GetChildrenCount_ReturnValue2) == 0x000014, "Member 'TeamScoreDetailsContent_C_TrimUnusedRows::CallFunc_GetChildrenCount_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TeamScoreDetailsContent_C_TrimUnusedRows, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'TeamScoreDetailsContent_C_TrimUnusedRows::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

