#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ThreatPostProcessManagerAndParticleBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ThreatPostProcessManagerAndParticleBlueprint.ThreatPostProcessManagerAndParticleBlueprint_C
// 0x01C0 (0x0530 - 0x0370)
class AThreatPostProcessManagerAndParticleBlueprint_C final : public AFortThreatParticleActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UAudioComponent*                        EnterTheStormSound;                                // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Sprite1;                                           // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Ramp_Up_down_values_on_death_NewTrack_0_1CA080D642E9F1C3CB297DBE1BD2C9A4; // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Ramp_Up_down_values_on_death__Direction_1CA080D642E9F1C3CB297DBE1BD2C9A4; // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Ramp_Up_down_values_on_death;                      // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Min_Cloud_Distance_from_player;                    // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Localized_Particle_System_MID;                     // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   NewEventDispatcher;                                // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   NewEventDispatcher0;                               // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FVector>                        Array_of_Cloud_Positions;                          // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                 SkyParticleCloudDistances;                         // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<int32>                                 CloudDistanceToPlayerLookUpArray;                  // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FVector                                Target_Cloud_Position;                             // 0x03F8(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RecalculateTimer;                                  // 0x0404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Alive;                                          // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsAliveJustChanged;                                // 0x0409(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsAlivePrevious;                                   // 0x040A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40B[0x1];                                      // 0x040B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Number_Of_ticks_before_checking_for_the_nearest_cloud_again_Minus_when_alive; // 0x040C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CurrentCloudMesh;                                  // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x3];                                      // 0x0411(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Number_Of_ticks_before_checking_for_the_nearest_cloud_again_Minus_when_dead; // 0x0414(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APostProcessVolume*                     Materialpost;                                      // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Post_process_volume_falloff__around_the_threat_volume; // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowRainEffect;                                    // 0x0424(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_425[0x3];                                      // 0x0425(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         FourClosestClouds;                                 // 0x0428(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
	int32                                         Number_Of_Volumes_to_check;                        // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaTime;                                         // 0x043C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PostProcessTargetWeight;                           // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Current_Post_Process_Weight;                       // 0x0444(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Post_Process_Fade_in_speed;                        // 0x0448(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SoundIsActive;                                     // 0x044C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SoundWasPreviouslyActive;                          // 0x044D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44E[0x2];                                      // 0x044E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             PlayerTransform;                                   // 0x0450(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Is_On;                                             // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APostProcessVolume*                     MaterialEffectsPostProcess;                        // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           ThreatFogPostProcessColor_Morning;                 // 0x0490(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ThreatFogPostProcessColor_Day;                     // 0x04A0(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ThreatFogPostProcessColor_Evening;                 // 0x04B0(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ThreatFogPostProcessColor_Night;                   // 0x04C0(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBox>                           Array_of_Cloud_Volumes;                            // 0x04D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         ClosestCloudIndex;                                 // 0x04E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ClosestCloudDistance;                              // 0x04E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PostProcessWeightModulation;                       // 0x04E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Ramp_Up_And_Down_Anim_Values;                      // 0x04EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowRainOnCameraLens;                              // 0x04F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F1[0x7];                                      // 0x04F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEmitterCameraLensEffectBase*           Rain_Camera_Lens_Effect;                           // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               LocalizedParticleSystem;                           // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsWorldReady;                                      // 0x0508(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_509[0x3];                                      // 0x0509(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Rain_Trace_Timer;                                  // 0x050C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                RainTraceOffset;                                   // 0x0510(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RainMultiplierCurrent;                             // 0x051C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rain_Spawn_Rate_Exponent;                          // 0x0520(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          TracePrevious;                                     // 0x0524(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsAthenaWorld;                                     // 0x0525(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void NewEventDispatcher__DelegateSignature();
	void NewEventDispatcher0__DelegateSignature();
	void ExecuteUbergraph_ThreatPostProcessManagerAndParticleBlueprint(int32 EntryPoint);
	void ForceUpdateLensEffect();
	void StartTraceTimer();
	void VFX_RainTracePeriodic();
	void OnWorldReady();
	void OnThreatCloudsChanged(const TArray<struct FThreatLocationInfo>& ThreatLocationInfo);
	void ReceiveTick(float DeltaSeconds);
	void Ramp_Up_down_values_on_death__UpdateFunc();
	void Ramp_Up_down_values_on_death__FinishedFunc();
	void UserConstructionScript();
	void CalculatePlayerPositionNearBox(const struct FVector& BoxMin, const struct FVector& BoxMax, float* VolumePlayerCoveragePercentage);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ThreatPostProcessManagerAndParticleBlueprint_C">();
	}
	static class AThreatPostProcessManagerAndParticleBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AThreatPostProcessManagerAndParticleBlueprint_C>();
	}
};
static_assert(alignof(AThreatPostProcessManagerAndParticleBlueprint_C) == 0x000010, "Wrong alignment on AThreatPostProcessManagerAndParticleBlueprint_C");
static_assert(sizeof(AThreatPostProcessManagerAndParticleBlueprint_C) == 0x000530, "Wrong size on AThreatPostProcessManagerAndParticleBlueprint_C");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, UberGraphFrame) == 0x000370, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, EnterTheStormSound) == 0x000378, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::EnterTheStormSound' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, Sprite1) == 0x000380, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::Sprite1' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, Ramp_Up_down_values_on_death_NewTrack_0_1CA080D642E9F1C3CB297DBE1BD2C9A4) == 0x000388, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::Ramp_Up_down_values_on_death_NewTrack_0_1CA080D642E9F1C3CB297DBE1BD2C9A4' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, Ramp_Up_down_values_on_death__Direction_1CA080D642E9F1C3CB297DBE1BD2C9A4) == 0x00038C, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::Ramp_Up_down_values_on_death__Direction_1CA080D642E9F1C3CB297DBE1BD2C9A4' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, Ramp_Up_down_values_on_death) == 0x000390, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::Ramp_Up_down_values_on_death' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, Min_Cloud_Distance_from_player) == 0x000398, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::Min_Cloud_Distance_from_player' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, Localized_Particle_System_MID) == 0x0003A0, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::Localized_Particle_System_MID' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, NewEventDispatcher) == 0x0003A8, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::NewEventDispatcher' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, NewEventDispatcher0) == 0x0003B8, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::NewEventDispatcher0' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, Array_of_Cloud_Positions) == 0x0003C8, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::Array_of_Cloud_Positions' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, SkyParticleCloudDistances) == 0x0003D8, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::SkyParticleCloudDistances' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, CloudDistanceToPlayerLookUpArray) == 0x0003E8, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::CloudDistanceToPlayerLookUpArray' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, Target_Cloud_Position) == 0x0003F8, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::Target_Cloud_Position' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, RecalculateTimer) == 0x000404, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::RecalculateTimer' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, Is_Alive) == 0x000408, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::Is_Alive' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, IsAliveJustChanged) == 0x000409, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::IsAliveJustChanged' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, IsAlivePrevious) == 0x00040A, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::IsAlivePrevious' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, Number_Of_ticks_before_checking_for_the_nearest_cloud_again_Minus_when_alive) == 0x00040C, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::Number_Of_ticks_before_checking_for_the_nearest_cloud_again_Minus_when_alive' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, CurrentCloudMesh) == 0x000410, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::CurrentCloudMesh' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, Number_Of_ticks_before_checking_for_the_nearest_cloud_again_Minus_when_dead) == 0x000414, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::Number_Of_ticks_before_checking_for_the_nearest_cloud_again_Minus_when_dead' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, Materialpost) == 0x000418, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::Materialpost' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, Post_process_volume_falloff__around_the_threat_volume) == 0x000420, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::Post_process_volume_falloff__around_the_threat_volume' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, ShowRainEffect) == 0x000424, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::ShowRainEffect' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, FourClosestClouds) == 0x000428, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::FourClosestClouds' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, Number_Of_Volumes_to_check) == 0x000438, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::Number_Of_Volumes_to_check' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, DeltaTime) == 0x00043C, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::DeltaTime' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, PostProcessTargetWeight) == 0x000440, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::PostProcessTargetWeight' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, Current_Post_Process_Weight) == 0x000444, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::Current_Post_Process_Weight' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, Post_Process_Fade_in_speed) == 0x000448, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::Post_Process_Fade_in_speed' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, SoundIsActive) == 0x00044C, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::SoundIsActive' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, SoundWasPreviouslyActive) == 0x00044D, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::SoundWasPreviouslyActive' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, PlayerTransform) == 0x000450, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::PlayerTransform' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, Is_On) == 0x000480, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::Is_On' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, MaterialEffectsPostProcess) == 0x000488, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::MaterialEffectsPostProcess' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, ThreatFogPostProcessColor_Morning) == 0x000490, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::ThreatFogPostProcessColor_Morning' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, ThreatFogPostProcessColor_Day) == 0x0004A0, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::ThreatFogPostProcessColor_Day' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, ThreatFogPostProcessColor_Evening) == 0x0004B0, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::ThreatFogPostProcessColor_Evening' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, ThreatFogPostProcessColor_Night) == 0x0004C0, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::ThreatFogPostProcessColor_Night' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, Array_of_Cloud_Volumes) == 0x0004D0, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::Array_of_Cloud_Volumes' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, ClosestCloudIndex) == 0x0004E0, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::ClosestCloudIndex' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, ClosestCloudDistance) == 0x0004E4, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::ClosestCloudDistance' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, PostProcessWeightModulation) == 0x0004E8, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::PostProcessWeightModulation' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, Ramp_Up_And_Down_Anim_Values) == 0x0004EC, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::Ramp_Up_And_Down_Anim_Values' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, ShowRainOnCameraLens) == 0x0004F0, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::ShowRainOnCameraLens' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, Rain_Camera_Lens_Effect) == 0x0004F8, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::Rain_Camera_Lens_Effect' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, LocalizedParticleSystem) == 0x000500, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::LocalizedParticleSystem' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, IsWorldReady) == 0x000508, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::IsWorldReady' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, Rain_Trace_Timer) == 0x00050C, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::Rain_Trace_Timer' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, RainTraceOffset) == 0x000510, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::RainTraceOffset' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, RainMultiplierCurrent) == 0x00051C, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::RainMultiplierCurrent' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, Rain_Spawn_Rate_Exponent) == 0x000520, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::Rain_Spawn_Rate_Exponent' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, TracePrevious) == 0x000524, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::TracePrevious' has a wrong offset!");
static_assert(offsetof(AThreatPostProcessManagerAndParticleBlueprint_C, IsAthenaWorld) == 0x000525, "Member 'AThreatPostProcessManagerAndParticleBlueprint_C::IsAthenaWorld' has a wrong offset!");

}

