#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ThrowingStarTest

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ThrowingStarTest.ThrowingStarTest_C.OnExecute
// 0x01D0 (0x01D0 - 0x0000)
struct ThrowingStarTest_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_GetHitResult_ReturnValue;                 // 0x00C8(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0154(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0160(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x016C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0178(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01B0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01BC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ThrowingStarTest_C_OnExecute) == 0x000008, "Wrong alignment on ThrowingStarTest_C_OnExecute");
static_assert(sizeof(ThrowingStarTest_C_OnExecute) == 0x0001D0, "Wrong size on ThrowingStarTest_C_OnExecute");
static_assert(offsetof(ThrowingStarTest_C_OnExecute, MyTarget) == 0x000000, "Member 'ThrowingStarTest_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(ThrowingStarTest_C_OnExecute, Parameters) == 0x000008, "Member 'ThrowingStarTest_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(ThrowingStarTest_C_OnExecute, ReturnValue) == 0x0000C0, "Member 'ThrowingStarTest_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(ThrowingStarTest_C_OnExecute, CallFunc_GetHitResult_ReturnValue) == 0x0000C8, "Member 'ThrowingStarTest_C_OnExecute::CallFunc_GetHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(ThrowingStarTest_C_OnExecute, CallFunc_BreakHitResult_bBlockingHit) == 0x000148, "Member 'ThrowingStarTest_C_OnExecute::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(ThrowingStarTest_C_OnExecute, CallFunc_BreakHitResult_bInitialOverlap) == 0x000149, "Member 'ThrowingStarTest_C_OnExecute::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(ThrowingStarTest_C_OnExecute, CallFunc_BreakHitResult_Time) == 0x00014C, "Member 'ThrowingStarTest_C_OnExecute::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(ThrowingStarTest_C_OnExecute, CallFunc_BreakHitResult_Distance) == 0x000150, "Member 'ThrowingStarTest_C_OnExecute::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(ThrowingStarTest_C_OnExecute, CallFunc_BreakHitResult_Location) == 0x000154, "Member 'ThrowingStarTest_C_OnExecute::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(ThrowingStarTest_C_OnExecute, CallFunc_BreakHitResult_ImpactPoint) == 0x000160, "Member 'ThrowingStarTest_C_OnExecute::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(ThrowingStarTest_C_OnExecute, CallFunc_BreakHitResult_Normal) == 0x00016C, "Member 'ThrowingStarTest_C_OnExecute::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(ThrowingStarTest_C_OnExecute, CallFunc_BreakHitResult_ImpactNormal) == 0x000178, "Member 'ThrowingStarTest_C_OnExecute::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(ThrowingStarTest_C_OnExecute, CallFunc_BreakHitResult_PhysMat) == 0x000188, "Member 'ThrowingStarTest_C_OnExecute::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(ThrowingStarTest_C_OnExecute, CallFunc_BreakHitResult_HitActor) == 0x000190, "Member 'ThrowingStarTest_C_OnExecute::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(ThrowingStarTest_C_OnExecute, CallFunc_BreakHitResult_HitComponent) == 0x000198, "Member 'ThrowingStarTest_C_OnExecute::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(ThrowingStarTest_C_OnExecute, CallFunc_BreakHitResult_HitBoneName) == 0x0001A0, "Member 'ThrowingStarTest_C_OnExecute::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(ThrowingStarTest_C_OnExecute, CallFunc_BreakHitResult_HitItem) == 0x0001A8, "Member 'ThrowingStarTest_C_OnExecute::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(ThrowingStarTest_C_OnExecute, CallFunc_BreakHitResult_FaceIndex) == 0x0001AC, "Member 'ThrowingStarTest_C_OnExecute::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(ThrowingStarTest_C_OnExecute, CallFunc_BreakHitResult_TraceStart) == 0x0001B0, "Member 'ThrowingStarTest_C_OnExecute::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(ThrowingStarTest_C_OnExecute, CallFunc_BreakHitResult_TraceEnd) == 0x0001BC, "Member 'ThrowingStarTest_C_OnExecute::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(ThrowingStarTest_C_OnExecute, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0001C8, "Member 'ThrowingStarTest_C_OnExecute::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

}

