#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TooltipMinusBasicMinusS

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Tooltip-Basic-S.Tooltip-Basic-S_C
// 0x0078 (0x0288 - 0x0210)
class UTooltipMinusBasicMinusS_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 _hr_;                                              // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Body_HBox;                                         // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Header_HBox;                                       // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconMinusHeader;                                   // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                SpacerMinusIcon;                                   // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextMinusBody;                                     // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextMinusHeader;                                   // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   BodyText;                                          // 0x0250(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   HeaderText;                                        // 0x0268(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class USlateBrushAsset*                       Icon_Brush;                                        // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TooltipMinusBasicMinusS(int32 EntryPoint);
	void Construct();
	class FText Get_Body_Text();
	class FText Get_Header_Text();
	struct FSlateBrush Get_Icon_Brush();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tooltip-Basic-S_C">();
	}
	static class UTooltipMinusBasicMinusS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTooltipMinusBasicMinusS_C>();
	}
};
static_assert(alignof(UTooltipMinusBasicMinusS_C) == 0x000008, "Wrong alignment on UTooltipMinusBasicMinusS_C");
static_assert(sizeof(UTooltipMinusBasicMinusS_C) == 0x000288, "Wrong size on UTooltipMinusBasicMinusS_C");
static_assert(offsetof(UTooltipMinusBasicMinusS_C, UberGraphFrame) == 0x000210, "Member 'UTooltipMinusBasicMinusS_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMinusS_C, _hr_) == 0x000218, "Member 'UTooltipMinusBasicMinusS_C::_hr_' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMinusS_C, Body_HBox) == 0x000220, "Member 'UTooltipMinusBasicMinusS_C::Body_HBox' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMinusS_C, Header_HBox) == 0x000228, "Member 'UTooltipMinusBasicMinusS_C::Header_HBox' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMinusS_C, IconMinusHeader) == 0x000230, "Member 'UTooltipMinusBasicMinusS_C::IconMinusHeader' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMinusS_C, SpacerMinusIcon) == 0x000238, "Member 'UTooltipMinusBasicMinusS_C::SpacerMinusIcon' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMinusS_C, TextMinusBody) == 0x000240, "Member 'UTooltipMinusBasicMinusS_C::TextMinusBody' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMinusS_C, TextMinusHeader) == 0x000248, "Member 'UTooltipMinusBasicMinusS_C::TextMinusHeader' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMinusS_C, BodyText) == 0x000250, "Member 'UTooltipMinusBasicMinusS_C::BodyText' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMinusS_C, HeaderText) == 0x000268, "Member 'UTooltipMinusBasicMinusS_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMinusS_C, Icon_Brush) == 0x000280, "Member 'UTooltipMinusBasicMinusS_C::Icon_Brush' has a wrong offset!");

}

