#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TooltipMinusBasicMultiLineMinusS

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Tooltip-BasicMultiLine-S.Tooltip-BasicMultiLine-S_C
// 0x0078 (0x0280 - 0x0208)
class UTooltipMinusBasicMultiLineMinusS_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 _hr_;                                              // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           _Vertical_Box__Stats;                              // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Body_HBox;                                         // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Header_HBox;                                       // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconMinusHeader;                                   // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                SpacerMinusHeader;                                 // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                SpacerMinusIcon;                                   // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextMinusHeader;                                   // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FText>                           BodyText;                                          // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn)
	class FText                                   HeaderText;                                        // 0x0260(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class USlateBrushAsset*                       Icon_Brush;                                        // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TooltipMinusBasicMultiLineMinusS(int32 EntryPoint);
	void Construct();
	void Get_Body_Text();
	class FText Get_Header_Text();
	struct FSlateBrush Get_Icon_Brush();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tooltip-BasicMultiLine-S_C">();
	}
	static class UTooltipMinusBasicMultiLineMinusS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTooltipMinusBasicMultiLineMinusS_C>();
	}
};
static_assert(alignof(UTooltipMinusBasicMultiLineMinusS_C) == 0x000008, "Wrong alignment on UTooltipMinusBasicMultiLineMinusS_C");
static_assert(sizeof(UTooltipMinusBasicMultiLineMinusS_C) == 0x000280, "Wrong size on UTooltipMinusBasicMultiLineMinusS_C");
static_assert(offsetof(UTooltipMinusBasicMultiLineMinusS_C, UberGraphFrame) == 0x000208, "Member 'UTooltipMinusBasicMultiLineMinusS_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMultiLineMinusS_C, _hr_) == 0x000210, "Member 'UTooltipMinusBasicMultiLineMinusS_C::_hr_' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMultiLineMinusS_C, _Vertical_Box__Stats) == 0x000218, "Member 'UTooltipMinusBasicMultiLineMinusS_C::_Vertical_Box__Stats' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMultiLineMinusS_C, Body_HBox) == 0x000220, "Member 'UTooltipMinusBasicMultiLineMinusS_C::Body_HBox' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMultiLineMinusS_C, Header_HBox) == 0x000228, "Member 'UTooltipMinusBasicMultiLineMinusS_C::Header_HBox' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMultiLineMinusS_C, IconMinusHeader) == 0x000230, "Member 'UTooltipMinusBasicMultiLineMinusS_C::IconMinusHeader' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMultiLineMinusS_C, SpacerMinusHeader) == 0x000238, "Member 'UTooltipMinusBasicMultiLineMinusS_C::SpacerMinusHeader' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMultiLineMinusS_C, SpacerMinusIcon) == 0x000240, "Member 'UTooltipMinusBasicMultiLineMinusS_C::SpacerMinusIcon' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMultiLineMinusS_C, TextMinusHeader) == 0x000248, "Member 'UTooltipMinusBasicMultiLineMinusS_C::TextMinusHeader' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMultiLineMinusS_C, BodyText) == 0x000250, "Member 'UTooltipMinusBasicMultiLineMinusS_C::BodyText' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMultiLineMinusS_C, HeaderText) == 0x000260, "Member 'UTooltipMinusBasicMultiLineMinusS_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UTooltipMinusBasicMultiLineMinusS_C, Icon_Brush) == 0x000278, "Member 'UTooltipMinusBasicMultiLineMinusS_C::Icon_Brush' has a wrong offset!");

}

