#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Wall_Electric_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trap_Wall_Electric_Athena.Trap_Wall_Electric_Athena_C
// 0x0088 (0x0F08 - 0x0E80)
class ATrap_Wall_Electric_Athena_C final : public ABuildingTrapWall
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E80(0x0008)(Transient, DuplicateTransient)
	class UBoxComponent*                          SoundTriggerComponent;                             // 0x0E88(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        TraceLocation;                                     // 0x0E90(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TriggerComponent;                                  // 0x0E98(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               IdleFX_Coil_R;                                     // 0x0EA0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               IdleFX_Coil_L;                                     // 0x0EA8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Light_onFire;                                      // 0x0EB0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               IdleFX_Arcs_R;                                     // 0x0EB8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               IdleFX_Arcs_L;                                     // 0x0EC0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0EC8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FadeLight_Brightness_C184AADC4D731F4EF02D419DFF483ED3; // 0x0ED0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FadeLight__Direction_C184AADC4D731F4EF02D419DFF483ED3; // 0x0ED4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED5[0x3];                                      // 0x0ED5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FadeLight;                                         // 0x0ED8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Activate_Sound_Cue;                                // 0x0EE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Placed_Sound_Cue;                                  // 0x0EE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Explode_Sound_Cue;                                 // 0x0EF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Fire_Sound_Cue;                               // 0x0EF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ChargeSoundInst;                                   // 0x0F00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Trap_Wall_Electric_Athena(int32 EntryPoint);
	void BndEvt__SoundTriggerComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnWorldReady();
	void OnOutOfDurability();
	void GameplayCue_Abilities_Activation_Traps_ActivateTrap(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void OnReloadEnd();
	void OnFinishedBuilding();
	void OnPlaced();
	void FadeLight__UpdateFunc();
	void FadeLight__FinishedFunc();
	void UserConstructionScript();
	void PlayActivationSoundAndFX();

	struct FTransform GetFireLocationAndRotation() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trap_Wall_Electric_Athena_C">();
	}
	static class ATrap_Wall_Electric_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_Wall_Electric_Athena_C>();
	}
};
static_assert(alignof(ATrap_Wall_Electric_Athena_C) == 0x000008, "Wrong alignment on ATrap_Wall_Electric_Athena_C");
static_assert(sizeof(ATrap_Wall_Electric_Athena_C) == 0x000F08, "Wrong size on ATrap_Wall_Electric_Athena_C");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, UberGraphFrame) == 0x000E80, "Member 'ATrap_Wall_Electric_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, SoundTriggerComponent) == 0x000E88, "Member 'ATrap_Wall_Electric_Athena_C::SoundTriggerComponent' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, TraceLocation) == 0x000E90, "Member 'ATrap_Wall_Electric_Athena_C::TraceLocation' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, TriggerComponent) == 0x000E98, "Member 'ATrap_Wall_Electric_Athena_C::TriggerComponent' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, IdleFX_Coil_R) == 0x000EA0, "Member 'ATrap_Wall_Electric_Athena_C::IdleFX_Coil_R' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, IdleFX_Coil_L) == 0x000EA8, "Member 'ATrap_Wall_Electric_Athena_C::IdleFX_Coil_L' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, Light_onFire) == 0x000EB0, "Member 'ATrap_Wall_Electric_Athena_C::Light_onFire' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, IdleFX_Arcs_R) == 0x000EB8, "Member 'ATrap_Wall_Electric_Athena_C::IdleFX_Arcs_R' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, IdleFX_Arcs_L) == 0x000EC0, "Member 'ATrap_Wall_Electric_Athena_C::IdleFX_Arcs_L' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, Root) == 0x000EC8, "Member 'ATrap_Wall_Electric_Athena_C::Root' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, FadeLight_Brightness_C184AADC4D731F4EF02D419DFF483ED3) == 0x000ED0, "Member 'ATrap_Wall_Electric_Athena_C::FadeLight_Brightness_C184AADC4D731F4EF02D419DFF483ED3' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, FadeLight__Direction_C184AADC4D731F4EF02D419DFF483ED3) == 0x000ED4, "Member 'ATrap_Wall_Electric_Athena_C::FadeLight__Direction_C184AADC4D731F4EF02D419DFF483ED3' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, FadeLight) == 0x000ED8, "Member 'ATrap_Wall_Electric_Athena_C::FadeLight' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, Activate_Sound_Cue) == 0x000EE0, "Member 'ATrap_Wall_Electric_Athena_C::Activate_Sound_Cue' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, Placed_Sound_Cue) == 0x000EE8, "Member 'ATrap_Wall_Electric_Athena_C::Placed_Sound_Cue' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, Explode_Sound_Cue) == 0x000EF0, "Member 'ATrap_Wall_Electric_Athena_C::Explode_Sound_Cue' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, Trap_Fire_Sound_Cue) == 0x000EF8, "Member 'ATrap_Wall_Electric_Athena_C::Trap_Fire_Sound_Cue' has a wrong offset!");
static_assert(offsetof(ATrap_Wall_Electric_Athena_C, ChargeSoundInst) == 0x000F00, "Member 'ATrap_Wall_Electric_Athena_C::ChargeSoundInst' has a wrong offset!");

}

