#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Trap_Ceiling_ElectricWeak_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Trap_Ceiling_ElectricWeak_Athena.Trap_Ceiling_ElectricWeak_Athena_C
// 0x0070 (0x0EE8 - 0x0E78)
class ATrap_Ceiling_ElectricWeak_Athena_C final : public ABuildingTrapCeiling
{
public:
	uint8                                         Pad_E78[0x8];                                      // 0x0E78(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E80(0x0008)(Transient, DuplicateTransient)
	class UBoxComponent*                          SoundTriggerComponent;                             // 0x0E88(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        TraceLocation;                                     // 0x0E90(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               IdleElectricFX;                                    // 0x0E98(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   Light;                                             // 0x0EA0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TriggerComponent;                                  // 0x0EA8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0EB0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ScaleOutLight_Brightness_3AA74E0F4FE4CCC5C65C10AB9EBF8ED5; // 0x0EB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ScaleOutLight__Direction_3AA74E0F4FE4CCC5C65C10AB9EBF8ED5; // 0x0EBC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EBD[0x3];                                      // 0x0EBD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ScaleOutLight;                                     // 0x0EC0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Placed_Sound;                                 // 0x0EC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Trap_Fire_Sound;                                   // 0x0ED0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Explosion_Sound;                                   // 0x0ED8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        ChargeSoundInst;                                   // 0x0EE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Trap_Ceiling_ElectricWeak_Athena(int32 EntryPoint);
	void BndEvt__SoundTriggerComponent_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnWorldReady();
	void OnOutOfDurability();
	void GameplayCue_Abilities_Activation_Traps_ActivateTrap(EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void OnReloadEnd();
	void OnFinishedBuilding();
	void OnPlaced();
	void ScaleOutLight__UpdateFunc();
	void ScaleOutLight__FinishedFunc();
	void UserConstructionScript();

	struct FTransform GetFireLocationAndRotation() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Trap_Ceiling_ElectricWeak_Athena_C">();
	}
	static class ATrap_Ceiling_ElectricWeak_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATrap_Ceiling_ElectricWeak_Athena_C>();
	}
};
static_assert(alignof(ATrap_Ceiling_ElectricWeak_Athena_C) == 0x000008, "Wrong alignment on ATrap_Ceiling_ElectricWeak_Athena_C");
static_assert(sizeof(ATrap_Ceiling_ElectricWeak_Athena_C) == 0x000EE8, "Wrong size on ATrap_Ceiling_ElectricWeak_Athena_C");
static_assert(offsetof(ATrap_Ceiling_ElectricWeak_Athena_C, UberGraphFrame) == 0x000E80, "Member 'ATrap_Ceiling_ElectricWeak_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_ElectricWeak_Athena_C, SoundTriggerComponent) == 0x000E88, "Member 'ATrap_Ceiling_ElectricWeak_Athena_C::SoundTriggerComponent' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_ElectricWeak_Athena_C, TraceLocation) == 0x000E90, "Member 'ATrap_Ceiling_ElectricWeak_Athena_C::TraceLocation' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_ElectricWeak_Athena_C, IdleElectricFX) == 0x000E98, "Member 'ATrap_Ceiling_ElectricWeak_Athena_C::IdleElectricFX' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_ElectricWeak_Athena_C, Light) == 0x000EA0, "Member 'ATrap_Ceiling_ElectricWeak_Athena_C::Light' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_ElectricWeak_Athena_C, TriggerComponent) == 0x000EA8, "Member 'ATrap_Ceiling_ElectricWeak_Athena_C::TriggerComponent' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_ElectricWeak_Athena_C, Root) == 0x000EB0, "Member 'ATrap_Ceiling_ElectricWeak_Athena_C::Root' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_ElectricWeak_Athena_C, ScaleOutLight_Brightness_3AA74E0F4FE4CCC5C65C10AB9EBF8ED5) == 0x000EB8, "Member 'ATrap_Ceiling_ElectricWeak_Athena_C::ScaleOutLight_Brightness_3AA74E0F4FE4CCC5C65C10AB9EBF8ED5' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_ElectricWeak_Athena_C, ScaleOutLight__Direction_3AA74E0F4FE4CCC5C65C10AB9EBF8ED5) == 0x000EBC, "Member 'ATrap_Ceiling_ElectricWeak_Athena_C::ScaleOutLight__Direction_3AA74E0F4FE4CCC5C65C10AB9EBF8ED5' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_ElectricWeak_Athena_C, ScaleOutLight) == 0x000EC0, "Member 'ATrap_Ceiling_ElectricWeak_Athena_C::ScaleOutLight' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_ElectricWeak_Athena_C, Trap_Placed_Sound) == 0x000EC8, "Member 'ATrap_Ceiling_ElectricWeak_Athena_C::Trap_Placed_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_ElectricWeak_Athena_C, Trap_Fire_Sound) == 0x000ED0, "Member 'ATrap_Ceiling_ElectricWeak_Athena_C::Trap_Fire_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_ElectricWeak_Athena_C, Explosion_Sound) == 0x000ED8, "Member 'ATrap_Ceiling_ElectricWeak_Athena_C::Explosion_Sound' has a wrong offset!");
static_assert(offsetof(ATrap_Ceiling_ElectricWeak_Athena_C, ChargeSoundInst) == 0x000EE0, "Member 'ATrap_Ceiling_ElectricWeak_Athena_C::ChargeSoundInst' has a wrong offset!");

}

