#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UACCommon

#include "Basic.hpp"


namespace SDK::Params
{

// Function UACCommon.UACNetComponent.SendPacketToClient
// 0x0018 (0x0018 - 0x0000)
struct UACNetComponent_SendPacketToClient final
{
public:
	uint8                                         Type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 Packet;                                            // 0x0008(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(UACNetComponent_SendPacketToClient) == 0x000008, "Wrong alignment on UACNetComponent_SendPacketToClient");
static_assert(sizeof(UACNetComponent_SendPacketToClient) == 0x000018, "Wrong size on UACNetComponent_SendPacketToClient");
static_assert(offsetof(UACNetComponent_SendPacketToClient, Type) == 0x000000, "Member 'UACNetComponent_SendPacketToClient::Type' has a wrong offset!");
static_assert(offsetof(UACNetComponent_SendPacketToClient, Packet) == 0x000008, "Member 'UACNetComponent_SendPacketToClient::Packet' has a wrong offset!");

// Function UACCommon.UACNetComponent.SendPacketToServer
// 0x0018 (0x0018 - 0x0000)
struct UACNetComponent_SendPacketToServer final
{
public:
	uint8                                         Type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 Packet;                                            // 0x0008(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(UACNetComponent_SendPacketToServer) == 0x000008, "Wrong alignment on UACNetComponent_SendPacketToServer");
static_assert(sizeof(UACNetComponent_SendPacketToServer) == 0x000018, "Wrong size on UACNetComponent_SendPacketToServer");
static_assert(offsetof(UACNetComponent_SendPacketToServer, Type) == 0x000000, "Member 'UACNetComponent_SendPacketToServer::Type' has a wrong offset!");
static_assert(offsetof(UACNetComponent_SendPacketToServer, Packet) == 0x000008, "Member 'UACNetComponent_SendPacketToServer::Packet' has a wrong offset!");

}

