#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIManager

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function UIManager.UIManager_C.ExecuteUbergraph_UIManager
// 0x0250 (0x0250 - 0x0000)
struct UIManager_C_ExecuteUbergraph_UIManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamepadAttached_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bDisplay;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortUIState                                  CallFunc__BPGetCurrentUIState_ReturnValue;         // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0xD];                                       // 0x0013(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortErrorInfo                         K2Node_Event_Info;                                 // 0x0020(0x0080)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCanCache_ReturnValue;                  // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A3[0xD];                                       // 0x00A3(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortDialogDescription_NUI             K2Node_Event_Description;                          // 0x00B0(0x0170)(ContainsInstancedReference)
	class UFortUIStateWidget_NUI*                 K2Node_Event_StateWidget;                          // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatablePanel*                K2Node_Event_Panel2;                               // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatablePanel*                K2Node_Event_Panel;                                // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIManager_C_ExecuteUbergraph_UIManager) == 0x000010, "Wrong alignment on UIManager_C_ExecuteUbergraph_UIManager");
static_assert(sizeof(UIManager_C_ExecuteUbergraph_UIManager) == 0x000250, "Wrong size on UIManager_C_ExecuteUbergraph_UIManager");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, EntryPoint) == 0x000000, "Member 'UIManager_C_ExecuteUbergraph_UIManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, Temp_byte_Variable) == 0x000004, "Member 'UIManager_C_ExecuteUbergraph_UIManager::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, Temp_byte_Variable2) == 0x000005, "Member 'UIManager_C_ExecuteUbergraph_UIManager::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'UIManager_C_ExecuteUbergraph_UIManager::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, CallFunc_IsGamepadAttached_ReturnValue) == 0x000010, "Member 'UIManager_C_ExecuteUbergraph_UIManager::CallFunc_IsGamepadAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, K2Node_Event_bDisplay) == 0x000011, "Member 'UIManager_C_ExecuteUbergraph_UIManager::K2Node_Event_bDisplay' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, CallFunc__BPGetCurrentUIState_ReturnValue) == 0x000012, "Member 'UIManager_C_ExecuteUbergraph_UIManager::CallFunc__BPGetCurrentUIState_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, K2Node_Event_Info) == 0x000020, "Member 'UIManager_C_ExecuteUbergraph_UIManager::K2Node_Event_Info' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, K2Node_SwitchEnum_CmpSuccess) == 0x0000A0, "Member 'UIManager_C_ExecuteUbergraph_UIManager::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, CallFunc_GetCanCache_ReturnValue) == 0x0000A1, "Member 'UIManager_C_ExecuteUbergraph_UIManager::CallFunc_GetCanCache_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, CallFunc_Not_PreBool_ReturnValue) == 0x0000A2, "Member 'UIManager_C_ExecuteUbergraph_UIManager::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, K2Node_Event_Description) == 0x0000B0, "Member 'UIManager_C_ExecuteUbergraph_UIManager::K2Node_Event_Description' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, K2Node_Event_StateWidget) == 0x000220, "Member 'UIManager_C_ExecuteUbergraph_UIManager::K2Node_Event_StateWidget' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, K2Node_Event_Panel2) == 0x000228, "Member 'UIManager_C_ExecuteUbergraph_UIManager::K2Node_Event_Panel2' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, Temp_bool_Variable) == 0x000230, "Member 'UIManager_C_ExecuteUbergraph_UIManager::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, K2Node_Select_Default) == 0x000231, "Member 'UIManager_C_ExecuteUbergraph_UIManager::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, K2Node_Event_Panel) == 0x000238, "Member 'UIManager_C_ExecuteUbergraph_UIManager::K2Node_Event_Panel' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, CallFunc_IsValid_ReturnValue) == 0x000240, "Member 'UIManager_C_ExecuteUbergraph_UIManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, CallFunc_GetChildrenCount_ReturnValue) == 0x000244, "Member 'UIManager_C_ExecuteUbergraph_UIManager::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, CallFunc_Greater_IntInt_ReturnValue) == 0x000248, "Member 'UIManager_C_ExecuteUbergraph_UIManager::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_ExecuteUbergraph_UIManager, CallFunc_BooleanAND_ReturnValue) == 0x000249, "Member 'UIManager_C_ExecuteUbergraph_UIManager::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function UIManager.UIManager_C.PopActivatablePanelInModalLayer
// 0x0008 (0x0008 - 0x0000)
struct UIManager_C_PopActivatablePanelInModalLayer final
{
public:
	const class UCommonActivatablePanel*          Panel;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIManager_C_PopActivatablePanelInModalLayer) == 0x000008, "Wrong alignment on UIManager_C_PopActivatablePanelInModalLayer");
static_assert(sizeof(UIManager_C_PopActivatablePanelInModalLayer) == 0x000008, "Wrong size on UIManager_C_PopActivatablePanelInModalLayer");
static_assert(offsetof(UIManager_C_PopActivatablePanelInModalLayer, Panel) == 0x000000, "Member 'UIManager_C_PopActivatablePanelInModalLayer::Panel' has a wrong offset!");

// Function UIManager.UIManager_C.QueueActivatablePanelIntoModalLayer
// 0x0008 (0x0008 - 0x0000)
struct UIManager_C_QueueActivatablePanelIntoModalLayer final
{
public:
	const class UCommonActivatablePanel*          Panel;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIManager_C_QueueActivatablePanelIntoModalLayer) == 0x000008, "Wrong alignment on UIManager_C_QueueActivatablePanelIntoModalLayer");
static_assert(sizeof(UIManager_C_QueueActivatablePanelIntoModalLayer) == 0x000008, "Wrong size on UIManager_C_QueueActivatablePanelIntoModalLayer");
static_assert(offsetof(UIManager_C_QueueActivatablePanelIntoModalLayer, Panel) == 0x000000, "Member 'UIManager_C_QueueActivatablePanelIntoModalLayer::Panel' has a wrong offset!");

// Function UIManager.UIManager_C.UpdateStateWidgetContent
// 0x0008 (0x0008 - 0x0000)
struct UIManager_C_UpdateStateWidgetContent final
{
public:
	class UFortUIStateWidget_NUI*                 StateWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIManager_C_UpdateStateWidgetContent) == 0x000008, "Wrong alignment on UIManager_C_UpdateStateWidgetContent");
static_assert(sizeof(UIManager_C_UpdateStateWidgetContent) == 0x000008, "Wrong size on UIManager_C_UpdateStateWidgetContent");
static_assert(offsetof(UIManager_C_UpdateStateWidgetContent, StateWidget) == 0x000000, "Member 'UIManager_C_UpdateStateWidgetContent::StateWidget' has a wrong offset!");

// Function UIManager.UIManager_C.OnShowConfirmation_NUI
// 0x0170 (0x0170 - 0x0000)
struct UIManager_C_OnShowConfirmation_NUI final
{
public:
	struct FFortDialogDescription_NUI             Description;                                       // 0x0000(0x0170)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(UIManager_C_OnShowConfirmation_NUI) == 0x000010, "Wrong alignment on UIManager_C_OnShowConfirmation_NUI");
static_assert(sizeof(UIManager_C_OnShowConfirmation_NUI) == 0x000170, "Wrong size on UIManager_C_OnShowConfirmation_NUI");
static_assert(offsetof(UIManager_C_OnShowConfirmation_NUI, Description) == 0x000000, "Member 'UIManager_C_OnShowConfirmation_NUI::Description' has a wrong offset!");

// Function UIManager.UIManager_C.DisplayErrorDialog
// 0x0080 (0x0080 - 0x0000)
struct UIManager_C_DisplayErrorDialog final
{
public:
	struct FFortErrorInfo                         Info;                                              // 0x0000(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIManager_C_DisplayErrorDialog) == 0x000010, "Wrong alignment on UIManager_C_DisplayErrorDialog");
static_assert(sizeof(UIManager_C_DisplayErrorDialog) == 0x000080, "Wrong size on UIManager_C_DisplayErrorDialog");
static_assert(offsetof(UIManager_C_DisplayErrorDialog, Info) == 0x000000, "Member 'UIManager_C_DisplayErrorDialog::Info' has a wrong offset!");

// Function UIManager.UIManager_C.DisplayStateContent
// 0x0001 (0x0001 - 0x0000)
struct UIManager_C_DisplayStateContent final
{
public:
	bool                                          bDisplay;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIManager_C_DisplayStateContent) == 0x000001, "Wrong alignment on UIManager_C_DisplayStateContent");
static_assert(sizeof(UIManager_C_DisplayStateContent) == 0x000001, "Wrong size on UIManager_C_DisplayStateContent");
static_assert(offsetof(UIManager_C_DisplayStateContent, bDisplay) == 0x000000, "Member 'UIManager_C_DisplayStateContent::bDisplay' has a wrong offset!");

// Function UIManager.UIManager_C.ClearLayers
// 0x0008 (0x0008 - 0x0000)
struct UIManager_C_ClearLayers final
{
public:
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIManager_C_ClearLayers) == 0x000008, "Wrong alignment on UIManager_C_ClearLayers");
static_assert(sizeof(UIManager_C_ClearLayers) == 0x000008, "Wrong size on UIManager_C_ClearLayers");
static_assert(offsetof(UIManager_C_ClearLayers, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'UIManager_C_ClearLayers::CallFunc_GetContext_ReturnValue' has a wrong offset!");

// Function UIManager.UIManager_C.QueueModalPanel
// 0x0018 (0x0018 - 0x0000)
struct UIManager_C_QueueModalPanel final
{
public:
	class UCommonActivatablePanel*                ActivatablePanel;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStateContentChildShowing_ReturnValue;   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIManager_C_QueueModalPanel) == 0x000008, "Wrong alignment on UIManager_C_QueueModalPanel");
static_assert(sizeof(UIManager_C_QueueModalPanel) == 0x000018, "Wrong size on UIManager_C_QueueModalPanel");
static_assert(offsetof(UIManager_C_QueueModalPanel, ActivatablePanel) == 0x000000, "Member 'UIManager_C_QueueModalPanel::ActivatablePanel' has a wrong offset!");
static_assert(offsetof(UIManager_C_QueueModalPanel, CallFunc_IsStateContentChildShowing_ReturnValue) == 0x000008, "Member 'UIManager_C_QueueModalPanel::CallFunc_IsStateContentChildShowing_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_QueueModalPanel, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'UIManager_C_QueueModalPanel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_QueueModalPanel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'UIManager_C_QueueModalPanel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_QueueModalPanel, CallFunc_BooleanAND_ReturnValue) == 0x000011, "Member 'UIManager_C_QueueModalPanel::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_QueueModalPanel, CallFunc_Array_Add_ReturnValue) == 0x000014, "Member 'UIManager_C_QueueModalPanel::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function UIManager.UIManager_C.ShowNextModalWidget
// 0x0010 (0x0010 - 0x0000)
struct UIManager_C_ShowNextModalWidget final
{
public:
	class UCommonActivatablePanel*                CallFunc_Array_Get_Item;                           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIManager_C_ShowNextModalWidget) == 0x000008, "Wrong alignment on UIManager_C_ShowNextModalWidget");
static_assert(sizeof(UIManager_C_ShowNextModalWidget) == 0x000010, "Wrong size on UIManager_C_ShowNextModalWidget");
static_assert(offsetof(UIManager_C_ShowNextModalWidget, CallFunc_Array_Get_Item) == 0x000000, "Member 'UIManager_C_ShowNextModalWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIManager_C_ShowNextModalWidget, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'UIManager_C_ShowNextModalWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_ShowNextModalWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'UIManager_C_ShowNextModalWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function UIManager.UIManager_C.BindDelegates
// 0x0040 (0x0040 - 0x0000)
struct UIManager_C_BindDelegates final
{
public:
	TDelegate<void(bool bConnected)>              K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UWidget* WebWidget, const class FString& OfferId)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(UIManager_C_BindDelegates) == 0x000008, "Wrong alignment on UIManager_C_BindDelegates");
static_assert(sizeof(UIManager_C_BindDelegates) == 0x000040, "Wrong size on UIManager_C_BindDelegates");
static_assert(offsetof(UIManager_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'UIManager_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIManager_C_BindDelegates, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'UIManager_C_BindDelegates::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_BindDelegates, CallFunc_GetContext_ReturnValue2) == 0x000018, "Member 'UIManager_C_BindDelegates::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(UIManager_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'UIManager_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(UIManager_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate3) == 0x000030, "Member 'UIManager_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");

// Function UIManager.UIManager_C.IsStateContentChildShowing
// 0x0018 (0x0018 - 0x0000)
struct UIManager_C_IsStateContentChildShowing final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIManager_C_IsStateContentChildShowing) == 0x000008, "Wrong alignment on UIManager_C_IsStateContentChildShowing");
static_assert(sizeof(UIManager_C_IsStateContentChildShowing) == 0x000018, "Wrong size on UIManager_C_IsStateContentChildShowing");
static_assert(offsetof(UIManager_C_IsStateContentChildShowing, ReturnValue) == 0x000000, "Member 'UIManager_C_IsStateContentChildShowing::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_IsStateContentChildShowing, CallFunc_GetChildrenCount_ReturnValue) == 0x000004, "Member 'UIManager_C_IsStateContentChildShowing::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_IsStateContentChildShowing, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'UIManager_C_IsStateContentChildShowing::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_IsStateContentChildShowing, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'UIManager_C_IsStateContentChildShowing::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_IsStateContentChildShowing, CallFunc_IsVisible_ReturnValue) == 0x000011, "Member 'UIManager_C_IsStateContentChildShowing::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_IsStateContentChildShowing, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'UIManager_C_IsStateContentChildShowing::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function UIManager.UIManager_C.HandleDeactivatedPanelConfirmationLayer
// 0x0010 (0x0010 - 0x0000)
struct UIManager_C_HandleDeactivatedPanelConfirmationLayer final
{
public:
	class UCommonActivatablePanel*                DeactivatedPanel;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIManager_C_HandleDeactivatedPanelConfirmationLayer) == 0x000008, "Wrong alignment on UIManager_C_HandleDeactivatedPanelConfirmationLayer");
static_assert(sizeof(UIManager_C_HandleDeactivatedPanelConfirmationLayer) == 0x000010, "Wrong size on UIManager_C_HandleDeactivatedPanelConfirmationLayer");
static_assert(offsetof(UIManager_C_HandleDeactivatedPanelConfirmationLayer, DeactivatedPanel) == 0x000000, "Member 'UIManager_C_HandleDeactivatedPanelConfirmationLayer::DeactivatedPanel' has a wrong offset!");
static_assert(offsetof(UIManager_C_HandleDeactivatedPanelConfirmationLayer, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'UIManager_C_HandleDeactivatedPanelConfirmationLayer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_HandleDeactivatedPanelConfirmationLayer, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'UIManager_C_HandleDeactivatedPanelConfirmationLayer::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function UIManager.UIManager_C.ShowNextConfirmation
// 0x01B0 (0x01B0 - 0x0000)
struct UIManager_C_ShowNextConfirmation final
{
public:
	TDelegate<void(class UCommonActivatablePanel* Panel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputManager*                    CallFunc_GetInputManager_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortDialogDescription_NUI             CallFunc_Array_Get_Item;                           // 0x0030(0x0170)(ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIManager_C_ShowNextConfirmation) == 0x000010, "Wrong alignment on UIManager_C_ShowNextConfirmation");
static_assert(sizeof(UIManager_C_ShowNextConfirmation) == 0x0001B0, "Wrong size on UIManager_C_ShowNextConfirmation");
static_assert(offsetof(UIManager_C_ShowNextConfirmation, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'UIManager_C_ShowNextConfirmation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIManager_C_ShowNextConfirmation, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'UIManager_C_ShowNextConfirmation::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_ShowNextConfirmation, CallFunc_GetInputManager_ReturnValue) == 0x000018, "Member 'UIManager_C_ShowNextConfirmation::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_ShowNextConfirmation, CallFunc_AddChild_ReturnValue) == 0x000020, "Member 'UIManager_C_ShowNextConfirmation::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_ShowNextConfirmation, CallFunc_Array_Get_Item) == 0x000030, "Member 'UIManager_C_ShowNextConfirmation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIManager_C_ShowNextConfirmation, CallFunc_Array_Length_ReturnValue) == 0x0001A0, "Member 'UIManager_C_ShowNextConfirmation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_ShowNextConfirmation, CallFunc_Greater_IntInt_ReturnValue) == 0x0001A4, "Member 'UIManager_C_ShowNextConfirmation::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function UIManager.UIManager_C.QueueConfirmation
// 0x0190 (0x0190 - 0x0000)
struct UIManager_C_QueueConfirmation final
{
public:
	struct FFortDialogDescription_NUI             ConfirmationDescription;                           // 0x0000(0x0170)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_172[0x2];                                      // 0x0172(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStateContentChildShowing_ReturnValue;   // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17B[0x1];                                      // 0x017B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIManager_C_QueueConfirmation) == 0x000010, "Wrong alignment on UIManager_C_QueueConfirmation");
static_assert(sizeof(UIManager_C_QueueConfirmation) == 0x000190, "Wrong size on UIManager_C_QueueConfirmation");
static_assert(offsetof(UIManager_C_QueueConfirmation, ConfirmationDescription) == 0x000000, "Member 'UIManager_C_QueueConfirmation::ConfirmationDescription' has a wrong offset!");
static_assert(offsetof(UIManager_C_QueueConfirmation, CallFunc_HasAnyChildren_ReturnValue) == 0x000170, "Member 'UIManager_C_QueueConfirmation::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_QueueConfirmation, CallFunc_Not_PreBool_ReturnValue) == 0x000171, "Member 'UIManager_C_QueueConfirmation::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_QueueConfirmation, CallFunc_Array_Length_ReturnValue) == 0x000174, "Member 'UIManager_C_QueueConfirmation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_QueueConfirmation, CallFunc_IsStateContentChildShowing_ReturnValue) == 0x000178, "Member 'UIManager_C_QueueConfirmation::CallFunc_IsStateContentChildShowing_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_QueueConfirmation, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000179, "Member 'UIManager_C_QueueConfirmation::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_QueueConfirmation, CallFunc_BooleanAND_ReturnValue) == 0x00017A, "Member 'UIManager_C_QueueConfirmation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_QueueConfirmation, CallFunc_Array_Add_ReturnValue) == 0x00017C, "Member 'UIManager_C_QueueConfirmation::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_QueueConfirmation, CallFunc_BooleanAND_ReturnValue2) == 0x000180, "Member 'UIManager_C_QueueConfirmation::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");

// Function UIManager.UIManager_C.Initialize
// 0x0100 (0x0100 - 0x0000)
struct UIManager_C_Initialize final
{
public:
	class FText                                   Temp_text_Variable;                                // 0x0000(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable2;                               // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable3;                               // 0x0038(0x0018)()
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable4;                               // 0x0060(0x0018)()
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0088(0x0018)()
	class UProgressModalWidget_C*                 CallFunc_Create_ReturnValue;                       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue2;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWebPurchase_C*                         CallFunc_Create_ReturnValue2;                      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue3;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UErrorWindow_C*                         CallFunc_Create_ReturnValue3;                      // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select2_Default;                            // 0x00D0(0x0018)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue4;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UConfirmationWindow_C*                  CallFunc_Create_ReturnValue4;                      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIManager_C_Initialize) == 0x000008, "Wrong alignment on UIManager_C_Initialize");
static_assert(sizeof(UIManager_C_Initialize) == 0x000100, "Wrong size on UIManager_C_Initialize");
static_assert(offsetof(UIManager_C_Initialize, Temp_text_Variable) == 0x000000, "Member 'UIManager_C_Initialize::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(UIManager_C_Initialize, Temp_bool_Variable) == 0x000018, "Member 'UIManager_C_Initialize::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UIManager_C_Initialize, Temp_text_Variable2) == 0x000020, "Member 'UIManager_C_Initialize::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(UIManager_C_Initialize, Temp_text_Variable3) == 0x000038, "Member 'UIManager_C_Initialize::Temp_text_Variable3' has a wrong offset!");
static_assert(offsetof(UIManager_C_Initialize, CallFunc_GetPlatformName_ReturnValue) == 0x000050, "Member 'UIManager_C_Initialize::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_Initialize, Temp_text_Variable4) == 0x000060, "Member 'UIManager_C_Initialize::Temp_text_Variable4' has a wrong offset!");
static_assert(offsetof(UIManager_C_Initialize, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000078, "Member 'UIManager_C_Initialize::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_Initialize, CallFunc_GetOwningPlayer_ReturnValue) == 0x000080, "Member 'UIManager_C_Initialize::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_Initialize, K2Node_Select_Default) == 0x000088, "Member 'UIManager_C_Initialize::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UIManager_C_Initialize, CallFunc_Create_ReturnValue) == 0x0000A0, "Member 'UIManager_C_Initialize::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_Initialize, CallFunc_GetOwningPlayer_ReturnValue2) == 0x0000A8, "Member 'UIManager_C_Initialize::CallFunc_GetOwningPlayer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(UIManager_C_Initialize, CallFunc_Create_ReturnValue2) == 0x0000B0, "Member 'UIManager_C_Initialize::CallFunc_Create_ReturnValue2' has a wrong offset!");
static_assert(offsetof(UIManager_C_Initialize, CallFunc_GetOwningPlayer_ReturnValue3) == 0x0000B8, "Member 'UIManager_C_Initialize::CallFunc_GetOwningPlayer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(UIManager_C_Initialize, Temp_bool_Variable2) == 0x0000C0, "Member 'UIManager_C_Initialize::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(UIManager_C_Initialize, CallFunc_Create_ReturnValue3) == 0x0000C8, "Member 'UIManager_C_Initialize::CallFunc_Create_ReturnValue3' has a wrong offset!");
static_assert(offsetof(UIManager_C_Initialize, K2Node_Select2_Default) == 0x0000D0, "Member 'UIManager_C_Initialize::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(UIManager_C_Initialize, CallFunc_GetOwningPlayer_ReturnValue4) == 0x0000E8, "Member 'UIManager_C_Initialize::CallFunc_GetOwningPlayer_ReturnValue4' has a wrong offset!");
static_assert(offsetof(UIManager_C_Initialize, CallFunc_Create_ReturnValue4) == 0x0000F0, "Member 'UIManager_C_Initialize::CallFunc_Create_ReturnValue4' has a wrong offset!");
static_assert(offsetof(UIManager_C_Initialize, CallFunc_HasAnyChildren_ReturnValue) == 0x0000F8, "Member 'UIManager_C_Initialize::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");

// Function UIManager.UIManager_C.AddActivatablePanelToModalLayer
// 0x0030 (0x0030 - 0x0000)
struct UIManager_C_AddActivatablePanelToModalLayer final
{
public:
	class UCommonActivatablePanel*                ActivatablePanel;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputManager*                    CallFunc_GetInputManager_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatablePanel* Panel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIManager_C_AddActivatablePanelToModalLayer) == 0x000008, "Wrong alignment on UIManager_C_AddActivatablePanelToModalLayer");
static_assert(sizeof(UIManager_C_AddActivatablePanelToModalLayer) == 0x000030, "Wrong size on UIManager_C_AddActivatablePanelToModalLayer");
static_assert(offsetof(UIManager_C_AddActivatablePanelToModalLayer, ActivatablePanel) == 0x000000, "Member 'UIManager_C_AddActivatablePanelToModalLayer::ActivatablePanel' has a wrong offset!");
static_assert(offsetof(UIManager_C_AddActivatablePanelToModalLayer, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'UIManager_C_AddActivatablePanelToModalLayer::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_AddActivatablePanelToModalLayer, CallFunc_GetInputManager_ReturnValue) == 0x000010, "Member 'UIManager_C_AddActivatablePanelToModalLayer::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_AddActivatablePanelToModalLayer, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'UIManager_C_AddActivatablePanelToModalLayer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIManager_C_AddActivatablePanelToModalLayer, CallFunc_AddChild_ReturnValue) == 0x000028, "Member 'UIManager_C_AddActivatablePanelToModalLayer::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function UIManager.UIManager_C.HandleDeactivatedPanelModalLayer
// 0x0010 (0x0010 - 0x0000)
struct UIManager_C_HandleDeactivatedPanelModalLayer final
{
public:
	class UCommonActivatablePanel*                DeactivatedPanel;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIManager_C_HandleDeactivatedPanelModalLayer) == 0x000008, "Wrong alignment on UIManager_C_HandleDeactivatedPanelModalLayer");
static_assert(sizeof(UIManager_C_HandleDeactivatedPanelModalLayer) == 0x000010, "Wrong size on UIManager_C_HandleDeactivatedPanelModalLayer");
static_assert(offsetof(UIManager_C_HandleDeactivatedPanelModalLayer, DeactivatedPanel) == 0x000000, "Member 'UIManager_C_HandleDeactivatedPanelModalLayer::DeactivatedPanel' has a wrong offset!");
static_assert(offsetof(UIManager_C_HandleDeactivatedPanelModalLayer, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'UIManager_C_HandleDeactivatedPanelModalLayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UIManager.UIManager_C.ShowErrorInErrorWindow
// 0x00A0 (0x00A0 - 0x0000)
struct UIManager_C_ShowErrorInErrorWindow final
{
public:
	struct FFortErrorInfo                         ErrorInfo;                                         // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
	TDelegate<void(class UCommonActivatablePanel* Panel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasChild_ReturnValue;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIManager_C_ShowErrorInErrorWindow) == 0x000010, "Wrong alignment on UIManager_C_ShowErrorInErrorWindow");
static_assert(sizeof(UIManager_C_ShowErrorInErrorWindow) == 0x0000A0, "Wrong size on UIManager_C_ShowErrorInErrorWindow");
static_assert(offsetof(UIManager_C_ShowErrorInErrorWindow, ErrorInfo) == 0x000000, "Member 'UIManager_C_ShowErrorInErrorWindow::ErrorInfo' has a wrong offset!");
static_assert(offsetof(UIManager_C_ShowErrorInErrorWindow, K2Node_CreateDelegate_OutputDelegate) == 0x000080, "Member 'UIManager_C_ShowErrorInErrorWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIManager_C_ShowErrorInErrorWindow, CallFunc_AddChild_ReturnValue) == 0x000090, "Member 'UIManager_C_ShowErrorInErrorWindow::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_ShowErrorInErrorWindow, CallFunc_HasChild_ReturnValue) == 0x000098, "Member 'UIManager_C_ShowErrorInErrorWindow::CallFunc_HasChild_ReturnValue' has a wrong offset!");

// Function UIManager.UIManager_C.HandleDeactivatedErrorWindow
// 0x0028 (0x0028 - 0x0000)
struct UIManager_C_HandleDeactivatedErrorWindow final
{
public:
	class UCommonActivatablePanel*                DeactivatedPanel;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStateContentChildShowing_ReturnValue;   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCommonActivatablePanel* Panel)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(UIManager_C_HandleDeactivatedErrorWindow) == 0x000008, "Wrong alignment on UIManager_C_HandleDeactivatedErrorWindow");
static_assert(sizeof(UIManager_C_HandleDeactivatedErrorWindow) == 0x000028, "Wrong size on UIManager_C_HandleDeactivatedErrorWindow");
static_assert(offsetof(UIManager_C_HandleDeactivatedErrorWindow, DeactivatedPanel) == 0x000000, "Member 'UIManager_C_HandleDeactivatedErrorWindow::DeactivatedPanel' has a wrong offset!");
static_assert(offsetof(UIManager_C_HandleDeactivatedErrorWindow, CallFunc_IsStateContentChildShowing_ReturnValue) == 0x000008, "Member 'UIManager_C_HandleDeactivatedErrorWindow::CallFunc_IsStateContentChildShowing_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_HandleDeactivatedErrorWindow, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'UIManager_C_HandleDeactivatedErrorWindow::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_HandleDeactivatedErrorWindow, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'UIManager_C_HandleDeactivatedErrorWindow::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_HandleDeactivatedErrorWindow, CallFunc_BooleanAND_ReturnValue) == 0x000011, "Member 'UIManager_C_HandleDeactivatedErrorWindow::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_HandleDeactivatedErrorWindow, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'UIManager_C_HandleDeactivatedErrorWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function UIManager.UIManager_C.DisplayWebPurchase
// 0x0030 (0x0030 - 0x0000)
struct UIManager_C_DisplayWebPurchase final
{
public:
	class UWidget*                                WebWidget;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 OfferId;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsole_ReturnValue;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIManager_C_DisplayWebPurchase) == 0x000008, "Wrong alignment on UIManager_C_DisplayWebPurchase");
static_assert(sizeof(UIManager_C_DisplayWebPurchase) == 0x000030, "Wrong size on UIManager_C_DisplayWebPurchase");
static_assert(offsetof(UIManager_C_DisplayWebPurchase, WebWidget) == 0x000000, "Member 'UIManager_C_DisplayWebPurchase::WebWidget' has a wrong offset!");
static_assert(offsetof(UIManager_C_DisplayWebPurchase, OfferId) == 0x000008, "Member 'UIManager_C_DisplayWebPurchase::OfferId' has a wrong offset!");
static_assert(offsetof(UIManager_C_DisplayWebPurchase, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'UIManager_C_DisplayWebPurchase::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_DisplayWebPurchase, CallFunc_GetContext_ReturnValue2) == 0x000020, "Member 'UIManager_C_DisplayWebPurchase::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(UIManager_C_DisplayWebPurchase, CallFunc_IsInZone_ReturnValue) == 0x000028, "Member 'UIManager_C_DisplayWebPurchase::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_DisplayWebPurchase, CallFunc_IsConsole_ReturnValue) == 0x000029, "Member 'UIManager_C_DisplayWebPurchase::CallFunc_IsConsole_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_DisplayWebPurchase, CallFunc_Not_PreBool_ReturnValue) == 0x00002A, "Member 'UIManager_C_DisplayWebPurchase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function UIManager.UIManager_C.IsConsole
// 0x0020 (0x0020 - 0x0000)
struct UIManager_C_IsConsole final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue2;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIManager_C_IsConsole) == 0x000008, "Wrong alignment on UIManager_C_IsConsole");
static_assert(sizeof(UIManager_C_IsConsole) == 0x000020, "Wrong size on UIManager_C_IsConsole");
static_assert(offsetof(UIManager_C_IsConsole, ReturnValue) == 0x000000, "Member 'UIManager_C_IsConsole::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_IsConsole, CallFunc_GetPlatformName_ReturnValue) == 0x000008, "Member 'UIManager_C_IsConsole::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_IsConsole, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000018, "Member 'UIManager_C_IsConsole::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_IsConsole, CallFunc_EqualEqual_StrStr_ReturnValue2) == 0x000019, "Member 'UIManager_C_IsConsole::CallFunc_EqualEqual_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(UIManager_C_IsConsole, CallFunc_BooleanOR_ReturnValue) == 0x00001A, "Member 'UIManager_C_IsConsole::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function UIManager.UIManager_C.OnEndLatentWaitForConfirmationDialog
// 0x000C (0x000C - 0x0000)
struct UIManager_C_OnEndLatentWaitForConfirmationDialog final
{
public:
	struct FFortDialogExternalLatentActionHandle  WaitingDialogHandle;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FFortDialogExternalLatentActionHandle  CallFunc_GetLatentActionWaitHandle_LatentActionHandle; // 0x0004(0x0004)(NoDestructor)
	bool                                          CallFunc_EqualEqual_FFortDialogWaitingForLatentActionHandle_ReturnValue; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLatentActionHandleValid_ReturnValue;    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIManager_C_OnEndLatentWaitForConfirmationDialog) == 0x000004, "Wrong alignment on UIManager_C_OnEndLatentWaitForConfirmationDialog");
static_assert(sizeof(UIManager_C_OnEndLatentWaitForConfirmationDialog) == 0x00000C, "Wrong size on UIManager_C_OnEndLatentWaitForConfirmationDialog");
static_assert(offsetof(UIManager_C_OnEndLatentWaitForConfirmationDialog, WaitingDialogHandle) == 0x000000, "Member 'UIManager_C_OnEndLatentWaitForConfirmationDialog::WaitingDialogHandle' has a wrong offset!");
static_assert(offsetof(UIManager_C_OnEndLatentWaitForConfirmationDialog, CallFunc_GetLatentActionWaitHandle_LatentActionHandle) == 0x000004, "Member 'UIManager_C_OnEndLatentWaitForConfirmationDialog::CallFunc_GetLatentActionWaitHandle_LatentActionHandle' has a wrong offset!");
static_assert(offsetof(UIManager_C_OnEndLatentWaitForConfirmationDialog, CallFunc_EqualEqual_FFortDialogWaitingForLatentActionHandle_ReturnValue) == 0x000008, "Member 'UIManager_C_OnEndLatentWaitForConfirmationDialog::CallFunc_EqualEqual_FFortDialogWaitingForLatentActionHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_OnEndLatentWaitForConfirmationDialog, CallFunc_IsLatentActionHandleValid_ReturnValue) == 0x000009, "Member 'UIManager_C_OnEndLatentWaitForConfirmationDialog::CallFunc_IsLatentActionHandleValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_OnEndLatentWaitForConfirmationDialog, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'UIManager_C_OnEndLatentWaitForConfirmationDialog::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_OnEndLatentWaitForConfirmationDialog, CallFunc_BooleanAND_ReturnValue2) == 0x00000B, "Member 'UIManager_C_OnEndLatentWaitForConfirmationDialog::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");

// Function UIManager.UIManager_C.HandleControllerConnectionChanged
// 0x0020 (0x0020 - 0x0000)
struct UIManager_C_HandleControllerConnectionChanged final
{
public:
	bool                                          bConnected;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputManager*                    CallFunc_GetInputManager_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIManager_C_HandleControllerConnectionChanged) == 0x000008, "Wrong alignment on UIManager_C_HandleControllerConnectionChanged");
static_assert(sizeof(UIManager_C_HandleControllerConnectionChanged) == 0x000020, "Wrong size on UIManager_C_HandleControllerConnectionChanged");
static_assert(offsetof(UIManager_C_HandleControllerConnectionChanged, bConnected) == 0x000000, "Member 'UIManager_C_HandleControllerConnectionChanged::bConnected' has a wrong offset!");
static_assert(offsetof(UIManager_C_HandleControllerConnectionChanged, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'UIManager_C_HandleControllerConnectionChanged::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_HandleControllerConnectionChanged, CallFunc_GetInputManager_ReturnValue) == 0x000010, "Member 'UIManager_C_HandleControllerConnectionChanged::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIManager_C_HandleControllerConnectionChanged, CallFunc_AddChild_ReturnValue) == 0x000018, "Member 'UIManager_C_HandleControllerConnectionChanged::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function UIManager.UIManager_C.HandleStateContentUpdated
// 0x0018 (0x0018 - 0x0000)
struct UIManager_C_HandleStateContentUpdated final
{
public:
