#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VaultCamera_Blueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass VaultCamera_Blueprint.VaultCamera_Blueprint_C
// 0x0020 (0x0900 - 0x08E0)
class AVaultCamera_Blueprint_C final : public AFortCameraBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08E0(0x0008)(Transient, DuplicateTransient)
	class AFortPlayerPawn*                        CachedPawn;                                        // 0x08E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MouseDown;                                         // 0x08F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8F1[0x7];                                      // 0x08F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVaultCamera_Blueprint_C*               VaultActor;                                        // 0x08F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VaultCamera_Blueprint(int32 EntryPoint);
	void OnDeactivated();
	void OnActivated();
	void ReceiveTick(float DeltaSeconds);
	void InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void InpActEvt_RightMouseButton_K2Node_InputKeyEvent_2(const struct FKey& Key);
	void InpActEvt_RightMouseButton_K2Node_InputKeyEvent_3(const struct FKey& Key);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VaultCamera_Blueprint_C">();
	}
	static class AVaultCamera_Blueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVaultCamera_Blueprint_C>();
	}
};
static_assert(alignof(AVaultCamera_Blueprint_C) == 0x000010, "Wrong alignment on AVaultCamera_Blueprint_C");
static_assert(sizeof(AVaultCamera_Blueprint_C) == 0x000900, "Wrong size on AVaultCamera_Blueprint_C");
static_assert(offsetof(AVaultCamera_Blueprint_C, UberGraphFrame) == 0x0008E0, "Member 'AVaultCamera_Blueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AVaultCamera_Blueprint_C, CachedPawn) == 0x0008E8, "Member 'AVaultCamera_Blueprint_C::CachedPawn' has a wrong offset!");
static_assert(offsetof(AVaultCamera_Blueprint_C, MouseDown) == 0x0008F0, "Member 'AVaultCamera_Blueprint_C::MouseDown' has a wrong offset!");
static_assert(offsetof(AVaultCamera_Blueprint_C, VaultActor) == 0x0008F8, "Member 'AVaultCamera_Blueprint_C::VaultActor' has a wrong offset!");

}

