#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WindManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FlowMapMaterials_structs.hpp"
#include "StaticMeshMaterialArrayCombo_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "WaterMeshAssetsToReplace_structs.hpp"


namespace SDK::Params
{

// Function WindManager.WindManager_C.ExecuteUbergraph_WindManager
// 0x0840 (0x0840 - 0x0000)
struct WindManager_C_ExecuteUbergraph_WindManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortStaticMeshActor*>           CallFunc_GetAllActorsOfClass_OutActors;            // 0x0068(0x0010)(ZeroConstructor, ReferenceParm)
	class UParticleSystem*                        K2Node_CustomEvent_EmitterTemplate;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             K2Node_CustomEvent_InTransform;                    // 0x0080(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00B0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00BC(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00C8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Generic_C*                  K2Node_CustomEvent_Player_Pawn_Generic;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10F[0x1];                                      // 0x010F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStaticMeshMaterialArrayCombo          CallFunc_Array_Get_Item;                           // 0x0128(0x0018)(HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Array_Get_Item2;                          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue5;                // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable4;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWaterMeshAssetsToReplace              CallFunc_Array_Get_Item3;                          // 0x0160(0x0018)(HasGetValueTypeHash)
	struct FWaterMeshAssetsToReplace              CallFunc_Array_Get_Item4;                          // 0x0178(0x0018)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue6;                // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakColor_R;                             // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R2;                            // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G2;                            // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B2;                            // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A2;                            // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x01BC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x01C8(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue2;                // 0x01DC(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x01E4(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue2;                         // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable5;                   // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue3;                // 0x0200(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X2;                         // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y2;                         // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x0210(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x021C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X3;                         // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y3;                         // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x022C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue5;                 // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x023C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0250(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable4;                    // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFlowMapMaterials                      CallFunc_Array_Get_Item5;                          // 0x02D8(0x0010)(HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable5;                    // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortStaticMeshActor*                   CallFunc_Array_Get_Item6;                          // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Calculate_Camera_Position_ReturnValue;    // 0x02F8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0304(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0310(0x0010)(ZeroConstructor, ReferenceParm)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult2;      // 0x0320(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue7;                // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue8;                // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStaticMeshMaterialArrayCombo          K2Node_MakeStruct_StaticMeshMaterialArrayCombo;    // 0x03A8(0x0018)(HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue2;    // 0x03C0(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x03D0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x03DC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x03EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X2;                           // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y2;                           // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z2;                           // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue2;            // 0x0404(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X3;                           // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y3;                           // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z3;                           // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue2;                        // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue2;                        // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue3;                        // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x042C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x043C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X4;                           // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y4;                           // 0x044C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z4;                           // 0x0450(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable2;         // 0x0454(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_455[0x3];                                      // 0x0455(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X5;                           // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y5;                           // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z5;                           // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X6;                           // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y6;                           // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z6;                           // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x0471(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue3;          // 0x0472(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue4;          // 0x0473(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue5;          // 0x0474(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0475(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue6;          // 0x0476(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0477(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x047A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47B[0x1];                                      // 0x047B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable6;                    // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue6;                  // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_481[0x3];                                      // 0x0481(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable6;                   // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            Temp_object_Variable;                              // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue6;                 // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_491[0x3];                                      // 0x0491(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue6;                  // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable7;                    // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable7;                   // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item7;                          // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue7;                 // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue7;                  // 0x04A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4AA[0x2];                                      // 0x04AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue7;                  // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               K2Node_Event_ParticleSystemComponent;              // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortWindImpulseCylinder               K2Node_Event_WindImpulseCylinder3;                 // 0x04B8(0x0048)(NoDestructor)
	struct FFortWindImpulseCylinderDelta          K2Node_Event_WindImpulseCylinderDelta;             // 0x0500(0x0090)(NoDestructor)
	struct FFortWindImpulseCylinder               K2Node_Event_WindImpulseCylinder2;                 // 0x0590(0x0048)(NoDestructor)
	struct FFortWindImpulseCylinder               K2Node_Event_WindImpulseCylinder;                  // 0x05D8(0x0048)(NoDestructor)
	float                                         CallFunc_GetGlobalWindIntensityAndDirection_WindIntensity; // 0x0620(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetGlobalWindIntensityAndDirection_WindDirection; // 0x0624(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakWindImpulseCylinderAdvanced_WindLocation; // 0x0630(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakWindImpulseCylinderAdvanced_WindInnerRadius; // 0x063C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakWindImpulseCylinderAdvanced_WindOuterRadius; // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakWindImpulseCylinderAdvanced_WindWorldDirection; // 0x0644(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakWindImpulseCylinderAdvanced_WindMagnitude; // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBox                                   CallFunc_BreakWindImpulseCylinderAdvanced_WindWorldBounds; // 0x0654(0x001C)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakWindImpulseCylinderAdvanced_bIsWindChanging; // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakWindImpulseCylinderAdvanced_bIsWindChangePending; // 0x0671(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_672[0x2];                                      // 0x0672(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0674(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Find_Matching_Wind_Mesh_Index_And_Write_Bool_Storm_Cyl_Mesh_Match; // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_681[0x3];                                      // 0x0681(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Find_Matching_Wind_Mesh_Index_And_Write_Bool_Wind_Cyl_Mesh_Array_Match_Index; // 0x0684(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetWindMatVariables_NewParam;             // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_689[0x3];                                      // 0x0689(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Radius;                         // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ImpulseMagnitude;               // 0x0690(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0694(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x06A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A4[0xC];                                      // 0x06A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_Particle_Transform;             // 0x06B0(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x06E0(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0760(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_764[0x4];                                      // 0x0764(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_InComponent;                    // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue3;                  // 0x0770(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_NewMagnitude;                   // 0x077C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortWindImpulseCylinder               CallFunc_MakeWindImpulseCylinder_ReturnValue;      // 0x0780(0x0048)(NoDestructor)
	struct FFortWindImpulseHandle                 CallFunc_AddWindImpulseCylinder_ReturnValue;       // 0x07C8(0x0004)(NoDestructor)
	bool                                          CallFunc_SetWindImpulseCylinderMagnitude_ReturnValue; // 0x07CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CD[0x3];                                      // 0x07CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable8;                   // 0x07D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D4[0x4];                                      // 0x07D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue8;                 // 0x07E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E1[0x3];                                      // 0x07E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue8;                  // 0x07E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue2;             // 0x07E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue3;             // 0x07F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable8;                    // 0x07F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7FC[0x4];                                      // 0x07FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item8;                          // 0x0800(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item9;                          // 0x0808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0810(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_811[0x7];                                      // 0x0811(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0818(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               K2Node_DynamicCast_AsMaterial_Instance_Dynamic;    // 0x0820(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0828(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_829[0x3];                                      // 0x0829(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x082C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x0830(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WindManager_C_ExecuteUbergraph_WindManager) == 0x000010, "Wrong alignment on WindManager_C_ExecuteUbergraph_WindManager");
static_assert(sizeof(WindManager_C_ExecuteUbergraph_WindManager) == 0x000840, "Wrong size on WindManager_C_ExecuteUbergraph_WindManager");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, EntryPoint) == 0x000000, "Member 'WindManager_C_ExecuteUbergraph_WindManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, Temp_struct_Variable) == 0x000010, "Member 'WindManager_C_ExecuteUbergraph_WindManager::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_AddComponent_ReturnValue) == 0x000040, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, Temp_int_Array_Index_Variable) == 0x000048, "Member 'WindManager_C_ExecuteUbergraph_WindManager::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000050, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'WindManager_C_ExecuteUbergraph_WindManager::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_GetAllActorsOfClass_OutActors) == 0x000068, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, K2Node_CustomEvent_EmitterTemplate) == 0x000078, "Member 'WindManager_C_ExecuteUbergraph_WindManager::K2Node_CustomEvent_EmitterTemplate' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, K2Node_CustomEvent_InTransform) == 0x000080, "Member 'WindManager_C_ExecuteUbergraph_WindManager::K2Node_CustomEvent_InTransform' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakTransform_Location) == 0x0000B0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakTransform_Rotation) == 0x0000BC, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakTransform_Scale) == 0x0000C8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, Temp_int_Loop_Counter_Variable2) == 0x0000D4, "Member 'WindManager_C_ExecuteUbergraph_WindManager::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000D8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Less_IntInt_ReturnValue) == 0x0000E0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Add_IntInt_ReturnValue2) == 0x0000E4, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, Temp_int_Loop_Counter_Variable3) == 0x0000E8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Add_IntInt_ReturnValue3) == 0x0000EC, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_GetScalarParameterValue_ReturnValue) == 0x0000F0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, K2Node_Event_DeltaSeconds) == 0x0000F4, "Member 'WindManager_C_ExecuteUbergraph_WindManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, K2Node_CustomEvent_Player_Pawn_Generic) == 0x0000F8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::K2Node_CustomEvent_Player_Pawn_Generic' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, Temp_int_Array_Index_Variable2) == 0x000100, "Member 'WindManager_C_ExecuteUbergraph_WindManager::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, Temp_bool_True_if_break_was_hit_Variable) == 0x000104, "Member 'WindManager_C_ExecuteUbergraph_WindManager::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Length_ReturnValue2) == 0x000108, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Less_IntInt_ReturnValue2) == 0x00010C, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Not_PreBool_ReturnValue) == 0x00010D, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BooleanAND_ReturnValue) == 0x00010E, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Length_ReturnValue3) == 0x000110, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_IsDedicatedServer_ReturnValue) == 0x000114, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Length_ReturnValue4) == 0x000118, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00011C, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, Temp_int_Array_Index_Variable3) == 0x000120, "Member 'WindManager_C_ExecuteUbergraph_WindManager::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Get_Item) == 0x000128, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Get_Item2) == 0x000140, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Length_ReturnValue5) == 0x000148, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Length_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Less_IntInt_ReturnValue3) == 0x00014C, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, Temp_int_Loop_Counter_Variable4) == 0x000150, "Member 'WindManager_C_ExecuteUbergraph_WindManager::Temp_int_Loop_Counter_Variable4' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Add_IntInt_ReturnValue4) == 0x000154, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_IsDedicatedServer_ReturnValue2) == 0x000158, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Get_Item3) == 0x000160, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Get_Item4) == 0x000178, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Length_ReturnValue6) == 0x000190, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Length_ReturnValue6' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_LastIndex_ReturnValue) == 0x000194, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Less_IntInt_ReturnValue4) == 0x000198, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Less_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakColor_R) == 0x00019C, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakColor_G) == 0x0001A0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakColor_B) == 0x0001A4, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakColor_A) == 0x0001A8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakColor_R2) == 0x0001AC, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakColor_R2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakColor_G2) == 0x0001B0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakColor_G2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakColor_B2) == 0x0001B4, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakColor_B2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakColor_A2) == 0x0001B8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakColor_A2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0001BC, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_MakeVector2D_ReturnValue) == 0x0001C8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakVector_X) == 0x0001D0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakVector_Y) == 0x0001D4, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakVector_Z) == 0x0001D8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_MakeVector2D_ReturnValue2) == 0x0001DC, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_MakeVector2D_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x0001E4, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakVector2D_X) == 0x0001EC, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakVector2D_Y) == 0x0001F0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Abs_ReturnValue) == 0x0001F4, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Abs_ReturnValue2) == 0x0001F8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Abs_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, Temp_int_Loop_Counter_Variable5) == 0x0001FC, "Member 'WindManager_C_ExecuteUbergraph_WindManager::Temp_int_Loop_Counter_Variable5' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_MakeVector2D_ReturnValue3) == 0x000200, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_MakeVector2D_ReturnValue3' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakVector2D_X2) == 0x000208, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakVector2D_X2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakVector2D_Y2) == 0x00020C, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakVector2D_Y2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x000210, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_FMax_ReturnValue) == 0x000218, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x00021C, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakVector2D_X3) == 0x000224, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakVector2D_X3' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_BreakVector2D_Y3) == 0x000228, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_BreakVector2D_Y3' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_MakeVector_ReturnValue) == 0x00022C, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Less_IntInt_ReturnValue5) == 0x000238, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Less_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x00023C, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000250, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Add_IntInt_ReturnValue5) == 0x0002D0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, Temp_int_Array_Index_Variable4) == 0x0002D4, "Member 'WindManager_C_ExecuteUbergraph_WindManager::Temp_int_Array_Index_Variable4' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Get_Item5) == 0x0002D8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, Temp_int_Array_Index_Variable5) == 0x0002E8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::Temp_int_Array_Index_Variable5' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Get_Item6) == 0x0002F0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Get_Item6' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Calculate_Camera_Position_ReturnValue) == 0x0002F8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Calculate_Camera_Position_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Add_VectorVector_ReturnValue) == 0x000304, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_GetMaterials_ReturnValue) == 0x000310, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_K2_SetWorldLocation_SweepHitResult2) == 0x000320, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_K2_SetWorldLocation_SweepHitResult2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Length_ReturnValue7) == 0x0003A0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Length_ReturnValue7' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Length_ReturnValue8) == 0x0003A4, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Length_ReturnValue8' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, K2Node_MakeStruct_StaticMeshMaterialArrayCombo) == 0x0003A8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::K2Node_MakeStruct_StaticMeshMaterialArrayCombo' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Conv_VectorToLinearColor_ReturnValue2) == 0x0003C0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Conv_VectorToLinearColor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_GetActorBounds_Origin) == 0x0003D0, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_GetActorBounds_BoxExtent) == 0x0003DC, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Array_Find_ReturnValue) == 0x0003E8, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WindManager_C_ExecuteUbergraph_WindManager, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0003EC, "Member 'WindManager_C_ExecuteUbergraph_WindManager::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
