#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WM_Camera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WM_Camera.WM_Camera_C
// 0x00B0 (0x0990 - 0x08E0)
class AWM_Camera_C final : public AFortCameraBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08E0(0x0008)(Transient, DuplicateTransient)
	float                                         TL_CameraDeactivateAnim_OutCurve_73E7DC7546C4C2FD98109BAD51037AF1; // 0x08E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_CameraDeactivateAnim__Direction_73E7DC7546C4C2FD98109BAD51037AF1; // 0x08EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8ED[0x3];                                      // 0x08ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_CameraDeactivateAnim;                           // 0x08F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TL_CameraActivateAnim_NewTrack_4_ED6153E9442CF8BBFC62D28E1B56763B; // 0x08F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TL_CameraActivateAnim__Direction_ED6153E9442CF8BBFC62D28E1B56763B; // 0x08FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8FD[0x3];                                      // 0x08FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_CameraActivateAnim;                             // 0x0900(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraNoise_Noise3_CAC0C7484A50FFB26B3B348FCDF148B0; // 0x0908(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraNoise_Noise2_CAC0C7484A50FFB26B3B348FCDF148B0; // 0x090C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraNoise_Noise1_CAC0C7484A50FFB26B3B348FCDF148B0; // 0x0910(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            CameraNoise__Direction_CAC0C7484A50FFB26B3B348FCDF148B0; // 0x0914(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_915[0x3];                                      // 0x0915(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     CameraNoise;                                       // 0x0918(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             InitialPosition;                                   // 0x0920(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             ZoomPosition;                                      // 0x0950(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<class AWorldMapPin*>                   AllPinsArray;                                      // 0x0980(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WM_Camera(int32 EntryPoint);
	void CameraActivateAnim();
	void CameraDeactivateAnim();
	void CameraNoise__FinishedFunc();
	void CameraNoise__UpdateFunc();
	void CameraWiggle();
	void OnActivated();
	void OnDeactivated();
	void StopWiggle();
	void TL_CameraActivateAnim__FinishedFunc();
	void TL_CameraActivateAnim__UpdateFunc();
	void TL_CameraDeactivateAnim__FinishedFunc();
	void TL_CameraDeactivateAnim__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WM_Camera_C">();
	}
	static class AWM_Camera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWM_Camera_C>();
	}
};
static_assert(alignof(AWM_Camera_C) == 0x000010, "Wrong alignment on AWM_Camera_C");
static_assert(sizeof(AWM_Camera_C) == 0x000990, "Wrong size on AWM_Camera_C");
static_assert(offsetof(AWM_Camera_C, UberGraphFrame) == 0x0008E0, "Member 'AWM_Camera_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, TL_CameraDeactivateAnim_OutCurve_73E7DC7546C4C2FD98109BAD51037AF1) == 0x0008E8, "Member 'AWM_Camera_C::TL_CameraDeactivateAnim_OutCurve_73E7DC7546C4C2FD98109BAD51037AF1' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, TL_CameraDeactivateAnim__Direction_73E7DC7546C4C2FD98109BAD51037AF1) == 0x0008EC, "Member 'AWM_Camera_C::TL_CameraDeactivateAnim__Direction_73E7DC7546C4C2FD98109BAD51037AF1' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, TL_CameraDeactivateAnim) == 0x0008F0, "Member 'AWM_Camera_C::TL_CameraDeactivateAnim' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, TL_CameraActivateAnim_NewTrack_4_ED6153E9442CF8BBFC62D28E1B56763B) == 0x0008F8, "Member 'AWM_Camera_C::TL_CameraActivateAnim_NewTrack_4_ED6153E9442CF8BBFC62D28E1B56763B' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, TL_CameraActivateAnim__Direction_ED6153E9442CF8BBFC62D28E1B56763B) == 0x0008FC, "Member 'AWM_Camera_C::TL_CameraActivateAnim__Direction_ED6153E9442CF8BBFC62D28E1B56763B' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, TL_CameraActivateAnim) == 0x000900, "Member 'AWM_Camera_C::TL_CameraActivateAnim' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, CameraNoise_Noise3_CAC0C7484A50FFB26B3B348FCDF148B0) == 0x000908, "Member 'AWM_Camera_C::CameraNoise_Noise3_CAC0C7484A50FFB26B3B348FCDF148B0' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, CameraNoise_Noise2_CAC0C7484A50FFB26B3B348FCDF148B0) == 0x00090C, "Member 'AWM_Camera_C::CameraNoise_Noise2_CAC0C7484A50FFB26B3B348FCDF148B0' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, CameraNoise_Noise1_CAC0C7484A50FFB26B3B348FCDF148B0) == 0x000910, "Member 'AWM_Camera_C::CameraNoise_Noise1_CAC0C7484A50FFB26B3B348FCDF148B0' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, CameraNoise__Direction_CAC0C7484A50FFB26B3B348FCDF148B0) == 0x000914, "Member 'AWM_Camera_C::CameraNoise__Direction_CAC0C7484A50FFB26B3B348FCDF148B0' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, CameraNoise) == 0x000918, "Member 'AWM_Camera_C::CameraNoise' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, InitialPosition) == 0x000920, "Member 'AWM_Camera_C::InitialPosition' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, ZoomPosition) == 0x000950, "Member 'AWM_Camera_C::ZoomPosition' has a wrong offset!");
static_assert(offsetof(AWM_Camera_C, AllPinsArray) == 0x000980, "Member 'AWM_Camera_C::AllPinsArray' has a wrong offset!");

}

