#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WM_Lights

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WM_Lights.WM_Lights_C
// 0x0030 (0x0398 - 0x0368)
class AWM_Lights_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             DirectionalLight;                                  // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkyLightComponent*                     SkyLight;                                          // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight1;                                       // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WM_Lights(int32 EntryPoint);
	void WMMinusLightcontrol(bool TurnOn);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WM_Lights_C">();
	}
	static class AWM_Lights_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWM_Lights_C>();
	}
};
static_assert(alignof(AWM_Lights_C) == 0x000008, "Wrong alignment on AWM_Lights_C");
static_assert(sizeof(AWM_Lights_C) == 0x000398, "Wrong size on AWM_Lights_C");
static_assert(offsetof(AWM_Lights_C, UberGraphFrame) == 0x000368, "Member 'AWM_Lights_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AWM_Lights_C, Arrow) == 0x000370, "Member 'AWM_Lights_C::Arrow' has a wrong offset!");
static_assert(offsetof(AWM_Lights_C, DirectionalLight) == 0x000378, "Member 'AWM_Lights_C::DirectionalLight' has a wrong offset!");
static_assert(offsetof(AWM_Lights_C, SkyLight) == 0x000380, "Member 'AWM_Lights_C::SkyLight' has a wrong offset!");
static_assert(offsetof(AWM_Lights_C, PointLight1) == 0x000388, "Member 'AWM_Lights_C::PointLight1' has a wrong offset!");
static_assert(offsetof(AWM_Lights_C, DefaultSceneRoot) == 0x000390, "Member 'AWM_Lights_C::DefaultSceneRoot' has a wrong offset!");

}

