#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: XpReasonFeedItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass XpReasonFeedItem.XpReasonFeedItem_C
// 0x0018 (0x0250 - 0x0238)
class UXpReasonFeedItem_C final : public UFortHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Present;                                           // 0x0240(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortRichTextBlock*                     KIllText;                                          // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__Present_K2Node_ComponentBoundEvent_1_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature();
	void ExecuteUbergraph_XpReasonFeedItem(int32 EntryPoint);
	void PlayPresentEffectAndRemove();
	void SetXpText(const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"XpReasonFeedItem_C">();
	}
	static class UXpReasonFeedItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXpReasonFeedItem_C>();
	}
};
static_assert(alignof(UXpReasonFeedItem_C) == 0x000008, "Wrong alignment on UXpReasonFeedItem_C");
static_assert(sizeof(UXpReasonFeedItem_C) == 0x000250, "Wrong size on UXpReasonFeedItem_C");
static_assert(offsetof(UXpReasonFeedItem_C, UberGraphFrame) == 0x000238, "Member 'UXpReasonFeedItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UXpReasonFeedItem_C, Present) == 0x000240, "Member 'UXpReasonFeedItem_C::Present' has a wrong offset!");
static_assert(offsetof(UXpReasonFeedItem_C, KIllText) == 0x000248, "Member 'UXpReasonFeedItem_C::KIllText' has a wrong offset!");

}

