#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AccountBonuses

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AccountBonuses.AccountBonuses_C
// 0x0080 (0x0290 - 0x0210)
class UAccountBonuses_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 Divider;                                           // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FounderBadge;                                      // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       FoundersText;                                      // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           FounderVertBox;                                    // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxEmpty;                                         // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxFoundersBadge;                                 // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxVipBadge;                                      // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MonthlyVIPText;                                    // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MonthlyVIPTitle;                                   // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_0;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VIPVertBox;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItemDefinition*                    MonthlyVIPDefinition;                              // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    FounderDefinition;                                 // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AccountBonuses(int32 EntryPoint);
	void Founder_Changed();
	void Construct();
	void Has_Founder_Badge(bool* Result);
	void Has_VIP_Badge(bool* Result);
	void Update_Badges();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AccountBonuses_C">();
	}
	static class UAccountBonuses_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAccountBonuses_C>();
	}
};
static_assert(alignof(UAccountBonuses_C) == 0x000008, "Wrong alignment on UAccountBonuses_C");
static_assert(sizeof(UAccountBonuses_C) == 0x000290, "Wrong size on UAccountBonuses_C");
static_assert(offsetof(UAccountBonuses_C, UberGraphFrame) == 0x000210, "Member 'UAccountBonuses_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAccountBonuses_C, Divider) == 0x000218, "Member 'UAccountBonuses_C::Divider' has a wrong offset!");
static_assert(offsetof(UAccountBonuses_C, FounderBadge) == 0x000220, "Member 'UAccountBonuses_C::FounderBadge' has a wrong offset!");
static_assert(offsetof(UAccountBonuses_C, FoundersText) == 0x000228, "Member 'UAccountBonuses_C::FoundersText' has a wrong offset!");
static_assert(offsetof(UAccountBonuses_C, FounderVertBox) == 0x000230, "Member 'UAccountBonuses_C::FounderVertBox' has a wrong offset!");
static_assert(offsetof(UAccountBonuses_C, HBoxEmpty) == 0x000238, "Member 'UAccountBonuses_C::HBoxEmpty' has a wrong offset!");
static_assert(offsetof(UAccountBonuses_C, HBoxFoundersBadge) == 0x000240, "Member 'UAccountBonuses_C::HBoxFoundersBadge' has a wrong offset!");
static_assert(offsetof(UAccountBonuses_C, HBoxVipBadge) == 0x000248, "Member 'UAccountBonuses_C::HBoxVipBadge' has a wrong offset!");
static_assert(offsetof(UAccountBonuses_C, Image_6) == 0x000250, "Member 'UAccountBonuses_C::Image_6' has a wrong offset!");
static_assert(offsetof(UAccountBonuses_C, MonthlyVIPText) == 0x000258, "Member 'UAccountBonuses_C::MonthlyVIPText' has a wrong offset!");
static_assert(offsetof(UAccountBonuses_C, MonthlyVIPTitle) == 0x000260, "Member 'UAccountBonuses_C::MonthlyVIPTitle' has a wrong offset!");
static_assert(offsetof(UAccountBonuses_C, SafeZone_0) == 0x000268, "Member 'UAccountBonuses_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UAccountBonuses_C, VerticalBox_0) == 0x000270, "Member 'UAccountBonuses_C::VerticalBox_0' has a wrong offset!");
static_assert(offsetof(UAccountBonuses_C, VIPVertBox) == 0x000278, "Member 'UAccountBonuses_C::VIPVertBox' has a wrong offset!");
static_assert(offsetof(UAccountBonuses_C, MonthlyVIPDefinition) == 0x000280, "Member 'UAccountBonuses_C::MonthlyVIPDefinition' has a wrong offset!");
static_assert(offsetof(UAccountBonuses_C, FounderDefinition) == 0x000288, "Member 'UAccountBonuses_C::FounderDefinition' has a wrong offset!");

}

