#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AccountLinkingWindow

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AccountLinkingWindow.AccountLinkingWindow_C.OnAccountLinkingFailed__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct AccountLinkingWindow_C_OnAccountLinkingFailed__DelegateSignature final
{
public:
	class FText                                   FailReason;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AccountLinkingWindow_C_OnAccountLinkingFailed__DelegateSignature) == 0x000008, "Wrong alignment on AccountLinkingWindow_C_OnAccountLinkingFailed__DelegateSignature");
static_assert(sizeof(AccountLinkingWindow_C_OnAccountLinkingFailed__DelegateSignature) == 0x000018, "Wrong size on AccountLinkingWindow_C_OnAccountLinkingFailed__DelegateSignature");
static_assert(offsetof(AccountLinkingWindow_C_OnAccountLinkingFailed__DelegateSignature, FailReason) == 0x000000, "Member 'AccountLinkingWindow_C_OnAccountLinkingFailed__DelegateSignature::FailReason' has a wrong offset!");

// Function AccountLinkingWindow.AccountLinkingWindow_C.OnPushStatus__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct AccountLinkingWindow_C_OnPushStatus__DelegateSignature final
{
public:
	class FText                                   StatusText;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AccountLinkingWindow_C_OnPushStatus__DelegateSignature) == 0x000008, "Wrong alignment on AccountLinkingWindow_C_OnPushStatus__DelegateSignature");
static_assert(sizeof(AccountLinkingWindow_C_OnPushStatus__DelegateSignature) == 0x000018, "Wrong size on AccountLinkingWindow_C_OnPushStatus__DelegateSignature");
static_assert(offsetof(AccountLinkingWindow_C_OnPushStatus__DelegateSignature, StatusText) == 0x000000, "Member 'AccountLinkingWindow_C_OnPushStatus__DelegateSignature::StatusText' has a wrong offset!");

// Function AccountLinkingWindow.AccountLinkingWindow_C.ExecuteUbergraph_AccountLinkingWindow
// 0x01E0 (0x01E0 - 0x0000)
struct AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UFortAsyncAction_WebCreateEpicAccountAndLink* CallFunc_WebCreateEpicAccountAndLink_ReturnValue;  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	class UFortAsyncAction_CreateHeadlessAccount* CallFunc_CreateHeadlessAccount_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0080(0x0008)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	class UFortAsyncAction_ShowPlatformStoreForPurchase* CallFunc_ShowPlatformStoreForPurchase_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate9;             // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	class UFortAsyncAction_ShowPlatformRedeemCode* CallFunc_ShowPlatformRedeemCode_ReturnValue;       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate10;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate11;            // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	class UFortAsyncAction_CheckHasRedeemForAccess* CallFunc_CheckHasRedeemForAccess_ReturnValue;      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button10;               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button9;                // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button8;                // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button7;                // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button6;                // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button5;                // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button4;                // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPurchaseFree_ReturnValue;               // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0158(0x0018)()
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue2;      // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue3;      // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button3;                // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate12;            // 0x0198(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate13;            // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate14;            // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue4;      // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select2_Default;                            // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow) == 0x000008, "Wrong alignment on AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow");
static_assert(sizeof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow) == 0x0001E0, "Wrong size on AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, EntryPoint) == 0x000000, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, CallFunc_WebCreateEpicAccountAndLink_ReturnValue) == 0x000030, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::CallFunc_WebCreateEpicAccountAndLink_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, K2Node_CreateDelegate_OutputDelegate3) == 0x000038, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, K2Node_CreateDelegate_OutputDelegate4) == 0x000050, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, CallFunc_CreateHeadlessAccount_ReturnValue) == 0x000060, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::CallFunc_CreateHeadlessAccount_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, Temp_bool_Variable) == 0x000068, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, CallFunc_IsValid_ReturnValue2) == 0x000069, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, K2Node_CreateDelegate_OutputDelegate5) == 0x000070, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000080, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, K2Node_CreateDelegate_OutputDelegate6) == 0x000088, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, K2Node_CreateDelegate_OutputDelegate7) == 0x000098, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, CallFunc_ShowPlatformStoreForPurchase_ReturnValue) == 0x0000A8, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::CallFunc_ShowPlatformStoreForPurchase_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, K2Node_CreateDelegate_OutputDelegate8) == 0x0000B0, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, CallFunc_IsValid_ReturnValue3) == 0x0000C0, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, K2Node_CreateDelegate_OutputDelegate9) == 0x0000C8, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, CallFunc_ShowPlatformRedeemCode_ReturnValue) == 0x0000D8, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::CallFunc_ShowPlatformRedeemCode_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, K2Node_CreateDelegate_OutputDelegate10) == 0x0000E0, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::K2Node_CreateDelegate_OutputDelegate10' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, CallFunc_IsValid_ReturnValue4) == 0x0000F0, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, K2Node_CreateDelegate_OutputDelegate11) == 0x0000F8, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::K2Node_CreateDelegate_OutputDelegate11' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, CallFunc_CheckHasRedeemForAccess_ReturnValue) == 0x000108, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::CallFunc_CheckHasRedeemForAccess_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, Temp_int_Variable) == 0x000110, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, CallFunc_IsValid_ReturnValue5) == 0x000114, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, K2Node_ComponentBoundEvent_Button10) == 0x000118, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::K2Node_ComponentBoundEvent_Button10' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, K2Node_ComponentBoundEvent_Button9) == 0x000120, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::K2Node_ComponentBoundEvent_Button9' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, K2Node_ComponentBoundEvent_Button8) == 0x000128, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::K2Node_ComponentBoundEvent_Button8' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, K2Node_ComponentBoundEvent_Button7) == 0x000130, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::K2Node_ComponentBoundEvent_Button7' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, K2Node_ComponentBoundEvent_Button6) == 0x000138, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::K2Node_ComponentBoundEvent_Button6' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, K2Node_ComponentBoundEvent_Button5) == 0x000140, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::K2Node_ComponentBoundEvent_Button5' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, K2Node_ComponentBoundEvent_Button4) == 0x000148, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::K2Node_ComponentBoundEvent_Button4' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, CallFunc_IsPurchaseFree_ReturnValue) == 0x000150, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::CallFunc_IsPurchaseFree_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, K2Node_Select_Default) == 0x000158, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, CallFunc_GetUINavigationManager_ReturnValue) == 0x000170, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, CallFunc_GetUINavigationManager_ReturnValue2) == 0x000178, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::CallFunc_GetUINavigationManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, CallFunc_GetUINavigationManager_ReturnValue3) == 0x000180, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::CallFunc_GetUINavigationManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, K2Node_ComponentBoundEvent_Button3) == 0x000188, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, K2Node_ComponentBoundEvent_Button2) == 0x000190, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, K2Node_CreateDelegate_OutputDelegate12) == 0x000198, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::K2Node_CreateDelegate_OutputDelegate12' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, K2Node_CreateDelegate_OutputDelegate13) == 0x0001A8, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::K2Node_CreateDelegate_OutputDelegate13' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, K2Node_CreateDelegate_OutputDelegate14) == 0x0001B8, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::K2Node_CreateDelegate_OutputDelegate14' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, CallFunc_GetUINavigationManager_ReturnValue4) == 0x0001C8, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::CallFunc_GetUINavigationManager_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x0001D0, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow, K2Node_Select2_Default) == 0x0001D8, "Member 'AccountLinkingWindow_C_ExecuteUbergraph_AccountLinkingWindow::K2Node_Select2_Default' has a wrong offset!");

// Function AccountLinkingWindow.AccountLinkingWindow_C.BndEvt__ButtonPurchasePack_K2Node_ComponentBoundEvent_175_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AccountLinkingWindow_C_BndEvt__ButtonPurchasePack_K2Node_ComponentBoundEvent_175_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AccountLinkingWindow_C_BndEvt__ButtonPurchasePack_K2Node_ComponentBoundEvent_175_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AccountLinkingWindow_C_BndEvt__ButtonPurchasePack_K2Node_ComponentBoundEvent_175_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AccountLinkingWindow_C_BndEvt__ButtonPurchasePack_K2Node_ComponentBoundEvent_175_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AccountLinkingWindow_C_BndEvt__ButtonPurchasePack_K2Node_ComponentBoundEvent_175_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AccountLinkingWindow_C_BndEvt__ButtonPurchasePack_K2Node_ComponentBoundEvent_175_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AccountLinkingWindow_C_BndEvt__ButtonPurchasePack_K2Node_ComponentBoundEvent_175_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AccountLinkingWindow.AccountLinkingWindow_C.BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_305_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AccountLinkingWindow_C_BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_305_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AccountLinkingWindow_C_BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_305_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AccountLinkingWindow_C_BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_305_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AccountLinkingWindow_C_BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_305_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AccountLinkingWindow_C_BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_305_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AccountLinkingWindow_C_BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_305_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AccountLinkingWindow_C_BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_305_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AccountLinkingWindow.AccountLinkingWindow_C.BndEvt__IconTextButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AccountLinkingWindow_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AccountLinkingWindow_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AccountLinkingWindow_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AccountLinkingWindow_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AccountLinkingWindow_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AccountLinkingWindow_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AccountLinkingWindow_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AccountLinkingWindow.AccountLinkingWindow_C.BndEvt__ButtonSkipSignInNoThanks_K2Node_ComponentBoundEvent_483_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AccountLinkingWindow_C_BndEvt__ButtonSkipSignInNoThanks_K2Node_ComponentBoundEvent_483_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AccountLinkingWindow_C_BndEvt__ButtonSkipSignInNoThanks_K2Node_ComponentBoundEvent_483_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AccountLinkingWindow_C_BndEvt__ButtonSkipSignInNoThanks_K2Node_ComponentBoundEvent_483_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AccountLinkingWindow_C_BndEvt__ButtonSkipSignInNoThanks_K2Node_ComponentBoundEvent_483_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AccountLinkingWindow_C_BndEvt__ButtonSkipSignInNoThanks_K2Node_ComponentBoundEvent_483_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AccountLinkingWindow_C_BndEvt__ButtonSkipSignInNoThanks_K2Node_ComponentBoundEvent_483_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AccountLinkingWindow_C_BndEvt__ButtonSkipSignInNoThanks_K2Node_ComponentBoundEvent_483_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AccountLinkingWindow.AccountLinkingWindow_C.BndEvt__ButtonSkipSignInLogIn_K2Node_ComponentBoundEvent_463_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AccountLinkingWindow_C_BndEvt__ButtonSkipSignInLogIn_K2Node_ComponentBoundEvent_463_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AccountLinkingWindow_C_BndEvt__ButtonSkipSignInLogIn_K2Node_ComponentBoundEvent_463_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AccountLinkingWindow_C_BndEvt__ButtonSkipSignInLogIn_K2Node_ComponentBoundEvent_463_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AccountLinkingWindow_C_BndEvt__ButtonSkipSignInLogIn_K2Node_ComponentBoundEvent_463_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AccountLinkingWindow_C_BndEvt__ButtonSkipSignInLogIn_K2Node_ComponentBoundEvent_463_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AccountLinkingWindow_C_BndEvt__ButtonSkipSignInLogIn_K2Node_ComponentBoundEvent_463_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AccountLinkingWindow_C_BndEvt__ButtonSkipSignInLogIn_K2Node_ComponentBoundEvent_463_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AccountLinkingWindow.AccountLinkingWindow_C.BndEvt__ButtonSkipSignInSignIn_K2Node_ComponentBoundEvent_444_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AccountLinkingWindow_C_BndEvt__ButtonSkipSignInSignIn_K2Node_ComponentBoundEvent_444_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AccountLinkingWindow_C_BndEvt__ButtonSkipSignInSignIn_K2Node_ComponentBoundEvent_444_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AccountLinkingWindow_C_BndEvt__ButtonSkipSignInSignIn_K2Node_ComponentBoundEvent_444_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AccountLinkingWindow_C_BndEvt__ButtonSkipSignInSignIn_K2Node_ComponentBoundEvent_444_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AccountLinkingWindow_C_BndEvt__ButtonSkipSignInSignIn_K2Node_ComponentBoundEvent_444_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AccountLinkingWindow_C_BndEvt__ButtonSkipSignInSignIn_K2Node_ComponentBoundEvent_444_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AccountLinkingWindow_C_BndEvt__ButtonSkipSignInSignIn_K2Node_ComponentBoundEvent_444_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AccountLinkingWindow.AccountLinkingWindow_C.BndEvt__ButtonSignUp_K2Node_ComponentBoundEvent_416_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AccountLinkingWindow_C_BndEvt__ButtonSignUp_K2Node_ComponentBoundEvent_416_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AccountLinkingWindow_C_BndEvt__ButtonSignUp_K2Node_ComponentBoundEvent_416_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AccountLinkingWindow_C_BndEvt__ButtonSignUp_K2Node_ComponentBoundEvent_416_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AccountLinkingWindow_C_BndEvt__ButtonSignUp_K2Node_ComponentBoundEvent_416_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AccountLinkingWindow_C_BndEvt__ButtonSignUp_K2Node_ComponentBoundEvent_416_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AccountLinkingWindow_C_BndEvt__ButtonSignUp_K2Node_ComponentBoundEvent_416_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AccountLinkingWindow_C_BndEvt__ButtonSignUp_K2Node_ComponentBoundEvent_416_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AccountLinkingWindow.AccountLinkingWindow_C.BndEvt__ButtonLogIn_K2Node_ComponentBoundEvent_431_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AccountLinkingWindow_C_BndEvt__ButtonLogIn_K2Node_ComponentBoundEvent_431_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AccountLinkingWindow_C_BndEvt__ButtonLogIn_K2Node_ComponentBoundEvent_431_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AccountLinkingWindow_C_BndEvt__ButtonLogIn_K2Node_ComponentBoundEvent_431_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AccountLinkingWindow_C_BndEvt__ButtonLogIn_K2Node_ComponentBoundEvent_431_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AccountLinkingWindow_C_BndEvt__ButtonLogIn_K2Node_ComponentBoundEvent_431_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AccountLinkingWindow_C_BndEvt__ButtonLogIn_K2Node_ComponentBoundEvent_431_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AccountLinkingWindow_C_BndEvt__ButtonLogIn_K2Node_ComponentBoundEvent_431_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AccountLinkingWindow.AccountLinkingWindow_C.BndEvt__ButtonNoThanks_K2Node_ComponentBoundEvent_447_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AccountLinkingWindow_C_BndEvt__ButtonNoThanks_K2Node_ComponentBoundEvent_447_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AccountLinkingWindow_C_BndEvt__ButtonNoThanks_K2Node_ComponentBoundEvent_447_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AccountLinkingWindow_C_BndEvt__ButtonNoThanks_K2Node_ComponentBoundEvent_447_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AccountLinkingWindow_C_BndEvt__ButtonNoThanks_K2Node_ComponentBoundEvent_447_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AccountLinkingWindow_C_BndEvt__ButtonNoThanks_K2Node_ComponentBoundEvent_447_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AccountLinkingWindow_C_BndEvt__ButtonNoThanks_K2Node_ComponentBoundEvent_447_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AccountLinkingWindow_C_BndEvt__ButtonNoThanks_K2Node_ComponentBoundEvent_447_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AccountLinkingWindow.AccountLinkingWindow_C.BndEvt__ButtonLogInFromPurchase_K2Node_ComponentBoundEvent_464_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AccountLinkingWindow_C_BndEvt__ButtonLogInFromPurchase_K2Node_ComponentBoundEvent_464_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AccountLinkingWindow_C_BndEvt__ButtonLogInFromPurchase_K2Node_ComponentBoundEvent_464_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AccountLinkingWindow_C_BndEvt__ButtonLogInFromPurchase_K2Node_ComponentBoundEvent_464_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AccountLinkingWindow_C_BndEvt__ButtonLogInFromPurchase_K2Node_ComponentBoundEvent_464_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AccountLinkingWindow_C_BndEvt__ButtonLogInFromPurchase_K2Node_ComponentBoundEvent_464_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AccountLinkingWindow_C_BndEvt__ButtonLogInFromPurchase_K2Node_ComponentBoundEvent_464_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AccountLinkingWindow_C_BndEvt__ButtonLogInFromPurchase_K2Node_ComponentBoundEvent_464_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AccountLinkingWindow.AccountLinkingWindow_C.SetLinkedAccountNeedsPurchase
// 0x0001 (0x0001 - 0x0000)
struct AccountLinkingWindow_C_SetLinkedAccountNeedsPurchase final
{
public:
	bool                                          bInLinkedAccountNeedsPurchase;                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AccountLinkingWindow_C_SetLinkedAccountNeedsPurchase) == 0x000001, "Wrong alignment on AccountLinkingWindow_C_SetLinkedAccountNeedsPurchase");
static_assert(sizeof(AccountLinkingWindow_C_SetLinkedAccountNeedsPurchase) == 0x000001, "Wrong size on AccountLinkingWindow_C_SetLinkedAccountNeedsPurchase");
static_assert(offsetof(AccountLinkingWindow_C_SetLinkedAccountNeedsPurchase, bInLinkedAccountNeedsPurchase) == 0x000000, "Member 'AccountLinkingWindow_C_SetLinkedAccountNeedsPurchase::bInLinkedAccountNeedsPurchase' has a wrong offset!");

// Function AccountLinkingWindow.AccountLinkingWindow_C.HideLinkOptions
// 0x0004 (0x0004 - 0x0000)
struct AccountLinkingWindow_C_HideLinkOptions final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AccountLinkingWindow_C_HideLinkOptions) == 0x000001, "Wrong alignment on AccountLinkingWindow_C_HideLinkOptions");
static_assert(sizeof(AccountLinkingWindow_C_HideLinkOptions) == 0x000004, "Wrong size on AccountLinkingWindow_C_HideLinkOptions");
static_assert(offsetof(AccountLinkingWindow_C_HideLinkOptions, Temp_byte_Variable) == 0x000000, "Member 'AccountLinkingWindow_C_HideLinkOptions::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_HideLinkOptions, Temp_byte_Variable2) == 0x000001, "Member 'AccountLinkingWindow_C_HideLinkOptions::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_HideLinkOptions, Temp_bool_Variable) == 0x000002, "Member 'AccountLinkingWindow_C_HideLinkOptions::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_HideLinkOptions, K2Node_Select_Default) == 0x000003, "Member 'AccountLinkingWindow_C_HideLinkOptions::K2Node_Select_Default' has a wrong offset!");

// Function AccountLinkingWindow.AccountLinkingWindow_C.SetupLinkText
// 0x0018 (0x0018 - 0x0000)
struct AccountLinkingWindow_C_SetupLinkText final
{
public:
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue2;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AccountLinkingWindow_C_SetupLinkText) == 0x000008, "Wrong alignment on AccountLinkingWindow_C_SetupLinkText");
static_assert(sizeof(AccountLinkingWindow_C_SetupLinkText) == 0x000018, "Wrong size on AccountLinkingWindow_C_SetupLinkText");
static_assert(offsetof(AccountLinkingWindow_C_SetupLinkText, CallFunc_GetPlatformName_ReturnValue) == 0x000000, "Member 'AccountLinkingWindow_C_SetupLinkText::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_SetupLinkText, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000010, "Member 'AccountLinkingWindow_C_SetupLinkText::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AccountLinkingWindow_C_SetupLinkText, CallFunc_EqualEqual_StrStr_ReturnValue2) == 0x000011, "Member 'AccountLinkingWindow_C_SetupLinkText::CallFunc_EqualEqual_StrStr_ReturnValue2' has a wrong offset!");

