#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AmbientControllerComponent_Athena

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AmbientControllerComponent_Athena.AmbientControllerComponent_Athena_C.ExecuteUbergraph_AmbientControllerComponent_Athena
// 0x0138 (0x0138 - 0x0000)
struct AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDayPhase                                 Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 Temp_byte_Variable2;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0040(0x0008)(NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortTimeOfDayManager*                  CallFunc_GetTimeOfDayManagerFromContext_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 K2Node_CustomEvent_CurrentDayPhase;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 K2Node_CustomEvent_PreviousDayPhase;               // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bAtCreation;                    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EFortDayPhase CurrentDayPhase, EFortDayPhase PreviousDayPhase, bool bAtCreation)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class USoundBase*                             K2Node_Select_Default;                             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortTimeOfDayManager*                  CallFunc_GetTimeOfDayManagerFromContext_ReturnValue2; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue2;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0088(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select2_Default;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x00A0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00AC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x00B8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00C4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue2;        // 0x00D0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Trace_ReturnValue;                        // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Trace_ReturnValue2;                       // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Trace_ReturnValue3;                       // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Trace_ReturnValue4;                       // 0x00DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Trace_ReturnValue5;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAthenaGamePhase                              K2Node_CustomEvent_GamePhase;                      // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAthenaGamePhase GamePhase)>   K2Node_CreateDelegate_OutputDelegate3;             // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAthenaGamePhaseStep                          K2Node_CustomEvent_GamePhaseStep;                  // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAthenaGamePhaseStep GamePhaseStep)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Enabled;                        // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena) == 0x000008, "Wrong alignment on AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena");
static_assert(sizeof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena) == 0x000138, "Wrong size on AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, EntryPoint) == 0x000000, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, CallFunc_IsValid_ReturnValue2) == 0x000005, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, Temp_byte_Variable) == 0x000006, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, Temp_byte_Variable2) == 0x000007, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, CallFunc_GetViewTarget_ReturnValue) == 0x000008, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, CallFunc_IsValid_ReturnValue3) == 0x000010, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, K2Node_Event_EndPlayReason) == 0x000011, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, CallFunc_IsValid_ReturnValue4) == 0x000012, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, K2Node_DynamicCast_AsPlayer_Controller) == 0x000020, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000040, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000048, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, CallFunc_GetTimeOfDayManagerFromContext_ReturnValue) == 0x000050, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::CallFunc_GetTimeOfDayManagerFromContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, K2Node_CustomEvent_CurrentDayPhase) == 0x000058, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::K2Node_CustomEvent_CurrentDayPhase' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, K2Node_CustomEvent_PreviousDayPhase) == 0x000059, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::K2Node_CustomEvent_PreviousDayPhase' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, K2Node_CustomEvent_bAtCreation) == 0x00005A, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::K2Node_CustomEvent_bAtCreation' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, K2Node_CreateDelegate_OutputDelegate2) == 0x000060, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, K2Node_Select_Default) == 0x000070, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, CallFunc_GetTimeOfDayManagerFromContext_ReturnValue2) == 0x000078, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::CallFunc_GetTimeOfDayManagerFromContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, CallFunc_GetViewTarget_ReturnValue2) == 0x000080, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::CallFunc_GetViewTarget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, CallFunc_GetActorUpVector_ReturnValue) == 0x000088, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, K2Node_Select2_Default) == 0x000098, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, CallFunc_GetActorRightVector_ReturnValue) == 0x0000A0, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000AC, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, CallFunc_GetActorForwardVector_ReturnValue) == 0x0000B8, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000C4, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, CallFunc_Multiply_VectorFloat_ReturnValue2) == 0x0000D0, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::CallFunc_Multiply_VectorFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, CallFunc_Trace_ReturnValue) == 0x0000DC, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::CallFunc_Trace_ReturnValue' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, CallFunc_Trace_ReturnValue2) == 0x0000DD, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::CallFunc_Trace_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, CallFunc_Trace_ReturnValue3) == 0x0000DE, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::CallFunc_Trace_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, CallFunc_Trace_ReturnValue4) == 0x0000DF, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::CallFunc_Trace_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, CallFunc_Trace_ReturnValue5) == 0x0000E0, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::CallFunc_Trace_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, K2Node_Event_DeltaSeconds) == 0x0000E4, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0000E8, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, CallFunc_FInterpTo_ReturnValue) == 0x0000EC, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, CallFunc_GetGameState_ReturnValue) == 0x0000F0, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x0000F8, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, K2Node_DynamicCast_bSuccess2) == 0x000100, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, K2Node_CustomEvent_GamePhase) == 0x000101, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::K2Node_CustomEvent_GamePhase' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, K2Node_CreateDelegate_OutputDelegate3) == 0x000108, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, K2Node_SwitchEnum_CmpSuccess) == 0x000118, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, K2Node_CustomEvent_GamePhaseStep) == 0x000119, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::K2Node_CustomEvent_GamePhaseStep' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, K2Node_CreateDelegate_OutputDelegate4) == 0x000120, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, K2Node_SwitchEnum2_CmpSuccess) == 0x000130, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena, K2Node_CustomEvent_Enabled) == 0x000131, "Member 'AmbientControllerComponent_Athena_C_ExecuteUbergraph_AmbientControllerComponent_Athena::K2Node_CustomEvent_Enabled' has a wrong offset!");

// Function AmbientControllerComponent_Athena.AmbientControllerComponent_Athena_C.Set Storm Amb Layer Enabled
// 0x0001 (0x0001 - 0x0000)
struct AmbientControllerComponent_Athena_C_Set_Storm_Amb_Layer_Enabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AmbientControllerComponent_Athena_C_Set_Storm_Amb_Layer_Enabled) == 0x000001, "Wrong alignment on AmbientControllerComponent_Athena_C_Set_Storm_Amb_Layer_Enabled");
static_assert(sizeof(AmbientControllerComponent_Athena_C_Set_Storm_Amb_Layer_Enabled) == 0x000001, "Wrong size on AmbientControllerComponent_Athena_C_Set_Storm_Amb_Layer_Enabled");
static_assert(offsetof(AmbientControllerComponent_Athena_C_Set_Storm_Amb_Layer_Enabled, Enabled) == 0x000000, "Member 'AmbientControllerComponent_Athena_C_Set_Storm_Amb_Layer_Enabled::Enabled' has a wrong offset!");

// Function AmbientControllerComponent_Athena.AmbientControllerComponent_Athena_C.On Game Phase Step Change
// 0x0001 (0x0001 - 0x0000)
struct AmbientControllerComponent_Athena_C_On_Game_Phase_Step_Change final
{
public:
	EAthenaGamePhaseStep                          GamePhaseStep;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AmbientControllerComponent_Athena_C_On_Game_Phase_Step_Change) == 0x000001, "Wrong alignment on AmbientControllerComponent_Athena_C_On_Game_Phase_Step_Change");
static_assert(sizeof(AmbientControllerComponent_Athena_C_On_Game_Phase_Step_Change) == 0x000001, "Wrong size on AmbientControllerComponent_Athena_C_On_Game_Phase_Step_Change");
static_assert(offsetof(AmbientControllerComponent_Athena_C_On_Game_Phase_Step_Change, GamePhaseStep) == 0x000000, "Member 'AmbientControllerComponent_Athena_C_On_Game_Phase_Step_Change::GamePhaseStep' has a wrong offset!");

// Function AmbientControllerComponent_Athena.AmbientControllerComponent_Athena_C.On Game Phase Change
// 0x0001 (0x0001 - 0x0000)
struct AmbientControllerComponent_Athena_C_On_Game_Phase_Change final
{
public:
	EAthenaGamePhase                              GamePhase;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AmbientControllerComponent_Athena_C_On_Game_Phase_Change) == 0x000001, "Wrong alignment on AmbientControllerComponent_Athena_C_On_Game_Phase_Change");
static_assert(sizeof(AmbientControllerComponent_Athena_C_On_Game_Phase_Change) == 0x000001, "Wrong size on AmbientControllerComponent_Athena_C_On_Game_Phase_Change");
static_assert(offsetof(AmbientControllerComponent_Athena_C_On_Game_Phase_Change, GamePhase) == 0x000000, "Member 'AmbientControllerComponent_Athena_C_On_Game_Phase_Change::GamePhase' has a wrong offset!");

// Function AmbientControllerComponent_Athena.AmbientControllerComponent_Athena_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct AmbientControllerComponent_Athena_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AmbientControllerComponent_Athena_C_ReceiveTick) == 0x000004, "Wrong alignment on AmbientControllerComponent_Athena_C_ReceiveTick");
static_assert(sizeof(AmbientControllerComponent_Athena_C_ReceiveTick) == 0x000004, "Wrong size on AmbientControllerComponent_Athena_C_ReceiveTick");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'AmbientControllerComponent_Athena_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function AmbientControllerComponent_Athena.AmbientControllerComponent_Athena_C.On Day Phase Change
// 0x0003 (0x0003 - 0x0000)
struct AmbientControllerComponent_Athena_C_On_Day_Phase_Change final
{
public:
	EFortDayPhase                                 CurrentDayPhase;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 PreviousDayPhase;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAtCreation;                                       // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AmbientControllerComponent_Athena_C_On_Day_Phase_Change) == 0x000001, "Wrong alignment on AmbientControllerComponent_Athena_C_On_Day_Phase_Change");
static_assert(sizeof(AmbientControllerComponent_Athena_C_On_Day_Phase_Change) == 0x000003, "Wrong size on AmbientControllerComponent_Athena_C_On_Day_Phase_Change");
static_assert(offsetof(AmbientControllerComponent_Athena_C_On_Day_Phase_Change, CurrentDayPhase) == 0x000000, "Member 'AmbientControllerComponent_Athena_C_On_Day_Phase_Change::CurrentDayPhase' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_On_Day_Phase_Change, PreviousDayPhase) == 0x000001, "Member 'AmbientControllerComponent_Athena_C_On_Day_Phase_Change::PreviousDayPhase' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_On_Day_Phase_Change, bAtCreation) == 0x000002, "Member 'AmbientControllerComponent_Athena_C_On_Day_Phase_Change::bAtCreation' has a wrong offset!");

// Function AmbientControllerComponent_Athena.AmbientControllerComponent_Athena_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct AmbientControllerComponent_Athena_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AmbientControllerComponent_Athena_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on AmbientControllerComponent_Athena_C_ReceiveEndPlay");
static_assert(sizeof(AmbientControllerComponent_Athena_C_ReceiveEndPlay) == 0x000001, "Wrong size on AmbientControllerComponent_Athena_C_ReceiveEndPlay");
static_assert(offsetof(AmbientControllerComponent_Athena_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'AmbientControllerComponent_Athena_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function AmbientControllerComponent_Athena.AmbientControllerComponent_Athena_C.Crossfade
// 0x0028 (0x0028 - 0x0000)
struct AmbientControllerComponent_Athena_C_Crossfade final
{
public:
	class USoundBase*                             NewSound;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             NewSoundLocal;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue2;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AmbientControllerComponent_Athena_C_Crossfade) == 0x000008, "Wrong alignment on AmbientControllerComponent_Athena_C_Crossfade");
static_assert(sizeof(AmbientControllerComponent_Athena_C_Crossfade) == 0x000028, "Wrong size on AmbientControllerComponent_Athena_C_Crossfade");
static_assert(offsetof(AmbientControllerComponent_Athena_C_Crossfade, NewSound) == 0x000000, "Member 'AmbientControllerComponent_Athena_C_Crossfade::NewSound' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_Crossfade, NewSoundLocal) == 0x000008, "Member 'AmbientControllerComponent_Athena_C_Crossfade::NewSoundLocal' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_Crossfade, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'AmbientControllerComponent_Athena_C_Crossfade::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_Crossfade, CallFunc_IsValid_ReturnValue2) == 0x000011, "Member 'AmbientControllerComponent_Athena_C_Crossfade::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_Crossfade, CallFunc_SpawnSound2D_ReturnValue) == 0x000018, "Member 'AmbientControllerComponent_Athena_C_Crossfade::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_Crossfade, CallFunc_SpawnSound2D_ReturnValue2) == 0x000020, "Member 'AmbientControllerComponent_Athena_C_Crossfade::CallFunc_SpawnSound2D_ReturnValue2' has a wrong offset!");

// Function AmbientControllerComponent_Athena.AmbientControllerComponent_Athena_C.Trace
// 0x00D0 (0x00D0 - 0x0000)
struct AmbientControllerComponent_Athena_C_Trace final
{
public:
	struct FVector                                Start;                                             // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Direction;                                         // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerPawn*>                CallFunc_GetAllFortPlayerPawns_OutFortPlayerPawns; // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0030(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x003C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0048(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AmbientControllerComponent_Athena_C_Trace) == 0x000008, "Wrong alignment on AmbientControllerComponent_Athena_C_Trace");
static_assert(sizeof(AmbientControllerComponent_Athena_C_Trace) == 0x0000D0, "Wrong size on AmbientControllerComponent_Athena_C_Trace");
static_assert(offsetof(AmbientControllerComponent_Athena_C_Trace, Start) == 0x000000, "Member 'AmbientControllerComponent_Athena_C_Trace::Start' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_Trace, Direction) == 0x00000C, "Member 'AmbientControllerComponent_Athena_C_Trace::Direction' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_Trace, ReturnValue) == 0x000018, "Member 'AmbientControllerComponent_Athena_C_Trace::ReturnValue' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_Trace, CallFunc_GetAllFortPlayerPawns_OutFortPlayerPawns) == 0x000020, "Member 'AmbientControllerComponent_Athena_C_Trace::CallFunc_GetAllFortPlayerPawns_OutFortPlayerPawns' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_Trace, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000030, "Member 'AmbientControllerComponent_Athena_C_Trace::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_Trace, CallFunc_Add_VectorVector_ReturnValue) == 0x00003C, "Member 'AmbientControllerComponent_Athena_C_Trace::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_Trace, CallFunc_LineTraceSingle_OutHit) == 0x000048, "Member 'AmbientControllerComponent_Athena_C_Trace::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_Trace, CallFunc_LineTraceSingle_ReturnValue) == 0x0000C8, "Member 'AmbientControllerComponent_Athena_C_Trace::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");

// Function AmbientControllerComponent_Athena.AmbientControllerComponent_Athena_C.SetIndoorMixEnabled
// 0x0010 (0x0010 - 0x0000)
struct AmbientControllerComponent_Athena_C_SetIndoorMixEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AmbientControllerComponent_Athena_C_SetIndoorMixEnabled) == 0x000008, "Wrong alignment on AmbientControllerComponent_Athena_C_SetIndoorMixEnabled");
static_assert(sizeof(AmbientControllerComponent_Athena_C_SetIndoorMixEnabled) == 0x000010, "Wrong size on AmbientControllerComponent_Athena_C_SetIndoorMixEnabled");
static_assert(offsetof(AmbientControllerComponent_Athena_C_SetIndoorMixEnabled, Enabled) == 0x000000, "Member 'AmbientControllerComponent_Athena_C_SetIndoorMixEnabled::Enabled' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_SetIndoorMixEnabled, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'AmbientControllerComponent_Athena_C_SetIndoorMixEnabled::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AmbientControllerComponent_Athena_C_SetIndoorMixEnabled, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000008, "Member 'AmbientControllerComponent_Athena_C_SetIndoorMixEnabled::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");

// Function AmbientControllerComponent_Athena.AmbientControllerComponent_Athena_C.SetTargetLPFFreq
// 0x0004 (0x0004 - 0x0000)
struct AmbientControllerComponent_Athena_C_SetTargetLPFFreq final
{
public:
	float                                         Target;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AmbientControllerComponent_Athena_C_SetTargetLPFFreq) == 0x000004, "Wrong alignment on AmbientControllerComponent_Athena_C_SetTargetLPFFreq");
static_assert(sizeof(AmbientControllerComponent_Athena_C_SetTargetLPFFreq) == 0x000004, "Wrong size on AmbientControllerComponent_Athena_C_SetTargetLPFFreq");
static_assert(offsetof(AmbientControllerComponent_Athena_C_SetTargetLPFFreq, Target) == 0x000000, "Member 'AmbientControllerComponent_Athena_C_SetTargetLPFFreq::Target' has a wrong offset!");

}

