#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Announcement_Basic

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function Announcement_Basic.Announcement_Basic_C.ExecuteUbergraph_Announcement_Basic
// 0x0070 (0x0070 - 0x0000)
struct Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortClientAnnouncement*                K2Node_Event_Announcement2;                        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortClientAnnouncement_Basic*          K2Node_DynamicCast_AsFort_Client_Announcement_Basic; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue2;                 // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue3;                 // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   K2Node_Select_Default;                             // 0x0030(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue4;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetBrushResource_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortClientAnnouncement*                K2Node_Event_Announcement;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic) == 0x000008, "Wrong alignment on Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic");
static_assert(sizeof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic) == 0x000070, "Wrong size on Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, EntryPoint) == 0x000000, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::EntryPoint' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, Temp_bool_Variable) == 0x000004, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, Temp_byte_Variable) == 0x000005, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, Temp_bool_Variable2) == 0x000006, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, CallFunc_IsUsingGamepad_ReturnValue) == 0x000010, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, K2Node_Event_Announcement2) == 0x000018, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::K2Node_Event_Announcement2' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, K2Node_DynamicCast_AsFort_Client_Announcement_Basic) == 0x000020, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::K2Node_DynamicCast_AsFort_Client_Announcement_Basic' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000029, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, CallFunc_TextIsEmpty_ReturnValue) == 0x00002A, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, CallFunc_Not_PreBool_ReturnValue) == 0x00002B, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, CallFunc_TextIsEmpty_ReturnValue2) == 0x00002C, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::CallFunc_TextIsEmpty_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, CallFunc_BooleanAND_ReturnValue) == 0x00002D, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, CallFunc_TextIsEmpty_ReturnValue3) == 0x00002E, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::CallFunc_TextIsEmpty_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, CallFunc_BooleanAND_ReturnValue2) == 0x00002F, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, K2Node_Select_Default) == 0x000030, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, CallFunc_TextIsEmpty_ReturnValue4) == 0x000048, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::CallFunc_TextIsEmpty_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, CallFunc_GetBrushResource_ReturnValue) == 0x000050, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::CallFunc_GetBrushResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, Temp_byte_Variable2) == 0x000058, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, K2Node_Event_Announcement) == 0x000060, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::K2Node_Event_Announcement' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, Temp_bool_Variable3) == 0x000068, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, Temp_byte_Variable3) == 0x000069, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, K2Node_Select2_Default) == 0x00006A, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, Temp_byte_Variable4) == 0x00006B, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic, K2Node_Select3_Default) == 0x00006C, "Member 'Announcement_Basic_C_ExecuteUbergraph_Announcement_Basic::K2Node_Select3_Default' has a wrong offset!");

// Function Announcement_Basic.Announcement_Basic_C.AnnouncementStopped
// 0x0008 (0x0008 - 0x0000)
struct Announcement_Basic_C_AnnouncementStopped final
{
public:
	class AFortClientAnnouncement*                Announcement;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Announcement_Basic_C_AnnouncementStopped) == 0x000008, "Wrong alignment on Announcement_Basic_C_AnnouncementStopped");
static_assert(sizeof(Announcement_Basic_C_AnnouncementStopped) == 0x000008, "Wrong size on Announcement_Basic_C_AnnouncementStopped");
static_assert(offsetof(Announcement_Basic_C_AnnouncementStopped, Announcement) == 0x000000, "Member 'Announcement_Basic_C_AnnouncementStopped::Announcement' has a wrong offset!");

// Function Announcement_Basic.Announcement_Basic_C.UpdateWidgetData
// 0x0008 (0x0008 - 0x0000)
struct Announcement_Basic_C_UpdateWidgetData final
{
public:
	class AFortClientAnnouncement*                Announcement;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Announcement_Basic_C_UpdateWidgetData) == 0x000008, "Wrong alignment on Announcement_Basic_C_UpdateWidgetData");
static_assert(sizeof(Announcement_Basic_C_UpdateWidgetData) == 0x000008, "Wrong size on Announcement_Basic_C_UpdateWidgetData");
static_assert(offsetof(Announcement_Basic_C_UpdateWidgetData, Announcement) == 0x000000, "Member 'Announcement_Basic_C_UpdateWidgetData::Announcement' has a wrong offset!");

}

