#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Announcement_Layout

#include "Basic.hpp"


namespace SDK::Params
{

// Function Announcement_Layout.Announcement_Layout_C.ExecuteUbergraph_Announcement_Layout
// 0x0030 (0x0030 - 0x0000)
struct Announcement_Layout_C_ExecuteUbergraph_Announcement_Layout final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortClientAnnouncement*                K2Node_CustomEvent_NewAnnouncement;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortTutorialContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortClientAnnouncement* NewAnnouncement)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(Announcement_Layout_C_ExecuteUbergraph_Announcement_Layout) == 0x000008, "Wrong alignment on Announcement_Layout_C_ExecuteUbergraph_Announcement_Layout");
static_assert(sizeof(Announcement_Layout_C_ExecuteUbergraph_Announcement_Layout) == 0x000030, "Wrong size on Announcement_Layout_C_ExecuteUbergraph_Announcement_Layout");
static_assert(offsetof(Announcement_Layout_C_ExecuteUbergraph_Announcement_Layout, EntryPoint) == 0x000000, "Member 'Announcement_Layout_C_ExecuteUbergraph_Announcement_Layout::EntryPoint' has a wrong offset!");
static_assert(offsetof(Announcement_Layout_C_ExecuteUbergraph_Announcement_Layout, K2Node_CustomEvent_NewAnnouncement) == 0x000008, "Member 'Announcement_Layout_C_ExecuteUbergraph_Announcement_Layout::K2Node_CustomEvent_NewAnnouncement' has a wrong offset!");
static_assert(offsetof(Announcement_Layout_C_ExecuteUbergraph_Announcement_Layout, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'Announcement_Layout_C_ExecuteUbergraph_Announcement_Layout::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Layout_C_ExecuteUbergraph_Announcement_Layout, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'Announcement_Layout_C_ExecuteUbergraph_Announcement_Layout::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Layout_C_ExecuteUbergraph_Announcement_Layout, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'Announcement_Layout_C_ExecuteUbergraph_Announcement_Layout::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function Announcement_Layout.Announcement_Layout_C.OnStartNewAnnouncement
// 0x0008 (0x0008 - 0x0000)
struct Announcement_Layout_C_OnStartNewAnnouncement final
{
public:
	class AFortClientAnnouncement*                NewAnnouncement;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Announcement_Layout_C_OnStartNewAnnouncement) == 0x000008, "Wrong alignment on Announcement_Layout_C_OnStartNewAnnouncement");
static_assert(sizeof(Announcement_Layout_C_OnStartNewAnnouncement) == 0x000008, "Wrong size on Announcement_Layout_C_OnStartNewAnnouncement");
static_assert(offsetof(Announcement_Layout_C_OnStartNewAnnouncement, NewAnnouncement) == 0x000000, "Member 'Announcement_Layout_C_OnStartNewAnnouncement::NewAnnouncement' has a wrong offset!");

// Function Announcement_Layout.Announcement_Layout_C.SwapAnnouncementUIContent
// 0x0030 (0x0030 - 0x0000)
struct Announcement_Layout_C_SwapAnnouncementUIContent final
{
public:
	class AFortClientAnnouncement*                NewAnnouncement;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortClientAnnouncement_Basic*          K2Node_DynamicCast_AsFort_Client_Announcement_Basic; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAnnouncementWidget*                CallFunc_CreateAnnouncementWidget_NewWidget;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Announcement_Layout_C_SwapAnnouncementUIContent) == 0x000008, "Wrong alignment on Announcement_Layout_C_SwapAnnouncementUIContent");
static_assert(sizeof(Announcement_Layout_C_SwapAnnouncementUIContent) == 0x000030, "Wrong size on Announcement_Layout_C_SwapAnnouncementUIContent");
static_assert(offsetof(Announcement_Layout_C_SwapAnnouncementUIContent, NewAnnouncement) == 0x000000, "Member 'Announcement_Layout_C_SwapAnnouncementUIContent::NewAnnouncement' has a wrong offset!");
static_assert(offsetof(Announcement_Layout_C_SwapAnnouncementUIContent, K2Node_DynamicCast_AsFort_Client_Announcement_Basic) == 0x000008, "Member 'Announcement_Layout_C_SwapAnnouncementUIContent::K2Node_DynamicCast_AsFort_Client_Announcement_Basic' has a wrong offset!");
static_assert(offsetof(Announcement_Layout_C_SwapAnnouncementUIContent, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'Announcement_Layout_C_SwapAnnouncementUIContent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Announcement_Layout_C_SwapAnnouncementUIContent, CallFunc_CreateAnnouncementWidget_NewWidget) == 0x000018, "Member 'Announcement_Layout_C_SwapAnnouncementUIContent::CallFunc_CreateAnnouncementWidget_NewWidget' has a wrong offset!");
static_assert(offsetof(Announcement_Layout_C_SwapAnnouncementUIContent, CallFunc_AddChild_ReturnValue) == 0x000020, "Member 'Announcement_Layout_C_SwapAnnouncementUIContent::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Layout_C_SwapAnnouncementUIContent, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'Announcement_Layout_C_SwapAnnouncementUIContent::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function Announcement_Layout.Announcement_Layout_C.CreateAnnouncementWidget
// 0x0058 (0x0058 - 0x0000)
struct Announcement_Layout_C_CreateAnnouncementWidget final
{
public:
	class UClass*                                 NewWidgetClass;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ForceCreateUI;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAnnouncementWidget*                NewWidget;                                         // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_ReturnValue2;                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAnnouncementWidget*                K2Node_DynamicCast_AsFort_Announcement_Widget;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAnnouncementWidget*                K2Node_DynamicCast_AsFort_Announcement_Widget2;    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Announcement_Layout_C_CreateAnnouncementWidget) == 0x000008, "Wrong alignment on Announcement_Layout_C_CreateAnnouncementWidget");
static_assert(sizeof(Announcement_Layout_C_CreateAnnouncementWidget) == 0x000058, "Wrong size on Announcement_Layout_C_CreateAnnouncementWidget");
static_assert(offsetof(Announcement_Layout_C_CreateAnnouncementWidget, NewWidgetClass) == 0x000000, "Member 'Announcement_Layout_C_CreateAnnouncementWidget::NewWidgetClass' has a wrong offset!");
static_assert(offsetof(Announcement_Layout_C_CreateAnnouncementWidget, ForceCreateUI) == 0x000008, "Member 'Announcement_Layout_C_CreateAnnouncementWidget::ForceCreateUI' has a wrong offset!");
static_assert(offsetof(Announcement_Layout_C_CreateAnnouncementWidget, NewWidget) == 0x000010, "Member 'Announcement_Layout_C_CreateAnnouncementWidget::NewWidget' has a wrong offset!");
static_assert(offsetof(Announcement_Layout_C_CreateAnnouncementWidget, CallFunc_IsValidClass_ReturnValue) == 0x000018, "Member 'Announcement_Layout_C_CreateAnnouncementWidget::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Layout_C_CreateAnnouncementWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'Announcement_Layout_C_CreateAnnouncementWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Layout_C_CreateAnnouncementWidget, CallFunc_Create_ReturnValue) == 0x000028, "Member 'Announcement_Layout_C_CreateAnnouncementWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Announcement_Layout_C_CreateAnnouncementWidget, CallFunc_Create_ReturnValue2) == 0x000030, "Member 'Announcement_Layout_C_CreateAnnouncementWidget::CallFunc_Create_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Announcement_Layout_C_CreateAnnouncementWidget, K2Node_DynamicCast_AsFort_Announcement_Widget) == 0x000038, "Member 'Announcement_Layout_C_CreateAnnouncementWidget::K2Node_DynamicCast_AsFort_Announcement_Widget' has a wrong offset!");
static_assert(offsetof(Announcement_Layout_C_CreateAnnouncementWidget, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'Announcement_Layout_C_CreateAnnouncementWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Announcement_Layout_C_CreateAnnouncementWidget, K2Node_DynamicCast_AsFort_Announcement_Widget2) == 0x000048, "Member 'Announcement_Layout_C_CreateAnnouncementWidget::K2Node_DynamicCast_AsFort_Announcement_Widget2' has a wrong offset!");
static_assert(offsetof(Announcement_Layout_C_CreateAnnouncementWidget, K2Node_DynamicCast_bSuccess2) == 0x000050, "Member 'Announcement_Layout_C_CreateAnnouncementWidget::K2Node_DynamicCast_bSuccess2' has a wrong offset!");

}

