#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Announce_Gen_Quest_Conversation_FrontEndRewards

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Announce_Gen_Quest_Conversation_FrontEndRewards.Announce_Gen_Quest_Conversation_FrontEndRewards_C
// 0x0028 (0x0450 - 0x0428)
class AAnnounce_Gen_Quest_Conversation_FrontEndRewards_C final : public AFortClientAnnouncement_Conversation
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0428(0x0008)(Transient, DuplicateTransient)
	UMulticastDelegateProperty_                   OnNewSentence;                                     // 0x0430(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnCurrentConversationFinished;                     // 0x0440(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnNewSentence__DelegateSignature(const struct FFortConversationSentence& Sentence);
	void OnCurrentConversationFinished__DelegateSignature();
	void ExecuteUbergraph_Announce_Gen_Quest_Conversation_FrontEndRewards(int32 EntryPoint);
	void OnSentenceStarted(const struct FFortConversationSentence& Sentence, int32 SentenceIndex);
	void OnConversationFinished(const struct FFortConversationSentence& FinishingSentence, int32 FinishingSentenceSentenceIndex);
	void UserConstructionScript();
	void PlayCurrentConversation();
	void StopCurrentConversation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Announce_Gen_Quest_Conversation_FrontEndRewards_C">();
	}
	static class AAnnounce_Gen_Quest_Conversation_FrontEndRewards_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAnnounce_Gen_Quest_Conversation_FrontEndRewards_C>();
	}
};
static_assert(alignof(AAnnounce_Gen_Quest_Conversation_FrontEndRewards_C) == 0x000008, "Wrong alignment on AAnnounce_Gen_Quest_Conversation_FrontEndRewards_C");
static_assert(sizeof(AAnnounce_Gen_Quest_Conversation_FrontEndRewards_C) == 0x000450, "Wrong size on AAnnounce_Gen_Quest_Conversation_FrontEndRewards_C");
static_assert(offsetof(AAnnounce_Gen_Quest_Conversation_FrontEndRewards_C, UberGraphFrame) == 0x000428, "Member 'AAnnounce_Gen_Quest_Conversation_FrontEndRewards_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAnnounce_Gen_Quest_Conversation_FrontEndRewards_C, OnNewSentence) == 0x000430, "Member 'AAnnounce_Gen_Quest_Conversation_FrontEndRewards_C::OnNewSentence' has a wrong offset!");
static_assert(offsetof(AAnnounce_Gen_Quest_Conversation_FrontEndRewards_C, OnCurrentConversationFinished) == 0x000440, "Member 'AAnnounce_Gen_Quest_Conversation_FrontEndRewards_C::OnCurrentConversationFinished' has a wrong offset!");

}

