#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Announce_Gen_Quest_Conversation_FrontEndRewards

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function Announce_Gen_Quest_Conversation_FrontEndRewards.Announce_Gen_Quest_Conversation_FrontEndRewards_C.OnNewSentence__DelegateSignature
// 0x00C8 (0x00C8 - 0x0000)
struct Announce_Gen_Quest_Conversation_FrontEndRewards_C_OnNewSentence__DelegateSignature final
{
public:
	struct FFortConversationSentence              Sentence;                                          // 0x0000(0x00C8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Announce_Gen_Quest_Conversation_FrontEndRewards_C_OnNewSentence__DelegateSignature) == 0x000008, "Wrong alignment on Announce_Gen_Quest_Conversation_FrontEndRewards_C_OnNewSentence__DelegateSignature");
static_assert(sizeof(Announce_Gen_Quest_Conversation_FrontEndRewards_C_OnNewSentence__DelegateSignature) == 0x0000C8, "Wrong size on Announce_Gen_Quest_Conversation_FrontEndRewards_C_OnNewSentence__DelegateSignature");
static_assert(offsetof(Announce_Gen_Quest_Conversation_FrontEndRewards_C_OnNewSentence__DelegateSignature, Sentence) == 0x000000, "Member 'Announce_Gen_Quest_Conversation_FrontEndRewards_C_OnNewSentence__DelegateSignature::Sentence' has a wrong offset!");

// Function Announce_Gen_Quest_Conversation_FrontEndRewards.Announce_Gen_Quest_Conversation_FrontEndRewards_C.ExecuteUbergraph_Announce_Gen_Quest_Conversation_FrontEndRewards
// 0x01A8 (0x01A8 - 0x0000)
struct Announce_Gen_Quest_Conversation_FrontEndRewards_C_ExecuteUbergraph_Announce_Gen_Quest_Conversation_FrontEndRewards final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortConversationSentence              K2Node_Event_FinishingSentence;                    // 0x0008(0x00C8)()
	int32                                         K2Node_Event_FinishingSentenceSentenceIndex;       // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortConversationSentence              K2Node_Event_Sentence;                             // 0x00D8(0x00C8)()
	int32                                         K2Node_Event_SentenceIndex;                        // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Announce_Gen_Quest_Conversation_FrontEndRewards_C_ExecuteUbergraph_Announce_Gen_Quest_Conversation_FrontEndRewards) == 0x000008, "Wrong alignment on Announce_Gen_Quest_Conversation_FrontEndRewards_C_ExecuteUbergraph_Announce_Gen_Quest_Conversation_FrontEndRewards");
static_assert(sizeof(Announce_Gen_Quest_Conversation_FrontEndRewards_C_ExecuteUbergraph_Announce_Gen_Quest_Conversation_FrontEndRewards) == 0x0001A8, "Wrong size on Announce_Gen_Quest_Conversation_FrontEndRewards_C_ExecuteUbergraph_Announce_Gen_Quest_Conversation_FrontEndRewards");
static_assert(offsetof(Announce_Gen_Quest_Conversation_FrontEndRewards_C_ExecuteUbergraph_Announce_Gen_Quest_Conversation_FrontEndRewards, EntryPoint) == 0x000000, "Member 'Announce_Gen_Quest_Conversation_FrontEndRewards_C_ExecuteUbergraph_Announce_Gen_Quest_Conversation_FrontEndRewards::EntryPoint' has a wrong offset!");
static_assert(offsetof(Announce_Gen_Quest_Conversation_FrontEndRewards_C_ExecuteUbergraph_Announce_Gen_Quest_Conversation_FrontEndRewards, K2Node_Event_FinishingSentence) == 0x000008, "Member 'Announce_Gen_Quest_Conversation_FrontEndRewards_C_ExecuteUbergraph_Announce_Gen_Quest_Conversation_FrontEndRewards::K2Node_Event_FinishingSentence' has a wrong offset!");
static_assert(offsetof(Announce_Gen_Quest_Conversation_FrontEndRewards_C_ExecuteUbergraph_Announce_Gen_Quest_Conversation_FrontEndRewards, K2Node_Event_FinishingSentenceSentenceIndex) == 0x0000D0, "Member 'Announce_Gen_Quest_Conversation_FrontEndRewards_C_ExecuteUbergraph_Announce_Gen_Quest_Conversation_FrontEndRewards::K2Node_Event_FinishingSentenceSentenceIndex' has a wrong offset!");
static_assert(offsetof(Announce_Gen_Quest_Conversation_FrontEndRewards_C_ExecuteUbergraph_Announce_Gen_Quest_Conversation_FrontEndRewards, K2Node_Event_Sentence) == 0x0000D8, "Member 'Announce_Gen_Quest_Conversation_FrontEndRewards_C_ExecuteUbergraph_Announce_Gen_Quest_Conversation_FrontEndRewards::K2Node_Event_Sentence' has a wrong offset!");
static_assert(offsetof(Announce_Gen_Quest_Conversation_FrontEndRewards_C_ExecuteUbergraph_Announce_Gen_Quest_Conversation_FrontEndRewards, K2Node_Event_SentenceIndex) == 0x0001A0, "Member 'Announce_Gen_Quest_Conversation_FrontEndRewards_C_ExecuteUbergraph_Announce_Gen_Quest_Conversation_FrontEndRewards::K2Node_Event_SentenceIndex' has a wrong offset!");

// Function Announce_Gen_Quest_Conversation_FrontEndRewards.Announce_Gen_Quest_Conversation_FrontEndRewards_C.OnSentenceStarted
// 0x00D0 (0x00D0 - 0x0000)
struct Announce_Gen_Quest_Conversation_FrontEndRewards_C_OnSentenceStarted final
{
public:
	struct FFortConversationSentence              Sentence;                                          // 0x0000(0x00C8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         SentenceIndex;                                     // 0x00C8(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Announce_Gen_Quest_Conversation_FrontEndRewards_C_OnSentenceStarted) == 0x000008, "Wrong alignment on Announce_Gen_Quest_Conversation_FrontEndRewards_C_OnSentenceStarted");
static_assert(sizeof(Announce_Gen_Quest_Conversation_FrontEndRewards_C_OnSentenceStarted) == 0x0000D0, "Wrong size on Announce_Gen_Quest_Conversation_FrontEndRewards_C_OnSentenceStarted");
static_assert(offsetof(Announce_Gen_Quest_Conversation_FrontEndRewards_C_OnSentenceStarted, Sentence) == 0x000000, "Member 'Announce_Gen_Quest_Conversation_FrontEndRewards_C_OnSentenceStarted::Sentence' has a wrong offset!");
static_assert(offsetof(Announce_Gen_Quest_Conversation_FrontEndRewards_C_OnSentenceStarted, SentenceIndex) == 0x0000C8, "Member 'Announce_Gen_Quest_Conversation_FrontEndRewards_C_OnSentenceStarted::SentenceIndex' has a wrong offset!");

// Function Announce_Gen_Quest_Conversation_FrontEndRewards.Announce_Gen_Quest_Conversation_FrontEndRewards_C.OnConversationFinished
// 0x00D0 (0x00D0 - 0x0000)
struct Announce_Gen_Quest_Conversation_FrontEndRewards_C_OnConversationFinished final
{
public:
	struct FFortConversationSentence              FinishingSentence;                                 // 0x0000(0x00C8)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         FinishingSentenceSentenceIndex;                    // 0x00C8(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Announce_Gen_Quest_Conversation_FrontEndRewards_C_OnConversationFinished) == 0x000008, "Wrong alignment on Announce_Gen_Quest_Conversation_FrontEndRewards_C_OnConversationFinished");
static_assert(sizeof(Announce_Gen_Quest_Conversation_FrontEndRewards_C_OnConversationFinished) == 0x0000D0, "Wrong size on Announce_Gen_Quest_Conversation_FrontEndRewards_C_OnConversationFinished");
static_assert(offsetof(Announce_Gen_Quest_Conversation_FrontEndRewards_C_OnConversationFinished, FinishingSentence) == 0x000000, "Member 'Announce_Gen_Quest_Conversation_FrontEndRewards_C_OnConversationFinished::FinishingSentence' has a wrong offset!");
static_assert(offsetof(Announce_Gen_Quest_Conversation_FrontEndRewards_C_OnConversationFinished, FinishingSentenceSentenceIndex) == 0x0000C8, "Member 'Announce_Gen_Quest_Conversation_FrontEndRewards_C_OnConversationFinished::FinishingSentenceSentenceIndex' has a wrong offset!");

// Function Announce_Gen_Quest_Conversation_FrontEndRewards.Announce_Gen_Quest_Conversation_FrontEndRewards_C.PlayCurrentConversation
// 0x0001 (0x0001 - 0x0000)
struct Announce_Gen_Quest_Conversation_FrontEndRewards_C_PlayCurrentConversation final
{
public:
	bool                                          CallFunc_PlayConversation_ReturnValue;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Announce_Gen_Quest_Conversation_FrontEndRewards_C_PlayCurrentConversation) == 0x000001, "Wrong alignment on Announce_Gen_Quest_Conversation_FrontEndRewards_C_PlayCurrentConversation");
static_assert(sizeof(Announce_Gen_Quest_Conversation_FrontEndRewards_C_PlayCurrentConversation) == 0x000001, "Wrong size on Announce_Gen_Quest_Conversation_FrontEndRewards_C_PlayCurrentConversation");
static_assert(offsetof(Announce_Gen_Quest_Conversation_FrontEndRewards_C_PlayCurrentConversation, CallFunc_PlayConversation_ReturnValue) == 0x000000, "Member 'Announce_Gen_Quest_Conversation_FrontEndRewards_C_PlayCurrentConversation::CallFunc_PlayConversation_ReturnValue' has a wrong offset!");

}

