#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaCustomizationTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_structs.hpp"


namespace SDK::Params
{

// Function AthenaCustomizationTab.AthenaCustomizationTab_C.ExecuteUbergraph_AthenaCustomizationTab
// 0x0138 (0x0138 - 0x0000)
struct AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable4;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable5;                                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCustomizationSlotButtonWrapper_C* CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCustomizationSlotButtonWrapper_C* CallFunc_Array_Get_Item2;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue2;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button3;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaBannerSelectModal_C*             CallFunc_Create_ReturnValue;                       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAthenaCustomizationCategory CustomizationType, class FText BannerLabel, class FText CustomizationDescription, int32 SubslotIndex)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable6;                                // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAthenaCustomizationCategory CustomizationType, class UCommonButton* Button, class FText BannerLabel, int32 Subslot_Index)> K2Node_CreateDelegate_OutputDelegate3;             // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue6;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCustomizationSlotButtonWrapper_C* CallFunc_Array_Get_Item3;                          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bUsingGamepad;                        // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCustomizationSlotButtonWrapper_C* CallFunc_Array_Get_Item4;                          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAthenaCustomizationSlotButtonWrapper_C*> K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCustomizationSlotButtonWrapper_C* CallFunc_Array_Get_Item5;                          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue5;                // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* CallFunc_Array_Get_Item6;                          // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue5;                 // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue6;                // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue6;                 // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab) == 0x000008, "Wrong alignment on AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab");
static_assert(sizeof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab) == 0x000138, "Wrong size on AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, EntryPoint) == 0x000000, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, Temp_int_Variable) == 0x000004, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, Temp_int_Variable2) == 0x000008, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_Add_IntInt_ReturnValue2) == 0x000010, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, Temp_int_Variable3) == 0x000014, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, Temp_int_Variable4) == 0x000018, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::Temp_int_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_Add_IntInt_ReturnValue3) == 0x00001C, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_Add_IntInt_ReturnValue4) == 0x000020, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, Temp_int_Variable5) == 0x000024, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::Temp_int_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_Add_IntInt_ReturnValue5) == 0x000028, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_GetContext_ReturnValue) == 0x000040, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_Array_Get_Item) == 0x000050, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_Array_Length_ReturnValue2) == 0x000058, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_Array_Get_Item2) == 0x000060, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_Array_Length_ReturnValue3) == 0x000068, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_Less_IntInt_ReturnValue2) == 0x00006C, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000070, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_GetUIManagerWidget_ReturnValue2) == 0x000078, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_GetUIManagerWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_GetOwningPlayer_ReturnValue) == 0x000080, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, K2Node_ComponentBoundEvent_Button3) == 0x000088, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_Create_ReturnValue) == 0x000090, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, K2Node_CreateDelegate_OutputDelegate2) == 0x000098, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, Temp_int_Variable6) == 0x0000A8, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::Temp_int_Variable6' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, K2Node_CreateDelegate_OutputDelegate3) == 0x0000B0, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_Add_IntInt_ReturnValue6) == 0x0000C0, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_Add_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_Array_Get_Item3) == 0x0000C8, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_Less_IntInt_ReturnValue3) == 0x0000D0, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, K2Node_ComponentBoundEvent_Button2) == 0x0000D8, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, K2Node_ComponentBoundEvent_Button) == 0x0000E0, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, K2Node_Event_bUsingGamepad) == 0x0000E8, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::K2Node_Event_bUsingGamepad' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_Array_Get_Item4) == 0x0000F0, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, K2Node_MakeArray_Array) == 0x0000F8, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_Array_Length_ReturnValue4) == 0x000108, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_Array_Get_Item5) == 0x000110, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_Less_IntInt_ReturnValue4) == 0x000118, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_Less_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_Array_Length_ReturnValue5) == 0x00011C, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_Array_Length_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_Array_Get_Item6) == 0x000120, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_Array_Get_Item6' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_Less_IntInt_ReturnValue5) == 0x000128, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_Less_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_Array_Length_ReturnValue6) == 0x00012C, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_Array_Length_ReturnValue6' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab, CallFunc_Less_IntInt_ReturnValue6) == 0x000130, "Member 'AthenaCustomizationTab_C_ExecuteUbergraph_AthenaCustomizationTab::CallFunc_Less_IntInt_ReturnValue6' has a wrong offset!");

// Function AthenaCustomizationTab.AthenaCustomizationTab_C.OnInputModeChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaCustomizationTab_C_OnInputModeChanged final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaCustomizationTab_C_OnInputModeChanged) == 0x000001, "Wrong alignment on AthenaCustomizationTab_C_OnInputModeChanged");
static_assert(sizeof(AthenaCustomizationTab_C_OnInputModeChanged) == 0x000001, "Wrong size on AthenaCustomizationTab_C_OnInputModeChanged");
static_assert(offsetof(AthenaCustomizationTab_C_OnInputModeChanged, bUsingGamepad) == 0x000000, "Member 'AthenaCustomizationTab_C_OnInputModeChanged::bUsingGamepad' has a wrong offset!");

// Function AthenaCustomizationTab.AthenaCustomizationTab_C.BndEvt__BannerSlot_K2Node_ComponentBoundEvent_561_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaCustomizationTab_C_BndEvt__BannerSlot_K2Node_ComponentBoundEvent_561_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationTab_C_BndEvt__BannerSlot_K2Node_ComponentBoundEvent_561_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaCustomizationTab_C_BndEvt__BannerSlot_K2Node_ComponentBoundEvent_561_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaCustomizationTab_C_BndEvt__BannerSlot_K2Node_ComponentBoundEvent_561_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaCustomizationTab_C_BndEvt__BannerSlot_K2Node_ComponentBoundEvent_561_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaCustomizationTab_C_BndEvt__BannerSlot_K2Node_ComponentBoundEvent_561_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaCustomizationTab_C_BndEvt__BannerSlot_K2Node_ComponentBoundEvent_561_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaCustomizationTab.AthenaCustomizationTab_C.BndEvt__BannerSlot_K2Node_ComponentBoundEvent_547_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaCustomizationTab_C_BndEvt__BannerSlot_K2Node_ComponentBoundEvent_547_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationTab_C_BndEvt__BannerSlot_K2Node_ComponentBoundEvent_547_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaCustomizationTab_C_BndEvt__BannerSlot_K2Node_ComponentBoundEvent_547_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaCustomizationTab_C_BndEvt__BannerSlot_K2Node_ComponentBoundEvent_547_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaCustomizationTab_C_BndEvt__BannerSlot_K2Node_ComponentBoundEvent_547_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaCustomizationTab_C_BndEvt__BannerSlot_K2Node_ComponentBoundEvent_547_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaCustomizationTab_C_BndEvt__BannerSlot_K2Node_ComponentBoundEvent_547_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaCustomizationTab.AthenaCustomizationTab_C.BndEvt__AthenaCustomizationBannerButton_490_K2Node_ComponentBoundEvent_205_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaCustomizationTab_C_BndEvt__AthenaCustomizationBannerButton_490_K2Node_ComponentBoundEvent_205_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationTab_C_BndEvt__AthenaCustomizationBannerButton_490_K2Node_ComponentBoundEvent_205_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaCustomizationTab_C_BndEvt__AthenaCustomizationBannerButton_490_K2Node_ComponentBoundEvent_205_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaCustomizationTab_C_BndEvt__AthenaCustomizationBannerButton_490_K2Node_ComponentBoundEvent_205_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaCustomizationTab_C_BndEvt__AthenaCustomizationBannerButton_490_K2Node_ComponentBoundEvent_205_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaCustomizationTab_C_BndEvt__AthenaCustomizationBannerButton_490_K2Node_ComponentBoundEvent_205_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaCustomizationTab_C_BndEvt__AthenaCustomizationBannerButton_490_K2Node_ComponentBoundEvent_205_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaCustomizationTab.AthenaCustomizationTab_C.HandleCancel
// 0x0001 (0x0001 - 0x0000)
struct AthenaCustomizationTab_C_HandleCancel final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaCustomizationTab_C_HandleCancel) == 0x000001, "Wrong alignment on AthenaCustomizationTab_C_HandleCancel");
static_assert(sizeof(AthenaCustomizationTab_C_HandleCancel) == 0x000001, "Wrong size on AthenaCustomizationTab_C_HandleCancel");
static_assert(offsetof(AthenaCustomizationTab_C_HandleCancel, Passthrough) == 0x000000, "Member 'AthenaCustomizationTab_C_HandleCancel::Passthrough' has a wrong offset!");

// Function AthenaCustomizationTab.AthenaCustomizationTab_C.RegisterCancel
// 0x0020 (0x0020 - 0x0000)
struct AthenaCustomizationTab_C_RegisterCancel final
{
public:
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0010(0x0010)(NoDestructor)
};
static_assert(alignof(AthenaCustomizationTab_C_RegisterCancel) == 0x000008, "Wrong alignment on AthenaCustomizationTab_C_RegisterCancel");
static_assert(sizeof(AthenaCustomizationTab_C_RegisterCancel) == 0x000020, "Wrong size on AthenaCustomizationTab_C_RegisterCancel");
static_assert(offsetof(AthenaCustomizationTab_C_RegisterCancel, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AthenaCustomizationTab_C_RegisterCancel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_RegisterCancel, K2Node_MakeStruct_DataTableRowHandle) == 0x000010, "Member 'AthenaCustomizationTab_C_RegisterCancel::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");

// Function AthenaCustomizationTab.AthenaCustomizationTab_C.BeginPickingCustomization
// 0x0030 (0x0030 - 0x0000)
struct AthenaCustomizationTab_C_BeginPickingCustomization final
{
public:
	EAthenaCustomizationCategory                  Category;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          WidgetToReturnFocusTo;                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Param_HeaderText;                                  // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Subslot_Index;                                     // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaCustomizationCategory                  NewLocalVar_0;                                     // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationTab_C_BeginPickingCustomization) == 0x000008, "Wrong alignment on AthenaCustomizationTab_C_BeginPickingCustomization");
static_assert(sizeof(AthenaCustomizationTab_C_BeginPickingCustomization) == 0x000030, "Wrong size on AthenaCustomizationTab_C_BeginPickingCustomization");
static_assert(offsetof(AthenaCustomizationTab_C_BeginPickingCustomization, Category) == 0x000000, "Member 'AthenaCustomizationTab_C_BeginPickingCustomization::Category' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_BeginPickingCustomization, WidgetToReturnFocusTo) == 0x000008, "Member 'AthenaCustomizationTab_C_BeginPickingCustomization::WidgetToReturnFocusTo' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_BeginPickingCustomization, Param_HeaderText) == 0x000010, "Member 'AthenaCustomizationTab_C_BeginPickingCustomization::Param_HeaderText' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_BeginPickingCustomization, Subslot_Index) == 0x000028, "Member 'AthenaCustomizationTab_C_BeginPickingCustomization::Subslot_Index' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_BeginPickingCustomization, NewLocalVar_0) == 0x00002C, "Member 'AthenaCustomizationTab_C_BeginPickingCustomization::NewLocalVar_0' has a wrong offset!");

// Function AthenaCustomizationTab.AthenaCustomizationTab_C.EndPickingCustomization
// 0x0020 (0x0020 - 0x0000)
struct AthenaCustomizationTab_C_EndPickingCustomization final
{
public:
	bool                                          RestoreFocus;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationTab_C_EndPickingCustomization) == 0x000008, "Wrong alignment on AthenaCustomizationTab_C_EndPickingCustomization");
static_assert(sizeof(AthenaCustomizationTab_C_EndPickingCustomization) == 0x000020, "Wrong size on AthenaCustomizationTab_C_EndPickingCustomization");
static_assert(offsetof(AthenaCustomizationTab_C_EndPickingCustomization, RestoreFocus) == 0x000000, "Member 'AthenaCustomizationTab_C_EndPickingCustomization::RestoreFocus' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_EndPickingCustomization, Temp_float_Variable) == 0x000004, "Member 'AthenaCustomizationTab_C_EndPickingCustomization::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_EndPickingCustomization, CallFunc_GetEndTime_ReturnValue) == 0x000008, "Member 'AthenaCustomizationTab_C_EndPickingCustomization::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_EndPickingCustomization, CallFunc_IsActivated_ReturnValue) == 0x00000C, "Member 'AthenaCustomizationTab_C_EndPickingCustomization::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_EndPickingCustomization, Temp_bool_Variable) == 0x00000D, "Member 'AthenaCustomizationTab_C_EndPickingCustomization::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_EndPickingCustomization, CallFunc_GetUINavigationManager_ReturnValue) == 0x000010, "Member 'AthenaCustomizationTab_C_EndPickingCustomization::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_EndPickingCustomization, K2Node_Select_Default) == 0x000018, "Member 'AthenaCustomizationTab_C_EndPickingCustomization::K2Node_Select_Default' has a wrong offset!");

// Function AthenaCustomizationTab.AthenaCustomizationTab_C.RefreshInputActions
// 0x0020 (0x0020 - 0x0000)
struct AthenaCustomizationTab_C_RefreshInputActions final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInputActionState                             Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputActionState                             Temp_byte_Variable2;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0008(0x0010)(NoDestructor)
	EInputActionState                             K2Node_Select_Default;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationTab_C_RefreshInputActions) == 0x000008, "Wrong alignment on AthenaCustomizationTab_C_RefreshInputActions");
static_assert(sizeof(AthenaCustomizationTab_C_RefreshInputActions) == 0x000020, "Wrong size on AthenaCustomizationTab_C_RefreshInputActions");
static_assert(offsetof(AthenaCustomizationTab_C_RefreshInputActions, Temp_bool_Variable) == 0x000000, "Member 'AthenaCustomizationTab_C_RefreshInputActions::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_RefreshInputActions, Temp_byte_Variable) == 0x000001, "Member 'AthenaCustomizationTab_C_RefreshInputActions::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_RefreshInputActions, Temp_byte_Variable2) == 0x000002, "Member 'AthenaCustomizationTab_C_RefreshInputActions::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_RefreshInputActions, K2Node_MakeStruct_DataTableRowHandle) == 0x000008, "Member 'AthenaCustomizationTab_C_RefreshInputActions::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_RefreshInputActions, K2Node_Select_Default) == 0x000018, "Member 'AthenaCustomizationTab_C_RefreshInputActions::K2Node_Select_Default' has a wrong offset!");

// Function AthenaCustomizationTab.AthenaCustomizationTab_C.ShowThrobber
// 0x00D0 (0x00D0 - 0x0000)
struct AthenaCustomizationTab_C_ShowThrobber final
{
public:
	class UFortUIManagerWidget_NUI*               UIManager;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)(ConstParm)
	class FText                                   Temp_text_Variable2;                               // 0x0020(0x0018)(ConstParm)
	struct FSlateBrush                            CallFunc_NoResourceBrush_ReturnValue;              // 0x0038(0x0078)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProgressModalWidget_C*                 CallFunc_Create_ReturnValue;                       // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationTab_C_ShowThrobber) == 0x000008, "Wrong alignment on AthenaCustomizationTab_C_ShowThrobber");
static_assert(sizeof(AthenaCustomizationTab_C_ShowThrobber) == 0x0000D0, "Wrong size on AthenaCustomizationTab_C_ShowThrobber");
static_assert(offsetof(AthenaCustomizationTab_C_ShowThrobber, UIManager) == 0x000000, "Member 'AthenaCustomizationTab_C_ShowThrobber::UIManager' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ShowThrobber, Temp_text_Variable) == 0x000008, "Member 'AthenaCustomizationTab_C_ShowThrobber::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ShowThrobber, Temp_text_Variable2) == 0x000020, "Member 'AthenaCustomizationTab_C_ShowThrobber::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ShowThrobber, CallFunc_NoResourceBrush_ReturnValue) == 0x000038, "Member 'AthenaCustomizationTab_C_ShowThrobber::CallFunc_NoResourceBrush_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ShowThrobber, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'AthenaCustomizationTab_C_ShowThrobber::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ShowThrobber, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000B8, "Member 'AthenaCustomizationTab_C_ShowThrobber::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ShowThrobber, CallFunc_Create_ReturnValue) == 0x0000C0, "Member 'AthenaCustomizationTab_C_ShowThrobber::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ShowThrobber, CallFunc_GetUIManagerWidget_ReturnValue) == 0x0000C8, "Member 'AthenaCustomizationTab_C_ShowThrobber::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function AthenaCustomizationTab.AthenaCustomizationTab_C.SelectFirstWidget
// 0x0008 (0x0008 - 0x0000)
struct AthenaCustomizationTab_C_SelectFirstWidget final
{
public:
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationTab_C_SelectFirstWidget) == 0x000008, "Wrong alignment on AthenaCustomizationTab_C_SelectFirstWidget");
static_assert(sizeof(AthenaCustomizationTab_C_SelectFirstWidget) == 0x000008, "Wrong size on AthenaCustomizationTab_C_SelectFirstWidget");
static_assert(offsetof(AthenaCustomizationTab_C_SelectFirstWidget, CallFunc_GetUINavigationManager_ReturnValue) == 0x000000, "Member 'AthenaCustomizationTab_C_SelectFirstWidget::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

// Function AthenaCustomizationTab.AthenaCustomizationTab_C.HandleSlotHovered
// 0x0170 (0x0170 - 0x0000)
struct AthenaCustomizationTab_C_HandleSlotHovered final
{
public:
	EAthenaCustomizationCategory                  Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Param_HeaderText;                                  // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Param_DescriptionText;                             // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         SubslotIndex;                                      // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_GetFavoriteItemForCategory_ReturnValue;   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetSingleLineDescription_ReturnValue;     // 0x0058(0x0018)()
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0070(0x0018)()
	EFortRarity                                   CallFunc_GetRarity_ReturnValue;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0090(0x0018)()
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x00A8(0x0080)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakColor_R;                             // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x013C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue2;      // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationTab_C_HandleSlotHovered) == 0x000008, "Wrong alignment on AthenaCustomizationTab_C_HandleSlotHovered");
static_assert(sizeof(AthenaCustomizationTab_C_HandleSlotHovered) == 0x000170, "Wrong size on AthenaCustomizationTab_C_HandleSlotHovered");
static_assert(offsetof(AthenaCustomizationTab_C_HandleSlotHovered, Type) == 0x000000, "Member 'AthenaCustomizationTab_C_HandleSlotHovered::Type' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_HandleSlotHovered, Param_HeaderText) == 0x000008, "Member 'AthenaCustomizationTab_C_HandleSlotHovered::Param_HeaderText' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_HandleSlotHovered, Param_DescriptionText) == 0x000020, "Member 'AthenaCustomizationTab_C_HandleSlotHovered::Param_DescriptionText' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_HandleSlotHovered, SubslotIndex) == 0x000038, "Member 'AthenaCustomizationTab_C_HandleSlotHovered::SubslotIndex' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_HandleSlotHovered, CallFunc_GetFavoriteItemForCategory_ReturnValue) == 0x000040, "Member 'AthenaCustomizationTab_C_HandleSlotHovered::CallFunc_GetFavoriteItemForCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_HandleSlotHovered, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000048, "Member 'AthenaCustomizationTab_C_HandleSlotHovered::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_HandleSlotHovered, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000050, "Member 'AthenaCustomizationTab_C_HandleSlotHovered::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_HandleSlotHovered, CallFunc_GetSingleLineDescription_ReturnValue) == 0x000058, "Member 'AthenaCustomizationTab_C_HandleSlotHovered::CallFunc_GetSingleLineDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_HandleSlotHovered, CallFunc_GetDisplayName_ReturnValue) == 0x000070, "Member 'AthenaCustomizationTab_C_HandleSlotHovered::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_HandleSlotHovered, CallFunc_GetRarity_ReturnValue) == 0x000088, "Member 'AthenaCustomizationTab_C_HandleSlotHovered::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_HandleSlotHovered, CallFunc_TextToUpper_ReturnValue) == 0x000090, "Member 'AthenaCustomizationTab_C_HandleSlotHovered::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_HandleSlotHovered, CallFunc_BPGetRarityData_ReturnValue) == 0x0000A8, "Member 'AthenaCustomizationTab_C_HandleSlotHovered::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_HandleSlotHovered, CallFunc_IsValid_ReturnValue) == 0x000128, "Member 'AthenaCustomizationTab_C_HandleSlotHovered::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_HandleSlotHovered, CallFunc_BreakColor_R) == 0x00012C, "Member 'AthenaCustomizationTab_C_HandleSlotHovered::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_HandleSlotHovered, CallFunc_BreakColor_G) == 0x000130, "Member 'AthenaCustomizationTab_C_HandleSlotHovered::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_HandleSlotHovered, CallFunc_BreakColor_B) == 0x000134, "Member 'AthenaCustomizationTab_C_HandleSlotHovered::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_HandleSlotHovered, CallFunc_BreakColor_A) == 0x000138, "Member 'AthenaCustomizationTab_C_HandleSlotHovered::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_HandleSlotHovered, CallFunc_MakeColor_ReturnValue) == 0x00013C, "Member 'AthenaCustomizationTab_C_HandleSlotHovered::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_HandleSlotHovered, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00014C, "Member 'AthenaCustomizationTab_C_HandleSlotHovered::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_HandleSlotHovered, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000150, "Member 'AthenaCustomizationTab_C_HandleSlotHovered::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_HandleSlotHovered, CallFunc_GetDynamicFontMaterial_ReturnValue2) == 0x000158, "Member 'AthenaCustomizationTab_C_HandleSlotHovered::CallFunc_GetDynamicFontMaterial_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_HandleSlotHovered, Temp_int_Variable) == 0x000160, "Member 'AthenaCustomizationTab_C_HandleSlotHovered::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_HandleSlotHovered, Temp_int_Variable2) == 0x000164, "Member 'AthenaCustomizationTab_C_HandleSlotHovered::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_HandleSlotHovered, Temp_bool_Variable) == 0x000168, "Member 'AthenaCustomizationTab_C_HandleSlotHovered::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_HandleSlotHovered, K2Node_Select_Default) == 0x00016C, "Member 'AthenaCustomizationTab_C_HandleSlotHovered::K2Node_Select_Default' has a wrong offset!");

// Function AthenaCustomizationTab.AthenaCustomizationTab_C.ShowVaultItemByCategory
// 0x0030 (0x0030 - 0x0000)
struct AthenaCustomizationTab_C_ShowVaultItemByCategory final
{
public:
	EAthenaCustomizationCategory                  CustomizationType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubslotIndex;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_GetFavoriteItemForCategory_ReturnValue;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaCustomizationTab_C_ShowVaultItemByCategory) == 0x000008, "Wrong alignment on AthenaCustomizationTab_C_ShowVaultItemByCategory");
static_assert(sizeof(AthenaCustomizationTab_C_ShowVaultItemByCategory) == 0x000030, "Wrong size on AthenaCustomizationTab_C_ShowVaultItemByCategory");
static_assert(offsetof(AthenaCustomizationTab_C_ShowVaultItemByCategory, CustomizationType) == 0x000000, "Member 'AthenaCustomizationTab_C_ShowVaultItemByCategory::CustomizationType' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ShowVaultItemByCategory, SubslotIndex) == 0x000004, "Member 'AthenaCustomizationTab_C_ShowVaultItemByCategory::SubslotIndex' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ShowVaultItemByCategory, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaCustomizationTab_C_ShowVaultItemByCategory::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ShowVaultItemByCategory, CallFunc_GetFavoriteItemForCategory_ReturnValue) == 0x000010, "Member 'AthenaCustomizationTab_C_ShowVaultItemByCategory::CallFunc_GetFavoriteItemForCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ShowVaultItemByCategory, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'AthenaCustomizationTab_C_ShowVaultItemByCategory::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ShowVaultItemByCategory, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000020, "Member 'AthenaCustomizationTab_C_ShowVaultItemByCategory::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_ShowVaultItemByCategory, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000028, "Member 'AthenaCustomizationTab_C_ShowVaultItemByCategory::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function AthenaCustomizationTab.AthenaCustomizationTab_C.SetupBanner
// 0x0040 (0x0040 - 0x0000)
struct AthenaCustomizationTab_C_SetupBanner final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetGameAccountId_ReturnValue;             // 0x0018(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(AthenaCustomizationTab_C_SetupBanner) == 0x000008, "Wrong alignment on AthenaCustomizationTab_C_SetupBanner");
static_assert(sizeof(AthenaCustomizationTab_C_SetupBanner) == 0x000040, "Wrong size on AthenaCustomizationTab_C_SetupBanner");
static_assert(offsetof(AthenaCustomizationTab_C_SetupBanner, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'AthenaCustomizationTab_C_SetupBanner::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_SetupBanner, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000008, "Member 'AthenaCustomizationTab_C_SetupBanner::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(AthenaCustomizationTab_C_SetupBanner, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'AthenaCustomizationTab_C_SetupBanner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
