#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaGameOverWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CommonUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaGameOverWidget.AthenaGameOverWidget_C.ExecuteUbergraph_AthenaGameOverWidget
// 0x00D8 (0x00D8 - 0x0000)
struct AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& WinnerPlayerName)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 NumHighlights)>          K2Node_CreateDelegate_OutputDelegate4;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue2;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue3;                  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue4;                  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue2;                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateAthena*                   K2Node_DynamicCast_AsFort_Game_State_Athena2;      // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue5;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue6;                  // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget) == 0x000008, "Wrong alignment on AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget");
static_assert(sizeof(AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget) == 0x0000D8, "Wrong size on AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget");
static_assert(offsetof(AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget, EntryPoint) == 0x000000, "Member 'AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget, CallFunc_GetGameState_ReturnValue) == 0x000030, "Member 'AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget, K2Node_CreateDelegate_OutputDelegate3) == 0x000038, "Member 'AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget, K2Node_DynamicCast_AsFort_Game_State_Athena) == 0x000048, "Member 'AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget::K2Node_DynamicCast_AsFort_Game_State_Athena' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget, K2Node_CreateDelegate_OutputDelegate4) == 0x000058, "Member 'AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget, K2Node_ComponentBoundEvent_Button) == 0x000068, "Member 'AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000070, "Member 'AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget, CallFunc_GetContext_ReturnValue2) == 0x000078, "Member 'AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000080, "Member 'AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget, K2Node_DynamicCast_bSuccess2) == 0x000088, "Member 'AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget, CallFunc_GetContext_ReturnValue3) == 0x000090, "Member 'AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget, CallFunc_GetContext_ReturnValue4) == 0x000098, "Member 'AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget, CallFunc_GetGameState_ReturnValue2) == 0x0000A0, "Member 'AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget::CallFunc_GetGameState_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget, K2Node_DynamicCast_AsFort_Game_State_Athena2) == 0x0000A8, "Member 'AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget::K2Node_DynamicCast_AsFort_Game_State_Athena2' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget, K2Node_DynamicCast_bSuccess3) == 0x0000B0, "Member 'AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget, K2Node_CreateDelegate_OutputDelegate5) == 0x0000B8, "Member 'AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget, CallFunc_GetContext_ReturnValue5) == 0x0000C8, "Member 'AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget::CallFunc_GetContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget, CallFunc_GetContext_ReturnValue6) == 0x0000D0, "Member 'AthenaGameOverWidget_C_ExecuteUbergraph_AthenaGameOverWidget::CallFunc_GetContext_ReturnValue6' has a wrong offset!");

// Function AthenaGameOverWidget.AthenaGameOverWidget_C.BndEvt__OpenShadowPlayHighlights_K2Node_ComponentBoundEvent_188_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaGameOverWidget_C_BndEvt__OpenShadowPlayHighlights_K2Node_ComponentBoundEvent_188_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaGameOverWidget_C_BndEvt__OpenShadowPlayHighlights_K2Node_ComponentBoundEvent_188_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaGameOverWidget_C_BndEvt__OpenShadowPlayHighlights_K2Node_ComponentBoundEvent_188_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaGameOverWidget_C_BndEvt__OpenShadowPlayHighlights_K2Node_ComponentBoundEvent_188_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaGameOverWidget_C_BndEvt__OpenShadowPlayHighlights_K2Node_ComponentBoundEvent_188_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaGameOverWidget_C_BndEvt__OpenShadowPlayHighlights_K2Node_ComponentBoundEvent_188_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaGameOverWidget_C_BndEvt__OpenShadowPlayHighlights_K2Node_ComponentBoundEvent_188_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaGameOverWidget.AthenaGameOverWidget_C.OnPawnDied
// 0x0070 (0x0070 - 0x0000)
struct AthenaGameOverWidget_C_OnPawnDied final
{
public:
	struct FFortPlayerDeathReport                 DeathReport;                                       // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaGameOverWidget_C_OnPawnDied) == 0x000008, "Wrong alignment on AthenaGameOverWidget_C_OnPawnDied");
static_assert(sizeof(AthenaGameOverWidget_C_OnPawnDied) == 0x000070, "Wrong size on AthenaGameOverWidget_C_OnPawnDied");
static_assert(offsetof(AthenaGameOverWidget_C_OnPawnDied, DeathReport) == 0x000000, "Member 'AthenaGameOverWidget_C_OnPawnDied::DeathReport' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_OnPawnDied, CallFunc_GetContext_ReturnValue) == 0x000050, "Member 'AthenaGameOverWidget_C_OnPawnDied::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_OnPawnDied, CallFunc_GetOwningPlayer_ReturnValue) == 0x000058, "Member 'AthenaGameOverWidget_C_OnPawnDied::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_OnPawnDied, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000060, "Member 'AthenaGameOverWidget_C_OnPawnDied::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_OnPawnDied, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'AthenaGameOverWidget_C_OnPawnDied::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AthenaGameOverWidget.AthenaGameOverWidget_C.OnViewTargetChanged
// 0x0030 (0x0030 - 0x0000)
struct AthenaGameOverWidget_C_OnViewTargetChanged final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSpectatingPlayerName_ReturnValue;      // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaGameOverWidget_C_OnViewTargetChanged) == 0x000008, "Wrong alignment on AthenaGameOverWidget_C_OnViewTargetChanged");
static_assert(sizeof(AthenaGameOverWidget_C_OnViewTargetChanged) == 0x000030, "Wrong size on AthenaGameOverWidget_C_OnViewTargetChanged");
static_assert(offsetof(AthenaGameOverWidget_C_OnViewTargetChanged, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'AthenaGameOverWidget_C_OnViewTargetChanged::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_OnViewTargetChanged, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000008, "Member 'AthenaGameOverWidget_C_OnViewTargetChanged::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_OnViewTargetChanged, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'AthenaGameOverWidget_C_OnViewTargetChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_OnViewTargetChanged, CallFunc_GetSpectatingPlayerName_ReturnValue) == 0x000018, "Member 'AthenaGameOverWidget_C_OnViewTargetChanged::CallFunc_GetSpectatingPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_OnViewTargetChanged, CallFunc_Len_ReturnValue) == 0x000028, "Member 'AthenaGameOverWidget_C_OnViewTargetChanged::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_OnViewTargetChanged, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'AthenaGameOverWidget_C_OnViewTargetChanged::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaGameOverWidget.AthenaGameOverWidget_C.OnWinnerAnnounced
// 0x0010 (0x0010 - 0x0000)
struct AthenaGameOverWidget_C_OnWinnerAnnounced final
{
public:
	class FString                                 Winner;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaGameOverWidget_C_OnWinnerAnnounced) == 0x000008, "Wrong alignment on AthenaGameOverWidget_C_OnWinnerAnnounced");
static_assert(sizeof(AthenaGameOverWidget_C_OnWinnerAnnounced) == 0x000010, "Wrong size on AthenaGameOverWidget_C_OnWinnerAnnounced");
static_assert(offsetof(AthenaGameOverWidget_C_OnWinnerAnnounced, Winner) == 0x000000, "Member 'AthenaGameOverWidget_C_OnWinnerAnnounced::Winner' has a wrong offset!");

// Function AthenaGameOverWidget.AthenaGameOverWidget_C.AddTeamMemberIndicator
// 0x0040 (0x0040 - 0x0000)
struct AthenaGameOverWidget_C_AddTeamMemberIndicator final
{
public:
	class AFortPlayerStateAthena*                 Player_State;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Team_Member_Index;                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue2;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaTeamMemberIndicator_C*           CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortActorCanvasSlot*                   CallFunc_AddActorIndicator_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaGameOverWidget_C_AddTeamMemberIndicator) == 0x000008, "Wrong alignment on AthenaGameOverWidget_C_AddTeamMemberIndicator");
static_assert(sizeof(AthenaGameOverWidget_C_AddTeamMemberIndicator) == 0x000040, "Wrong size on AthenaGameOverWidget_C_AddTeamMemberIndicator");
static_assert(offsetof(AthenaGameOverWidget_C_AddTeamMemberIndicator, Player_State) == 0x000000, "Member 'AthenaGameOverWidget_C_AddTeamMemberIndicator::Player_State' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_AddTeamMemberIndicator, Team_Member_Index) == 0x000008, "Member 'AthenaGameOverWidget_C_AddTeamMemberIndicator::Team_Member_Index' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_AddTeamMemberIndicator, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'AthenaGameOverWidget_C_AddTeamMemberIndicator::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_AddTeamMemberIndicator, CallFunc_GetOwningPlayer_ReturnValue2) == 0x000018, "Member 'AthenaGameOverWidget_C_AddTeamMemberIndicator::CallFunc_GetOwningPlayer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_AddTeamMemberIndicator, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000020, "Member 'AthenaGameOverWidget_C_AddTeamMemberIndicator::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_AddTeamMemberIndicator, CallFunc_Create_ReturnValue) == 0x000028, "Member 'AthenaGameOverWidget_C_AddTeamMemberIndicator::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_AddTeamMemberIndicator, CallFunc_AddActorIndicator_ReturnValue) == 0x000030, "Member 'AthenaGameOverWidget_C_AddTeamMemberIndicator::CallFunc_AddActorIndicator_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_AddTeamMemberIndicator, CallFunc_Array_Add_ReturnValue) == 0x000038, "Member 'AthenaGameOverWidget_C_AddTeamMemberIndicator::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function AthenaGameOverWidget.AthenaGameOverWidget_C.HighlightCountChanged
// 0x000C (0x000C - 0x0000)
struct AthenaGameOverWidget_C_HighlightCountChanged final
{
public:
	int32                                         HighlightCount;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaGameOverWidget_C_HighlightCountChanged) == 0x000004, "Wrong alignment on AthenaGameOverWidget_C_HighlightCountChanged");
static_assert(sizeof(AthenaGameOverWidget_C_HighlightCountChanged) == 0x00000C, "Wrong size on AthenaGameOverWidget_C_HighlightCountChanged");
static_assert(offsetof(AthenaGameOverWidget_C_HighlightCountChanged, HighlightCount) == 0x000000, "Member 'AthenaGameOverWidget_C_HighlightCountChanged::HighlightCount' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_HighlightCountChanged, Temp_bool_Variable) == 0x000004, "Member 'AthenaGameOverWidget_C_HighlightCountChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_HighlightCountChanged, CallFunc_Greater_IntInt_ReturnValue) == 0x000005, "Member 'AthenaGameOverWidget_C_HighlightCountChanged::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_HighlightCountChanged, Temp_byte_Variable) == 0x000006, "Member 'AthenaGameOverWidget_C_HighlightCountChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_HighlightCountChanged, Temp_byte_Variable2) == 0x000007, "Member 'AthenaGameOverWidget_C_HighlightCountChanged::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_HighlightCountChanged, K2Node_Select_Default) == 0x000008, "Member 'AthenaGameOverWidget_C_HighlightCountChanged::K2Node_Select_Default' has a wrong offset!");

// Function AthenaGameOverWidget.AthenaGameOverWidget_C.Handle_ReturnToLobby
// 0x0020 (0x0020 - 0x0000)
struct AthenaGameOverWidget_C_Handle_ReturnToLobby final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaGameOverWidget_C_Handle_ReturnToLobby) == 0x000008, "Wrong alignment on AthenaGameOverWidget_C_Handle_ReturnToLobby");
static_assert(sizeof(AthenaGameOverWidget_C_Handle_ReturnToLobby) == 0x000020, "Wrong size on AthenaGameOverWidget_C_Handle_ReturnToLobby");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_ReturnToLobby, Passthrough) == 0x000000, "Member 'AthenaGameOverWidget_C_Handle_ReturnToLobby::Passthrough' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_ReturnToLobby, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'AthenaGameOverWidget_C_Handle_ReturnToLobby::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_ReturnToLobby, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000010, "Member 'AthenaGameOverWidget_C_Handle_ReturnToLobby::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_ReturnToLobby, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AthenaGameOverWidget_C_Handle_ReturnToLobby::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AthenaGameOverWidget.AthenaGameOverWidget_C.InputRefresh
// 0x0005 (0x0005 - 0x0000)
struct AthenaGameOverWidget_C_InputRefresh final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInputActionState                             Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputActionState                             Temp_byte_Variable2;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanFollowNextOrPreviousTeammate_ReturnValue; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInputActionState                             K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaGameOverWidget_C_InputRefresh) == 0x000001, "Wrong alignment on AthenaGameOverWidget_C_InputRefresh");
static_assert(sizeof(AthenaGameOverWidget_C_InputRefresh) == 0x000005, "Wrong size on AthenaGameOverWidget_C_InputRefresh");
static_assert(offsetof(AthenaGameOverWidget_C_InputRefresh, Temp_bool_Variable) == 0x000000, "Member 'AthenaGameOverWidget_C_InputRefresh::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_InputRefresh, Temp_byte_Variable) == 0x000001, "Member 'AthenaGameOverWidget_C_InputRefresh::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_InputRefresh, Temp_byte_Variable2) == 0x000002, "Member 'AthenaGameOverWidget_C_InputRefresh::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_InputRefresh, CallFunc_CanFollowNextOrPreviousTeammate_ReturnValue) == 0x000003, "Member 'AthenaGameOverWidget_C_InputRefresh::CallFunc_CanFollowNextOrPreviousTeammate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_InputRefresh, K2Node_Select_Default) == 0x000004, "Member 'AthenaGameOverWidget_C_InputRefresh::K2Node_Select_Default' has a wrong offset!");

// Function AthenaGameOverWidget.AthenaGameOverWidget_C.Handle_FollowNextTeammate
// 0x0020 (0x0020 - 0x0000)
struct AthenaGameOverWidget_C_Handle_FollowNextTeammate final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_PlayerController_C*             K2Node_DynamicCast_AsAthena_Player_Controller;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaGameOverWidget_C_Handle_FollowNextTeammate) == 0x000008, "Wrong alignment on AthenaGameOverWidget_C_Handle_FollowNextTeammate");
static_assert(sizeof(AthenaGameOverWidget_C_Handle_FollowNextTeammate) == 0x000020, "Wrong size on AthenaGameOverWidget_C_Handle_FollowNextTeammate");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_FollowNextTeammate, Passthrough) == 0x000000, "Member 'AthenaGameOverWidget_C_Handle_FollowNextTeammate::Passthrough' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_FollowNextTeammate, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'AthenaGameOverWidget_C_Handle_FollowNextTeammate::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_FollowNextTeammate, K2Node_DynamicCast_AsAthena_Player_Controller) == 0x000010, "Member 'AthenaGameOverWidget_C_Handle_FollowNextTeammate::K2Node_DynamicCast_AsAthena_Player_Controller' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_FollowNextTeammate, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AthenaGameOverWidget_C_Handle_FollowNextTeammate::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AthenaGameOverWidget.AthenaGameOverWidget_C.Handle_FollowPreviousTeammate
// 0x0020 (0x0020 - 0x0000)
struct AthenaGameOverWidget_C_Handle_FollowPreviousTeammate final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_PlayerController_C*             K2Node_DynamicCast_AsAthena_Player_Controller;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaGameOverWidget_C_Handle_FollowPreviousTeammate) == 0x000008, "Wrong alignment on AthenaGameOverWidget_C_Handle_FollowPreviousTeammate");
static_assert(sizeof(AthenaGameOverWidget_C_Handle_FollowPreviousTeammate) == 0x000020, "Wrong size on AthenaGameOverWidget_C_Handle_FollowPreviousTeammate");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_FollowPreviousTeammate, Passthrough) == 0x000000, "Member 'AthenaGameOverWidget_C_Handle_FollowPreviousTeammate::Passthrough' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_FollowPreviousTeammate, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'AthenaGameOverWidget_C_Handle_FollowPreviousTeammate::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_FollowPreviousTeammate, K2Node_DynamicCast_AsAthena_Player_Controller) == 0x000010, "Member 'AthenaGameOverWidget_C_Handle_FollowPreviousTeammate::K2Node_DynamicCast_AsAthena_Player_Controller' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_FollowPreviousTeammate, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AthenaGameOverWidget_C_Handle_FollowPreviousTeammate::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AthenaGameOverWidget.AthenaGameOverWidget_C.InputSetup
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) AthenaGameOverWidget_C_InputSetup final
{
public:
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate2;             // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate3;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate4;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate5;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AthenaGameOverWidget_C_InputSetup) == 0x000008, "Wrong alignment on AthenaGameOverWidget_C_InputSetup");
static_assert(sizeof(AthenaGameOverWidget_C_InputSetup) == 0x000050, "Wrong size on AthenaGameOverWidget_C_InputSetup");
static_assert(offsetof(AthenaGameOverWidget_C_InputSetup, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AthenaGameOverWidget_C_InputSetup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_InputSetup, K2Node_CreateDelegate_OutputDelegate2) == 0x000010, "Member 'AthenaGameOverWidget_C_InputSetup::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_InputSetup, K2Node_CreateDelegate_OutputDelegate3) == 0x000020, "Member 'AthenaGameOverWidget_C_InputSetup::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_InputSetup, K2Node_CreateDelegate_OutputDelegate4) == 0x000030, "Member 'AthenaGameOverWidget_C_InputSetup::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_InputSetup, K2Node_CreateDelegate_OutputDelegate5) == 0x000040, "Member 'AthenaGameOverWidget_C_InputSetup::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");

// Function AthenaGameOverWidget.AthenaGameOverWidget_C.Handle_ReportPlayer
// 0x0088 (0x0088 - 0x0000)
struct AthenaGameOverWidget_C_Handle_ReportPlayer final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerAthena*            OwningAthenaPC;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSpectatingPlayerName_ReturnValue;      // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliation_ReturnValue;           // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue2;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFeedback_C*                            CallFunc_Create_ReturnValue;                       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaGameOverWidget_C_Handle_ReportPlayer) == 0x000008, "Wrong alignment on AthenaGameOverWidget_C_Handle_ReportPlayer");
static_assert(sizeof(AthenaGameOverWidget_C_Handle_ReportPlayer) == 0x000088, "Wrong size on AthenaGameOverWidget_C_Handle_ReportPlayer");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_ReportPlayer, Passthrough) == 0x000000, "Member 'AthenaGameOverWidget_C_Handle_ReportPlayer::Passthrough' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_ReportPlayer, OwningAthenaPC) == 0x000008, "Member 'AthenaGameOverWidget_C_Handle_ReportPlayer::OwningAthenaPC' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_ReportPlayer, CallFunc_GetSpectatingPlayerName_ReturnValue) == 0x000010, "Member 'AthenaGameOverWidget_C_Handle_ReportPlayer::CallFunc_GetSpectatingPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_ReportPlayer, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'AthenaGameOverWidget_C_Handle_ReportPlayer::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_ReportPlayer, CallFunc_GetViewTarget_ReturnValue) == 0x000038, "Member 'AthenaGameOverWidget_C_Handle_ReportPlayer::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_ReportPlayer, CallFunc_TextIsEmpty_ReturnValue) == 0x000040, "Member 'AthenaGameOverWidget_C_Handle_ReportPlayer::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_ReportPlayer, K2Node_DynamicCast_AsPawn) == 0x000048, "Member 'AthenaGameOverWidget_C_Handle_ReportPlayer::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_ReportPlayer, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'AthenaGameOverWidget_C_Handle_ReportPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_ReportPlayer, CallFunc_GetTeamAffiliation_ReturnValue) == 0x000051, "Member 'AthenaGameOverWidget_C_Handle_ReportPlayer::CallFunc_GetTeamAffiliation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_ReportPlayer, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000052, "Member 'AthenaGameOverWidget_C_Handle_ReportPlayer::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_ReportPlayer, CallFunc_GetOwningPlayer_ReturnValue) == 0x000058, "Member 'AthenaGameOverWidget_C_Handle_ReportPlayer::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_ReportPlayer, CallFunc_GetOwningPlayer_ReturnValue2) == 0x000060, "Member 'AthenaGameOverWidget_C_Handle_ReportPlayer::CallFunc_GetOwningPlayer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_ReportPlayer, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000068, "Member 'AthenaGameOverWidget_C_Handle_ReportPlayer::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_ReportPlayer, K2Node_DynamicCast_bSuccess2) == 0x000070, "Member 'AthenaGameOverWidget_C_Handle_ReportPlayer::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_ReportPlayer, CallFunc_Create_ReturnValue) == 0x000078, "Member 'AthenaGameOverWidget_C_Handle_ReportPlayer::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_ReportPlayer, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000080, "Member 'AthenaGameOverWidget_C_Handle_ReportPlayer::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function AthenaGameOverWidget.AthenaGameOverWidget_C.Handle_ViewMatchStats
// 0x0018 (0x0018 - 0x0000)
struct AthenaGameOverWidget_C_Handle_ViewMatchStats final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetCachedWidget_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaGameOverWidget_C_Handle_ViewMatchStats) == 0x000008, "Wrong alignment on AthenaGameOverWidget_C_Handle_ViewMatchStats");
static_assert(sizeof(AthenaGameOverWidget_C_Handle_ViewMatchStats) == 0x000018, "Wrong size on AthenaGameOverWidget_C_Handle_ViewMatchStats");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_ViewMatchStats, Passthrough) == 0x000000, "Member 'AthenaGameOverWidget_C_Handle_ViewMatchStats::Passthrough' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_ViewMatchStats, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000008, "Member 'AthenaGameOverWidget_C_Handle_ViewMatchStats::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_Handle_ViewMatchStats, CallFunc_GetCachedWidget_ReturnValue) == 0x000010, "Member 'AthenaGameOverWidget_C_Handle_ViewMatchStats::CallFunc_GetCachedWidget_ReturnValue' has a wrong offset!");

// Function AthenaGameOverWidget.AthenaGameOverWidget_C.SetKillersName
// 0x00C8 (0x00C8 - 0x0000)
struct AthenaGameOverWidget_C_SetKillersName final
{
public:
	struct FFortPlayerDeathReport                 FortPlayerDeathReport;                             // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0058(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0090(0x0018)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00B0(0x0018)()
};
static_assert(alignof(AthenaGameOverWidget_C_SetKillersName) == 0x000008, "Wrong alignment on AthenaGameOverWidget_C_SetKillersName");
static_assert(sizeof(AthenaGameOverWidget_C_SetKillersName) == 0x0000C8, "Wrong size on AthenaGameOverWidget_C_SetKillersName");
static_assert(offsetof(AthenaGameOverWidget_C_SetKillersName, FortPlayerDeathReport) == 0x000000, "Member 'AthenaGameOverWidget_C_SetKillersName::FortPlayerDeathReport' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_SetKillersName, Temp_bool_Variable) == 0x000050, "Member 'AthenaGameOverWidget_C_SetKillersName::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_SetKillersName, Temp_text_Variable) == 0x000058, "Member 'AthenaGameOverWidget_C_SetKillersName::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_SetKillersName, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'AthenaGameOverWidget_C_SetKillersName::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_SetKillersName, CallFunc_GetPlayerName_ReturnValue) == 0x000078, "Member 'AthenaGameOverWidget_C_SetKillersName::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_SetKillersName, CallFunc_GetOwningPlayer_ReturnValue) == 0x000088, "Member 'AthenaGameOverWidget_C_SetKillersName::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_SetKillersName, CallFunc_Conv_StringToText_ReturnValue) == 0x000090, "Member 'AthenaGameOverWidget_C_SetKillersName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_SetKillersName, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000A8, "Member 'AthenaGameOverWidget_C_SetKillersName::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_SetKillersName, K2Node_Select_Default) == 0x0000B0, "Member 'AthenaGameOverWidget_C_SetKillersName::K2Node_Select_Default' has a wrong offset!");

// Function AthenaGameOverWidget.AthenaGameOverWidget_C.CanFollowNextOrPreviousTeammate
// 0x0020 (0x0020 - 0x0000)
struct AthenaGameOverWidget_C_CanFollowNextOrPreviousTeammate final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanFollowTeammate_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaGameOverWidget_C_CanFollowNextOrPreviousTeammate) == 0x000008, "Wrong alignment on AthenaGameOverWidget_C_CanFollowNextOrPreviousTeammate");
static_assert(sizeof(AthenaGameOverWidget_C_CanFollowNextOrPreviousTeammate) == 0x000020, "Wrong size on AthenaGameOverWidget_C_CanFollowNextOrPreviousTeammate");
static_assert(offsetof(AthenaGameOverWidget_C_CanFollowNextOrPreviousTeammate, ReturnValue) == 0x000000, "Member 'AthenaGameOverWidget_C_CanFollowNextOrPreviousTeammate::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaGameOverWidget_C_CanFollowNextOrPreviousTeammate, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'AthenaGameOverWidget_C_CanFollowNextOrPreviousTeammate::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
