#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaInventoryFortItemTileButton

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaInventoryFortItemTileButton.AthenaInventoryFortItemTileButton_C.ExecuteUbergraph_AthenaInventoryFortItemTileButton
// 0x0010 (0x0010 - 0x0000)
struct AthenaInventoryFortItemTileButton_C_ExecuteUbergraph_AthenaInventoryFortItemTileButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              K2Node_CustomEvent_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryFortItemTileButton_C_ExecuteUbergraph_AthenaInventoryFortItemTileButton) == 0x000008, "Wrong alignment on AthenaInventoryFortItemTileButton_C_ExecuteUbergraph_AthenaInventoryFortItemTileButton");
static_assert(sizeof(AthenaInventoryFortItemTileButton_C_ExecuteUbergraph_AthenaInventoryFortItemTileButton) == 0x000010, "Wrong size on AthenaInventoryFortItemTileButton_C_ExecuteUbergraph_AthenaInventoryFortItemTileButton");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_ExecuteUbergraph_AthenaInventoryFortItemTileButton, EntryPoint) == 0x000000, "Member 'AthenaInventoryFortItemTileButton_C_ExecuteUbergraph_AthenaInventoryFortItemTileButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_ExecuteUbergraph_AthenaInventoryFortItemTileButton, K2Node_CustomEvent_Item) == 0x000008, "Member 'AthenaInventoryFortItemTileButton_C_ExecuteUbergraph_AthenaInventoryFortItemTileButton::K2Node_CustomEvent_Item' has a wrong offset!");

// Function AthenaInventoryFortItemTileButton.AthenaInventoryFortItemTileButton_C.OnInventoryItemSelected_Event_0
// 0x0008 (0x0008 - 0x0000)
struct AthenaInventoryFortItemTileButton_C_OnInventoryItemSelected_Event_0 final
{
public:
	class UFortItem*                              Param_Item;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryFortItemTileButton_C_OnInventoryItemSelected_Event_0) == 0x000008, "Wrong alignment on AthenaInventoryFortItemTileButton_C_OnInventoryItemSelected_Event_0");
static_assert(sizeof(AthenaInventoryFortItemTileButton_C_OnInventoryItemSelected_Event_0) == 0x000008, "Wrong size on AthenaInventoryFortItemTileButton_C_OnInventoryItemSelected_Event_0");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_OnInventoryItemSelected_Event_0, Param_Item) == 0x000000, "Member 'AthenaInventoryFortItemTileButton_C_OnInventoryItemSelected_Event_0::Param_Item' has a wrong offset!");

// Function AthenaInventoryFortItemTileButton.AthenaInventoryFortItemTileButton_C.OnDragDetected
// 0x00F0 (0x00F0 - 0x0000)
struct AthenaInventoryFortItemTileButton_C_OnDragDetected final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaInventoryDragDrop_C*             CallFunc_CreateDragDropOperation_ReturnValue;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputEvent                            CallFunc_GetInputEventFromPointerEvent_ReturnValue; // 0x00B8(0x0020)()
	bool                                          CallFunc_InputEvent_IsShiftDown_ReturnValue;       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemCardSize                             CallFunc_GetCardSize_ReturnValue;                  // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaInventoryDragVisual_C*           CallFunc_Create_ReturnValue;                       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryFortItemTileButton_C_OnDragDetected) == 0x000008, "Wrong alignment on AthenaInventoryFortItemTileButton_C_OnDragDetected");
static_assert(sizeof(AthenaInventoryFortItemTileButton_C_OnDragDetected) == 0x0000F0, "Wrong size on AthenaInventoryFortItemTileButton_C_OnDragDetected");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_OnDragDetected, MyGeometry) == 0x000000, "Member 'AthenaInventoryFortItemTileButton_C_OnDragDetected::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_OnDragDetected, PointerEvent) == 0x000038, "Member 'AthenaInventoryFortItemTileButton_C_OnDragDetected::PointerEvent' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_OnDragDetected, Operation) == 0x0000A8, "Member 'AthenaInventoryFortItemTileButton_C_OnDragDetected::Operation' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_OnDragDetected, CallFunc_CreateDragDropOperation_ReturnValue) == 0x0000B0, "Member 'AthenaInventoryFortItemTileButton_C_OnDragDetected::CallFunc_CreateDragDropOperation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_OnDragDetected, CallFunc_GetInputEventFromPointerEvent_ReturnValue) == 0x0000B8, "Member 'AthenaInventoryFortItemTileButton_C_OnDragDetected::CallFunc_GetInputEventFromPointerEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_OnDragDetected, CallFunc_InputEvent_IsShiftDown_ReturnValue) == 0x0000D8, "Member 'AthenaInventoryFortItemTileButton_C_OnDragDetected::CallFunc_InputEvent_IsShiftDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_OnDragDetected, CallFunc_GetCardSize_ReturnValue) == 0x0000D9, "Member 'AthenaInventoryFortItemTileButton_C_OnDragDetected::CallFunc_GetCardSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_OnDragDetected, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000E0, "Member 'AthenaInventoryFortItemTileButton_C_OnDragDetected::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_OnDragDetected, CallFunc_Create_ReturnValue) == 0x0000E8, "Member 'AthenaInventoryFortItemTileButton_C_OnDragDetected::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function AthenaInventoryFortItemTileButton.AthenaInventoryFortItemTileButton_C.UpdateInteractionWidgetVisibility
// 0x0030 (0x0030 - 0x0000)
struct AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetData_ReturnValue;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              K2Node_DynamicCast_AsFort_Item;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemType                                 CallFunc_GetType_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetOwningController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEquipable_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility) == 0x000008, "Wrong alignment on AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility");
static_assert(sizeof(AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility) == 0x000030, "Wrong size on AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility, Temp_byte_Variable) == 0x000000, "Member 'AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility, Temp_byte_Variable2) == 0x000001, "Member 'AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility, Temp_bool_Variable) == 0x000002, "Member 'AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility, CallFunc_GetData_ReturnValue) == 0x000008, "Member 'AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility::CallFunc_GetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility, K2Node_DynamicCast_AsFort_Item) == 0x000010, "Member 'AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility::K2Node_DynamicCast_AsFort_Item' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility, CallFunc_GetType_ReturnValue) == 0x000019, "Member 'AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility::CallFunc_GetType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility, CallFunc_GetOwningController_ReturnValue) == 0x000020, "Member 'AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility::CallFunc_GetOwningController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000028, "Member 'AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility, CallFunc_IsEquipable_ReturnValue) == 0x000029, "Member 'AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility::CallFunc_IsEquipable_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x00002A, "Member 'AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility, CallFunc_BooleanAND_ReturnValue) == 0x00002B, "Member 'AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility, K2Node_Select_Default) == 0x00002C, "Member 'AthenaInventoryFortItemTileButton_C_UpdateInteractionWidgetVisibility::K2Node_Select_Default' has a wrong offset!");

// Function AthenaInventoryFortItemTileButton.AthenaInventoryFortItemTileButton_C.On_ItemWidgetHolder_MouseButtonDown
// 0x0398 (0x0398 - 0x0000)
struct AthenaInventoryFortItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0160(0x00B8)()
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_DetectDrag_ReturnValue;                   // 0x0220(0x00B8)()
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DA[0x6];                                      // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue2;                   // 0x02E0(0x00B8)()
};
static_assert(alignof(AthenaInventoryFortItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown) == 0x000008, "Wrong alignment on AthenaInventoryFortItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown");
static_assert(sizeof(AthenaInventoryFortItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown) == 0x000398, "Wrong size on AthenaInventoryFortItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown, MyGeometry) == 0x000000, "Member 'AthenaInventoryFortItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown, MouseEvent) == 0x000038, "Member 'AthenaInventoryFortItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown, ReturnValue) == 0x0000A8, "Member 'AthenaInventoryFortItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown, CallFunc_Unhandled_ReturnValue) == 0x000160, "Member 'AthenaInventoryFortItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown, CallFunc_GetContext_ReturnValue) == 0x000218, "Member 'AthenaInventoryFortItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown, CallFunc_DetectDrag_ReturnValue) == 0x000220, "Member 'AthenaInventoryFortItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown::CallFunc_DetectDrag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown, CallFunc_IsUsingGamepad_ReturnValue) == 0x0002D8, "Member 'AthenaInventoryFortItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown, CallFunc_Not_PreBool_ReturnValue) == 0x0002D9, "Member 'AthenaInventoryFortItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown, CallFunc_Unhandled_ReturnValue2) == 0x0002E0, "Member 'AthenaInventoryFortItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown::CallFunc_Unhandled_ReturnValue2' has a wrong offset!");

// Function AthenaInventoryFortItemTileButton.AthenaInventoryFortItemTileButton_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct AthenaInventoryFortItemTileButton_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x00F8(0x00B8)()
};
static_assert(alignof(AthenaInventoryFortItemTileButton_C_OnFocusReceived) == 0x000008, "Wrong alignment on AthenaInventoryFortItemTileButton_C_OnFocusReceived");
static_assert(sizeof(AthenaInventoryFortItemTileButton_C_OnFocusReceived) == 0x0001B0, "Wrong size on AthenaInventoryFortItemTileButton_C_OnFocusReceived");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'AthenaInventoryFortItemTileButton_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'AthenaInventoryFortItemTileButton_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'AthenaInventoryFortItemTileButton_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_OnFocusReceived, CallFunc_Unhandled_ReturnValue) == 0x0000F8, "Member 'AthenaInventoryFortItemTileButton_C_OnFocusReceived::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function AthenaInventoryFortItemTileButton.AthenaInventoryFortItemTileButton_C.OnDrop
// 0x00C8 (0x00C8 - 0x0000)
struct AthenaInventoryFortItemTileButton_C_OnDrop final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00A8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          ValidDrop;                                         // 0x00B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              K2Node_DynamicCast_AsFort_Item;                    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaInventoryFortItemTileButton_C_OnDrop) == 0x000008, "Wrong alignment on AthenaInventoryFortItemTileButton_C_OnDrop");
static_assert(sizeof(AthenaInventoryFortItemTileButton_C_OnDrop) == 0x0000C8, "Wrong size on AthenaInventoryFortItemTileButton_C_OnDrop");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_OnDrop, MyGeometry) == 0x000000, "Member 'AthenaInventoryFortItemTileButton_C_OnDrop::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_OnDrop, PointerEvent) == 0x000038, "Member 'AthenaInventoryFortItemTileButton_C_OnDrop::PointerEvent' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_OnDrop, Operation) == 0x0000A8, "Member 'AthenaInventoryFortItemTileButton_C_OnDrop::Operation' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_OnDrop, ReturnValue) == 0x0000B0, "Member 'AthenaInventoryFortItemTileButton_C_OnDrop::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_OnDrop, ValidDrop) == 0x0000B1, "Member 'AthenaInventoryFortItemTileButton_C_OnDrop::ValidDrop' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_OnDrop, K2Node_DynamicCast_AsFort_Item) == 0x0000B8, "Member 'AthenaInventoryFortItemTileButton_C_OnDrop::K2Node_DynamicCast_AsFort_Item' has a wrong offset!");
static_assert(offsetof(AthenaInventoryFortItemTileButton_C_OnDrop, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'AthenaInventoryFortItemTileButton_C_OnDrop::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

