#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaInventoryDragVisual

#include "Basic.hpp"

#include "AthenaDragDropAction_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaInventoryDragVisual.AthenaInventoryDragVisual_C.ExecuteUbergraph_AthenaInventoryDragVisual
// 0x0008 (0x0008 - 0x0000)
struct AthenaInventoryDragVisual_C_ExecuteUbergraph_AthenaInventoryDragVisual final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaInventoryDragVisual_C_ExecuteUbergraph_AthenaInventoryDragVisual) == 0x000004, "Wrong alignment on AthenaInventoryDragVisual_C_ExecuteUbergraph_AthenaInventoryDragVisual");
static_assert(sizeof(AthenaInventoryDragVisual_C_ExecuteUbergraph_AthenaInventoryDragVisual) == 0x000008, "Wrong size on AthenaInventoryDragVisual_C_ExecuteUbergraph_AthenaInventoryDragVisual");
static_assert(offsetof(AthenaInventoryDragVisual_C_ExecuteUbergraph_AthenaInventoryDragVisual, EntryPoint) == 0x000000, "Member 'AthenaInventoryDragVisual_C_ExecuteUbergraph_AthenaInventoryDragVisual::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaInventoryDragVisual_C_ExecuteUbergraph_AthenaInventoryDragVisual, K2Node_Event_IsDesignTime) == 0x000004, "Member 'AthenaInventoryDragVisual_C_ExecuteUbergraph_AthenaInventoryDragVisual::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function AthenaInventoryDragVisual.AthenaInventoryDragVisual_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct AthenaInventoryDragVisual_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaInventoryDragVisual_C_PreConstruct) == 0x000001, "Wrong alignment on AthenaInventoryDragVisual_C_PreConstruct");
static_assert(sizeof(AthenaInventoryDragVisual_C_PreConstruct) == 0x000001, "Wrong size on AthenaInventoryDragVisual_C_PreConstruct");
static_assert(offsetof(AthenaInventoryDragVisual_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'AthenaInventoryDragVisual_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function AthenaInventoryDragVisual.AthenaInventoryDragVisual_C.ShowDropIcon
// 0x0038 (0x0038 - 0x0000)
struct AthenaInventoryDragVisual_C_ShowDropIcon final
{
public:
	EAthenaDragDropAction                         Drop_Action;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAthenaDragDropAction                         Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable2;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable3;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaInventoryDragVisual_C_ShowDropIcon) == 0x000008, "Wrong alignment on AthenaInventoryDragVisual_C_ShowDropIcon");
static_assert(sizeof(AthenaInventoryDragVisual_C_ShowDropIcon) == 0x000038, "Wrong size on AthenaInventoryDragVisual_C_ShowDropIcon");
static_assert(offsetof(AthenaInventoryDragVisual_C_ShowDropIcon, Drop_Action) == 0x000000, "Member 'AthenaInventoryDragVisual_C_ShowDropIcon::Drop_Action' has a wrong offset!");
static_assert(offsetof(AthenaInventoryDragVisual_C_ShowDropIcon, Temp_byte_Variable) == 0x000001, "Member 'AthenaInventoryDragVisual_C_ShowDropIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryDragVisual_C_ShowDropIcon, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000002, "Member 'AthenaInventoryDragVisual_C_ShowDropIcon::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaInventoryDragVisual_C_ShowDropIcon, Temp_object_Variable) == 0x000008, "Member 'AthenaInventoryDragVisual_C_ShowDropIcon::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryDragVisual_C_ShowDropIcon, Temp_object_Variable2) == 0x000010, "Member 'AthenaInventoryDragVisual_C_ShowDropIcon::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaInventoryDragVisual_C_ShowDropIcon, Temp_object_Variable3) == 0x000018, "Member 'AthenaInventoryDragVisual_C_ShowDropIcon::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaInventoryDragVisual_C_ShowDropIcon, Temp_bool_Variable) == 0x000020, "Member 'AthenaInventoryDragVisual_C_ShowDropIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaInventoryDragVisual_C_ShowDropIcon, K2Node_Select_Default) == 0x000028, "Member 'AthenaInventoryDragVisual_C_ShowDropIcon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaInventoryDragVisual_C_ShowDropIcon, Temp_byte_Variable2) == 0x000030, "Member 'AthenaInventoryDragVisual_C_ShowDropIcon::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaInventoryDragVisual_C_ShowDropIcon, Temp_byte_Variable3) == 0x000031, "Member 'AthenaInventoryDragVisual_C_ShowDropIcon::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaInventoryDragVisual_C_ShowDropIcon, K2Node_Select2_Default) == 0x000032, "Member 'AthenaInventoryDragVisual_C_ShowDropIcon::K2Node_Select2_Default' has a wrong offset!");

}

