#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSeasonTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaSeasonTab.AthenaSeasonTab_C
// 0x0110 (0x05C0 - 0x04B0)
class UAthenaSeasonTab_C final : public USeasonPassScreenBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B0(0x0008)(Transient, DuplicateTransient)
	class UAthenaSeasonBPTrackerWidget_C*         AthenaSeasonBPTrackerWidget;                       // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackgroundGradient;                                // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CurrentPageNumber;                                 // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ItemName;                                          // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ItemType;                                          // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  LevelPageWidgetSwitcher;                           // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MainViewItemInfoOverlay;                           // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           MainViewItemInfoVB;                                // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      PageLeftBtn;                                       // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      PageRightBtn;                                      // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PassCompleted;                                     // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PassNotOwned;                                      // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PassOwned;                                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PurchaseBattlePassText;                            // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      PurchaseLevelBtn;                                  // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PurchaseLevelDescription;                          // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      PurchaseSeasonBtn;                                 // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RarityGlow;                                        // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Rule;                                              // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonDateTimeTextBlock*               SeasonCountdown;                                   // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SeasonHeadingTextLabel;                            // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  SeasonPassOwnedSwitcher;                           // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ShortDescription;                                  // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TotalPageNumber;                                   // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UFortCompendiumBundleDefinition*> UnlockableBundles;                                 // 0x0578(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UFortCompendiumBundle*>          ActiveBundles;                                     // 0x0588(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FName                                   LastActiveTab;                                     // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaSeasonPageWidget_C*              CurrentPage;                                       // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortDirectAcquisitionOfferInfo*        SeasonCatalogOffer;                                // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItemDefinition*             BattlePointsCurrency;                              // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DoNotNavigateToFirstLevel;                         // 0x05B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AthenaSeasonTab(int32 EntryPoint);
	void ScrollNegative();
	void ScrollPositive();
	void NoOffersAvailable();
	void BndEvt__PurchaseLevelBtn_K2Node_ComponentBoundEvent_40_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__LevelPageWidgetSwitcher_K2Node_ComponentBoundEvent_1_OnActiveWidgetChanged__DelegateSignature(class UWidget* ActiveWidget, int32 ActiveWidgetIndex);
	void HandlePageRight();
	void HandlePageLeft();
	void BndEvt__PageRightBtn_K2Node_ComponentBoundEvent_84_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__IconTextButton_0_K2Node_ComponentBoundEvent_45_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnLevelsGenerated();
	void BndEvt__PurchaseSeasonBtn_K2Node_ComponentBoundEvent_61_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnSeasonPassChanged();
	void GenerateOfferWidget(class UFortDirectAcquisitionOfferInfo* Param_OfferData);
	void OnOffersGenerated();
	void OnStartReadingOffers();
	void OnNavigateToLevel(int32 Level);
	void OnDeactivated();
	void OnActivated();
	void Construct();
	TArray<class USeasonPassLevelWidget*> GenerateLevelWidgets(class UFortSeasonPassLevelInfo* LevelInfo);
	void SelectPageByLevel(int32 TargetLevel);
	void SetupViewedItemData(class UFortItem* Item);
	void UpdateSeasonPurchaseState();
	void UpdatePageCount();
	void SetupViewedItemName(class UFortItem* Item);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSeasonTab_C">();
	}
	static class UAthenaSeasonTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSeasonTab_C>();
	}
};
static_assert(alignof(UAthenaSeasonTab_C) == 0x000008, "Wrong alignment on UAthenaSeasonTab_C");
static_assert(sizeof(UAthenaSeasonTab_C) == 0x0005C0, "Wrong size on UAthenaSeasonTab_C");
static_assert(offsetof(UAthenaSeasonTab_C, UberGraphFrame) == 0x0004B0, "Member 'UAthenaSeasonTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, AthenaSeasonBPTrackerWidget) == 0x0004B8, "Member 'UAthenaSeasonTab_C::AthenaSeasonBPTrackerWidget' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, BackgroundGradient) == 0x0004C0, "Member 'UAthenaSeasonTab_C::BackgroundGradient' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, CurrentPageNumber) == 0x0004C8, "Member 'UAthenaSeasonTab_C::CurrentPageNumber' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, ItemName) == 0x0004D0, "Member 'UAthenaSeasonTab_C::ItemName' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, ItemType) == 0x0004D8, "Member 'UAthenaSeasonTab_C::ItemType' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, LevelPageWidgetSwitcher) == 0x0004E0, "Member 'UAthenaSeasonTab_C::LevelPageWidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, MainViewItemInfoOverlay) == 0x0004E8, "Member 'UAthenaSeasonTab_C::MainViewItemInfoOverlay' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, MainViewItemInfoVB) == 0x0004F0, "Member 'UAthenaSeasonTab_C::MainViewItemInfoVB' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, PageLeftBtn) == 0x0004F8, "Member 'UAthenaSeasonTab_C::PageLeftBtn' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, PageRightBtn) == 0x000500, "Member 'UAthenaSeasonTab_C::PageRightBtn' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, PassCompleted) == 0x000508, "Member 'UAthenaSeasonTab_C::PassCompleted' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, PassNotOwned) == 0x000510, "Member 'UAthenaSeasonTab_C::PassNotOwned' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, PassOwned) == 0x000518, "Member 'UAthenaSeasonTab_C::PassOwned' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, PurchaseBattlePassText) == 0x000520, "Member 'UAthenaSeasonTab_C::PurchaseBattlePassText' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, PurchaseLevelBtn) == 0x000528, "Member 'UAthenaSeasonTab_C::PurchaseLevelBtn' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, PurchaseLevelDescription) == 0x000530, "Member 'UAthenaSeasonTab_C::PurchaseLevelDescription' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, PurchaseSeasonBtn) == 0x000538, "Member 'UAthenaSeasonTab_C::PurchaseSeasonBtn' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, RarityGlow) == 0x000540, "Member 'UAthenaSeasonTab_C::RarityGlow' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, Rule) == 0x000548, "Member 'UAthenaSeasonTab_C::Rule' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, SeasonCountdown) == 0x000550, "Member 'UAthenaSeasonTab_C::SeasonCountdown' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, SeasonHeadingTextLabel) == 0x000558, "Member 'UAthenaSeasonTab_C::SeasonHeadingTextLabel' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, SeasonPassOwnedSwitcher) == 0x000560, "Member 'UAthenaSeasonTab_C::SeasonPassOwnedSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, ShortDescription) == 0x000568, "Member 'UAthenaSeasonTab_C::ShortDescription' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, TotalPageNumber) == 0x000570, "Member 'UAthenaSeasonTab_C::TotalPageNumber' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, UnlockableBundles) == 0x000578, "Member 'UAthenaSeasonTab_C::UnlockableBundles' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, ActiveBundles) == 0x000588, "Member 'UAthenaSeasonTab_C::ActiveBundles' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, LastActiveTab) == 0x000598, "Member 'UAthenaSeasonTab_C::LastActiveTab' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, CurrentPage) == 0x0005A0, "Member 'UAthenaSeasonTab_C::CurrentPage' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, SeasonCatalogOffer) == 0x0005A8, "Member 'UAthenaSeasonTab_C::SeasonCatalogOffer' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, BattlePointsCurrency) == 0x0005B0, "Member 'UAthenaSeasonTab_C::BattlePointsCurrency' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonTab_C, DoNotNavigateToFirstLevel) == 0x0005B8, "Member 'UAthenaSeasonTab_C::DoNotNavigateToFirstLevel' has a wrong offset!");

}

