#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSeasonLevelPaidRewardsWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaSeasonLevelPaidRewardsWidget.AthenaSeasonLevelPaidRewardsWidget_C
// 0x0030 (0x0258 - 0x0228)
class UAthenaSeasonLevelPaidRewardsWidget_C final : public USeasonPassLevelWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(Transient, DuplicateTransient)
	class UCommonBorder*                          NotPurchasedDarken;                                // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          PaidRewardsBorder;                                 // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             PaidRewardsGrid;                                   // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UAthenaSeasonReward_C*>          RewardWidgets;                                     // 0x0248(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_AthenaSeasonLevelPaidRewardsWidget(int32 EntryPoint);
	void OnNavigateTo();
	void OnLockedStatusChanged(bool FreeUnlocked, bool PaidUnlocked);
	void OnSetup();
	void UpdateStyling();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSeasonLevelPaidRewardsWidget_C">();
	}
	static class UAthenaSeasonLevelPaidRewardsWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSeasonLevelPaidRewardsWidget_C>();
	}
};
static_assert(alignof(UAthenaSeasonLevelPaidRewardsWidget_C) == 0x000008, "Wrong alignment on UAthenaSeasonLevelPaidRewardsWidget_C");
static_assert(sizeof(UAthenaSeasonLevelPaidRewardsWidget_C) == 0x000258, "Wrong size on UAthenaSeasonLevelPaidRewardsWidget_C");
static_assert(offsetof(UAthenaSeasonLevelPaidRewardsWidget_C, UberGraphFrame) == 0x000228, "Member 'UAthenaSeasonLevelPaidRewardsWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelPaidRewardsWidget_C, NotPurchasedDarken) == 0x000230, "Member 'UAthenaSeasonLevelPaidRewardsWidget_C::NotPurchasedDarken' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelPaidRewardsWidget_C, PaidRewardsBorder) == 0x000238, "Member 'UAthenaSeasonLevelPaidRewardsWidget_C::PaidRewardsBorder' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelPaidRewardsWidget_C, PaidRewardsGrid) == 0x000240, "Member 'UAthenaSeasonLevelPaidRewardsWidget_C::PaidRewardsGrid' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonLevelPaidRewardsWidget_C, RewardWidgets) == 0x000248, "Member 'UAthenaSeasonLevelPaidRewardsWidget_C::RewardWidgets' has a wrong offset!");

}

