#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLeaderboardTabButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaLeaderboardTabButton.AthenaLeaderboardTabButton_C
// 0x00E8 (0x0868 - 0x0780)
class UAthenaLeaderboardTabButton_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0780(0x0008)(Transient, DuplicateTransient)
	class UCommonTextBlock*                       CenterButtonTextWidget;                            // 0x0788(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ContentHB;                                         // 0x0790(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftSideImage;                                     // 0x0798(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x07A0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateBrush                            IconBrush;                                         // 0x07B8(0x0078)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          UseText;                                           // 0x0830(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_831[0x3];                                      // 0x0831(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           SelectedIconTint;                                  // 0x0834(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DeselectedIconTint;                                // 0x0844(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoveredIconTint;                                   // 0x0854(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBangEnabled;                                      // 0x0864(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AthenaLeaderboardTabButton(int32 EntryPoint);
	void OnUnhovered();
	void OnHovered();
	void Construct();
	void OnDeselected();
	void OnSelected();
	void SetTabLabelInfo(const struct FFortTabButtonLabelInfo& TabLabelInfo);
	void OnCurrentTextStyleChanged();
	void PreConstruct(bool IsDesignTime);
	void Set_Text(const class FText& Param_ButtonText);
	void Set_Icon(const struct FSlateBrush& Param_IconBrush);
	void ShowText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaLeaderboardTabButton_C">();
	}
	static class UAthenaLeaderboardTabButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLeaderboardTabButton_C>();
	}
};
static_assert(alignof(UAthenaLeaderboardTabButton_C) == 0x000008, "Wrong alignment on UAthenaLeaderboardTabButton_C");
static_assert(sizeof(UAthenaLeaderboardTabButton_C) == 0x000868, "Wrong size on UAthenaLeaderboardTabButton_C");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, UberGraphFrame) == 0x000780, "Member 'UAthenaLeaderboardTabButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, CenterButtonTextWidget) == 0x000788, "Member 'UAthenaLeaderboardTabButton_C::CenterButtonTextWidget' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, ContentHB) == 0x000790, "Member 'UAthenaLeaderboardTabButton_C::ContentHB' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, LeftSideImage) == 0x000798, "Member 'UAthenaLeaderboardTabButton_C::LeftSideImage' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, ButtonText) == 0x0007A0, "Member 'UAthenaLeaderboardTabButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, IconBrush) == 0x0007B8, "Member 'UAthenaLeaderboardTabButton_C::IconBrush' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, UseText) == 0x000830, "Member 'UAthenaLeaderboardTabButton_C::UseText' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, SelectedIconTint) == 0x000834, "Member 'UAthenaLeaderboardTabButton_C::SelectedIconTint' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, DeselectedIconTint) == 0x000844, "Member 'UAthenaLeaderboardTabButton_C::DeselectedIconTint' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, HoveredIconTint) == 0x000854, "Member 'UAthenaLeaderboardTabButton_C::HoveredIconTint' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTabButton_C, bBangEnabled) == 0x000864, "Member 'UAthenaLeaderboardTabButton_C::bBangEnabled' has a wrong offset!");

}

