#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaInventoryDragVisual

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "AthenaDragDropAction_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaInventoryDragVisual.AthenaInventoryDragVisual_C
// 0x0030 (0x0248 - 0x0218)
class UAthenaInventoryDragVisual_C final : public UFortUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0218(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 DropImage;                                         // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DropImageContainer;                                // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 ItemWidget;                                        // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItem*                              Item;                                              // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EFortItemCardSize                             ItemCardSize;                                      // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaInventoryDragVisual(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void ShowDropIcon(EAthenaDragDropAction Drop_Action);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaInventoryDragVisual_C">();
	}
	static class UAthenaInventoryDragVisual_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInventoryDragVisual_C>();
	}
};
static_assert(alignof(UAthenaInventoryDragVisual_C) == 0x000008, "Wrong alignment on UAthenaInventoryDragVisual_C");
static_assert(sizeof(UAthenaInventoryDragVisual_C) == 0x000248, "Wrong size on UAthenaInventoryDragVisual_C");
static_assert(offsetof(UAthenaInventoryDragVisual_C, UberGraphFrame) == 0x000218, "Member 'UAthenaInventoryDragVisual_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryDragVisual_C, DropImage) == 0x000220, "Member 'UAthenaInventoryDragVisual_C::DropImage' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryDragVisual_C, DropImageContainer) == 0x000228, "Member 'UAthenaInventoryDragVisual_C::DropImageContainer' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryDragVisual_C, ItemWidget) == 0x000230, "Member 'UAthenaInventoryDragVisual_C::ItemWidget' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryDragVisual_C, Item) == 0x000238, "Member 'UAthenaInventoryDragVisual_C::Item' has a wrong offset!");
static_assert(offsetof(UAthenaInventoryDragVisual_C, ItemCardSize) == 0x000240, "Member 'UAthenaInventoryDragVisual_C::ItemCardSize' has a wrong offset!");

}

