#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaEquipProgress

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function AthenaEquipProgress.AthenaEquipProgress_C.ExecuteUbergraph_AthenaEquipProgress
// 0x0158 (0x0158 - 0x0000)
struct AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_CueName;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_CustomEvent_EventType;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_CustomEvent_Parameters;                     // 0x0070(0x00B8)(ConstParm, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName CueName, EGameplayCueEvent EventType, struct FGameplayCueParameters& Parameters)> K2Node_CreateDelegate_OutputDelegate;              // 0x0138(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue2;        // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress) == 0x000008, "Wrong alignment on AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress");
static_assert(sizeof(AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress) == 0x000158, "Wrong size on AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress");
static_assert(offsetof(AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress, EntryPoint) == 0x000000, "Member 'AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress, K2Node_Event_MyGeometry) == 0x000004, "Member 'AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress, CallFunc_Less_FloatFloat_ReturnValue) == 0x000040, "Member 'AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000044, "Member 'AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000048, "Member 'AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00004C, "Member 'AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress, CallFunc_FClamp_ReturnValue) == 0x000050, "Member 'AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x000054, "Member 'AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000058, "Member 'AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress, K2Node_CustomEvent_CueName) == 0x000060, "Member 'AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress::K2Node_CustomEvent_CueName' has a wrong offset!");
static_assert(offsetof(AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress, K2Node_CustomEvent_EventType) == 0x000068, "Member 'AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress::K2Node_CustomEvent_EventType' has a wrong offset!");
static_assert(offsetof(AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress, K2Node_CustomEvent_Parameters) == 0x000070, "Member 'AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress::K2Node_CustomEvent_Parameters' has a wrong offset!");
static_assert(offsetof(AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress, K2Node_SwitchEnum_CmpSuccess) == 0x000128, "Member 'AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress, K2Node_SwitchName_CmpSuccess) == 0x000129, "Member 'AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000130, "Member 'AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress, K2Node_CreateDelegate_OutputDelegate) == 0x000138, "Member 'AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress, CallFunc_GetGameTimeInSeconds_ReturnValue2) == 0x000148, "Member 'AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress::CallFunc_GetGameTimeInSeconds_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00014C, "Member 'AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress, CallFunc_GetContext_ReturnValue) == 0x000150, "Member 'AthenaEquipProgress_C_ExecuteUbergraph_AthenaEquipProgress::CallFunc_GetContext_ReturnValue' has a wrong offset!");

// Function AthenaEquipProgress.AthenaEquipProgress_C.OnUIGameplayCue_Event_0
// 0x00C8 (0x00C8 - 0x0000)
struct AthenaEquipProgress_C_OnUIGameplayCue_Event_0 final
{
public:
	class FName                                   CueName;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             EventType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 Parameters;                                        // 0x0010(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(AthenaEquipProgress_C_OnUIGameplayCue_Event_0) == 0x000008, "Wrong alignment on AthenaEquipProgress_C_OnUIGameplayCue_Event_0");
static_assert(sizeof(AthenaEquipProgress_C_OnUIGameplayCue_Event_0) == 0x0000C8, "Wrong size on AthenaEquipProgress_C_OnUIGameplayCue_Event_0");
static_assert(offsetof(AthenaEquipProgress_C_OnUIGameplayCue_Event_0, CueName) == 0x000000, "Member 'AthenaEquipProgress_C_OnUIGameplayCue_Event_0::CueName' has a wrong offset!");
static_assert(offsetof(AthenaEquipProgress_C_OnUIGameplayCue_Event_0, EventType) == 0x000008, "Member 'AthenaEquipProgress_C_OnUIGameplayCue_Event_0::EventType' has a wrong offset!");
static_assert(offsetof(AthenaEquipProgress_C_OnUIGameplayCue_Event_0, Parameters) == 0x000010, "Member 'AthenaEquipProgress_C_OnUIGameplayCue_Event_0::Parameters' has a wrong offset!");

// Function AthenaEquipProgress.AthenaEquipProgress_C.Tick
// 0x003C (0x003C - 0x0000)
struct AthenaEquipProgress_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaEquipProgress_C_Tick) == 0x000004, "Wrong alignment on AthenaEquipProgress_C_Tick");
static_assert(sizeof(AthenaEquipProgress_C_Tick) == 0x00003C, "Wrong size on AthenaEquipProgress_C_Tick");
static_assert(offsetof(AthenaEquipProgress_C_Tick, MyGeometry) == 0x000000, "Member 'AthenaEquipProgress_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(AthenaEquipProgress_C_Tick, InDeltaTime) == 0x000038, "Member 'AthenaEquipProgress_C_Tick::InDeltaTime' has a wrong offset!");

}

