#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDirectAcquisitionOfferWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C
// 0x00B0 (0x0838 - 0x0788)
class UAthenaDirectAcquisitionOfferWidget_C final : public UFortDirectAcquisitionOfferWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0788(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderRarityColored;                               // 0x0798(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BottomBorder;                                      // 0x07A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Check;                                             // 0x07A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlockOfferRemainingText;                 // 0x07B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Currency1ItemImage;                                // 0x07B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          ExclusiveBorder;                                   // 0x07C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HighlightGlow;                                     // 0x07C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockImage;                                         // 0x07D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MainImage;                                         // 0x07D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLoadGuard*                       MainImageLoadGuard;                                // 0x07E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NameText;                                          // 0x07E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        OwnedSwitcher;                                     // 0x07F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       OwnedText;                                         // 0x07F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SBPriceBox;                                        // 0x0800(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SBScaleDownArt;                                    // 0x0808(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SBTileSize;                                        // 0x0810(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ShortDescriptionText;                              // 0x0818(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOfferDisplayPrice;                             // 0x0820(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBHeaderAndDescription;                            // 0x0828(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          LargeTile;                                         // 0x0830(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget(int32 EntryPoint);
	void SetData(class UObject* InData, class UCommonListView* OwningList);
	void OnUpdateStatus();
	void OnUnhovered();
	void OnHovered();
	void HandleOfferPurchaseComplete(bool bSuccess);
	void OnClicked();
	void OnOfferSet();
	void Reset();
	void ToggleExpansion();
	void SetSelected(bool bSelected);
	void SetIndexInList(int32 InIndexInList);
	void SetExpanded(bool bExpanded);
	void RegisterOnClicked(const TDelegate<void(class UUserWidget* Widget)>& Callback);
	void Private_OnExpanderArrowShiftClicked();
	void OnReleaseToPool();
	void OnAcquireFromPool();
	void OfferSet();
	void UpdateAvailability();
	void UpdateStyle();
	void SetupPrice(int32 PriceIndex, class UItemCount_C* PriceWidget);
	void LargeImageLoaded(class UObject* LoadedObject);
	void UpdateName();
	void UpdateShortDescription();
	void Setup_Price();

	class UObject* GetData() const;
	bool IsItemExpanded() const;
	int32 DoesItemHaveChildren() const;
	int32 GetIndentLevel() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaDirectAcquisitionOfferWidget_C">();
	}
	static class UAthenaDirectAcquisitionOfferWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaDirectAcquisitionOfferWidget_C>();
	}
};
static_assert(alignof(UAthenaDirectAcquisitionOfferWidget_C) == 0x000008, "Wrong alignment on UAthenaDirectAcquisitionOfferWidget_C");
static_assert(sizeof(UAthenaDirectAcquisitionOfferWidget_C) == 0x000838, "Wrong size on UAthenaDirectAcquisitionOfferWidget_C");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidget_C, UberGraphFrame) == 0x000788, "Member 'UAthenaDirectAcquisitionOfferWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidget_C, Hover) == 0x000790, "Member 'UAthenaDirectAcquisitionOfferWidget_C::Hover' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidget_C, BorderRarityColored) == 0x000798, "Member 'UAthenaDirectAcquisitionOfferWidget_C::BorderRarityColored' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidget_C, BottomBorder) == 0x0007A0, "Member 'UAthenaDirectAcquisitionOfferWidget_C::BottomBorder' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidget_C, Check) == 0x0007A8, "Member 'UAthenaDirectAcquisitionOfferWidget_C::Check' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidget_C, CommonTextBlockOfferRemainingText) == 0x0007B0, "Member 'UAthenaDirectAcquisitionOfferWidget_C::CommonTextBlockOfferRemainingText' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidget_C, Currency1ItemImage) == 0x0007B8, "Member 'UAthenaDirectAcquisitionOfferWidget_C::Currency1ItemImage' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidget_C, ExclusiveBorder) == 0x0007C0, "Member 'UAthenaDirectAcquisitionOfferWidget_C::ExclusiveBorder' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidget_C, HighlightGlow) == 0x0007C8, "Member 'UAthenaDirectAcquisitionOfferWidget_C::HighlightGlow' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidget_C, LockImage) == 0x0007D0, "Member 'UAthenaDirectAcquisitionOfferWidget_C::LockImage' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidget_C, MainImage) == 0x0007D8, "Member 'UAthenaDirectAcquisitionOfferWidget_C::MainImage' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidget_C, MainImageLoadGuard) == 0x0007E0, "Member 'UAthenaDirectAcquisitionOfferWidget_C::MainImageLoadGuard' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidget_C, NameText) == 0x0007E8, "Member 'UAthenaDirectAcquisitionOfferWidget_C::NameText' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidget_C, OwnedSwitcher) == 0x0007F0, "Member 'UAthenaDirectAcquisitionOfferWidget_C::OwnedSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidget_C, OwnedText) == 0x0007F8, "Member 'UAthenaDirectAcquisitionOfferWidget_C::OwnedText' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidget_C, SBPriceBox) == 0x000800, "Member 'UAthenaDirectAcquisitionOfferWidget_C::SBPriceBox' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidget_C, SBScaleDownArt) == 0x000808, "Member 'UAthenaDirectAcquisitionOfferWidget_C::SBScaleDownArt' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidget_C, SBTileSize) == 0x000810, "Member 'UAthenaDirectAcquisitionOfferWidget_C::SBTileSize' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidget_C, ShortDescriptionText) == 0x000818, "Member 'UAthenaDirectAcquisitionOfferWidget_C::ShortDescriptionText' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidget_C, TextOfferDisplayPrice) == 0x000820, "Member 'UAthenaDirectAcquisitionOfferWidget_C::TextOfferDisplayPrice' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidget_C, VBHeaderAndDescription) == 0x000828, "Member 'UAthenaDirectAcquisitionOfferWidget_C::VBHeaderAndDescription' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferWidget_C, LargeTile) == 0x000830, "Member 'UAthenaDirectAcquisitionOfferWidget_C::LargeTile' has a wrong offset!");

}

