#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchStatsPartial

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMatchStatsPartial.AthenaMatchStatsPartial_C
// 0x00C0 (0x02D0 - 0x0210)
class UAthenaMatchStatsPartial_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UHorizontalBox*                         PlacementLine;                                     // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PlacementText;                                     // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressSpinner;                                   // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        RewardsSwitcher;                                   // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMatchStatsGrid_C*                      StatsGrid;                                         // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               WaitingForMatchToFinish;                           // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UXpMatchProgression_C*                  XpMatchProgression;                                // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaPlayerMatchReport*               MatchReport;                                       // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAthenaMatchStats                      MatchStats;                                        // 0x0258(0x0074)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_AthenaMatchStatsPartial(int32 EntryPoint);
	void Play_Xp_Rewards();
	void SetMatchReport(class UAthenaPlayerMatchReport* Report);
	void OnRewardsAvailable();
	void OnStatsAvailable();
	void OnTeamStatsAvailable();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMatchStatsPartial_C">();
	}
	static class UAthenaMatchStatsPartial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMatchStatsPartial_C>();
	}
};
static_assert(alignof(UAthenaMatchStatsPartial_C) == 0x000008, "Wrong alignment on UAthenaMatchStatsPartial_C");
static_assert(sizeof(UAthenaMatchStatsPartial_C) == 0x0002D0, "Wrong size on UAthenaMatchStatsPartial_C");
static_assert(offsetof(UAthenaMatchStatsPartial_C, UberGraphFrame) == 0x000210, "Member 'UAthenaMatchStatsPartial_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatsPartial_C, PlacementLine) == 0x000218, "Member 'UAthenaMatchStatsPartial_C::PlacementLine' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatsPartial_C, PlacementText) == 0x000220, "Member 'UAthenaMatchStatsPartial_C::PlacementText' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatsPartial_C, ProgressSpinner) == 0x000228, "Member 'UAthenaMatchStatsPartial_C::ProgressSpinner' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatsPartial_C, RewardsSwitcher) == 0x000230, "Member 'UAthenaMatchStatsPartial_C::RewardsSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatsPartial_C, StatsGrid) == 0x000238, "Member 'UAthenaMatchStatsPartial_C::StatsGrid' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatsPartial_C, WaitingForMatchToFinish) == 0x000240, "Member 'UAthenaMatchStatsPartial_C::WaitingForMatchToFinish' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatsPartial_C, XpMatchProgression) == 0x000248, "Member 'UAthenaMatchStatsPartial_C::XpMatchProgression' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatsPartial_C, MatchReport) == 0x000250, "Member 'UAthenaMatchStatsPartial_C::MatchReport' has a wrong offset!");
static_assert(offsetof(UAthenaMatchStatsPartial_C, MatchStats) == 0x000258, "Member 'UAthenaMatchStatsPartial_C::MatchStats' has a wrong offset!");

}

