#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQuickbarSecondary

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "QuickbarBase_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaQuickbarSecondary.AthenaQuickbarSecondary_C
// 0x0090 (0x02F0 - 0x0260)
class UAthenaQuickbarSecondary_C final : public UQuickbarBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AthenaQuickbarSecondary_C;          // 0x0260(0x0008)(Transient, DuplicateTransient)
	class UHorizontalBox*                         _Horizontal_Box__Camera_Mode_Content;              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 _Image__Separator;                                 // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 _Image__Switch_Action;                             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindSwitchBinding;                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       QuickbarSecondaryInvalidationBox;                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlotF1;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlotF2;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlotF3;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlotF4;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlotF5;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Building;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortBangWrapper*                       TutorialQBS1;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortBangWrapper*                       TutorialQBS2;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortBangWrapper*                       TutorialQBS3;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortBangWrapper*                       TutorialQBS4;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortBangWrapper*                       TutorialQBS5;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentBuildingSlot;                               // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaQuickbarSecondary(int32 EntryPoint);
	void AnimationFinished();
	void OnQuickbarContentsChanged(EFortQuickBars QuickbarIndex);
	void OnQuickBarSlotFocusChanged_Bind(EFortQuickBars QuickbarIndex, int32 Param_Slot);
	void Destruct();
	void HandleInputMethodChanged_Bind(bool bUsingGamepad);
	void Show_Secondary_Quickbar_Rail(bool Show);
	void HandleKeyBindsChange();
	void Construct();
	void HandleKeybindsChanged();
	void Minimize();
	void Maximize();
	void HandleMinimizeHiding();
	void HandleShowHideRail();
	void HandleMaximizeShowing();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaQuickbarSecondary_C">();
	}
	static class UAthenaQuickbarSecondary_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaQuickbarSecondary_C>();
	}
};
static_assert(alignof(UAthenaQuickbarSecondary_C) == 0x000008, "Wrong alignment on UAthenaQuickbarSecondary_C");
static_assert(sizeof(UAthenaQuickbarSecondary_C) == 0x0002F0, "Wrong size on UAthenaQuickbarSecondary_C");
static_assert(offsetof(UAthenaQuickbarSecondary_C, UberGraphFrame_AthenaQuickbarSecondary_C) == 0x000260, "Member 'UAthenaQuickbarSecondary_C::UberGraphFrame_AthenaQuickbarSecondary_C' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, _Horizontal_Box__Camera_Mode_Content) == 0x000268, "Member 'UAthenaQuickbarSecondary_C::_Horizontal_Box__Camera_Mode_Content' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, _Image__Separator) == 0x000270, "Member 'UAthenaQuickbarSecondary_C::_Image__Separator' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, _Image__Switch_Action) == 0x000278, "Member 'UAthenaQuickbarSecondary_C::_Image__Switch_Action' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, KeybindSwitchBinding) == 0x000280, "Member 'UAthenaQuickbarSecondary_C::KeybindSwitchBinding' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, QuickbarSecondaryInvalidationBox) == 0x000288, "Member 'UAthenaQuickbarSecondary_C::QuickbarSecondaryInvalidationBox' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, QuickbarSlotF1) == 0x000290, "Member 'UAthenaQuickbarSecondary_C::QuickbarSlotF1' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, QuickbarSlotF2) == 0x000298, "Member 'UAthenaQuickbarSecondary_C::QuickbarSlotF2' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, QuickbarSlotF3) == 0x0002A0, "Member 'UAthenaQuickbarSecondary_C::QuickbarSlotF3' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, QuickbarSlotF4) == 0x0002A8, "Member 'UAthenaQuickbarSecondary_C::QuickbarSlotF4' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, QuickbarSlotF5) == 0x0002B0, "Member 'UAthenaQuickbarSecondary_C::QuickbarSlotF5' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, SizeBox_Building) == 0x0002B8, "Member 'UAthenaQuickbarSecondary_C::SizeBox_Building' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, TutorialQBS1) == 0x0002C0, "Member 'UAthenaQuickbarSecondary_C::TutorialQBS1' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, TutorialQBS2) == 0x0002C8, "Member 'UAthenaQuickbarSecondary_C::TutorialQBS2' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, TutorialQBS3) == 0x0002D0, "Member 'UAthenaQuickbarSecondary_C::TutorialQBS3' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, TutorialQBS4) == 0x0002D8, "Member 'UAthenaQuickbarSecondary_C::TutorialQBS4' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, TutorialQBS5) == 0x0002E0, "Member 'UAthenaQuickbarSecondary_C::TutorialQBS5' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarSecondary_C, CurrentBuildingSlot) == 0x0002E8, "Member 'UAthenaQuickbarSecondary_C::CurrentBuildingSlot' has a wrong offset!");

}

