#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Matchmaking_SpecialEventButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Athena_Matchmaking_SpecialEventButton.Athena_Matchmaking_SpecialEventButton_C
// 0x0048 (0x0250 - 0x0208)
class UAthena_Matchmaking_SpecialEventButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewBang_OnOpen;                                    // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthena_Matchmaking_GameModeButton_C*   B_GM_LTM;                                          // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       CLI_LTM_SplashArt;                                 // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CTB_LTM_PanelHeaderText;                           // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_Bang;                                           // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title1;                                            // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bHasNewBang;                                       // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bModeHasExtraInfo;                                 // 0x0241(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             LTM_SplashArt;                                     // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void FirstTime_NewBang();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void PlayFirstTimeBang();
	void SetLTMSplashArt(TSoftObjectPtr<class UTexture2D> NewParam);
	void SetupLTM();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Matchmaking_SpecialEventButton_C">();
	}
	static class UAthena_Matchmaking_SpecialEventButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthena_Matchmaking_SpecialEventButton_C>();
	}
};
static_assert(alignof(UAthena_Matchmaking_SpecialEventButton_C) == 0x000008, "Wrong alignment on UAthena_Matchmaking_SpecialEventButton_C");
static_assert(sizeof(UAthena_Matchmaking_SpecialEventButton_C) == 0x000250, "Wrong size on UAthena_Matchmaking_SpecialEventButton_C");
static_assert(offsetof(UAthena_Matchmaking_SpecialEventButton_C, UberGraphFrame) == 0x000208, "Member 'UAthena_Matchmaking_SpecialEventButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_SpecialEventButton_C, NewBang_OnOpen) == 0x000210, "Member 'UAthena_Matchmaking_SpecialEventButton_C::NewBang_OnOpen' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_SpecialEventButton_C, B_GM_LTM) == 0x000218, "Member 'UAthena_Matchmaking_SpecialEventButton_C::B_GM_LTM' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_SpecialEventButton_C, CLI_LTM_SplashArt) == 0x000220, "Member 'UAthena_Matchmaking_SpecialEventButton_C::CLI_LTM_SplashArt' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_SpecialEventButton_C, CTB_LTM_PanelHeaderText) == 0x000228, "Member 'UAthena_Matchmaking_SpecialEventButton_C::CTB_LTM_PanelHeaderText' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_SpecialEventButton_C, SB_Bang) == 0x000230, "Member 'UAthena_Matchmaking_SpecialEventButton_C::SB_Bang' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_SpecialEventButton_C, Title1) == 0x000238, "Member 'UAthena_Matchmaking_SpecialEventButton_C::Title1' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_SpecialEventButton_C, bHasNewBang) == 0x000240, "Member 'UAthena_Matchmaking_SpecialEventButton_C::bHasNewBang' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_SpecialEventButton_C, bModeHasExtraInfo) == 0x000241, "Member 'UAthena_Matchmaking_SpecialEventButton_C::bModeHasExtraInfo' has a wrong offset!");
static_assert(offsetof(UAthena_Matchmaking_SpecialEventButton_C, LTM_SplashArt) == 0x000248, "Member 'UAthena_Matchmaking_SpecialEventButton_C::LTM_SplashArt' has a wrong offset!");

}

