#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchStatsScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AthenaMatchStatsScreen.AthenaMatchStatsScreen_C.ExecuteUbergraph_AthenaMatchStatsScreen
// 0x0028 (0x0028 - 0x0000)
struct AthenaMatchStatsScreen_C_ExecuteUbergraph_AthenaMatchStatsScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_PlayerController_C*             K2Node_DynamicCast_AsAthena_Player_Controller;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaPlayerMatchReport*               CallFunc_GetMatchReport_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchStatsScreen_C_ExecuteUbergraph_AthenaMatchStatsScreen) == 0x000008, "Wrong alignment on AthenaMatchStatsScreen_C_ExecuteUbergraph_AthenaMatchStatsScreen");
static_assert(sizeof(AthenaMatchStatsScreen_C_ExecuteUbergraph_AthenaMatchStatsScreen) == 0x000028, "Wrong size on AthenaMatchStatsScreen_C_ExecuteUbergraph_AthenaMatchStatsScreen");
static_assert(offsetof(AthenaMatchStatsScreen_C_ExecuteUbergraph_AthenaMatchStatsScreen, EntryPoint) == 0x000000, "Member 'AthenaMatchStatsScreen_C_ExecuteUbergraph_AthenaMatchStatsScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsScreen_C_ExecuteUbergraph_AthenaMatchStatsScreen, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'AthenaMatchStatsScreen_C_ExecuteUbergraph_AthenaMatchStatsScreen::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsScreen_C_ExecuteUbergraph_AthenaMatchStatsScreen, K2Node_DynamicCast_AsAthena_Player_Controller) == 0x000010, "Member 'AthenaMatchStatsScreen_C_ExecuteUbergraph_AthenaMatchStatsScreen::K2Node_DynamicCast_AsAthena_Player_Controller' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsScreen_C_ExecuteUbergraph_AthenaMatchStatsScreen, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AthenaMatchStatsScreen_C_ExecuteUbergraph_AthenaMatchStatsScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsScreen_C_ExecuteUbergraph_AthenaMatchStatsScreen, CallFunc_GetMatchReport_ReturnValue) == 0x000020, "Member 'AthenaMatchStatsScreen_C_ExecuteUbergraph_AthenaMatchStatsScreen::CallFunc_GetMatchReport_ReturnValue' has a wrong offset!");

// Function AthenaMatchStatsScreen.AthenaMatchStatsScreen_C.RegisterBack
// 0x0020 (0x0020 - 0x0000)
struct AthenaMatchStatsScreen_C_RegisterBack final
{
public:
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0010(0x0010)(NoDestructor)
};
static_assert(alignof(AthenaMatchStatsScreen_C_RegisterBack) == 0x000008, "Wrong alignment on AthenaMatchStatsScreen_C_RegisterBack");
static_assert(sizeof(AthenaMatchStatsScreen_C_RegisterBack) == 0x000020, "Wrong size on AthenaMatchStatsScreen_C_RegisterBack");
static_assert(offsetof(AthenaMatchStatsScreen_C_RegisterBack, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'AthenaMatchStatsScreen_C_RegisterBack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsScreen_C_RegisterBack, K2Node_MakeStruct_DataTableRowHandle) == 0x000010, "Member 'AthenaMatchStatsScreen_C_RegisterBack::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");

// Function AthenaMatchStatsScreen.AthenaMatchStatsScreen_C.HandleBack
// 0x0010 (0x0010 - 0x0000)
struct AthenaMatchStatsScreen_C_HandleBack final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchStatsScreen_C_HandleBack) == 0x000008, "Wrong alignment on AthenaMatchStatsScreen_C_HandleBack");
static_assert(sizeof(AthenaMatchStatsScreen_C_HandleBack) == 0x000010, "Wrong size on AthenaMatchStatsScreen_C_HandleBack");
static_assert(offsetof(AthenaMatchStatsScreen_C_HandleBack, Passthrough) == 0x000000, "Member 'AthenaMatchStatsScreen_C_HandleBack::Passthrough' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsScreen_C_HandleBack, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000008, "Member 'AthenaMatchStatsScreen_C_HandleBack::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function AthenaMatchStatsScreen.AthenaMatchStatsScreen_C.InputRefresh
// 0x0010 (0x0010 - 0x0000)
struct AthenaMatchStatsScreen_C_InputRefresh final
{
public:
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0000(0x0010)(NoDestructor)
};
static_assert(alignof(AthenaMatchStatsScreen_C_InputRefresh) == 0x000008, "Wrong alignment on AthenaMatchStatsScreen_C_InputRefresh");
static_assert(sizeof(AthenaMatchStatsScreen_C_InputRefresh) == 0x000010, "Wrong size on AthenaMatchStatsScreen_C_InputRefresh");
static_assert(offsetof(AthenaMatchStatsScreen_C_InputRefresh, K2Node_MakeStruct_DataTableRowHandle) == 0x000000, "Member 'AthenaMatchStatsScreen_C_InputRefresh::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");

}

