#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaTeamMemberInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaTeamMemberInfo.AthenaTeamMemberInfo_C.ExecuteUbergraph_AthenaTeamMemberInfo
// 0x00C0 (0x00C0 - 0x0000)
struct AthenaTeamMemberInfo_C_ExecuteUbergraph_AthenaTeamMemberInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_Select_Default;                             // 0x0008(0x0078)()
	bool                                          CallFunc_CanFriend_CanFriend;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0090(0x0028)()
	bool                                          CallFunc_CanFriend_CanFriend2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTeamMemberInfo_C_ExecuteUbergraph_AthenaTeamMemberInfo) == 0x000008, "Wrong alignment on AthenaTeamMemberInfo_C_ExecuteUbergraph_AthenaTeamMemberInfo");
static_assert(sizeof(AthenaTeamMemberInfo_C_ExecuteUbergraph_AthenaTeamMemberInfo) == 0x0000C0, "Wrong size on AthenaTeamMemberInfo_C_ExecuteUbergraph_AthenaTeamMemberInfo");
static_assert(offsetof(AthenaTeamMemberInfo_C_ExecuteUbergraph_AthenaTeamMemberInfo, EntryPoint) == 0x000000, "Member 'AthenaTeamMemberInfo_C_ExecuteUbergraph_AthenaTeamMemberInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_ExecuteUbergraph_AthenaTeamMemberInfo, Temp_int_Variable) == 0x000004, "Member 'AthenaTeamMemberInfo_C_ExecuteUbergraph_AthenaTeamMemberInfo::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_ExecuteUbergraph_AthenaTeamMemberInfo, K2Node_Select_Default) == 0x000008, "Member 'AthenaTeamMemberInfo_C_ExecuteUbergraph_AthenaTeamMemberInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_ExecuteUbergraph_AthenaTeamMemberInfo, CallFunc_CanFriend_CanFriend) == 0x000080, "Member 'AthenaTeamMemberInfo_C_ExecuteUbergraph_AthenaTeamMemberInfo::CallFunc_CanFriend_CanFriend' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_ExecuteUbergraph_AthenaTeamMemberInfo, K2Node_ComponentBoundEvent_Button) == 0x000088, "Member 'AthenaTeamMemberInfo_C_ExecuteUbergraph_AthenaTeamMemberInfo::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_ExecuteUbergraph_AthenaTeamMemberInfo, K2Node_MakeStruct_SlateColor) == 0x000090, "Member 'AthenaTeamMemberInfo_C_ExecuteUbergraph_AthenaTeamMemberInfo::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_ExecuteUbergraph_AthenaTeamMemberInfo, CallFunc_CanFriend_CanFriend2) == 0x0000B8, "Member 'AthenaTeamMemberInfo_C_ExecuteUbergraph_AthenaTeamMemberInfo::CallFunc_CanFriend_CanFriend2' has a wrong offset!");

// Function AthenaTeamMemberInfo.AthenaTeamMemberInfo_C.BndEvt__AddFriendButton_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaTeamMemberInfo_C_BndEvt__AddFriendButton_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTeamMemberInfo_C_BndEvt__AddFriendButton_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaTeamMemberInfo_C_BndEvt__AddFriendButton_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaTeamMemberInfo_C_BndEvt__AddFriendButton_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaTeamMemberInfo_C_BndEvt__AddFriendButton_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaTeamMemberInfo_C_BndEvt__AddFriendButton_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaTeamMemberInfo_C_BndEvt__AddFriendButton_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaTeamMemberInfo.AthenaTeamMemberInfo_C.SetHealth
// 0x0018 (0x0018 - 0x0000)
struct AthenaTeamMemberInfo_C_SetHealth final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue2;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTeamMemberInfo_C_SetHealth) == 0x000008, "Wrong alignment on AthenaTeamMemberInfo_C_SetHealth");
static_assert(sizeof(AthenaTeamMemberInfo_C_SetHealth) == 0x000018, "Wrong size on AthenaTeamMemberInfo_C_SetHealth");
static_assert(offsetof(AthenaTeamMemberInfo_C_SetHealth, Value) == 0x000000, "Member 'AthenaTeamMemberInfo_C_SetHealth::Value' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_SetHealth, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'AthenaTeamMemberInfo_C_SetHealth::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_SetHealth, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'AthenaTeamMemberInfo_C_SetHealth::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_SetHealth, CallFunc_GetDynamicMaterial_ReturnValue2) == 0x000010, "Member 'AthenaTeamMemberInfo_C_SetHealth::CallFunc_GetDynamicMaterial_ReturnValue2' has a wrong offset!");

// Function AthenaTeamMemberInfo.AthenaTeamMemberInfo_C.SetShield
// 0x0010 (0x0010 - 0x0000)
struct AthenaTeamMemberInfo_C_SetShield final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTeamMemberInfo_C_SetShield) == 0x000008, "Wrong alignment on AthenaTeamMemberInfo_C_SetShield");
static_assert(sizeof(AthenaTeamMemberInfo_C_SetShield) == 0x000010, "Wrong size on AthenaTeamMemberInfo_C_SetShield");
static_assert(offsetof(AthenaTeamMemberInfo_C_SetShield, Value) == 0x000000, "Member 'AthenaTeamMemberInfo_C_SetShield::Value' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_SetShield, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'AthenaTeamMemberInfo_C_SetShield::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_SetShield, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'AthenaTeamMemberInfo_C_SetShield::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function AthenaTeamMemberInfo.AthenaTeamMemberInfo_C.UpdatePS
// 0x0008 (0x0008 - 0x0000)
struct AthenaTeamMemberInfo_C_UpdatePS final
{
public:
	class AFortPlayerStateAthena*                 InPlayerState;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTeamMemberInfo_C_UpdatePS) == 0x000008, "Wrong alignment on AthenaTeamMemberInfo_C_UpdatePS");
static_assert(sizeof(AthenaTeamMemberInfo_C_UpdatePS) == 0x000008, "Wrong size on AthenaTeamMemberInfo_C_UpdatePS");
static_assert(offsetof(AthenaTeamMemberInfo_C_UpdatePS, InPlayerState) == 0x000000, "Member 'AthenaTeamMemberInfo_C_UpdatePS::InPlayerState' has a wrong offset!");

// Function AthenaTeamMemberInfo.AthenaTeamMemberInfo_C.SetDead
// 0x0088 (0x0088 - 0x0000)
struct AthenaTeamMemberInfo_C_SetDead final
{
public:
	bool                                          Dead;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor2;                     // 0x0038(0x0028)()
	struct FSlateColor                            K2Node_Select2_Default;                            // 0x0060(0x0028)()
};
static_assert(alignof(AthenaTeamMemberInfo_C_SetDead) == 0x000008, "Wrong alignment on AthenaTeamMemberInfo_C_SetDead");
static_assert(sizeof(AthenaTeamMemberInfo_C_SetDead) == 0x000088, "Wrong size on AthenaTeamMemberInfo_C_SetDead");
static_assert(offsetof(AthenaTeamMemberInfo_C_SetDead, Dead) == 0x000000, "Member 'AthenaTeamMemberInfo_C_SetDead::Dead' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_SetDead, Temp_bool_Variable) == 0x000001, "Member 'AthenaTeamMemberInfo_C_SetDead::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_SetDead, Temp_bool_Variable2) == 0x000002, "Member 'AthenaTeamMemberInfo_C_SetDead::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_SetDead, Temp_byte_Variable) == 0x000003, "Member 'AthenaTeamMemberInfo_C_SetDead::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_SetDead, Temp_byte_Variable2) == 0x000004, "Member 'AthenaTeamMemberInfo_C_SetDead::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_SetDead, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'AthenaTeamMemberInfo_C_SetDead::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_SetDead, K2Node_Select_Default) == 0x000030, "Member 'AthenaTeamMemberInfo_C_SetDead::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_SetDead, K2Node_MakeStruct_SlateColor2) == 0x000038, "Member 'AthenaTeamMemberInfo_C_SetDead::K2Node_MakeStruct_SlateColor2' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_SetDead, K2Node_Select2_Default) == 0x000060, "Member 'AthenaTeamMemberInfo_C_SetDead::K2Node_Select2_Default' has a wrong offset!");

// Function AthenaTeamMemberInfo.AthenaTeamMemberInfo_C.SetDBNO
// 0x0001 (0x0001 - 0x0000)
struct AthenaTeamMemberInfo_C_SetDBNO final
{
public:
	bool                                          DBNO;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTeamMemberInfo_C_SetDBNO) == 0x000001, "Wrong alignment on AthenaTeamMemberInfo_C_SetDBNO");
static_assert(sizeof(AthenaTeamMemberInfo_C_SetDBNO) == 0x000001, "Wrong size on AthenaTeamMemberInfo_C_SetDBNO");
static_assert(offsetof(AthenaTeamMemberInfo_C_SetDBNO, DBNO) == 0x000000, "Member 'AthenaTeamMemberInfo_C_SetDBNO::DBNO' has a wrong offset!");

// Function AthenaTeamMemberInfo.AthenaTeamMemberInfo_C.UpdatePlayerName
// 0x0028 (0x0028 - 0x0000)
struct AthenaTeamMemberInfo_C_UpdatePlayerName final
{
public:
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};
static_assert(alignof(AthenaTeamMemberInfo_C_UpdatePlayerName) == 0x000008, "Wrong alignment on AthenaTeamMemberInfo_C_UpdatePlayerName");
static_assert(sizeof(AthenaTeamMemberInfo_C_UpdatePlayerName) == 0x000028, "Wrong size on AthenaTeamMemberInfo_C_UpdatePlayerName");
static_assert(offsetof(AthenaTeamMemberInfo_C_UpdatePlayerName, CallFunc_GetPlayerName_ReturnValue) == 0x000000, "Member 'AthenaTeamMemberInfo_C_UpdatePlayerName::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_UpdatePlayerName, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'AthenaTeamMemberInfo_C_UpdatePlayerName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function AthenaTeamMemberInfo.AthenaTeamMemberInfo_C.SetReviving
// 0x0001 (0x0001 - 0x0000)
struct AthenaTeamMemberInfo_C_SetReviving final
{
public:
	bool                                          Reviving;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTeamMemberInfo_C_SetReviving) == 0x000001, "Wrong alignment on AthenaTeamMemberInfo_C_SetReviving");
static_assert(sizeof(AthenaTeamMemberInfo_C_SetReviving) == 0x000001, "Wrong size on AthenaTeamMemberInfo_C_SetReviving");
static_assert(offsetof(AthenaTeamMemberInfo_C_SetReviving, Reviving) == 0x000000, "Member 'AthenaTeamMemberInfo_C_SetReviving::Reviving' has a wrong offset!");

// Function AthenaTeamMemberInfo.AthenaTeamMemberInfo_C.SetMuted
// 0x0001 (0x0001 - 0x0000)
struct AthenaTeamMemberInfo_C_SetMuted final
{
public:
	bool                                          NewMuted;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTeamMemberInfo_C_SetMuted) == 0x000001, "Wrong alignment on AthenaTeamMemberInfo_C_SetMuted");
static_assert(sizeof(AthenaTeamMemberInfo_C_SetMuted) == 0x000001, "Wrong size on AthenaTeamMemberInfo_C_SetMuted");
static_assert(offsetof(AthenaTeamMemberInfo_C_SetMuted, NewMuted) == 0x000000, "Member 'AthenaTeamMemberInfo_C_SetMuted::NewMuted' has a wrong offset!");

// Function AthenaTeamMemberInfo.AthenaTeamMemberInfo_C.SetTalking
// 0x0001 (0x0001 - 0x0000)
struct AthenaTeamMemberInfo_C_SetTalking final
{
public:
	bool                                          NewTalking;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTeamMemberInfo_C_SetTalking) == 0x000001, "Wrong alignment on AthenaTeamMemberInfo_C_SetTalking");
static_assert(sizeof(AthenaTeamMemberInfo_C_SetTalking) == 0x000001, "Wrong size on AthenaTeamMemberInfo_C_SetTalking");
static_assert(offsetof(AthenaTeamMemberInfo_C_SetTalking, NewTalking) == 0x000000, "Member 'AthenaTeamMemberInfo_C_SetTalking::NewTalking' has a wrong offset!");

// Function AthenaTeamMemberInfo.AthenaTeamMemberInfo_C.SetPlayerDisconnected
// 0x0028 (0x0028 - 0x0000)
struct AthenaTeamMemberInfo_C_SetPlayerDisconnected final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0028)()
};
static_assert(alignof(AthenaTeamMemberInfo_C_SetPlayerDisconnected) == 0x000008, "Wrong alignment on AthenaTeamMemberInfo_C_SetPlayerDisconnected");
static_assert(sizeof(AthenaTeamMemberInfo_C_SetPlayerDisconnected) == 0x000028, "Wrong size on AthenaTeamMemberInfo_C_SetPlayerDisconnected");
static_assert(offsetof(AthenaTeamMemberInfo_C_SetPlayerDisconnected, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'AthenaTeamMemberInfo_C_SetPlayerDisconnected::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function AthenaTeamMemberInfo.AthenaTeamMemberInfo_C.CanFriend
// 0x00A0 (0x00A0 - 0x0000)
struct AthenaTeamMemberInfo_C_CanFriend final
{
public:
	bool                                          Param_CanFriend;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       NetIdToUse;                                        // 0x0008(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTencentBuild_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidNetID_ReturnValue;                 // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortFriendRequestStatus                      Temp_byte_Variable;                                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsolePlatform_ReturnValue;            // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortFriendRequestStatus                      CallFunc_GetFriendRequestStatusForPlayer_ReturnValue; // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerStateAthena*                 K2Node_DynamicCast_AsFort_Player_State_Athena;     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetUniqueID_ReturnValue;                  // 0x0070(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_UniqueNetIdReplUniqueNetIdRepl_ReturnValue; // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTeamMemberInfo_C_CanFriend) == 0x000008, "Wrong alignment on AthenaTeamMemberInfo_C_CanFriend");
static_assert(sizeof(AthenaTeamMemberInfo_C_CanFriend) == 0x0000A0, "Wrong size on AthenaTeamMemberInfo_C_CanFriend");
static_assert(offsetof(AthenaTeamMemberInfo_C_CanFriend, Param_CanFriend) == 0x000000, "Member 'AthenaTeamMemberInfo_C_CanFriend::Param_CanFriend' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_CanFriend, NetIdToUse) == 0x000008, "Member 'AthenaTeamMemberInfo_C_CanFriend::NetIdToUse' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_CanFriend, Temp_bool_Variable) == 0x000030, "Member 'AthenaTeamMemberInfo_C_CanFriend::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_CanFriend, Temp_bool_Variable2) == 0x000031, "Member 'AthenaTeamMemberInfo_C_CanFriend::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_CanFriend, CallFunc_GetContext_ReturnValue) == 0x000038, "Member 'AthenaTeamMemberInfo_C_CanFriend::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_CanFriend, CallFunc_IsTencentBuild_ReturnValue) == 0x000040, "Member 'AthenaTeamMemberInfo_C_CanFriend::CallFunc_IsTencentBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_CanFriend, Temp_bool_Variable3) == 0x000041, "Member 'AthenaTeamMemberInfo_C_CanFriend::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_CanFriend, Temp_bool_Variable4) == 0x000042, "Member 'AthenaTeamMemberInfo_C_CanFriend::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_CanFriend, CallFunc_IsValidNetID_ReturnValue) == 0x000043, "Member 'AthenaTeamMemberInfo_C_CanFriend::CallFunc_IsValidNetID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_CanFriend, Temp_byte_Variable) == 0x000044, "Member 'AthenaTeamMemberInfo_C_CanFriend::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_CanFriend, CallFunc_IsConsolePlatform_ReturnValue) == 0x000045, "Member 'AthenaTeamMemberInfo_C_CanFriend::CallFunc_IsConsolePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_CanFriend, K2Node_Select_Default) == 0x000046, "Member 'AthenaTeamMemberInfo_C_CanFriend::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_CanFriend, CallFunc_GetOwningPlayer_ReturnValue) == 0x000048, "Member 'AthenaTeamMemberInfo_C_CanFriend::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_CanFriend, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000050, "Member 'AthenaTeamMemberInfo_C_CanFriend::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_CanFriend, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'AthenaTeamMemberInfo_C_CanFriend::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_CanFriend, CallFunc_GetFriendRequestStatusForPlayer_ReturnValue) == 0x000059, "Member 'AthenaTeamMemberInfo_C_CanFriend::CallFunc_GetFriendRequestStatusForPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_CanFriend, K2Node_DynamicCast_AsFort_Player_State_Athena) == 0x000060, "Member 'AthenaTeamMemberInfo_C_CanFriend::K2Node_DynamicCast_AsFort_Player_State_Athena' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_CanFriend, K2Node_DynamicCast_bSuccess2) == 0x000068, "Member 'AthenaTeamMemberInfo_C_CanFriend::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_CanFriend, CallFunc_GetUniqueID_ReturnValue) == 0x000070, "Member 'AthenaTeamMemberInfo_C_CanFriend::CallFunc_GetUniqueID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_CanFriend, CallFunc_EqualEqual_UniqueNetIdReplUniqueNetIdRepl_ReturnValue) == 0x000098, "Member 'AthenaTeamMemberInfo_C_CanFriend::CallFunc_EqualEqual_UniqueNetIdReplUniqueNetIdRepl_ReturnValue' has a wrong offset!");

// Function AthenaTeamMemberInfo.AthenaTeamMemberInfo_C.SendFriendInvite
// 0x0040 (0x0040 - 0x0000)
struct AthenaTeamMemberInfo_C_SendFriendInvite final
{
public:
	struct FUniqueNetIdRepl                       UniqueNetIdToUse;                                  // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsolePlatform_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanFriend_CanFriend;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaTeamMemberInfo_C_SendFriendInvite) == 0x000008, "Wrong alignment on AthenaTeamMemberInfo_C_SendFriendInvite");
static_assert(sizeof(AthenaTeamMemberInfo_C_SendFriendInvite) == 0x000040, "Wrong size on AthenaTeamMemberInfo_C_SendFriendInvite");
static_assert(offsetof(AthenaTeamMemberInfo_C_SendFriendInvite, UniqueNetIdToUse) == 0x000000, "Member 'AthenaTeamMemberInfo_C_SendFriendInvite::UniqueNetIdToUse' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_SendFriendInvite, CallFunc_IsConsolePlatform_ReturnValue) == 0x000028, "Member 'AthenaTeamMemberInfo_C_SendFriendInvite::CallFunc_IsConsolePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_SendFriendInvite, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'AthenaTeamMemberInfo_C_SendFriendInvite::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_SendFriendInvite, CallFunc_CanFriend_CanFriend) == 0x000038, "Member 'AthenaTeamMemberInfo_C_SendFriendInvite::CallFunc_CanFriend_CanFriend' has a wrong offset!");

// Function AthenaTeamMemberInfo.AthenaTeamMemberInfo_C.InitSpeakerMaterial
// 0x0010 (0x0010 - 0x0000)
struct AthenaTeamMemberInfo_C_InitSpeakerMaterial final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaTeamMemberInfo_C_InitSpeakerMaterial) == 0x000008, "Wrong alignment on AthenaTeamMemberInfo_C_InitSpeakerMaterial");
static_assert(sizeof(AthenaTeamMemberInfo_C_InitSpeakerMaterial) == 0x000010, "Wrong size on AthenaTeamMemberInfo_C_InitSpeakerMaterial");
static_assert(offsetof(AthenaTeamMemberInfo_C_InitSpeakerMaterial, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'AthenaTeamMemberInfo_C_InitSpeakerMaterial::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_InitSpeakerMaterial, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'AthenaTeamMemberInfo_C_InitSpeakerMaterial::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function AthenaTeamMemberInfo.AthenaTeamMemberInfo_C.UpdateUniqueID
// 0x0050 (0x0050 - 0x0000)
struct AthenaTeamMemberInfo_C_UpdateUniqueID final
{
public:
	struct FUniqueNetIdRepl                       CallFunc_GetUniqueID_ReturnValue;                  // 0x0000(0x0028)(HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetPlatformUniqueNetId_ReturnValue;       // 0x0028(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(AthenaTeamMemberInfo_C_UpdateUniqueID) == 0x000008, "Wrong alignment on AthenaTeamMemberInfo_C_UpdateUniqueID");
static_assert(sizeof(AthenaTeamMemberInfo_C_UpdateUniqueID) == 0x000050, "Wrong size on AthenaTeamMemberInfo_C_UpdateUniqueID");
static_assert(offsetof(AthenaTeamMemberInfo_C_UpdateUniqueID, CallFunc_GetUniqueID_ReturnValue) == 0x000000, "Member 'AthenaTeamMemberInfo_C_UpdateUniqueID::CallFunc_GetUniqueID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaTeamMemberInfo_C_UpdateUniqueID, CallFunc_GetPlatformUniqueNetId_ReturnValue) == 0x000028, "Member 'AthenaTeamMemberInfo_C_UpdateUniqueID::CallFunc_GetPlatformUniqueNetId_ReturnValue' has a wrong offset!");

}

