#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSeasonPageWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaSeasonPageWidget.AthenaSeasonPageWidget_C.ExecuteUbergraph_AthenaSeasonPageWidget
// 0x0048 (0x0048 - 0x0000)
struct AthenaSeasonPageWidget_C_ExecuteUbergraph_AthenaSeasonPageWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button4;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button3;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bUsingGamepad)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AthenaSeasonPageWidget_C_ExecuteUbergraph_AthenaSeasonPageWidget) == 0x000008, "Wrong alignment on AthenaSeasonPageWidget_C_ExecuteUbergraph_AthenaSeasonPageWidget");
static_assert(sizeof(AthenaSeasonPageWidget_C_ExecuteUbergraph_AthenaSeasonPageWidget) == 0x000048, "Wrong size on AthenaSeasonPageWidget_C_ExecuteUbergraph_AthenaSeasonPageWidget");
static_assert(offsetof(AthenaSeasonPageWidget_C_ExecuteUbergraph_AthenaSeasonPageWidget, EntryPoint) == 0x000000, "Member 'AthenaSeasonPageWidget_C_ExecuteUbergraph_AthenaSeasonPageWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_ExecuteUbergraph_AthenaSeasonPageWidget, K2Node_ComponentBoundEvent_Button4) == 0x000008, "Member 'AthenaSeasonPageWidget_C_ExecuteUbergraph_AthenaSeasonPageWidget::K2Node_ComponentBoundEvent_Button4' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_ExecuteUbergraph_AthenaSeasonPageWidget, K2Node_ComponentBoundEvent_Button3) == 0x000010, "Member 'AthenaSeasonPageWidget_C_ExecuteUbergraph_AthenaSeasonPageWidget::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_ExecuteUbergraph_AthenaSeasonPageWidget, K2Node_ComponentBoundEvent_Button2) == 0x000018, "Member 'AthenaSeasonPageWidget_C_ExecuteUbergraph_AthenaSeasonPageWidget::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_ExecuteUbergraph_AthenaSeasonPageWidget, K2Node_ComponentBoundEvent_Button) == 0x000020, "Member 'AthenaSeasonPageWidget_C_ExecuteUbergraph_AthenaSeasonPageWidget::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_ExecuteUbergraph_AthenaSeasonPageWidget, CallFunc_GetContext_ReturnValue) == 0x000028, "Member 'AthenaSeasonPageWidget_C_ExecuteUbergraph_AthenaSeasonPageWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_ExecuteUbergraph_AthenaSeasonPageWidget, CallFunc_IsUsingGamepad_ReturnValue) == 0x000030, "Member 'AthenaSeasonPageWidget_C_ExecuteUbergraph_AthenaSeasonPageWidget::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_ExecuteUbergraph_AthenaSeasonPageWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'AthenaSeasonPageWidget_C_ExecuteUbergraph_AthenaSeasonPageWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function AthenaSeasonPageWidget.AthenaSeasonPageWidget_C.BndEvt__LeftPaidBtn_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonPageWidget_C_BndEvt__LeftPaidBtn_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonPageWidget_C_BndEvt__LeftPaidBtn_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaSeasonPageWidget_C_BndEvt__LeftPaidBtn_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaSeasonPageWidget_C_BndEvt__LeftPaidBtn_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaSeasonPageWidget_C_BndEvt__LeftPaidBtn_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaSeasonPageWidget_C_BndEvt__LeftPaidBtn_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaSeasonPageWidget_C_BndEvt__LeftPaidBtn_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaSeasonPageWidget.AthenaSeasonPageWidget_C.BndEvt__LeftFreeBtn_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonPageWidget_C_BndEvt__LeftFreeBtn_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonPageWidget_C_BndEvt__LeftFreeBtn_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaSeasonPageWidget_C_BndEvt__LeftFreeBtn_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaSeasonPageWidget_C_BndEvt__LeftFreeBtn_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaSeasonPageWidget_C_BndEvt__LeftFreeBtn_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaSeasonPageWidget_C_BndEvt__LeftFreeBtn_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaSeasonPageWidget_C_BndEvt__LeftFreeBtn_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaSeasonPageWidget.AthenaSeasonPageWidget_C.BndEvt__RightFreeBtn_K2Node_ComponentBoundEvent_148_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonPageWidget_C_BndEvt__RightFreeBtn_K2Node_ComponentBoundEvent_148_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonPageWidget_C_BndEvt__RightFreeBtn_K2Node_ComponentBoundEvent_148_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaSeasonPageWidget_C_BndEvt__RightFreeBtn_K2Node_ComponentBoundEvent_148_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaSeasonPageWidget_C_BndEvt__RightFreeBtn_K2Node_ComponentBoundEvent_148_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaSeasonPageWidget_C_BndEvt__RightFreeBtn_K2Node_ComponentBoundEvent_148_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaSeasonPageWidget_C_BndEvt__RightFreeBtn_K2Node_ComponentBoundEvent_148_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaSeasonPageWidget_C_BndEvt__RightFreeBtn_K2Node_ComponentBoundEvent_148_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaSeasonPageWidget.AthenaSeasonPageWidget_C.BndEvt__RightPaidBtn_K2Node_ComponentBoundEvent_131_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonPageWidget_C_BndEvt__RightPaidBtn_K2Node_ComponentBoundEvent_131_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonPageWidget_C_BndEvt__RightPaidBtn_K2Node_ComponentBoundEvent_131_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaSeasonPageWidget_C_BndEvt__RightPaidBtn_K2Node_ComponentBoundEvent_131_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaSeasonPageWidget_C_BndEvt__RightPaidBtn_K2Node_ComponentBoundEvent_131_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaSeasonPageWidget_C_BndEvt__RightPaidBtn_K2Node_ComponentBoundEvent_131_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaSeasonPageWidget_C_BndEvt__RightPaidBtn_K2Node_ComponentBoundEvent_131_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaSeasonPageWidget_C_BndEvt__RightPaidBtn_K2Node_ComponentBoundEvent_131_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaSeasonPageWidget.AthenaSeasonPageWidget_C.AddLevelWidgets
// 0x0090 (0x0090 - 0x0000)
struct AthenaSeasonPageWidget_C_AddLevelWidgets final
{
public:
	class UFortSeasonPassLevelInfo*               LevelInfo;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USeasonPassLevelWidget*>         LevelWidgets;                                      // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor)
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSeasonPassMaxLevel_ReturnValue;        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumRewardItems_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaSeasonLevelFreeRewardsWidget_C*  CallFunc_AddFreeRewards_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaSeasonLevelPaidRewardsWidget_C*  CallFunc_AddPaidRewards_OutputPin;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaSeasonLevelHeaderWidget_C*       CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USeasonPassLevelWidget*>         K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0070(0x0010)(NoDestructor)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonPageWidget_C_AddLevelWidgets) == 0x000008, "Wrong alignment on AthenaSeasonPageWidget_C_AddLevelWidgets");
static_assert(sizeof(AthenaSeasonPageWidget_C_AddLevelWidgets) == 0x000090, "Wrong size on AthenaSeasonPageWidget_C_AddLevelWidgets");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddLevelWidgets, LevelInfo) == 0x000000, "Member 'AthenaSeasonPageWidget_C_AddLevelWidgets::LevelInfo' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddLevelWidgets, LevelWidgets) == 0x000008, "Member 'AthenaSeasonPageWidget_C_AddLevelWidgets::LevelWidgets' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddLevelWidgets, CallFunc_GetLevel_ReturnValue) == 0x000018, "Member 'AthenaSeasonPageWidget_C_AddLevelWidgets::CallFunc_GetLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddLevelWidgets, CallFunc_GetSeasonPassMaxLevel_ReturnValue) == 0x00001C, "Member 'AthenaSeasonPageWidget_C_AddLevelWidgets::CallFunc_GetSeasonPassMaxLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddLevelWidgets, CallFunc_Max_ReturnValue) == 0x000020, "Member 'AthenaSeasonPageWidget_C_AddLevelWidgets::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddLevelWidgets, CallFunc_Min_ReturnValue) == 0x000024, "Member 'AthenaSeasonPageWidget_C_AddLevelWidgets::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddLevelWidgets, CallFunc_GetNumRewardItems_ReturnValue) == 0x000028, "Member 'AthenaSeasonPageWidget_C_AddLevelWidgets::CallFunc_GetNumRewardItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddLevelWidgets, CallFunc_AddFreeRewards_ReturnValue) == 0x000030, "Member 'AthenaSeasonPageWidget_C_AddLevelWidgets::CallFunc_AddFreeRewards_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddLevelWidgets, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000038, "Member 'AthenaSeasonPageWidget_C_AddLevelWidgets::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddLevelWidgets, CallFunc_AddPaidRewards_OutputPin) == 0x000040, "Member 'AthenaSeasonPageWidget_C_AddLevelWidgets::CallFunc_AddPaidRewards_OutputPin' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddLevelWidgets, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'AthenaSeasonPageWidget_C_AddLevelWidgets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddLevelWidgets, CallFunc_GetOwningPlayer_ReturnValue) == 0x000050, "Member 'AthenaSeasonPageWidget_C_AddLevelWidgets::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddLevelWidgets, CallFunc_Create_ReturnValue) == 0x000058, "Member 'AthenaSeasonPageWidget_C_AddLevelWidgets::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddLevelWidgets, K2Node_MakeArray_Array) == 0x000060, "Member 'AthenaSeasonPageWidget_C_AddLevelWidgets::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddLevelWidgets, K2Node_MakeStruct_Margin) == 0x000070, "Member 'AthenaSeasonPageWidget_C_AddLevelWidgets::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddLevelWidgets, CallFunc_AddChildToGrid_ReturnValue) == 0x000080, "Member 'AthenaSeasonPageWidget_C_AddLevelWidgets::CallFunc_AddChildToGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddLevelWidgets, CallFunc_Add_IntInt_ReturnValue2) == 0x000088, "Member 'AthenaSeasonPageWidget_C_AddLevelWidgets::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");

// Function AthenaSeasonPageWidget.AthenaSeasonPageWidget_C.IsFull
// 0x0002 (0x0002 - 0x0000)
struct AthenaSeasonPageWidget_C_IsFull final
{
public:
	bool                                          Full;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSeasonPageWidget_C_IsFull) == 0x000001, "Wrong alignment on AthenaSeasonPageWidget_C_IsFull");
static_assert(sizeof(AthenaSeasonPageWidget_C_IsFull) == 0x000002, "Wrong size on AthenaSeasonPageWidget_C_IsFull");
static_assert(offsetof(AthenaSeasonPageWidget_C_IsFull, Full) == 0x000000, "Member 'AthenaSeasonPageWidget_C_IsFull::Full' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_IsFull, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000001, "Member 'AthenaSeasonPageWidget_C_IsFull::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaSeasonPageWidget.AthenaSeasonPageWidget_C.ContainsLevel
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonPageWidget_C_ContainsLevel final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSeasonPageWidget_C_ContainsLevel) == 0x000004, "Wrong alignment on AthenaSeasonPageWidget_C_ContainsLevel");
static_assert(sizeof(AthenaSeasonPageWidget_C_ContainsLevel) == 0x000008, "Wrong size on AthenaSeasonPageWidget_C_ContainsLevel");
static_assert(offsetof(AthenaSeasonPageWidget_C_ContainsLevel, Level) == 0x000000, "Member 'AthenaSeasonPageWidget_C_ContainsLevel::Level' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_ContainsLevel, ReturnValue) == 0x000004, "Member 'AthenaSeasonPageWidget_C_ContainsLevel::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_ContainsLevel, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000005, "Member 'AthenaSeasonPageWidget_C_ContainsLevel::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_ContainsLevel, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000006, "Member 'AthenaSeasonPageWidget_C_ContainsLevel::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_ContainsLevel, CallFunc_BooleanAND_ReturnValue) == 0x000007, "Member 'AthenaSeasonPageWidget_C_ContainsLevel::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function AthenaSeasonPageWidget.AthenaSeasonPageWidget_C.PagePopulationComplete
// 0x0050 (0x0050 - 0x0000)
struct AthenaSeasonPageWidget_C_PagePopulationComplete final
{
public:
	class UGridSlot*                              K2Node_DynamicCast_AsGrid_Slot;                    // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              K2Node_DynamicCast_AsGrid_Slot2;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              K2Node_DynamicCast_AsGrid_Slot3;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGridSlot*                              K2Node_DynamicCast_AsGrid_Slot4;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSeasonPageWidget_C_PagePopulationComplete) == 0x000008, "Wrong alignment on AthenaSeasonPageWidget_C_PagePopulationComplete");
static_assert(sizeof(AthenaSeasonPageWidget_C_PagePopulationComplete) == 0x000050, "Wrong size on AthenaSeasonPageWidget_C_PagePopulationComplete");
static_assert(offsetof(AthenaSeasonPageWidget_C_PagePopulationComplete, K2Node_DynamicCast_AsGrid_Slot) == 0x000000, "Member 'AthenaSeasonPageWidget_C_PagePopulationComplete::K2Node_DynamicCast_AsGrid_Slot' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_PagePopulationComplete, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'AthenaSeasonPageWidget_C_PagePopulationComplete::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_PagePopulationComplete, K2Node_DynamicCast_AsGrid_Slot2) == 0x000010, "Member 'AthenaSeasonPageWidget_C_PagePopulationComplete::K2Node_DynamicCast_AsGrid_Slot2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_PagePopulationComplete, K2Node_DynamicCast_bSuccess2) == 0x000018, "Member 'AthenaSeasonPageWidget_C_PagePopulationComplete::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_PagePopulationComplete, Temp_byte_Variable) == 0x000019, "Member 'AthenaSeasonPageWidget_C_PagePopulationComplete::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_PagePopulationComplete, Temp_byte_Variable2) == 0x00001A, "Member 'AthenaSeasonPageWidget_C_PagePopulationComplete::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_PagePopulationComplete, Temp_bool_Variable) == 0x00001B, "Member 'AthenaSeasonPageWidget_C_PagePopulationComplete::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_PagePopulationComplete, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00001C, "Member 'AthenaSeasonPageWidget_C_PagePopulationComplete::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_PagePopulationComplete, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00001D, "Member 'AthenaSeasonPageWidget_C_PagePopulationComplete::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_PagePopulationComplete, K2Node_Select_Default) == 0x00001E, "Member 'AthenaSeasonPageWidget_C_PagePopulationComplete::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_PagePopulationComplete, Temp_byte_Variable3) == 0x00001F, "Member 'AthenaSeasonPageWidget_C_PagePopulationComplete::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_PagePopulationComplete, Temp_byte_Variable4) == 0x000020, "Member 'AthenaSeasonPageWidget_C_PagePopulationComplete::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_PagePopulationComplete, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'AthenaSeasonPageWidget_C_PagePopulationComplete::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_PagePopulationComplete, Temp_bool_Variable2) == 0x000028, "Member 'AthenaSeasonPageWidget_C_PagePopulationComplete::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_PagePopulationComplete, K2Node_Select2_Default) == 0x000029, "Member 'AthenaSeasonPageWidget_C_PagePopulationComplete::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_PagePopulationComplete, K2Node_DynamicCast_AsGrid_Slot3) == 0x000030, "Member 'AthenaSeasonPageWidget_C_PagePopulationComplete::K2Node_DynamicCast_AsGrid_Slot3' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_PagePopulationComplete, K2Node_DynamicCast_bSuccess3) == 0x000038, "Member 'AthenaSeasonPageWidget_C_PagePopulationComplete::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_PagePopulationComplete, K2Node_DynamicCast_AsGrid_Slot4) == 0x000040, "Member 'AthenaSeasonPageWidget_C_PagePopulationComplete::K2Node_DynamicCast_AsGrid_Slot4' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_PagePopulationComplete, K2Node_DynamicCast_bSuccess4) == 0x000048, "Member 'AthenaSeasonPageWidget_C_PagePopulationComplete::K2Node_DynamicCast_bSuccess4' has a wrong offset!");

// Function AthenaSeasonPageWidget.AthenaSeasonPageWidget_C.AddPaidRewards
// 0x0048 (0x0048 - 0x0000)
struct AthenaSeasonPageWidget_C_AddPaidRewards final
{
public:
	int32                                         InColumn;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSeasonPassLevelInfo*               LevelInfo;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaSeasonLevelPaidRewardsWidget_C*  OutputPin;                                         // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumRewardItems_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0020(0x0010)(NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaSeasonLevelPaidRewardsWidget_C*  CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonPageWidget_C_AddPaidRewards) == 0x000008, "Wrong alignment on AthenaSeasonPageWidget_C_AddPaidRewards");
static_assert(sizeof(AthenaSeasonPageWidget_C_AddPaidRewards) == 0x000048, "Wrong size on AthenaSeasonPageWidget_C_AddPaidRewards");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddPaidRewards, InColumn) == 0x000000, "Member 'AthenaSeasonPageWidget_C_AddPaidRewards::InColumn' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddPaidRewards, LevelInfo) == 0x000008, "Member 'AthenaSeasonPageWidget_C_AddPaidRewards::LevelInfo' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddPaidRewards, OutputPin) == 0x000010, "Member 'AthenaSeasonPageWidget_C_AddPaidRewards::OutputPin' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddPaidRewards, CallFunc_GetNumRewardItems_ReturnValue) == 0x000018, "Member 'AthenaSeasonPageWidget_C_AddPaidRewards::CallFunc_GetNumRewardItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddPaidRewards, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'AthenaSeasonPageWidget_C_AddPaidRewards::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddPaidRewards, CallFunc_Greater_IntInt_ReturnValue) == 0x00001D, "Member 'AthenaSeasonPageWidget_C_AddPaidRewards::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddPaidRewards, K2Node_MakeStruct_Margin) == 0x000020, "Member 'AthenaSeasonPageWidget_C_AddPaidRewards::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddPaidRewards, CallFunc_GetOwningPlayer_ReturnValue) == 0x000030, "Member 'AthenaSeasonPageWidget_C_AddPaidRewards::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddPaidRewards, CallFunc_Create_ReturnValue) == 0x000038, "Member 'AthenaSeasonPageWidget_C_AddPaidRewards::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddPaidRewards, CallFunc_AddChildToGrid_ReturnValue) == 0x000040, "Member 'AthenaSeasonPageWidget_C_AddPaidRewards::CallFunc_AddChildToGrid_ReturnValue' has a wrong offset!");

// Function AthenaSeasonPageWidget.AthenaSeasonPageWidget_C.AddFreeRewards
// 0x0048 (0x0048 - 0x0000)
struct AthenaSeasonPageWidget_C_AddFreeRewards final
{
public:
	int32                                         InColumn;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSeasonPassLevelInfo*               LevelInfo;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaSeasonLevelFreeRewardsWidget_C*  ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumRewardItems_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0020(0x0010)(NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaSeasonLevelFreeRewardsWidget_C*  CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonPageWidget_C_AddFreeRewards) == 0x000008, "Wrong alignment on AthenaSeasonPageWidget_C_AddFreeRewards");
static_assert(sizeof(AthenaSeasonPageWidget_C_AddFreeRewards) == 0x000048, "Wrong size on AthenaSeasonPageWidget_C_AddFreeRewards");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddFreeRewards, InColumn) == 0x000000, "Member 'AthenaSeasonPageWidget_C_AddFreeRewards::InColumn' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddFreeRewards, LevelInfo) == 0x000008, "Member 'AthenaSeasonPageWidget_C_AddFreeRewards::LevelInfo' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddFreeRewards, ReturnValue) == 0x000010, "Member 'AthenaSeasonPageWidget_C_AddFreeRewards::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddFreeRewards, CallFunc_GetNumRewardItems_ReturnValue) == 0x000018, "Member 'AthenaSeasonPageWidget_C_AddFreeRewards::CallFunc_GetNumRewardItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddFreeRewards, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'AthenaSeasonPageWidget_C_AddFreeRewards::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddFreeRewards, CallFunc_Greater_IntInt_ReturnValue) == 0x00001D, "Member 'AthenaSeasonPageWidget_C_AddFreeRewards::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddFreeRewards, K2Node_MakeStruct_Margin) == 0x000020, "Member 'AthenaSeasonPageWidget_C_AddFreeRewards::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddFreeRewards, CallFunc_GetOwningPlayer_ReturnValue) == 0x000030, "Member 'AthenaSeasonPageWidget_C_AddFreeRewards::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddFreeRewards, CallFunc_Create_ReturnValue) == 0x000038, "Member 'AthenaSeasonPageWidget_C_AddFreeRewards::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_AddFreeRewards, CallFunc_AddChildToGrid_ReturnValue) == 0x000040, "Member 'AthenaSeasonPageWidget_C_AddFreeRewards::CallFunc_AddChildToGrid_ReturnValue' has a wrong offset!");

// Function AthenaSeasonPageWidget.AthenaSeasonPageWidget_C.HandleUsingGamepadChanged
// 0x0038 (0x0038 - 0x0000)
struct AthenaSeasonPageWidget_C_HandleUsingGamepadChanged final
{
public:
	bool                                          UsingGamepad;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPanelButton_C*>                 K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelButton_C*                         CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSeasonPageWidget_C_HandleUsingGamepadChanged) == 0x000008, "Wrong alignment on AthenaSeasonPageWidget_C_HandleUsingGamepadChanged");
static_assert(sizeof(AthenaSeasonPageWidget_C_HandleUsingGamepadChanged) == 0x000038, "Wrong size on AthenaSeasonPageWidget_C_HandleUsingGamepadChanged");
static_assert(offsetof(AthenaSeasonPageWidget_C_HandleUsingGamepadChanged, UsingGamepad) == 0x000000, "Member 'AthenaSeasonPageWidget_C_HandleUsingGamepadChanged::UsingGamepad' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_HandleUsingGamepadChanged, Temp_byte_Variable) == 0x000001, "Member 'AthenaSeasonPageWidget_C_HandleUsingGamepadChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_HandleUsingGamepadChanged, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'AthenaSeasonPageWidget_C_HandleUsingGamepadChanged::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_HandleUsingGamepadChanged, Temp_byte_Variable2) == 0x000003, "Member 'AthenaSeasonPageWidget_C_HandleUsingGamepadChanged::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_HandleUsingGamepadChanged, Temp_int_Variable) == 0x000004, "Member 'AthenaSeasonPageWidget_C_HandleUsingGamepadChanged::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_HandleUsingGamepadChanged, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'AthenaSeasonPageWidget_C_HandleUsingGamepadChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_HandleUsingGamepadChanged, Temp_bool_Variable) == 0x00000C, "Member 'AthenaSeasonPageWidget_C_HandleUsingGamepadChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_HandleUsingGamepadChanged, K2Node_Select_Default) == 0x00000D, "Member 'AthenaSeasonPageWidget_C_HandleUsingGamepadChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_HandleUsingGamepadChanged, K2Node_MakeArray_Array) == 0x000010, "Member 'AthenaSeasonPageWidget_C_HandleUsingGamepadChanged::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_HandleUsingGamepadChanged, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'AthenaSeasonPageWidget_C_HandleUsingGamepadChanged::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_HandleUsingGamepadChanged, CallFunc_Array_Get_Item) == 0x000028, "Member 'AthenaSeasonPageWidget_C_HandleUsingGamepadChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_HandleUsingGamepadChanged, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'AthenaSeasonPageWidget_C_HandleUsingGamepadChanged::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function AthenaSeasonPageWidget.AthenaSeasonPageWidget_C.GetFirstLevel
// 0x0004 (0x0004 - 0x0000)
struct AthenaSeasonPageWidget_C_GetFirstLevel final
{
public:
	int32                                         FirstLevel;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonPageWidget_C_GetFirstLevel) == 0x000004, "Wrong alignment on AthenaSeasonPageWidget_C_GetFirstLevel");
static_assert(sizeof(AthenaSeasonPageWidget_C_GetFirstLevel) == 0x000004, "Wrong size on AthenaSeasonPageWidget_C_GetFirstLevel");
static_assert(offsetof(AthenaSeasonPageWidget_C_GetFirstLevel, FirstLevel) == 0x000000, "Member 'AthenaSeasonPageWidget_C_GetFirstLevel::FirstLevel' has a wrong offset!");

// Function AthenaSeasonPageWidget.AthenaSeasonPageWidget_C.UpdateDynamicData
// 0x0028 (0x0028 - 0x0000)
struct AthenaSeasonPageWidget_C_UpdateDynamicData final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentSeasonNumber_ReturnValue;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	bool                                          CallFunc_OwnsSeasonPass_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonPageWidget_C_UpdateDynamicData) == 0x000008, "Wrong alignment on AthenaSeasonPageWidget_C_UpdateDynamicData");
static_assert(sizeof(AthenaSeasonPageWidget_C_UpdateDynamicData) == 0x000028, "Wrong size on AthenaSeasonPageWidget_C_UpdateDynamicData");
static_assert(offsetof(AthenaSeasonPageWidget_C_UpdateDynamicData, Temp_byte_Variable) == 0x000000, "Member 'AthenaSeasonPageWidget_C_UpdateDynamicData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaSeasonPageWidget_C_UpdateDynamicData, Temp_byte_Variable2) == 0x000001, "Member 'AthenaSeasonPageWidget_C_UpdateDynamicData::Temp_byte_Variable2' has a wrong offset!");
