#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSeasonReward

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaSeasonReward.AthenaSeasonReward_C
// 0x0038 (0x07B8 - 0x0780)
class UAthenaSeasonReward_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0780(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 ClaimedImage;                                      // 0x0788(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 ItemCard;                                          // 0x0790(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LockBox;                                           // 0x0798(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockedImage;                                       // 0x07A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockShadow;                                        // 0x07A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItem*                              StrongItemToRepresent;                             // 0x07B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaSeasonReward(int32 EntryPoint);
	void OnHovered();
	void Setup(class UFortItem* ItemToRepresent, bool Claimed, bool Locked, bool LevelAchieved);
	void SetState(bool Claimed, bool Locked, bool LevelAchieved);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSeasonReward_C">();
	}
	static class UAthenaSeasonReward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSeasonReward_C>();
	}
};
static_assert(alignof(UAthenaSeasonReward_C) == 0x000008, "Wrong alignment on UAthenaSeasonReward_C");
static_assert(sizeof(UAthenaSeasonReward_C) == 0x0007B8, "Wrong size on UAthenaSeasonReward_C");
static_assert(offsetof(UAthenaSeasonReward_C, UberGraphFrame) == 0x000780, "Member 'UAthenaSeasonReward_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, ClaimedImage) == 0x000788, "Member 'UAthenaSeasonReward_C::ClaimedImage' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, ItemCard) == 0x000790, "Member 'UAthenaSeasonReward_C::ItemCard' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, LockBox) == 0x000798, "Member 'UAthenaSeasonReward_C::LockBox' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, LockedImage) == 0x0007A0, "Member 'UAthenaSeasonReward_C::LockedImage' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, LockShadow) == 0x0007A8, "Member 'UAthenaSeasonReward_C::LockShadow' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, StrongItemToRepresent) == 0x0007B0, "Member 'UAthenaSeasonReward_C::StrongItemToRepresent' has a wrong offset!");

}

