#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchStatsPartial

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AthenaMatchStatsPartial.AthenaMatchStatsPartial_C.ExecuteUbergraph_AthenaMatchStatsPartial
// 0x0004 (0x0004 - 0x0000)
struct AthenaMatchStatsPartial_C_ExecuteUbergraph_AthenaMatchStatsPartial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchStatsPartial_C_ExecuteUbergraph_AthenaMatchStatsPartial) == 0x000004, "Wrong alignment on AthenaMatchStatsPartial_C_ExecuteUbergraph_AthenaMatchStatsPartial");
static_assert(sizeof(AthenaMatchStatsPartial_C_ExecuteUbergraph_AthenaMatchStatsPartial) == 0x000004, "Wrong size on AthenaMatchStatsPartial_C_ExecuteUbergraph_AthenaMatchStatsPartial");
static_assert(offsetof(AthenaMatchStatsPartial_C_ExecuteUbergraph_AthenaMatchStatsPartial, EntryPoint) == 0x000000, "Member 'AthenaMatchStatsPartial_C_ExecuteUbergraph_AthenaMatchStatsPartial::EntryPoint' has a wrong offset!");

// Function AthenaMatchStatsPartial.AthenaMatchStatsPartial_C.SetMatchReport
// 0x0050 (0x0050 - 0x0000)
struct AthenaMatchStatsPartial_C_SetMatchReport final
{
public:
	class UAthenaPlayerMatchReport*               Report;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AthenaMatchStatsPartial_C_SetMatchReport) == 0x000008, "Wrong alignment on AthenaMatchStatsPartial_C_SetMatchReport");
static_assert(sizeof(AthenaMatchStatsPartial_C_SetMatchReport) == 0x000050, "Wrong size on AthenaMatchStatsPartial_C_SetMatchReport");
static_assert(offsetof(AthenaMatchStatsPartial_C_SetMatchReport, Report) == 0x000000, "Member 'AthenaMatchStatsPartial_C_SetMatchReport::Report' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsPartial_C_SetMatchReport, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'AthenaMatchStatsPartial_C_SetMatchReport::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsPartial_C_SetMatchReport, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'AthenaMatchStatsPartial_C_SetMatchReport::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsPartial_C_SetMatchReport, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000020, "Member 'AthenaMatchStatsPartial_C_SetMatchReport::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsPartial_C_SetMatchReport, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AthenaMatchStatsPartial_C_SetMatchReport::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsPartial_C_SetMatchReport, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'AthenaMatchStatsPartial_C_SetMatchReport::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsPartial_C_SetMatchReport, K2Node_CreateDelegate_OutputDelegate3) == 0x000040, "Member 'AthenaMatchStatsPartial_C_SetMatchReport::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");

// Function AthenaMatchStatsPartial.AthenaMatchStatsPartial_C.OnTeamStatsAvailable
// 0x00A8 (0x00A8 - 0x0000)
struct AthenaMatchStatsPartial_C_OnTeamStatsAvailable final
{
public:
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0000(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0040(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
};
static_assert(alignof(AthenaMatchStatsPartial_C_OnTeamStatsAvailable) == 0x000008, "Wrong alignment on AthenaMatchStatsPartial_C_OnTeamStatsAvailable");
static_assert(sizeof(AthenaMatchStatsPartial_C_OnTeamStatsAvailable) == 0x0000A8, "Wrong size on AthenaMatchStatsPartial_C_OnTeamStatsAvailable");
static_assert(offsetof(AthenaMatchStatsPartial_C_OnTeamStatsAvailable, K2Node_MakeStruct_FormatArgumentData) == 0x000000, "Member 'AthenaMatchStatsPartial_C_OnTeamStatsAvailable::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsPartial_C_OnTeamStatsAvailable, K2Node_MakeStruct_FormatArgumentData2) == 0x000040, "Member 'AthenaMatchStatsPartial_C_OnTeamStatsAvailable::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsPartial_C_OnTeamStatsAvailable, K2Node_MakeArray_Array) == 0x000080, "Member 'AthenaMatchStatsPartial_C_OnTeamStatsAvailable::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaMatchStatsPartial_C_OnTeamStatsAvailable, CallFunc_Format_ReturnValue) == 0x000090, "Member 'AthenaMatchStatsPartial_C_OnTeamStatsAvailable::CallFunc_Format_ReturnValue' has a wrong offset!");

}

