#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaQuickbarPrimary

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "QuickbarBase_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaQuickbarPrimary.AthenaQuickbarPrimary_C
// 0x0080 (0x02E0 - 0x0260)
class UAthenaQuickbarPrimary_C final : public UQuickbarBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AthenaQuickbarPrimary_C;            // 0x0260(0x0008)(Transient, DuplicateTransient)
	class UInvalidationBox*                       QuickbarPrimaryInvalidationBox;                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlot1;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlot2;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlot3;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlot4;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlot5;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaQuickBarSlot_C*                  QuickbarSlot6;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_WeaponsRail;                               // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortBangWrapper*                       TutorialQBP1;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortBangWrapper*                       TutorialQBP2;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortBangWrapper*                       TutorialQBP3;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortBangWrapper*                       TutorialQBP4;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortBangWrapper*                       TutorialQBP5;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortBangWrapper*                       TutorialQBP6;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentWeaponSlot;                                 // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaQuickbarPrimary(int32 EntryPoint);
	void AnimationFinished();
	void OnQuickbarContentsChanged(EFortQuickBars QuickbarIndex);
	void OnQuickBarSlotFocusChanged_Bind(EFortQuickBars QuickbarIndex, int32 Param_Slot);
	void Destruct();
	void HandleInputMethodChanged_Bind(bool bUsingGamepad);
	void Show_Primary_Quickbar_Rail(bool Show);
	void HasOneNonHarvestWeapon(bool* HasNonHarvestWeapon);
	void HandleShowHideWeaponRail();
	void Construct();
	void Minimize();
	void Maximize();
	void HandleKeybindsChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaQuickbarPrimary_C">();
	}
	static class UAthenaQuickbarPrimary_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaQuickbarPrimary_C>();
	}
};
static_assert(alignof(UAthenaQuickbarPrimary_C) == 0x000008, "Wrong alignment on UAthenaQuickbarPrimary_C");
static_assert(sizeof(UAthenaQuickbarPrimary_C) == 0x0002E0, "Wrong size on UAthenaQuickbarPrimary_C");
static_assert(offsetof(UAthenaQuickbarPrimary_C, UberGraphFrame_AthenaQuickbarPrimary_C) == 0x000260, "Member 'UAthenaQuickbarPrimary_C::UberGraphFrame_AthenaQuickbarPrimary_C' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, QuickbarPrimaryInvalidationBox) == 0x000268, "Member 'UAthenaQuickbarPrimary_C::QuickbarPrimaryInvalidationBox' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, QuickbarSlot1) == 0x000270, "Member 'UAthenaQuickbarPrimary_C::QuickbarSlot1' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, QuickbarSlot2) == 0x000278, "Member 'UAthenaQuickbarPrimary_C::QuickbarSlot2' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, QuickbarSlot3) == 0x000280, "Member 'UAthenaQuickbarPrimary_C::QuickbarSlot3' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, QuickbarSlot4) == 0x000288, "Member 'UAthenaQuickbarPrimary_C::QuickbarSlot4' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, QuickbarSlot5) == 0x000290, "Member 'UAthenaQuickbarPrimary_C::QuickbarSlot5' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, QuickbarSlot6) == 0x000298, "Member 'UAthenaQuickbarPrimary_C::QuickbarSlot6' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, SizeBox_WeaponsRail) == 0x0002A0, "Member 'UAthenaQuickbarPrimary_C::SizeBox_WeaponsRail' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, TutorialQBP1) == 0x0002A8, "Member 'UAthenaQuickbarPrimary_C::TutorialQBP1' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, TutorialQBP2) == 0x0002B0, "Member 'UAthenaQuickbarPrimary_C::TutorialQBP2' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, TutorialQBP3) == 0x0002B8, "Member 'UAthenaQuickbarPrimary_C::TutorialQBP3' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, TutorialQBP4) == 0x0002C0, "Member 'UAthenaQuickbarPrimary_C::TutorialQBP4' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, TutorialQBP5) == 0x0002C8, "Member 'UAthenaQuickbarPrimary_C::TutorialQBP5' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, TutorialQBP6) == 0x0002D0, "Member 'UAthenaQuickbarPrimary_C::TutorialQBP6' has a wrong offset!");
static_assert(offsetof(UAthenaQuickbarPrimary_C, CurrentWeaponSlot) == 0x0002D8, "Member 'UAthenaQuickbarPrimary_C::CurrentWeaponSlot' has a wrong offset!");

}

