#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchmakingPlay

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaMatchmakingPlay.AthenaMatchmakingPlay_C.ExecuteUbergraph_AthenaMatchmakingPlay
// 0x04A0 (0x04A0 - 0x0000)
struct AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	EFortAthenaPlaylist                           Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable2;                               // 0x0028(0x0018)()
	class FText                                   Temp_text_Variable3;                               // 0x0040(0x0018)()
	class FText                                   Temp_text_Variable4;                               // 0x0058(0x0018)()
	class FText                                   Temp_text_Variable5;                               // 0x0070(0x0018)()
	class FText                                   Temp_text_Variable6;                               // 0x0088(0x0018)()
	class FText                                   Temp_text_Variable7;                               // 0x00A0(0x0018)()
	class FText                                   Temp_text_Variable8;                               // 0x00B8(0x0018)()
	class FText                                   Temp_text_Variable9;                               // 0x00D0(0x0018)()
	class FText                                   Temp_text_Variable10;                              // 0x00E8(0x0018)()
	class FText                                   Temp_text_Variable11;                              // 0x0100(0x0018)()
	class FText                                   Temp_text_Variable12;                              // 0x0118(0x0018)()
	class FText                                   Temp_text_Variable13;                              // 0x0130(0x0018)()
	EFortAthenaPlaylist                           Temp_byte_Variable2;                               // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable14;                              // 0x0150(0x0018)()
	class FText                                   Temp_text_Variable15;                              // 0x0168(0x0018)()
	class FText                                   Temp_text_Variable16;                              // 0x0180(0x0018)()
	class FText                                   Temp_text_Variable17;                              // 0x0198(0x0018)()
	class FText                                   Temp_text_Variable18;                              // 0x01B0(0x0018)()
	class FText                                   Temp_text_Variable19;                              // 0x01C8(0x0018)()
	class FText                                   Temp_text_Variable20;                              // 0x01E0(0x0018)()
	class FText                                   Temp_text_Variable21;                              // 0x01F8(0x0018)()
	class FText                                   Temp_text_Variable22;                              // 0x0210(0x0018)()
	class FText                                   Temp_text_Variable23;                              // 0x0228(0x0018)()
	class FText                                   Temp_text_Variable24;                              // 0x0240(0x0018)()
	class FText                                   Temp_text_Variable25;                              // 0x0258(0x0018)()
	bool                                          Temp_bool_Variable2;                               // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable26;                              // 0x0278(0x0018)()
	EFortAthenaPlaylist                           Temp_byte_Variable3;                               // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable27;                              // 0x0298(0x0018)()
	class FText                                   Temp_text_Variable28;                              // 0x02B0(0x0018)()
	class FText                                   Temp_text_Variable29;                              // 0x02C8(0x0018)()
	class FText                                   Temp_text_Variable30;                              // 0x02E0(0x0018)()
	class FText                                   Temp_text_Variable31;                              // 0x02F8(0x0018)()
	class FText                                   Temp_text_Variable32;                              // 0x0310(0x0018)()
	class FText                                   Temp_text_Variable33;                              // 0x0328(0x0018)()
	class FText                                   Temp_text_Variable34;                              // 0x0340(0x0018)()
	class FText                                   Temp_text_Variable35;                              // 0x0358(0x0018)()
	class FText                                   Temp_text_Variable36;                              // 0x0370(0x0018)()
	class FText                                   Temp_text_Variable37;                              // 0x0388(0x0018)()
	class FText                                   Temp_text_Variable38;                              // 0x03A0(0x0018)()
	EFortAthenaPlaylist                           Temp_byte_Variable4;                               // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x03BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x03BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable8;                               // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable9;                               // 0x03BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable10;                              // 0x03BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable11;                              // 0x03BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable12;                              // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable13;                              // 0x03C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable14;                              // 0x03C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable15;                              // 0x03C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable16;                              // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x03C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable17;                              // 0x03C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable18;                              // 0x03C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable19;                              // 0x03C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable20;                              // 0x03CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CB[0x5];                                      // 0x03CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button3;                // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bCanMatchmake;                        // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button;             // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsMatchmaking;                       // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EA[0x6];                                      // 0x03EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x03F0(0x0018)()
	class FText                                   K2Node_Select2_Default;                            // 0x0408(0x0018)()
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button2;            // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_429[0x3];                                      // 0x0429(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Value2;                 // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select3_Default;                            // 0x0430(0x0018)()
	class FText                                   K2Node_Select4_Default;                            // 0x0448(0x0018)()
	int32                                         K2Node_ComponentBoundEvent_Value;                  // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0464(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_465[0x3];                                      // 0x0465(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select5_Default;                            // 0x0470(0x0018)()
	bool                                          CallFunc_CheckForLTMBangs_BangAvail;               // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select6_Default;                            // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select7_Default;                            // 0x0499(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShowPlayButton;                      // 0x049A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select8_Default;                            // 0x049B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay) == 0x000008, "Wrong alignment on AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay");
static_assert(sizeof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay) == 0x0004A0, "Wrong size on AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, EntryPoint) == 0x000000, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_bool_Variable) == 0x000004, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable) == 0x000008, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_byte_Variable) == 0x000020, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable2) == 0x000028, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable3) == 0x000040, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable4) == 0x000058, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable5) == 0x000070, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable6) == 0x000088, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable6' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable7) == 0x0000A0, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable7' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable8) == 0x0000B8, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable8' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable9) == 0x0000D0, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable9' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable10) == 0x0000E8, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable10' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable11) == 0x000100, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable11' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable12) == 0x000118, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable12' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable13) == 0x000130, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable13' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_byte_Variable2) == 0x000148, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable14) == 0x000150, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable14' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable15) == 0x000168, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable15' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable16) == 0x000180, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable16' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable17) == 0x000198, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable17' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable18) == 0x0001B0, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable18' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable19) == 0x0001C8, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable19' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable20) == 0x0001E0, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable20' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable21) == 0x0001F8, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable21' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable22) == 0x000210, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable22' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable23) == 0x000228, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable23' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable24) == 0x000240, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable24' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable25) == 0x000258, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable25' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_bool_Variable2) == 0x000270, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable26) == 0x000278, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable26' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_byte_Variable3) == 0x000290, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable27) == 0x000298, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable27' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable28) == 0x0002B0, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable28' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable29) == 0x0002C8, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable29' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable30) == 0x0002E0, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable30' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable31) == 0x0002F8, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable31' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable32) == 0x000310, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable32' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable33) == 0x000328, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable33' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable34) == 0x000340, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable34' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable35) == 0x000358, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable35' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable36) == 0x000370, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable36' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable37) == 0x000388, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable37' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_text_Variable38) == 0x0003A0, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_text_Variable38' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_byte_Variable4) == 0x0003B8, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_byte_Variable5) == 0x0003B9, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_byte_Variable6) == 0x0003BA, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_byte_Variable7) == 0x0003BB, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_byte_Variable7' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_byte_Variable8) == 0x0003BC, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_byte_Variable8' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_byte_Variable9) == 0x0003BD, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_byte_Variable9' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_byte_Variable10) == 0x0003BE, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_byte_Variable10' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_byte_Variable11) == 0x0003BF, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_byte_Variable11' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_byte_Variable12) == 0x0003C0, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_byte_Variable12' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_byte_Variable13) == 0x0003C1, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_byte_Variable13' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_byte_Variable14) == 0x0003C2, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_byte_Variable14' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_byte_Variable15) == 0x0003C3, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_byte_Variable15' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_byte_Variable16) == 0x0003C4, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_byte_Variable16' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_bool_Variable3) == 0x0003C5, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_byte_Variable17) == 0x0003C6, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_byte_Variable17' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_byte_Variable18) == 0x0003C7, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_byte_Variable18' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_bool_Variable4) == 0x0003C8, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_byte_Variable19) == 0x0003C9, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_byte_Variable19' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, Temp_byte_Variable20) == 0x0003CA, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::Temp_byte_Variable20' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, K2Node_ComponentBoundEvent_Button3) == 0x0003D0, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, K2Node_Event_bCanMatchmake) == 0x0003D8, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::K2Node_Event_bCanMatchmake' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, K2Node_DynamicCast_AsIcon_Text_Button) == 0x0003E0, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::K2Node_DynamicCast_AsIcon_Text_Button' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, K2Node_DynamicCast_bSuccess) == 0x0003E8, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, K2Node_Event_bIsMatchmaking) == 0x0003E9, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::K2Node_Event_bIsMatchmaking' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, K2Node_Select_Default) == 0x0003F0, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, K2Node_Select2_Default) == 0x000408, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, K2Node_DynamicCast_AsIcon_Text_Button2) == 0x000420, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::K2Node_DynamicCast_AsIcon_Text_Button2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, K2Node_DynamicCast_bSuccess2) == 0x000428, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, K2Node_ComponentBoundEvent_Value2) == 0x00042C, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::K2Node_ComponentBoundEvent_Value2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, K2Node_Select3_Default) == 0x000430, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, K2Node_Select4_Default) == 0x000448, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, K2Node_ComponentBoundEvent_Value) == 0x000460, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, CallFunc_Conv_IntToBool_ReturnValue) == 0x000464, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, K2Node_ComponentBoundEvent_Button2) == 0x000468, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, K2Node_Select5_Default) == 0x000470, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::K2Node_Select5_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, CallFunc_CheckForLTMBangs_BangAvail) == 0x000488, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::CallFunc_CheckForLTMBangs_BangAvail' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, K2Node_ComponentBoundEvent_Button) == 0x000490, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, K2Node_Select6_Default) == 0x000498, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::K2Node_Select6_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, K2Node_Select7_Default) == 0x000499, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::K2Node_Select7_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, K2Node_Event_bShowPlayButton) == 0x00049A, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::K2Node_Event_bShowPlayButton' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay, K2Node_Select8_Default) == 0x00049B, "Member 'AthenaMatchmakingPlay_C_ExecuteUbergraph_AthenaMatchmakingPlay::K2Node_Select8_Default' has a wrong offset!");

// Function AthenaMatchmakingPlay.AthenaMatchmakingPlay_C.OnPlayButtonUpdated
// 0x0001 (0x0001 - 0x0000)
struct AthenaMatchmakingPlay_C_OnPlayButtonUpdated final
{
public:
	bool                                          bShowPlayButton;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingPlay_C_OnPlayButtonUpdated) == 0x000001, "Wrong alignment on AthenaMatchmakingPlay_C_OnPlayButtonUpdated");
static_assert(sizeof(AthenaMatchmakingPlay_C_OnPlayButtonUpdated) == 0x000001, "Wrong size on AthenaMatchmakingPlay_C_OnPlayButtonUpdated");
static_assert(offsetof(AthenaMatchmakingPlay_C_OnPlayButtonUpdated, bShowPlayButton) == 0x000000, "Member 'AthenaMatchmakingPlay_C_OnPlayButtonUpdated::bShowPlayButton' has a wrong offset!");

// Function AthenaMatchmakingPlay.AthenaMatchmakingPlay_C.BndEvt__BP_PlayButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaMatchmakingPlay_C_BndEvt__BP_PlayButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingPlay_C_BndEvt__BP_PlayButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaMatchmakingPlay_C_BndEvt__BP_PlayButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaMatchmakingPlay_C_BndEvt__BP_PlayButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaMatchmakingPlay_C_BndEvt__BP_PlayButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaMatchmakingPlay_C_BndEvt__BP_PlayButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaMatchmakingPlay_C_BndEvt__BP_PlayButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaMatchmakingPlay.AthenaMatchmakingPlay_C.BndEvt__FillSquadButton_K2Node_ComponentBoundEvent_33_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaMatchmakingPlay_C_BndEvt__FillSquadButton_K2Node_ComponentBoundEvent_33_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingPlay_C_BndEvt__FillSquadButton_K2Node_ComponentBoundEvent_33_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaMatchmakingPlay_C_BndEvt__FillSquadButton_K2Node_ComponentBoundEvent_33_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaMatchmakingPlay_C_BndEvt__FillSquadButton_K2Node_ComponentBoundEvent_33_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaMatchmakingPlay_C_BndEvt__FillSquadButton_K2Node_ComponentBoundEvent_33_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaMatchmakingPlay_C_BndEvt__FillSquadButton_K2Node_ComponentBoundEvent_33_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaMatchmakingPlay_C_BndEvt__FillSquadButton_K2Node_ComponentBoundEvent_33_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaMatchmakingPlay.AthenaMatchmakingPlay_C.BndEvt__TeamFillRotator_K2Node_ComponentBoundEvent_128_OnRotated__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct AthenaMatchmakingPlay_C_BndEvt__TeamFillRotator_K2Node_ComponentBoundEvent_128_OnRotated__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingPlay_C_BndEvt__TeamFillRotator_K2Node_ComponentBoundEvent_128_OnRotated__DelegateSignature) == 0x000004, "Wrong alignment on AthenaMatchmakingPlay_C_BndEvt__TeamFillRotator_K2Node_ComponentBoundEvent_128_OnRotated__DelegateSignature");
static_assert(sizeof(AthenaMatchmakingPlay_C_BndEvt__TeamFillRotator_K2Node_ComponentBoundEvent_128_OnRotated__DelegateSignature) == 0x000004, "Wrong size on AthenaMatchmakingPlay_C_BndEvt__TeamFillRotator_K2Node_ComponentBoundEvent_128_OnRotated__DelegateSignature");
static_assert(offsetof(AthenaMatchmakingPlay_C_BndEvt__TeamFillRotator_K2Node_ComponentBoundEvent_128_OnRotated__DelegateSignature, Value) == 0x000000, "Member 'AthenaMatchmakingPlay_C_BndEvt__TeamFillRotator_K2Node_ComponentBoundEvent_128_OnRotated__DelegateSignature::Value' has a wrong offset!");

// Function AthenaMatchmakingPlay.AthenaMatchmakingPlay_C.BndEvt__PlaylistRotator_K2Node_ComponentBoundEvent_83_OnRotated__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct AthenaMatchmakingPlay_C_BndEvt__PlaylistRotator_K2Node_ComponentBoundEvent_83_OnRotated__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingPlay_C_BndEvt__PlaylistRotator_K2Node_ComponentBoundEvent_83_OnRotated__DelegateSignature) == 0x000004, "Wrong alignment on AthenaMatchmakingPlay_C_BndEvt__PlaylistRotator_K2Node_ComponentBoundEvent_83_OnRotated__DelegateSignature");
static_assert(sizeof(AthenaMatchmakingPlay_C_BndEvt__PlaylistRotator_K2Node_ComponentBoundEvent_83_OnRotated__DelegateSignature) == 0x000004, "Wrong size on AthenaMatchmakingPlay_C_BndEvt__PlaylistRotator_K2Node_ComponentBoundEvent_83_OnRotated__DelegateSignature");
static_assert(offsetof(AthenaMatchmakingPlay_C_BndEvt__PlaylistRotator_K2Node_ComponentBoundEvent_83_OnRotated__DelegateSignature, Value) == 0x000000, "Member 'AthenaMatchmakingPlay_C_BndEvt__PlaylistRotator_K2Node_ComponentBoundEvent_83_OnRotated__DelegateSignature::Value' has a wrong offset!");

// Function AthenaMatchmakingPlay.AthenaMatchmakingPlay_C.SetCancelButtonState
// 0x0001 (0x0001 - 0x0000)
struct AthenaMatchmakingPlay_C_SetCancelButtonState final
{
public:
	bool                                          bIsMatchmaking;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingPlay_C_SetCancelButtonState) == 0x000001, "Wrong alignment on AthenaMatchmakingPlay_C_SetCancelButtonState");
static_assert(sizeof(AthenaMatchmakingPlay_C_SetCancelButtonState) == 0x000001, "Wrong size on AthenaMatchmakingPlay_C_SetCancelButtonState");
static_assert(offsetof(AthenaMatchmakingPlay_C_SetCancelButtonState, bIsMatchmaking) == 0x000000, "Member 'AthenaMatchmakingPlay_C_SetCancelButtonState::bIsMatchmaking' has a wrong offset!");

// Function AthenaMatchmakingPlay.AthenaMatchmakingPlay_C.SetPlayButtonState
// 0x0001 (0x0001 - 0x0000)
struct AthenaMatchmakingPlay_C_SetPlayButtonState final
{
public:
	bool                                          bCanMatchmake;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingPlay_C_SetPlayButtonState) == 0x000001, "Wrong alignment on AthenaMatchmakingPlay_C_SetPlayButtonState");
static_assert(sizeof(AthenaMatchmakingPlay_C_SetPlayButtonState) == 0x000001, "Wrong size on AthenaMatchmakingPlay_C_SetPlayButtonState");
static_assert(offsetof(AthenaMatchmakingPlay_C_SetPlayButtonState, bCanMatchmake) == 0x000000, "Member 'AthenaMatchmakingPlay_C_SetPlayButtonState::bCanMatchmake' has a wrong offset!");

// Function AthenaMatchmakingPlay.AthenaMatchmakingPlay_C.BndEvt__BP_CancelButton_K2Node_ComponentBoundEvent_19_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaMatchmakingPlay_C_BndEvt__BP_CancelButton_K2Node_ComponentBoundEvent_19_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingPlay_C_BndEvt__BP_CancelButton_K2Node_ComponentBoundEvent_19_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaMatchmakingPlay_C_BndEvt__BP_CancelButton_K2Node_ComponentBoundEvent_19_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaMatchmakingPlay_C_BndEvt__BP_CancelButton_K2Node_ComponentBoundEvent_19_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaMatchmakingPlay_C_BndEvt__BP_CancelButton_K2Node_ComponentBoundEvent_19_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaMatchmakingPlay_C_BndEvt__BP_CancelButton_K2Node_ComponentBoundEvent_19_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaMatchmakingPlay_C_BndEvt__BP_CancelButton_K2Node_ComponentBoundEvent_19_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaMatchmakingPlay.AthenaMatchmakingPlay_C.SetAutoFillOptions
// 0x0010 (0x0010 - 0x0000)
struct AthenaMatchmakingPlay_C_SetAutoFillOptions final
{
public:
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(AthenaMatchmakingPlay_C_SetAutoFillOptions) == 0x000008, "Wrong alignment on AthenaMatchmakingPlay_C_SetAutoFillOptions");
static_assert(sizeof(AthenaMatchmakingPlay_C_SetAutoFillOptions) == 0x000010, "Wrong size on AthenaMatchmakingPlay_C_SetAutoFillOptions");
static_assert(offsetof(AthenaMatchmakingPlay_C_SetAutoFillOptions, K2Node_MakeArray_Array) == 0x000000, "Member 'AthenaMatchmakingPlay_C_SetAutoFillOptions::K2Node_MakeArray_Array' has a wrong offset!");

// Function AthenaMatchmakingPlay.AthenaMatchmakingPlay_C.PlaylistChange
// 0x0018 (0x0018 - 0x0000)
struct AthenaMatchmakingPlay_C_PlaylistChange final
{
public:
	bool                                          bDirection;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaRotator_C*                       K2Node_DynamicCast_AsAthena_Rotator;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingPlay_C_PlaylistChange) == 0x000008, "Wrong alignment on AthenaMatchmakingPlay_C_PlaylistChange");
static_assert(sizeof(AthenaMatchmakingPlay_C_PlaylistChange) == 0x000018, "Wrong size on AthenaMatchmakingPlay_C_PlaylistChange");
static_assert(offsetof(AthenaMatchmakingPlay_C_PlaylistChange, bDirection) == 0x000000, "Member 'AthenaMatchmakingPlay_C_PlaylistChange::bDirection' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_PlaylistChange, K2Node_DynamicCast_AsAthena_Rotator) == 0x000008, "Member 'AthenaMatchmakingPlay_C_PlaylistChange::K2Node_DynamicCast_AsAthena_Rotator' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_PlaylistChange, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'AthenaMatchmakingPlay_C_PlaylistChange::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AthenaMatchmakingPlay.AthenaMatchmakingPlay_C.FillChange
// 0x0018 (0x0018 - 0x0000)
struct AthenaMatchmakingPlay_C_FillChange final
{
public:
	bool                                          bDirection;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaRotator_C*                       K2Node_DynamicCast_AsAthena_Rotator;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingPlay_C_FillChange) == 0x000008, "Wrong alignment on AthenaMatchmakingPlay_C_FillChange");
static_assert(sizeof(AthenaMatchmakingPlay_C_FillChange) == 0x000018, "Wrong size on AthenaMatchmakingPlay_C_FillChange");
static_assert(offsetof(AthenaMatchmakingPlay_C_FillChange, bDirection) == 0x000000, "Member 'AthenaMatchmakingPlay_C_FillChange::bDirection' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_FillChange, K2Node_DynamicCast_AsAthena_Rotator) == 0x000008, "Member 'AthenaMatchmakingPlay_C_FillChange::K2Node_DynamicCast_AsAthena_Rotator' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_FillChange, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'AthenaMatchmakingPlay_C_FillChange::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AthenaMatchmakingPlay.AthenaMatchmakingPlay_C.OpenPlayOptions
// 0x0010 (0x0010 - 0x0000)
struct AthenaMatchmakingPlay_C_OpenPlayOptions final
{
public:
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaMatchmakingOptionsDisplay_v2_C*  CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingPlay_C_OpenPlayOptions) == 0x000008, "Wrong alignment on AthenaMatchmakingPlay_C_OpenPlayOptions");
static_assert(sizeof(AthenaMatchmakingPlay_C_OpenPlayOptions) == 0x000010, "Wrong size on AthenaMatchmakingPlay_C_OpenPlayOptions");
static_assert(offsetof(AthenaMatchmakingPlay_C_OpenPlayOptions, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000000, "Member 'AthenaMatchmakingPlay_C_OpenPlayOptions::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_OpenPlayOptions, CallFunc_Create_ReturnValue) == 0x000008, "Member 'AthenaMatchmakingPlay_C_OpenPlayOptions::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function AthenaMatchmakingPlay.AthenaMatchmakingPlay_C.CheckForLTMBangs
// 0x0020 (0x0020 - 0x0000)
struct AthenaMatchmakingPlay_C_CheckForLTMBangs final
{
public:
	bool                                          BangAvail;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEvent1QueueEnabled_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEvent8QueueEnabled_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEvent7QueueEnabled_ReturnValue;         // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEvent6QueueEnabled_ReturnValue;         // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEvent5QueueEnabled_ReturnValue;         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEvent4QueueEnabled_ReturnValue;         // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEvent3QueueEnabled_ReturnValue;         // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEvent2QueueEnabled_ReturnValue;         // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFiftyFiftyQueueEnabled_ReturnValue;     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingPlay_C_CheckForLTMBangs) == 0x000008, "Wrong alignment on AthenaMatchmakingPlay_C_CheckForLTMBangs");
static_assert(sizeof(AthenaMatchmakingPlay_C_CheckForLTMBangs) == 0x000020, "Wrong size on AthenaMatchmakingPlay_C_CheckForLTMBangs");
static_assert(offsetof(AthenaMatchmakingPlay_C_CheckForLTMBangs, BangAvail) == 0x000000, "Member 'AthenaMatchmakingPlay_C_CheckForLTMBangs::BangAvail' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_CheckForLTMBangs, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaMatchmakingPlay_C_CheckForLTMBangs::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingPlay_C_CheckForLTMBangs, CallFunc_IsEvent1QueueEnabled_ReturnValue) == 0x000010, "Member 'AthenaMatchmakingPlay_C_CheckForLTMBangs::CallFunc_IsEvent1QueueEnabled_ReturnValue' has a wrong offset!");
