#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchmakingOptionsDisplay_v2

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C
// 0x00D8 (0x04C0 - 0x03E8)
class UAthenaMatchmakingOptionsDisplay_v2_C final : public UFortActivatablePanel
{
public:
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn_Details;                                    // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Open;                                              // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthena_Matchmaking_GameModeButton_C*   B_GM_Duo;                                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthena_Matchmaking_GameModeButton_C*   B_GM_LTM;                                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthena_Matchmaking_GameModeButton_C*   B_GM_Solo;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthena_Matchmaking_GameModeButton_C*   B_GM_Squad;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur_0;                                  // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          ClickBlocker;                                      // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CT_HoveredGameMode;                                // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CT_HoveredModeDescription;                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_Content;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VB_GameModeContainer;                              // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Input_Cancel;                                      // 0x0458(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UAthenaMatchmakingPlay_C*               Parent;                                            // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           DebugList_StandardModes;                           // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UAthena_Matchmaking_GameModeButton_C*> MyStandardGameModeButtons;                         // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UAthena_Matchmaking_SpecialEventButton_C* MyLTM;                                             // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastHoveredStandardModeIndex;                      // 0x0498(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C[0x4];                                      // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAthena_Matchmaking_GameModeButton_C*> MyActiveStandardGameModeButtons;                   // 0x04A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         SM_Button_IndexMax;                                // 0x04B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SM_Button_IndexCurrent;                            // 0x04B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortAthenaPlaylist                           LTMPlaylist;                                       // 0x04B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2(int32 EntryPoint);
	void PlaylistsUpdated();
	void OnModeButtonHovered(class UAthena_Matchmaking_GameModeButton_C* HoveredButton);
	void OnGameModeButtonSelected(class UAthena_Matchmaking_GameModeButton_C* SelectedGameModeButton);
	void Construct();
	void BndEvt__IconTextButton_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnActivated();
	void SetupInput();
	void Handle_InputAction_Cancel(bool* Passthrough);
	void CloseMatchmakingOptions();
	void AddStandardGameModes();
	void ClearStandardGameModes();
	void AddLTM(EFortAthenaPlaylist Param_LTMPlaylist, bool AddSpecialStyle);
	void ClearLTM();
	class UWidget* Handle_Navigate_Right(EUINavigation Param_Navigation);
	class UWidget* Handle_Navigate_Left(EUINavigation Param_Navigation);
	void SetupButtonBindings();
	void UpdateStandardGameModeButtonAvailibilty();
	class UWidget* Handle_Navigate_StandardModes_Up(EUINavigation Param_Navigation);
	class UWidget* Handle_Navigate_StandardModes_Down(EUINavigation Param_Navigation);
	void HandleStandardModeButtonIndex(bool Increment, int32* NewIndex);
	void UpdateLTM();
	void InitializeGameModeButtons();
	void NoLTMAvailable();
	struct FEventReply On_ClickBlocker_MouseButtonDown_0(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMatchmakingOptionsDisplay_v2_C">();
	}
	static class UAthenaMatchmakingOptionsDisplay_v2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMatchmakingOptionsDisplay_v2_C>();
	}
};
static_assert(alignof(UAthenaMatchmakingOptionsDisplay_v2_C) == 0x000008, "Wrong alignment on UAthenaMatchmakingOptionsDisplay_v2_C");
static_assert(sizeof(UAthenaMatchmakingOptionsDisplay_v2_C) == 0x0004C0, "Wrong size on UAthenaMatchmakingOptionsDisplay_v2_C");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, UberGraphFrame) == 0x0003F0, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, FadeIn_Details) == 0x0003F8, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::FadeIn_Details' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, Open) == 0x000400, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::Open' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, B_GM_Duo) == 0x000408, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::B_GM_Duo' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, B_GM_LTM) == 0x000410, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::B_GM_LTM' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, B_GM_Solo) == 0x000418, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::B_GM_Solo' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, B_GM_Squad) == 0x000420, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::B_GM_Squad' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, BackgroundBlur_0) == 0x000428, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::BackgroundBlur_0' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, ClickBlocker) == 0x000430, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::ClickBlocker' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, CT_HoveredGameMode) == 0x000438, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::CT_HoveredGameMode' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, CT_HoveredModeDescription) == 0x000440, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::CT_HoveredModeDescription' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, SB_Content) == 0x000448, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::SB_Content' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, VB_GameModeContainer) == 0x000450, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::VB_GameModeContainer' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, Input_Cancel) == 0x000458, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::Input_Cancel' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, Parent) == 0x000468, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::Parent' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, DebugList_StandardModes) == 0x000470, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::DebugList_StandardModes' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, MyStandardGameModeButtons) == 0x000480, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::MyStandardGameModeButtons' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, MyLTM) == 0x000490, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::MyLTM' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, LastHoveredStandardModeIndex) == 0x000498, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::LastHoveredStandardModeIndex' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, MyActiveStandardGameModeButtons) == 0x0004A0, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::MyActiveStandardGameModeButtons' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, SM_Button_IndexMax) == 0x0004B0, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::SM_Button_IndexMax' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, SM_Button_IndexCurrent) == 0x0004B4, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::SM_Button_IndexCurrent' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, LTMPlaylist) == 0x0004B8, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::LTMPlaylist' has a wrong offset!");

}

