#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Matchmaking_SpecialEventButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function Athena_Matchmaking_SpecialEventButton.Athena_Matchmaking_SpecialEventButton_C.ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton
// 0x0010 (0x0010 - 0x0000)
struct Athena_Matchmaking_SpecialEventButton_C_ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_Matchmaking_SpecialEventButton_C_ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton) == 0x000004, "Wrong alignment on Athena_Matchmaking_SpecialEventButton_C_ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton");
static_assert(sizeof(Athena_Matchmaking_SpecialEventButton_C_ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton) == 0x000010, "Wrong size on Athena_Matchmaking_SpecialEventButton_C_ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton");
static_assert(offsetof(Athena_Matchmaking_SpecialEventButton_C_ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton, EntryPoint) == 0x000000, "Member 'Athena_Matchmaking_SpecialEventButton_C_ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(Athena_Matchmaking_SpecialEventButton_C_ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton, Temp_bool_Variable) == 0x000004, "Member 'Athena_Matchmaking_SpecialEventButton_C_ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Matchmaking_SpecialEventButton_C_ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton, Temp_byte_Variable) == 0x000005, "Member 'Athena_Matchmaking_SpecialEventButton_C_ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Matchmaking_SpecialEventButton_C_ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton, Temp_byte_Variable2) == 0x000006, "Member 'Athena_Matchmaking_SpecialEventButton_C_ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(Athena_Matchmaking_SpecialEventButton_C_ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton, Temp_bool_Variable2) == 0x000007, "Member 'Athena_Matchmaking_SpecialEventButton_C_ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(Athena_Matchmaking_SpecialEventButton_C_ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton, Temp_byte_Variable3) == 0x000008, "Member 'Athena_Matchmaking_SpecialEventButton_C_ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(Athena_Matchmaking_SpecialEventButton_C_ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton, Temp_byte_Variable4) == 0x000009, "Member 'Athena_Matchmaking_SpecialEventButton_C_ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(Athena_Matchmaking_SpecialEventButton_C_ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton, K2Node_Select_Default) == 0x00000A, "Member 'Athena_Matchmaking_SpecialEventButton_C_ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Athena_Matchmaking_SpecialEventButton_C_ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton, K2Node_Event_IsDesignTime) == 0x00000B, "Member 'Athena_Matchmaking_SpecialEventButton_C_ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(Athena_Matchmaking_SpecialEventButton_C_ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton, K2Node_Select2_Default) == 0x00000C, "Member 'Athena_Matchmaking_SpecialEventButton_C_ExecuteUbergraph_Athena_Matchmaking_SpecialEventButton::K2Node_Select2_Default' has a wrong offset!");

// Function Athena_Matchmaking_SpecialEventButton.Athena_Matchmaking_SpecialEventButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Athena_Matchmaking_SpecialEventButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Athena_Matchmaking_SpecialEventButton_C_PreConstruct) == 0x000001, "Wrong alignment on Athena_Matchmaking_SpecialEventButton_C_PreConstruct");
static_assert(sizeof(Athena_Matchmaking_SpecialEventButton_C_PreConstruct) == 0x000001, "Wrong size on Athena_Matchmaking_SpecialEventButton_C_PreConstruct");
static_assert(offsetof(Athena_Matchmaking_SpecialEventButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Athena_Matchmaking_SpecialEventButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function Athena_Matchmaking_SpecialEventButton.Athena_Matchmaking_SpecialEventButton_C.OnFocusReceived
// 0x0270 (0x0270 - 0x0000)
struct Athena_Matchmaking_SpecialEventButton_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0100(0x00B8)()
	struct FEventReply                            CallFunc_SetUserFocus_ReturnValue;                 // 0x01B8(0x00B8)()
};
static_assert(alignof(Athena_Matchmaking_SpecialEventButton_C_OnFocusReceived) == 0x000008, "Wrong alignment on Athena_Matchmaking_SpecialEventButton_C_OnFocusReceived");
static_assert(sizeof(Athena_Matchmaking_SpecialEventButton_C_OnFocusReceived) == 0x000270, "Wrong size on Athena_Matchmaking_SpecialEventButton_C_OnFocusReceived");
static_assert(offsetof(Athena_Matchmaking_SpecialEventButton_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'Athena_Matchmaking_SpecialEventButton_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(Athena_Matchmaking_SpecialEventButton_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'Athena_Matchmaking_SpecialEventButton_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(Athena_Matchmaking_SpecialEventButton_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'Athena_Matchmaking_SpecialEventButton_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Matchmaking_SpecialEventButton_C_OnFocusReceived, CallFunc_GetUINavigationManager_ReturnValue) == 0x0000F8, "Member 'Athena_Matchmaking_SpecialEventButton_C_OnFocusReceived::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Matchmaking_SpecialEventButton_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000100, "Member 'Athena_Matchmaking_SpecialEventButton_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Matchmaking_SpecialEventButton_C_OnFocusReceived, CallFunc_SetUserFocus_ReturnValue) == 0x0001B8, "Member 'Athena_Matchmaking_SpecialEventButton_C_OnFocusReceived::CallFunc_SetUserFocus_ReturnValue' has a wrong offset!");

// Function Athena_Matchmaking_SpecialEventButton.Athena_Matchmaking_SpecialEventButton_C.SetLTMSplashArt
// 0x0028 (0x0028 - 0x0000)
struct Athena_Matchmaking_SpecialEventButton_C_SetLTMSplashArt final
{
public:
	TSoftObjectPtr<class UTexture2D>              NewParam;                                          // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Athena_Matchmaking_SpecialEventButton_C_SetLTMSplashArt) == 0x000008, "Wrong alignment on Athena_Matchmaking_SpecialEventButton_C_SetLTMSplashArt");
static_assert(sizeof(Athena_Matchmaking_SpecialEventButton_C_SetLTMSplashArt) == 0x000028, "Wrong size on Athena_Matchmaking_SpecialEventButton_C_SetLTMSplashArt");
static_assert(offsetof(Athena_Matchmaking_SpecialEventButton_C_SetLTMSplashArt, NewParam) == 0x000000, "Member 'Athena_Matchmaking_SpecialEventButton_C_SetLTMSplashArt::NewParam' has a wrong offset!");

}

