#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaHUDMenu

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaHUDMenu.AthenaHUDMenu_C.ExecuteUbergraph_AthenaHUDMenu
// 0x00B8 (0x00B8 - 0x0000)
struct AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue2;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UAthenaGameOverWidget_C*                CallFunc_CreateOrShowGameOverScreen_GameOverScreen; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue3;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FFortPlayerDeathReport& DeathReport)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class UAthenaGameOverWidget_C*                CallFunc_CreateOrShowGameOverScreen_GameOverScreen2; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortPlayerDeathReport                 K2Node_CustomEvent_DeathReport;                    // 0x0068(0x0050)(ConstParm)
};
static_assert(alignof(AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu) == 0x000008, "Wrong alignment on AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu");
static_assert(sizeof(AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu) == 0x0000B8, "Wrong size on AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu");
static_assert(offsetof(AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu, EntryPoint) == 0x000000, "Member 'AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu, CallFunc_GetContext_ReturnValue2) == 0x000010, "Member 'AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu, CallFunc_CreateOrShowGameOverScreen_GameOverScreen) == 0x000028, "Member 'AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu::CallFunc_CreateOrShowGameOverScreen_GameOverScreen' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu, CallFunc_GetContext_ReturnValue3) == 0x000030, "Member 'AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu, K2Node_CreateDelegate_OutputDelegate2) == 0x000038, "Member 'AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu, K2Node_CreateDelegate_OutputDelegate3) == 0x000048, "Member 'AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu, CallFunc_CreateOrShowGameOverScreen_GameOverScreen2) == 0x000058, "Member 'AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu::CallFunc_CreateOrShowGameOverScreen_GameOverScreen2' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000060, "Member 'AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu, K2Node_CustomEvent_DeathReport) == 0x000068, "Member 'AthenaHUDMenu_C_ExecuteUbergraph_AthenaHUDMenu::K2Node_CustomEvent_DeathReport' has a wrong offset!");

// Function AthenaHUDMenu.AthenaHUDMenu_C.On Player Died
// 0x0050 (0x0050 - 0x0000)
struct AthenaHUDMenu_C_On_Player_Died final
{
public:
	struct FFortPlayerDeathReport                 DeathReport;                                       // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaHUDMenu_C_On_Player_Died) == 0x000008, "Wrong alignment on AthenaHUDMenu_C_On_Player_Died");
static_assert(sizeof(AthenaHUDMenu_C_On_Player_Died) == 0x000050, "Wrong size on AthenaHUDMenu_C_On_Player_Died");
static_assert(offsetof(AthenaHUDMenu_C_On_Player_Died, DeathReport) == 0x000000, "Member 'AthenaHUDMenu_C_On_Player_Died::DeathReport' has a wrong offset!");

// Function AthenaHUDMenu.AthenaHUDMenu_C.SetCursorModeContent
// 0x0028 (0x0028 - 0x0000)
struct AthenaHUDMenu_C_SetCursorModeContent final
{
public:
	class UUserWidget*                            CustomWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ActionName;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_SetContent_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_SetContent_ReturnValue2;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHUDMenu_C_SetCursorModeContent) == 0x000008, "Wrong alignment on AthenaHUDMenu_C_SetCursorModeContent");
static_assert(sizeof(AthenaHUDMenu_C_SetCursorModeContent) == 0x000028, "Wrong size on AthenaHUDMenu_C_SetCursorModeContent");
static_assert(offsetof(AthenaHUDMenu_C_SetCursorModeContent, CustomWidget) == 0x000000, "Member 'AthenaHUDMenu_C_SetCursorModeContent::CustomWidget' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_SetCursorModeContent, ActionName) == 0x000008, "Member 'AthenaHUDMenu_C_SetCursorModeContent::ActionName' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_SetCursorModeContent, K2Node_SwitchName_CmpSuccess) == 0x000010, "Member 'AthenaHUDMenu_C_SetCursorModeContent::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_SetCursorModeContent, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'AthenaHUDMenu_C_SetCursorModeContent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_SetCursorModeContent, CallFunc_SetContent_ReturnValue) == 0x000018, "Member 'AthenaHUDMenu_C_SetCursorModeContent::CallFunc_SetContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_SetCursorModeContent, CallFunc_SetContent_ReturnValue2) == 0x000020, "Member 'AthenaHUDMenu_C_SetCursorModeContent::CallFunc_SetContent_ReturnValue2' has a wrong offset!");

// Function AthenaHUDMenu.AthenaHUDMenu_C.PushMenuContent
// 0x0008 (0x0008 - 0x0000)
struct AthenaHUDMenu_C_PushMenuContent final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHUDMenu_C_PushMenuContent) == 0x000008, "Wrong alignment on AthenaHUDMenu_C_PushMenuContent");
static_assert(sizeof(AthenaHUDMenu_C_PushMenuContent) == 0x000008, "Wrong size on AthenaHUDMenu_C_PushMenuContent");
static_assert(offsetof(AthenaHUDMenu_C_PushMenuContent, Widget) == 0x000000, "Member 'AthenaHUDMenu_C_PushMenuContent::Widget' has a wrong offset!");

// Function AthenaHUDMenu.AthenaHUDMenu_C.PopMenuContent
// 0x0010 (0x0010 - 0x0000)
struct AthenaHUDMenu_C_PopMenuContent final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_PopWigdet_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHUDMenu_C_PopMenuContent) == 0x000008, "Wrong alignment on AthenaHUDMenu_C_PopMenuContent");
static_assert(sizeof(AthenaHUDMenu_C_PopMenuContent) == 0x000010, "Wrong size on AthenaHUDMenu_C_PopMenuContent");
static_assert(offsetof(AthenaHUDMenu_C_PopMenuContent, ReturnValue) == 0x000000, "Member 'AthenaHUDMenu_C_PopMenuContent::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_PopMenuContent, CallFunc_PopWigdet_ReturnValue) == 0x000008, "Member 'AthenaHUDMenu_C_PopMenuContent::CallFunc_PopWigdet_ReturnValue' has a wrong offset!");

// Function AthenaHUDMenu.AthenaHUDMenu_C.Dismiss
// 0x0030 (0x0030 - 0x0000)
struct AthenaHUDMenu_C_Dismiss final
{
public:
	class UPanelSlot*                             CallFunc_SetContent_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIManager_C*                           K2Node_DynamicCast_AsUIManager;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFeedback_C*                            K2Node_DynamicCast_AsFeedback;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaHUDMenu_C_Dismiss) == 0x000008, "Wrong alignment on AthenaHUDMenu_C_Dismiss");
static_assert(sizeof(AthenaHUDMenu_C_Dismiss) == 0x000030, "Wrong size on AthenaHUDMenu_C_Dismiss");
static_assert(offsetof(AthenaHUDMenu_C_Dismiss, CallFunc_SetContent_ReturnValue) == 0x000000, "Member 'AthenaHUDMenu_C_Dismiss::CallFunc_SetContent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_Dismiss, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000008, "Member 'AthenaHUDMenu_C_Dismiss::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_Dismiss, K2Node_DynamicCast_AsUIManager) == 0x000010, "Member 'AthenaHUDMenu_C_Dismiss::K2Node_DynamicCast_AsUIManager' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_Dismiss, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AthenaHUDMenu_C_Dismiss::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_Dismiss, K2Node_DynamicCast_AsFeedback) == 0x000020, "Member 'AthenaHUDMenu_C_Dismiss::K2Node_DynamicCast_AsFeedback' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_Dismiss, K2Node_DynamicCast_bSuccess2) == 0x000028, "Member 'AthenaHUDMenu_C_Dismiss::K2Node_DynamicCast_bSuccess2' has a wrong offset!");

// Function AthenaHUDMenu.AthenaHUDMenu_C.CreateOrShowGameOverScreen
// 0x0030 (0x0030 - 0x0000)
struct AthenaHUDMenu_C_CreateOrShowGameOverScreen final
{
public:
	class UAthenaGameOverWidget_C*                GameOverScreen;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaGameOverWidget_C*                CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaHUDMenu_C_CreateOrShowGameOverScreen) == 0x000008, "Wrong alignment on AthenaHUDMenu_C_CreateOrShowGameOverScreen");
static_assert(sizeof(AthenaHUDMenu_C_CreateOrShowGameOverScreen) == 0x000030, "Wrong size on AthenaHUDMenu_C_CreateOrShowGameOverScreen");
static_assert(offsetof(AthenaHUDMenu_C_CreateOrShowGameOverScreen, GameOverScreen) == 0x000000, "Member 'AthenaHUDMenu_C_CreateOrShowGameOverScreen::GameOverScreen' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_CreateOrShowGameOverScreen, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaHUDMenu_C_CreateOrShowGameOverScreen::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_CreateOrShowGameOverScreen, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'AthenaHUDMenu_C_CreateOrShowGameOverScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_CreateOrShowGameOverScreen, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000018, "Member 'AthenaHUDMenu_C_CreateOrShowGameOverScreen::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_CreateOrShowGameOverScreen, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'AthenaHUDMenu_C_CreateOrShowGameOverScreen::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaHUDMenu_C_CreateOrShowGameOverScreen, CallFunc_Create_ReturnValue) == 0x000028, "Member 'AthenaHUDMenu_C_CreateOrShowGameOverScreen::CallFunc_Create_ReturnValue' has a wrong offset!");

}

