#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Pickups

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Pickups.B_Pickups_C
// 0x01F0 (0x05A8 - 0x03B8)
class AB_Pickups_C final : public AFortPickupEffect
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Pivot_Offset;                                      // 0x03D0(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation_Bias;                                     // 0x03DC(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UStaticMeshComponent*                   Static_Mesh_Pickup;                                // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Skeletal_Mesh_Pickup;                              // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSkeletalMesh;                                    // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Is_a_Backpack;                                     // 0x03F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FA[0x6];                                      // 0x03FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             ListOfMaterialsExemptFromReparenting;              // 0x0400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UPrimitiveComponent*                    SkeletalOrStaticMeshAssetPrimitive;                // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentElementIndex;                               // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C[0x4];                                      // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstanceDynamic*>       MIDArray;                                          // 0x0420(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UMaterialInterface*                     CurrentMaterial;                                   // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CurrentParentMaterial;                             // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MaterialParentIsValid;                             // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             ListOfParentMaterialsExemptFromReparenting;        // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UParticleSystem*                        BackpackParticleSystem;                            // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Tick_Accumulation;                                 // 0x0460(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed_After_Being_picked_up;                       // 0x0464(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            ShrinkParticleWhenPickedupCurve;                   // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Tossed;                                            // 0x0470(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Activate_Rarity_Particle_Systems;                  // 0x0471(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_472[0x6];                                      // 0x0472(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 Skeletal_Mesh_Pickup_Hologram;                     // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstanceDynamic*>       Hologram_MIDs;                                     // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UTexture*>                       NormalMaps;                                        // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FLinearColor                           Rarity_Color;                                      // 0x04A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Rarity_Level;                                      // 0x04B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Current_MID;                                       // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 Sweep_Brightness;                                  // 0x04C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                 Sweep_Speed;                                       // 0x04D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         Component_Radius__Scaled_;                         // 0x04E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Component_Radius_Multiplier;                       // 0x04E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Empty_Normal;                                      // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Static_Mesh_Pickup_Hologram;                       // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    SkeletalOrStaticMeshHologramAssetPrimitive;        // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 Sparkle_Spawn_Rate__Ground_;                       // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FLinearColor>                   Outline_Rarity_Colors;                             // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         Sphere_Radius;                                     // 0x0520(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Picked_Up_Delay_Before_Glow;                       // 0x0524(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Picked_Up_Fade_In_Time;                            // 0x0528(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Picked_Up_Hold_Time;                               // 0x052C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Picked_Up_Fade_Out_Time;                           // 0x0530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Picked_Up_Sweep_Speed;                             // 0x0534(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBluglo;                                          // 0x0538(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        BlugloParticleSystem;                              // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Picked_Up_Trail_PS;                                // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 Sparkle_Spawn_Rate__Picked_Up_;                    // 0x0550(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<float>                                 Lifetime__Picked_Up_;                              // 0x0560(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UMaterialInterface*                     Hologram_Material;                                 // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLootGiftForOthers;                               // 0x0578(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_579[0x7];                                      // 0x0579(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceFeedbackEffect*                   PickupForceFeedback;                               // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Violentium_Particle;                               // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        ViolentiumParticleSystem;                          // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Violentium;                                     // 0x0598(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_599[0x7];                                      // 0x0599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        LegendaryParticleSystem;                           // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Pickups(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnPickedUp();
	void OnAboutToEnterBackpack(class AFortPawn* PickupTarget);
	void OnTossed();
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();
	void SetRarityColor();
	void SpawnPickedUpTrailPS();
	void SetHologramPickedUpParams(bool Tier_0_or_1);
	void CreateHologramMIDs();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Pickups_C">();
	}
	static class AB_Pickups_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Pickups_C>();
	}
};
static_assert(alignof(AB_Pickups_C) == 0x000008, "Wrong alignment on AB_Pickups_C");
static_assert(sizeof(AB_Pickups_C) == 0x0005A8, "Wrong size on AB_Pickups_C");
static_assert(offsetof(AB_Pickups_C, UberGraphFrame) == 0x0003B8, "Member 'AB_Pickups_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, ParticleSystem) == 0x0003C0, "Member 'AB_Pickups_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Root) == 0x0003C8, "Member 'AB_Pickups_C::Root' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Pivot_Offset) == 0x0003D0, "Member 'AB_Pickups_C::Pivot_Offset' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Rotation_Bias) == 0x0003DC, "Member 'AB_Pickups_C::Rotation_Bias' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Static_Mesh_Pickup) == 0x0003E8, "Member 'AB_Pickups_C::Static_Mesh_Pickup' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Skeletal_Mesh_Pickup) == 0x0003F0, "Member 'AB_Pickups_C::Skeletal_Mesh_Pickup' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, IsSkeletalMesh) == 0x0003F8, "Member 'AB_Pickups_C::IsSkeletalMesh' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Is_a_Backpack) == 0x0003F9, "Member 'AB_Pickups_C::Is_a_Backpack' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, ListOfMaterialsExemptFromReparenting) == 0x000400, "Member 'AB_Pickups_C::ListOfMaterialsExemptFromReparenting' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, SkeletalOrStaticMeshAssetPrimitive) == 0x000410, "Member 'AB_Pickups_C::SkeletalOrStaticMeshAssetPrimitive' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, CurrentElementIndex) == 0x000418, "Member 'AB_Pickups_C::CurrentElementIndex' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, MIDArray) == 0x000420, "Member 'AB_Pickups_C::MIDArray' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, CurrentMaterial) == 0x000430, "Member 'AB_Pickups_C::CurrentMaterial' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, CurrentParentMaterial) == 0x000438, "Member 'AB_Pickups_C::CurrentParentMaterial' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, MaterialParentIsValid) == 0x000440, "Member 'AB_Pickups_C::MaterialParentIsValid' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, ListOfParentMaterialsExemptFromReparenting) == 0x000448, "Member 'AB_Pickups_C::ListOfParentMaterialsExemptFromReparenting' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, BackpackParticleSystem) == 0x000458, "Member 'AB_Pickups_C::BackpackParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Tick_Accumulation) == 0x000460, "Member 'AB_Pickups_C::Tick_Accumulation' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Speed_After_Being_picked_up) == 0x000464, "Member 'AB_Pickups_C::Speed_After_Being_picked_up' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, ShrinkParticleWhenPickedupCurve) == 0x000468, "Member 'AB_Pickups_C::ShrinkParticleWhenPickedupCurve' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Tossed) == 0x000470, "Member 'AB_Pickups_C::Tossed' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Activate_Rarity_Particle_Systems) == 0x000471, "Member 'AB_Pickups_C::Activate_Rarity_Particle_Systems' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Skeletal_Mesh_Pickup_Hologram) == 0x000478, "Member 'AB_Pickups_C::Skeletal_Mesh_Pickup_Hologram' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Hologram_MIDs) == 0x000480, "Member 'AB_Pickups_C::Hologram_MIDs' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, NormalMaps) == 0x000490, "Member 'AB_Pickups_C::NormalMaps' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Rarity_Color) == 0x0004A0, "Member 'AB_Pickups_C::Rarity_Color' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Rarity_Level) == 0x0004B0, "Member 'AB_Pickups_C::Rarity_Level' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Current_MID) == 0x0004B8, "Member 'AB_Pickups_C::Current_MID' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Sweep_Brightness) == 0x0004C0, "Member 'AB_Pickups_C::Sweep_Brightness' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Sweep_Speed) == 0x0004D0, "Member 'AB_Pickups_C::Sweep_Speed' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Component_Radius__Scaled_) == 0x0004E0, "Member 'AB_Pickups_C::Component_Radius__Scaled_' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Component_Radius_Multiplier) == 0x0004E4, "Member 'AB_Pickups_C::Component_Radius_Multiplier' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Empty_Normal) == 0x0004E8, "Member 'AB_Pickups_C::Empty_Normal' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Static_Mesh_Pickup_Hologram) == 0x0004F0, "Member 'AB_Pickups_C::Static_Mesh_Pickup_Hologram' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, SkeletalOrStaticMeshHologramAssetPrimitive) == 0x0004F8, "Member 'AB_Pickups_C::SkeletalOrStaticMeshHologramAssetPrimitive' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Sparkle_Spawn_Rate__Ground_) == 0x000500, "Member 'AB_Pickups_C::Sparkle_Spawn_Rate__Ground_' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Outline_Rarity_Colors) == 0x000510, "Member 'AB_Pickups_C::Outline_Rarity_Colors' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Sphere_Radius) == 0x000520, "Member 'AB_Pickups_C::Sphere_Radius' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Picked_Up_Delay_Before_Glow) == 0x000524, "Member 'AB_Pickups_C::Picked_Up_Delay_Before_Glow' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Picked_Up_Fade_In_Time) == 0x000528, "Member 'AB_Pickups_C::Picked_Up_Fade_In_Time' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Picked_Up_Hold_Time) == 0x00052C, "Member 'AB_Pickups_C::Picked_Up_Hold_Time' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Picked_Up_Fade_Out_Time) == 0x000530, "Member 'AB_Pickups_C::Picked_Up_Fade_Out_Time' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Picked_Up_Sweep_Speed) == 0x000534, "Member 'AB_Pickups_C::Picked_Up_Sweep_Speed' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, IsBluglo) == 0x000538, "Member 'AB_Pickups_C::IsBluglo' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, BlugloParticleSystem) == 0x000540, "Member 'AB_Pickups_C::BlugloParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Picked_Up_Trail_PS) == 0x000548, "Member 'AB_Pickups_C::Picked_Up_Trail_PS' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Sparkle_Spawn_Rate__Picked_Up_) == 0x000550, "Member 'AB_Pickups_C::Sparkle_Spawn_Rate__Picked_Up_' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Lifetime__Picked_Up_) == 0x000560, "Member 'AB_Pickups_C::Lifetime__Picked_Up_' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Hologram_Material) == 0x000570, "Member 'AB_Pickups_C::Hologram_Material' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, IsLootGiftForOthers) == 0x000578, "Member 'AB_Pickups_C::IsLootGiftForOthers' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, PickupForceFeedback) == 0x000580, "Member 'AB_Pickups_C::PickupForceFeedback' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Violentium_Particle) == 0x000588, "Member 'AB_Pickups_C::Violentium_Particle' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, ViolentiumParticleSystem) == 0x000590, "Member 'AB_Pickups_C::ViolentiumParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, Is_Violentium) == 0x000598, "Member 'AB_Pickups_C::Is_Violentium' has a wrong offset!");
static_assert(offsetof(AB_Pickups_C, LegendaryParticleSystem) == 0x0005A0, "Member 'AB_Pickups_C::LegendaryParticleSystem' has a wrong offset!");

}

