#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Post_Explosion_Generic

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Post_Explosion_Generic.B_Post_Explosion_Generic_C
// 0x0558 (0x08C0 - 0x0368)
class AB_Post_Explosion_Generic_C : public AActor
{
public:
	class UPostProcessComponent*                  PostFX;                                            // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       PostFX_SphereComponent;                            // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PostFX_PreviewScale;                               // 0x0378(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         PostFX_BlendRadius;                                // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PostFX_ShakeEpicenter;                             // 0x0388(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PostFX_ShakeOuterradius;                           // 0x0394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PostFX_ShakeInnerRadius;                           // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCameraShake;                                    // 0x039C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39D[0x3];                                      // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CameraShakeClass;                                  // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseForceFeedback;                                  // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x3];                                      // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeactivateDelay;                                   // 0x03AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPostProcessSettings                   PostFX_Settings;                                   // 0x03B0(0x0500)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UForceFeedbackEffect*                   ForceFeedbackNear;                                 // 0x08B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UForceFeedbackEffect*                   ForceFeedbackFar;                                  // 0x08B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Post_Explosion_Generic_C">();
	}
	static class AB_Post_Explosion_Generic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Post_Explosion_Generic_C>();
	}
};
static_assert(alignof(AB_Post_Explosion_Generic_C) == 0x000010, "Wrong alignment on AB_Post_Explosion_Generic_C");
static_assert(sizeof(AB_Post_Explosion_Generic_C) == 0x0008C0, "Wrong size on AB_Post_Explosion_Generic_C");
static_assert(offsetof(AB_Post_Explosion_Generic_C, PostFX) == 0x000368, "Member 'AB_Post_Explosion_Generic_C::PostFX' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, PostFX_SphereComponent) == 0x000370, "Member 'AB_Post_Explosion_Generic_C::PostFX_SphereComponent' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, PostFX_PreviewScale) == 0x000378, "Member 'AB_Post_Explosion_Generic_C::PostFX_PreviewScale' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, PostFX_BlendRadius) == 0x000384, "Member 'AB_Post_Explosion_Generic_C::PostFX_BlendRadius' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, PostFX_ShakeEpicenter) == 0x000388, "Member 'AB_Post_Explosion_Generic_C::PostFX_ShakeEpicenter' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, PostFX_ShakeOuterradius) == 0x000394, "Member 'AB_Post_Explosion_Generic_C::PostFX_ShakeOuterradius' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, PostFX_ShakeInnerRadius) == 0x000398, "Member 'AB_Post_Explosion_Generic_C::PostFX_ShakeInnerRadius' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, UseCameraShake) == 0x00039C, "Member 'AB_Post_Explosion_Generic_C::UseCameraShake' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, CameraShakeClass) == 0x0003A0, "Member 'AB_Post_Explosion_Generic_C::CameraShakeClass' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, UseForceFeedback) == 0x0003A8, "Member 'AB_Post_Explosion_Generic_C::UseForceFeedback' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, DeactivateDelay) == 0x0003AC, "Member 'AB_Post_Explosion_Generic_C::DeactivateDelay' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, PostFX_Settings) == 0x0003B0, "Member 'AB_Post_Explosion_Generic_C::PostFX_Settings' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, ForceFeedbackNear) == 0x0008B0, "Member 'AB_Post_Explosion_Generic_C::ForceFeedbackNear' has a wrong offset!");
static_assert(offsetof(AB_Post_Explosion_Generic_C, ForceFeedbackFar) == 0x0008B8, "Member 'AB_Post_Explosion_Generic_C::ForceFeedbackFar' has a wrong offset!");

}

