#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Bullet_Sniper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Bullet_Sniper.B_Prj_Bullet_Sniper_C
// 0x0020 (0x08A0 - 0x0880)
class AB_Prj_Bullet_Sniper_C final : public AFortProjectileAthena
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0880(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_SR_Ribbon_SmokeTrail;                            // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBulletWhipTrackerComponent_C*          BulletWhipTrackerComponent;                        // 0x0890(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Trail;                                           // 0x0898(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Prj_Bullet_Sniper(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void OnTouched(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FHitResult& HitResult, bool bIsOverlap);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Bullet_Sniper_C">();
	}
	static class AB_Prj_Bullet_Sniper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Bullet_Sniper_C>();
	}
};
static_assert(alignof(AB_Prj_Bullet_Sniper_C) == 0x000008, "Wrong alignment on AB_Prj_Bullet_Sniper_C");
static_assert(sizeof(AB_Prj_Bullet_Sniper_C) == 0x0008A0, "Wrong size on AB_Prj_Bullet_Sniper_C");
static_assert(offsetof(AB_Prj_Bullet_Sniper_C, UberGraphFrame) == 0x000880, "Member 'AB_Prj_Bullet_Sniper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Sniper_C, P_SR_Ribbon_SmokeTrail) == 0x000888, "Member 'AB_Prj_Bullet_Sniper_C::P_SR_Ribbon_SmokeTrail' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Sniper_C, BulletWhipTrackerComponent) == 0x000890, "Member 'AB_Prj_Bullet_Sniper_C::BulletWhipTrackerComponent' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Sniper_C, P_Trail) == 0x000898, "Member 'AB_Prj_Bullet_Sniper_C::P_Trail' has a wrong offset!");

}

