#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Ranged_Generic

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Ranged_Generic.B_Ranged_Generic_C.ExecuteUbergraph_B_Ranged_Generic
// 0x1010 (0x1010 - 0x0000)
struct B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPI_ReturnValue;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPersistentFire;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSecondaryFire;                       // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortReloadFXState                            K2Node_Event_ReloadStage;                          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MathExpression_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_MathExpression_ReturnValue2;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewIsTargeting;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class AFortAIPawn*>                    CallFunc_GetAllActorsOfClass_OutActors;            // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          K2Node_CustomEvent_Enable_Or_Disable;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_StencilBufferValue;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue2;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAlterationItemDefinition*          K2Node_Event_NewAlteration;                        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortCosmeticModification              K2Node_Event_CosmeticMod;                          // 0x0070(0x0B20)()
	class UMaterialInstanceDynamic*               K2Node_Event_DynamicMaterialInstance;              // 0x0B90(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAssetNull_ReturnValue;                  // 0x0B98(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAssetNull_ReturnValue2;                 // 0x0B99(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0B9A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAssetNull_ReturnValue3;                 // 0x0B9B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAssetNull_ReturnValue4;                 // 0x0B9C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9D[0x3];                                      // 0x0B9D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeToNextFire_ReturnValue;            // 0x0BA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLocalMagazineAmmoCount_ReturnValue;    // 0x0BA4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0BA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0BAC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0BB0(0x0008)(NoDestructor)
	class UObject*                                Temp_object_Variable;                              // 0x0BB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseScopeTargeting_ReturnValue;            // 0x0BC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BC1[0x7];                                      // 0x0BC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System;              // 0x0BC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0BD0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD1[0x3];                                      // 0x0BD1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0BD4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0BD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0BDC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0BE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0BF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSmallPreviewImage_ReturnValue;         // 0x0BF8(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0C20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable2;                             // 0x0C28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0C30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0C38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C39[0x7];                                      // 0x0C39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System2;             // 0x0C40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0C48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C49[0x7];                                      // 0x0C49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0C50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0C58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0C60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Enable2;                        // 0x0C61(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C62[0x2];                                      // 0x0C62(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_TargetLimit2;                   // 0x0C64(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0C68(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6C[0x4];                                      // 0x0C6C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0C70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0C78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded2;                        // 0x0C80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x0C88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C89[0x3];                                      // 0x0C89(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_TargetLimit;                    // 0x0C8C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable3;                             // 0x0C90(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue2;                   // 0x0C98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9C[0x4];                                      // 0x0C9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System3;             // 0x0CA0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0CA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingFirstPersonCamera_ReturnValue;     // 0x0CA9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingScopeOrFirstPersonCamera_ReturnValue; // 0x0CAA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0CAB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CAC[0x4];                                      // 0x0CAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x0CB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetInstigatorController_ReturnValue2;     // 0x0CB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerZone*              K2Node_DynamicCast_AsFort_Player_Controller_Zone;  // 0x0CC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0CC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CC9[0x7];                                      // 0x0CC9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerZone*              K2Node_DynamicCast_AsFort_Player_Controller_Zone2; // 0x0CD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x0CD8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD9[0x7];                                      // 0x0CD9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWindManager*                       CallFunc_GetWindManager_ReturnValue;               // 0x0CE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0CE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CE9[0x7];                                      // 0x0CE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue2;               // 0x0CF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn2;                   // 0x0CF8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x0D00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D01[0x7];                                      // 0x0D01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalViewingPlayerController_ReturnValue; // 0x0D08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0D10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UseScopeTargeting_ReturnValue2;           // 0x0D11(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D12[0x6];                                      // 0x0D12(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue3;               // 0x0D18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0D20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D21[0x7];                                      // 0x0D21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn3;                   // 0x0D28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x0D30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D31[0x7];                                      // 0x0D31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalViewingPlayerController_ReturnValue2; // 0x0D38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0D40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D41[0x7];                                      // 0x0D41(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue4;               // 0x0D48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue5;               // 0x0D50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn4;                   // 0x0D58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess10;                     // 0x0D60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D61[0x7];                                      // 0x0D61(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn5;                   // 0x0D68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess11;                     // 0x0D70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D71[0x7];                                      // 0x0D71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalViewingPlayerController_ReturnValue3; // 0x0D78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0D80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0D81(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D82[0x2];                                      // 0x0D82(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue2;           // 0x0D84(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue3;           // 0x0D90(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0D9C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue2;    // 0x0DAC(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseScopeTargeting_ReturnValue3;           // 0x0DBC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DBD[0x3];                                      // 0x0DBD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate2;             // 0x0DC0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x0DD0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD1[0x7];                                      // 0x0DD1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded3;                        // 0x0DD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable4;                             // 0x0DE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System4;             // 0x0DE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess12;                     // 0x0DF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0DF1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DF2[0x6];                                      // 0x0DF2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded4;                        // 0x0DF8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate3;             // 0x0E00(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate4;             // 0x0E10(0x0010)(ZeroConstructor, NoDestructor)
	class AFortAIPawn*                            CallFunc_Array_Get_Item;                           // 0x0E20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0E28(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0E29(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2A[0x2];                                      // 0x0E2A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0E2C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0E30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E31[0x3];                                      // 0x0E31(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0E34(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E38[0x8];                                      // 0x0E38(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0E40(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue2;          // 0x0E70(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0EA0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0EAC(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0EB8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location2;                 // 0x0EC4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation2;                 // 0x0ED0(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale2;                    // 0x0EDC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0EE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0EEC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0EF0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X2;                           // 0x0EF4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y2;                           // 0x0EF8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z2;                           // 0x0EFC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0F00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue4;           // 0x0F04(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0F10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue5;           // 0x0F14(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x0F20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0F24(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue2;        // 0x0F30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0F38(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_F44[0x4];                                      // 0x0F44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0F48(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0FC8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSocketExist_ReturnValue;              // 0x0FCC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FCD[0x3];                                      // 0x0FCD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x0FD0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x0FD4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue3;           // 0x0FD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0FDC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue4;           // 0x0FE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue5;           // 0x0FEC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0FF0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue3;                  // 0x0FFC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSocketExist_ReturnValue2;             // 0x1008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x1009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic) == 0x000010, "Wrong alignment on B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic");
static_assert(sizeof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic) == 0x001010, "Wrong size on B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, EntryPoint) == 0x000000, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_GetPI_ReturnValue) == 0x000004, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_GetPI_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000008, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_IsDedicatedServer_ReturnValue) == 0x000010, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_Event_bPersistentFire) == 0x000012, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_Event_bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_Event_bSecondaryFire) == 0x000013, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_Event_bSecondaryFire' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_Event_ReloadStage) == 0x000014, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_Event_ReloadStage' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000018, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_MathExpression_ReturnValue) == 0x00001C, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_MathExpression_ReturnValue2) == 0x000020, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_MathExpression_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, Temp_int_Array_Index_Variable) == 0x000024, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_Event_bNewIsTargeting) == 0x000028, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_Event_bNewIsTargeting' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_GetAllActorsOfClass_OutActors) == 0x000040, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_CustomEvent_Enable_Or_Disable) == 0x000050, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_CustomEvent_Enable_Or_Disable' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_CustomEvent_StencilBufferValue) == 0x000054, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_CustomEvent_StencilBufferValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000058, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_SpawnSoundAttached_ReturnValue2) == 0x000060, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_SpawnSoundAttached_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_Event_NewAlteration) == 0x000068, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_Event_NewAlteration' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_Event_CosmeticMod) == 0x000070, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_Event_CosmeticMod' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_Event_DynamicMaterialInstance) == 0x000B90, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_Event_DynamicMaterialInstance' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_IsAssetNull_ReturnValue) == 0x000B98, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_IsAssetNull_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_IsAssetNull_ReturnValue2) == 0x000B99, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_IsAssetNull_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_Not_PreBool_ReturnValue) == 0x000B9A, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_IsAssetNull_ReturnValue3) == 0x000B9B, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_IsAssetNull_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_IsAssetNull_ReturnValue4) == 0x000B9C, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_IsAssetNull_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_GetTimeToNextFire_ReturnValue) == 0x000BA0, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_GetTimeToNextFire_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_GetLocalMagazineAmmoCount_ReturnValue) == 0x000BA4, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_GetLocalMagazineAmmoCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000BA8, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000BAC, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_K2_SetTimer_ReturnValue) == 0x000BB0, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, Temp_object_Variable) == 0x000BB8, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_UseScopeTargeting_ReturnValue) == 0x000BC0, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_UseScopeTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_DynamicCast_AsParticle_System) == 0x000BC8, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_DynamicCast_AsParticle_System' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_DynamicCast_bSuccess) == 0x000BD0, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, Temp_int_Loop_Counter_Variable) == 0x000BD4, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_Add_IntInt_ReturnValue) == 0x000BD8, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_GetSocketLocation_ReturnValue) == 0x000BDC, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000BE8, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_CustomEvent_Loaded) == 0x000BF0, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_GetSmallPreviewImage_ReturnValue) == 0x000BF8, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_GetSmallPreviewImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000C20, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, Temp_object_Variable2) == 0x000C28, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_DynamicCast_AsTexture_2D) == 0x000C30, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_DynamicCast_bSuccess2) == 0x000C38, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_DynamicCast_AsParticle_System2) == 0x000C40, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_DynamicCast_AsParticle_System2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_DynamicCast_bSuccess3) == 0x000C48, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_GetInstigator_ReturnValue) == 0x000C50, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_DynamicCast_AsFort_Pawn) == 0x000C58, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_DynamicCast_bSuccess4) == 0x000C60, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_CustomEvent_Enable2) == 0x000C61, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_CustomEvent_Enable2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_CustomEvent_TargetLimit2) == 0x000C64, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_CustomEvent_TargetLimit2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_SelectInt_ReturnValue) == 0x000C68, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000C70, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000C78, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_CustomEvent_Loaded2) == 0x000C80, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_CustomEvent_Loaded2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_CustomEvent_Enable) == 0x000C88, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_CustomEvent_TargetLimit) == 0x000C8C, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_CustomEvent_TargetLimit' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, Temp_object_Variable3) == 0x000C90, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_SelectInt_ReturnValue2) == 0x000C98, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_SelectInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_DynamicCast_AsParticle_System3) == 0x000CA0, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_DynamicCast_AsParticle_System3' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_DynamicCast_bSuccess5) == 0x000CA8, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_IsUsingFirstPersonCamera_ReturnValue) == 0x000CA9, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_IsUsingFirstPersonCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_IsUsingScopeOrFirstPersonCamera_ReturnValue) == 0x000CAA, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_IsUsingScopeOrFirstPersonCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_Not_PreBool_ReturnValue2) == 0x000CAB, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_GetInstigatorController_ReturnValue) == 0x000CB0, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_GetInstigatorController_ReturnValue2) == 0x000CB8, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_GetInstigatorController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_DynamicCast_AsFort_Player_Controller_Zone) == 0x000CC0, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_DynamicCast_AsFort_Player_Controller_Zone' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_DynamicCast_bSuccess6) == 0x000CC8, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_DynamicCast_AsFort_Player_Controller_Zone2) == 0x000CD0, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_DynamicCast_AsFort_Player_Controller_Zone2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_DynamicCast_bSuccess7) == 0x000CD8, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_GetWindManager_ReturnValue) == 0x000CE0, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_GetWindManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, Temp_bool_Has_Been_Initd_Variable) == 0x000CE8, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_GetInstigator_ReturnValue2) == 0x000CF0, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_GetInstigator_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_DynamicCast_AsFort_Pawn2) == 0x000CF8, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_DynamicCast_AsFort_Pawn2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_DynamicCast_bSuccess8) == 0x000D00, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_DynamicCast_bSuccess8' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_GetLocalViewingPlayerController_ReturnValue) == 0x000D08, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_GetLocalViewingPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_IsValid_ReturnValue2) == 0x000D10, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_UseScopeTargeting_ReturnValue2) == 0x000D11, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_UseScopeTargeting_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_GetInstigator_ReturnValue3) == 0x000D18, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_GetInstigator_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, Temp_bool_IsClosed_Variable) == 0x000D20, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_DynamicCast_AsFort_Pawn3) == 0x000D28, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_DynamicCast_AsFort_Pawn3' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_DynamicCast_bSuccess9) == 0x000D30, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_DynamicCast_bSuccess9' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_GetLocalViewingPlayerController_ReturnValue2) == 0x000D38, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_GetLocalViewingPlayerController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_IsValid_ReturnValue3) == 0x000D40, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_GetInstigator_ReturnValue4) == 0x000D48, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_GetInstigator_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_GetInstigator_ReturnValue5) == 0x000D50, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_GetInstigator_ReturnValue5' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_DynamicCast_AsFort_Pawn4) == 0x000D58, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_DynamicCast_AsFort_Pawn4' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_DynamicCast_bSuccess10) == 0x000D60, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_DynamicCast_bSuccess10' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_DynamicCast_AsFort_Pawn5) == 0x000D68, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_DynamicCast_AsFort_Pawn5' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_DynamicCast_bSuccess11) == 0x000D70, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_DynamicCast_bSuccess11' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_GetLocalViewingPlayerController_ReturnValue3) == 0x000D78, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_GetLocalViewingPlayerController_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_IsValid_ReturnValue4) == 0x000D80, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_IsValid_ReturnValue5) == 0x000D81, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_GetSocketLocation_ReturnValue2) == 0x000D84, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_GetSocketLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_GetSocketLocation_ReturnValue3) == 0x000D90, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_GetSocketLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000D9C, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_Conv_VectorToLinearColor_ReturnValue2) == 0x000DAC, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_Conv_VectorToLinearColor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_UseScopeTargeting_ReturnValue3) == 0x000DBC, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_UseScopeTargeting_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_CreateDelegate_OutputDelegate2) == 0x000DC0, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_IsDedicatedServer_ReturnValue2) == 0x000DD0, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_CustomEvent_Loaded3) == 0x000DD8, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_CustomEvent_Loaded3' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, Temp_object_Variable4) == 0x000DE0, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_DynamicCast_AsParticle_System4) == 0x000DE8, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_DynamicCast_AsParticle_System4' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_DynamicCast_bSuccess12) == 0x000DF0, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_DynamicCast_bSuccess12' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, CallFunc_BooleanAND_ReturnValue) == 0x000DF1, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_CustomEvent_Loaded4) == 0x000DF8, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_CustomEvent_Loaded4' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_CreateDelegate_OutputDelegate3) == 0x000E00, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic, K2Node_CreateDelegate_OutputDelegate4) == 0x000E10, "Member 'B_Ranged_Generic_C_ExecuteUbergraph_B_Ranged_Generic::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
