#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Rift_Portals

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Rift_Portals.B_Rift_Portals_C.ExecuteUbergraph_B_Rift_Portals
// 0x02D8 (0x02D8 - 0x0000)
struct B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue2;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0014(0x000C)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_RandomFloatInRange_ReturnValue3;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0024(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue2;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        CallFunc_SpawnDecalAtLocation_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddWorldRotation_SweepHitResult;       // 0x0058(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x00E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0108(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0120(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0140(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue2;                        // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue2;        // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue3;        // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue4;          // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Delay;                          // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_RiftLightningDuration;          // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SpawnImpactParticles;           // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACar_Copper_C*                          K2Node_DynamicCast_AsCar_Copper;                   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue3;           // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue4;        // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue4;           // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x01B4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x01C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x01D0(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0250(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue5;        // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue6;        // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0275(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x0276(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_277[0x1];                                      // 0x0277(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0278(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28D[0x3];                                      // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue3;                        // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACar_Copper_C*                          CallFunc_Array_Get_Item2;                          // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVisualEffectQuality_ReturnValue;       // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWindManager*                       CallFunc_GetWindManager_ReturnValue;               // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWindManager_C*                         K2Node_DynamicCast_AsWind_Manager;                 // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals) == 0x000008, "Wrong alignment on B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals");
static_assert(sizeof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals) == 0x0002D8, "Wrong size on B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, EntryPoint) == 0x000000, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, K2Node_Event_EndPlayReason) == 0x000008, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x00000C, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_RandomFloatInRange_ReturnValue2) == 0x000010, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_RandomFloatInRange_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_MakeRotator_ReturnValue) == 0x000014, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_RandomFloatInRange_ReturnValue3) == 0x000020, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_RandomFloatInRange_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_MakeVector_ReturnValue) == 0x000024, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000040, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_SpawnEmitterAtLocation_ReturnValue2) == 0x000048, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_SpawnEmitterAtLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_SpawnDecalAtLocation_ReturnValue) == 0x000050, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_SpawnDecalAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_K2_AddWorldRotation_SweepHitResult) == 0x000058, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_K2_AddWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000D8, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x0000E0, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, K2Node_MakeArray_Array) == 0x0000F0, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_Array_Length_ReturnValue) == 0x000100, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, Temp_object_Variable) == 0x000108, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_Array_Length_ReturnValue2) == 0x000118, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_SphereOverlapActors_OutActors) == 0x000120, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_SphereOverlapActors_ReturnValue) == 0x000130, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, Temp_int_Loop_Counter_Variable) == 0x000134, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_Less_IntInt_ReturnValue) == 0x000138, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_Add_IntInt_ReturnValue) == 0x00013C, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_LinearColorLerp_ReturnValue) == 0x000140, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_Lerp_ReturnValue) == 0x000150, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_Lerp_ReturnValue2) == 0x000154, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_Lerp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_GetGameTimeInSeconds_ReturnValue2) == 0x000158, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_GetGameTimeInSeconds_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_GetGameTimeInSeconds_ReturnValue3) == 0x00015C, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_GetGameTimeInSeconds_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_RandomFloatInRange_ReturnValue4) == 0x000160, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_RandomFloatInRange_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000164, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x000168, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, K2Node_CustomEvent_Delay) == 0x00016C, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::K2Node_CustomEvent_Delay' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, K2Node_CustomEvent_RiftLightningDuration) == 0x000170, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::K2Node_CustomEvent_RiftLightningDuration' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, K2Node_CustomEvent_SpawnImpactParticles) == 0x000174, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::K2Node_CustomEvent_SpawnImpactParticles' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, Temp_int_Array_Index_Variable) == 0x000178, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_Array_Get_Item) == 0x000180, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, K2Node_DynamicCast_AsCar_Copper) == 0x000188, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::K2Node_DynamicCast_AsCar_Copper' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, K2Node_DynamicCast_bSuccess) == 0x000190, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_Array_Add_ReturnValue) == 0x000194, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, Temp_float_Variable) == 0x000198, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_Divide_FloatFloat_ReturnValue3) == 0x00019C, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_Divide_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_GetGameTimeInSeconds_ReturnValue4) == 0x0001A0, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_GetGameTimeInSeconds_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001A4, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0001A8, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0001AC, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_Divide_FloatFloat_ReturnValue4) == 0x0001B0, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_Divide_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_MakeVector_ReturnValue2) == 0x0001B4, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0001C0, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0001D0, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_Add_VectorVector_ReturnValue) == 0x000250, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, Temp_bool_Has_Been_Initd_Variable) == 0x00025C, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_GetGameTimeInSeconds_ReturnValue5) == 0x000260, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_GetGameTimeInSeconds_ReturnValue5' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_GetGameTimeInSeconds_ReturnValue6) == 0x000264, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_GetGameTimeInSeconds_ReturnValue6' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, Temp_bool_Variable) == 0x000268, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, K2Node_Select_Default) == 0x00026C, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_Add_FloatFloat_ReturnValue2) == 0x000270, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, Temp_bool_IsClosed_Variable) == 0x000274, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_IsDedicatedServer_ReturnValue) == 0x000275, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_IsDedicatedServer_ReturnValue2) == 0x000276, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000278, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, Temp_int_Loop_Counter_Variable2) == 0x000288, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_Less_IntInt_ReturnValue2) == 0x00028C, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_Add_IntInt_ReturnValue2) == 0x000290, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, Temp_int_Array_Index_Variable2) == 0x000294, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_Lerp_ReturnValue3) == 0x000298, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_Lerp_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_Array_Get_Item2) == 0x0002A0, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_IsValid_ReturnValue) == 0x0002A8, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_GetGameUserSettings_ReturnValue) == 0x0002B0, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_GetVisualEffectQuality_ReturnValue) == 0x0002B8, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_GetVisualEffectQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, K2Node_SwitchInteger_CmpSuccess) == 0x0002BC, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, CallFunc_GetWindManager_ReturnValue) == 0x0002C0, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::CallFunc_GetWindManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, K2Node_DynamicCast_AsWind_Manager) == 0x0002C8, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::K2Node_DynamicCast_AsWind_Manager' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals, K2Node_DynamicCast_bSuccess2) == 0x0002D0, "Member 'B_Rift_Portals_C_ExecuteUbergraph_B_Rift_Portals::K2Node_DynamicCast_bSuccess2' has a wrong offset!");

// Function B_Rift_Portals.B_Rift_Portals_C.PatrolEnemySuckIn
// 0x000C (0x000C - 0x0000)
struct B_Rift_Portals_C_PatrolEnemySuckIn final
{
public:
	float                                         Delay;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Param_RiftLightningDuration;                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_SpawnImpactParticles;                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Rift_Portals_C_PatrolEnemySuckIn) == 0x000004, "Wrong alignment on B_Rift_Portals_C_PatrolEnemySuckIn");
static_assert(sizeof(B_Rift_Portals_C_PatrolEnemySuckIn) == 0x00000C, "Wrong size on B_Rift_Portals_C_PatrolEnemySuckIn");
static_assert(offsetof(B_Rift_Portals_C_PatrolEnemySuckIn, Delay) == 0x000000, "Member 'B_Rift_Portals_C_PatrolEnemySuckIn::Delay' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_PatrolEnemySuckIn, Param_RiftLightningDuration) == 0x000004, "Member 'B_Rift_Portals_C_PatrolEnemySuckIn::Param_RiftLightningDuration' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_PatrolEnemySuckIn, Param_SpawnImpactParticles) == 0x000008, "Member 'B_Rift_Portals_C_PatrolEnemySuckIn::Param_SpawnImpactParticles' has a wrong offset!");

// Function B_Rift_Portals.B_Rift_Portals_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct B_Rift_Portals_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Rift_Portals_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on B_Rift_Portals_C_ReceiveEndPlay");
static_assert(sizeof(B_Rift_Portals_C_ReceiveEndPlay) == 0x000001, "Wrong size on B_Rift_Portals_C_ReceiveEndPlay");
static_assert(offsetof(B_Rift_Portals_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'B_Rift_Portals_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function B_Rift_Portals.B_Rift_Portals_C.UserConstructionScript
// 0x0138 (0x0138 - 0x0000)
struct B_Rift_Portals_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVisualEffectQuality_ReturnValue;       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue2; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X2;                           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y2;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z2;                           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue2;          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue3;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0054(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X2;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y2;                         // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X3;                           // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y3;                           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z3;                           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue4;          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0078(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue5;          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0088(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X3;                         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y3;                         // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0098(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue6;          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X4;                         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y4;                         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X5;                         // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y5;                         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00BC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue7;          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x00CC(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue8;          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue2;                // 0x00E0(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X6;                         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y6;                         // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X4;                           // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y4;                           // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z4;                           // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue9;          // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue3; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue10;         // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue4; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLightColor_ReturnValue;                // 0x0128(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Rift_Portals_C_UserConstructionScript) == 0x000008, "Wrong alignment on B_Rift_Portals_C_UserConstructionScript");
static_assert(sizeof(B_Rift_Portals_C_UserConstructionScript) == 0x000138, "Wrong size on B_Rift_Portals_C_UserConstructionScript");
static_assert(offsetof(B_Rift_Portals_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'B_Rift_Portals_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rift_Portals_C_UserConstructionScript, CallFunc_GetGameUserSettings_ReturnValue) == 0x000008, "Member 'B_Rift_Portals_C_UserConstructionScript::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
