#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BadgesEarnedPanelContent

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BadgesEarnedPanelContent.BadgesEarnedPanelContent_C.ExecuteUbergraph_BadgesEarnedPanelContent
// 0x0048 (0x0048 - 0x0000)
struct BadgesEarnedPanelContent_C_ExecuteUbergraph_BadgesEarnedPanelContent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BadgesEarnedPanelContent_C_ExecuteUbergraph_BadgesEarnedPanelContent) == 0x000008, "Wrong alignment on BadgesEarnedPanelContent_C_ExecuteUbergraph_BadgesEarnedPanelContent");
static_assert(sizeof(BadgesEarnedPanelContent_C_ExecuteUbergraph_BadgesEarnedPanelContent) == 0x000048, "Wrong size on BadgesEarnedPanelContent_C_ExecuteUbergraph_BadgesEarnedPanelContent");
static_assert(offsetof(BadgesEarnedPanelContent_C_ExecuteUbergraph_BadgesEarnedPanelContent, EntryPoint) == 0x000000, "Member 'BadgesEarnedPanelContent_C_ExecuteUbergraph_BadgesEarnedPanelContent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_ExecuteUbergraph_BadgesEarnedPanelContent, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BadgesEarnedPanelContent_C_ExecuteUbergraph_BadgesEarnedPanelContent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_ExecuteUbergraph_BadgesEarnedPanelContent, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'BadgesEarnedPanelContent_C_ExecuteUbergraph_BadgesEarnedPanelContent::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_ExecuteUbergraph_BadgesEarnedPanelContent, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BadgesEarnedPanelContent_C_ExecuteUbergraph_BadgesEarnedPanelContent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_ExecuteUbergraph_BadgesEarnedPanelContent, K2Node_CreateDelegate_OutputDelegate2) == 0x000028, "Member 'BadgesEarnedPanelContent_C_ExecuteUbergraph_BadgesEarnedPanelContent::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_ExecuteUbergraph_BadgesEarnedPanelContent, K2Node_CreateDelegate_OutputDelegate3) == 0x000038, "Member 'BadgesEarnedPanelContent_C_ExecuteUbergraph_BadgesEarnedPanelContent::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");

// Function BadgesEarnedPanelContent.BadgesEarnedPanelContent_C.UpdateBadgeWidgets
// 0x00B0 (0x00B0 - 0x0000)
struct BadgesEarnedPanelContent_C_UpdateBadgeWidgets final
{
public:
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FEarnedBadgeEntry>              CallFunc_GetEarnedBadges_ReturnValue;              // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEarnedBadgeEntry                      CallFunc_Array_Get_Item;                           // 0x0020(0x0030)()
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Get_Badge_And_Count_For_Player_Found;     // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_Get_Badge_And_Count_For_Player_FortPC;    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortBadgeItemDefinition*               CallFunc_Get_Badge_And_Count_For_Player_Badge;     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Get_Badge_And_Count_For_Player_Count;     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UEarnedBadgeTile_C*                     CallFunc_Create_ReturnValue;                       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BadgesEarnedPanelContent_C_UpdateBadgeWidgets) == 0x000008, "Wrong alignment on BadgesEarnedPanelContent_C_UpdateBadgeWidgets");
static_assert(sizeof(BadgesEarnedPanelContent_C_UpdateBadgeWidgets) == 0x0000B0, "Wrong size on BadgesEarnedPanelContent_C_UpdateBadgeWidgets");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdateBadgeWidgets, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'BadgesEarnedPanelContent_C_UpdateBadgeWidgets::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdateBadgeWidgets, CallFunc_GetEarnedBadges_ReturnValue) == 0x000008, "Member 'BadgesEarnedPanelContent_C_UpdateBadgeWidgets::CallFunc_GetEarnedBadges_ReturnValue' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdateBadgeWidgets, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BadgesEarnedPanelContent_C_UpdateBadgeWidgets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdateBadgeWidgets, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BadgesEarnedPanelContent_C_UpdateBadgeWidgets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdateBadgeWidgets, CallFunc_Array_Get_Item) == 0x000020, "Member 'BadgesEarnedPanelContent_C_UpdateBadgeWidgets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdateBadgeWidgets, CallFunc_Array_Length_ReturnValue2) == 0x000050, "Member 'BadgesEarnedPanelContent_C_UpdateBadgeWidgets::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdateBadgeWidgets, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'BadgesEarnedPanelContent_C_UpdateBadgeWidgets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdateBadgeWidgets, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000058, "Member 'BadgesEarnedPanelContent_C_UpdateBadgeWidgets::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdateBadgeWidgets, CallFunc_Less_IntInt_ReturnValue) == 0x000059, "Member 'BadgesEarnedPanelContent_C_UpdateBadgeWidgets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdateBadgeWidgets, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'BadgesEarnedPanelContent_C_UpdateBadgeWidgets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdateBadgeWidgets, Temp_byte_Variable) == 0x000060, "Member 'BadgesEarnedPanelContent_C_UpdateBadgeWidgets::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdateBadgeWidgets, Temp_byte_Variable2) == 0x000061, "Member 'BadgesEarnedPanelContent_C_UpdateBadgeWidgets::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdateBadgeWidgets, CallFunc_GetOwningPlayer_ReturnValue) == 0x000068, "Member 'BadgesEarnedPanelContent_C_UpdateBadgeWidgets::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdateBadgeWidgets, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000070, "Member 'BadgesEarnedPanelContent_C_UpdateBadgeWidgets::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdateBadgeWidgets, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BadgesEarnedPanelContent_C_UpdateBadgeWidgets::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdateBadgeWidgets, CallFunc_Get_Badge_And_Count_For_Player_Found) == 0x000079, "Member 'BadgesEarnedPanelContent_C_UpdateBadgeWidgets::CallFunc_Get_Badge_And_Count_For_Player_Found' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdateBadgeWidgets, CallFunc_Get_Badge_And_Count_For_Player_FortPC) == 0x000080, "Member 'BadgesEarnedPanelContent_C_UpdateBadgeWidgets::CallFunc_Get_Badge_And_Count_For_Player_FortPC' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdateBadgeWidgets, CallFunc_Get_Badge_And_Count_For_Player_Badge) == 0x000088, "Member 'BadgesEarnedPanelContent_C_UpdateBadgeWidgets::CallFunc_Get_Badge_And_Count_For_Player_Badge' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdateBadgeWidgets, CallFunc_Get_Badge_And_Count_For_Player_Count) == 0x000090, "Member 'BadgesEarnedPanelContent_C_UpdateBadgeWidgets::CallFunc_Get_Badge_And_Count_For_Player_Count' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdateBadgeWidgets, Temp_bool_Variable) == 0x000094, "Member 'BadgesEarnedPanelContent_C_UpdateBadgeWidgets::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdateBadgeWidgets, CallFunc_Create_ReturnValue) == 0x000098, "Member 'BadgesEarnedPanelContent_C_UpdateBadgeWidgets::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdateBadgeWidgets, K2Node_Select_Default) == 0x0000A0, "Member 'BadgesEarnedPanelContent_C_UpdateBadgeWidgets::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdateBadgeWidgets, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x0000A8, "Member 'BadgesEarnedPanelContent_C_UpdateBadgeWidgets::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function BadgesEarnedPanelContent.BadgesEarnedPanelContent_C.UpdatePotentialBadges
// 0x0070 (0x0070 - 0x0000)
struct BadgesEarnedPanelContent_C_UpdatePotentialBadges final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortBadgeCount>                CallFunc_GetPotentialBadges_ReturnValue;           // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortBadgeCount                        CallFunc_Array_Get_Item;                           // 0x0030(0x0020)(NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEarnedBadgeTile_C*                     CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BadgesEarnedPanelContent_C_UpdatePotentialBadges) == 0x000008, "Wrong alignment on BadgesEarnedPanelContent_C_UpdatePotentialBadges");
static_assert(sizeof(BadgesEarnedPanelContent_C_UpdatePotentialBadges) == 0x000070, "Wrong size on BadgesEarnedPanelContent_C_UpdatePotentialBadges");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdatePotentialBadges, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BadgesEarnedPanelContent_C_UpdatePotentialBadges::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdatePotentialBadges, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'BadgesEarnedPanelContent_C_UpdatePotentialBadges::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdatePotentialBadges, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BadgesEarnedPanelContent_C_UpdatePotentialBadges::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdatePotentialBadges, CallFunc_GetPotentialBadges_ReturnValue) == 0x000018, "Member 'BadgesEarnedPanelContent_C_UpdatePotentialBadges::CallFunc_GetPotentialBadges_ReturnValue' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdatePotentialBadges, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BadgesEarnedPanelContent_C_UpdatePotentialBadges::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdatePotentialBadges, CallFunc_Array_Get_Item) == 0x000030, "Member 'BadgesEarnedPanelContent_C_UpdatePotentialBadges::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdatePotentialBadges, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'BadgesEarnedPanelContent_C_UpdatePotentialBadges::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdatePotentialBadges, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'BadgesEarnedPanelContent_C_UpdatePotentialBadges::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdatePotentialBadges, CallFunc_Create_ReturnValue) == 0x000058, "Member 'BadgesEarnedPanelContent_C_UpdatePotentialBadges::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdatePotentialBadges, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'BadgesEarnedPanelContent_C_UpdatePotentialBadges::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_UpdatePotentialBadges, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000068, "Member 'BadgesEarnedPanelContent_C_UpdatePotentialBadges::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function BadgesEarnedPanelContent.BadgesEarnedPanelContent_C.Get Badge And Count For Player
// 0x00D8 (0x00D8 - 0x0000)
struct BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player final
{
public:
	class AFortPlayerController*                  InFortPC;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEarnedBadgeEntry                      EarnedBadgeEntry;                                  // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          Found;                                             // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  FortPC;                                            // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortBadgeItemDefinition*               Badge;                                             // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0050(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OutCount;                                          // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutFound;                                          // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEarnedBadgePlayerData                 CallFunc_Array_Get_Item;                           // 0x0070(0x0030)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetGameAccountId_ReturnValue;             // 0x00A8(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_AreUniqueIDsIdentical_ReturnValue;        // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player) == 0x000008, "Wrong alignment on BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player");
static_assert(sizeof(BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player) == 0x0000D8, "Wrong size on BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player");
static_assert(offsetof(BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player, InFortPC) == 0x000000, "Member 'BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player::InFortPC' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player, EarnedBadgeEntry) == 0x000008, "Member 'BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player::EarnedBadgeEntry' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player, Found) == 0x000038, "Member 'BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player::Found' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player, FortPC) == 0x000040, "Member 'BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player::FortPC' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player, Badge) == 0x000048, "Member 'BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player::Badge' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player, Count) == 0x000050, "Member 'BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player::Count' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player, OutCount) == 0x000054, "Member 'BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player::OutCount' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player, OutFound) == 0x000058, "Member 'BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player::OutFound' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player, Temp_bool_True_if_break_was_hit_Variable) == 0x000059, "Member 'BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player, CallFunc_Array_Length_ReturnValue) == 0x00005C, "Member 'BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player, CallFunc_Not_PreBool_ReturnValue) == 0x000060, "Member 'BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player, Temp_int_Array_Index_Variable) == 0x000064, "Member 'BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player, CallFunc_Array_Get_Item) == 0x000070, "Member 'BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player, CallFunc_BooleanAND_ReturnValue) == 0x0000A1, "Member 'BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player, CallFunc_Add_IntInt_ReturnValue) == 0x0000A4, "Member 'BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player, CallFunc_GetGameAccountId_ReturnValue) == 0x0000A8, "Member 'BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player::CallFunc_GetGameAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player, CallFunc_AreUniqueIDsIdentical_ReturnValue) == 0x0000D0, "Member 'BadgesEarnedPanelContent_C_Get_Badge_And_Count_For_Player::CallFunc_AreUniqueIDsIdentical_ReturnValue' has a wrong offset!");

}

