#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BasicGradientFill

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BasicGradientFill.BasicGradientFill_C.ExecuteUbergraph_BasicGradientFill
// 0x0008 (0x0008 - 0x0000)
struct BasicGradientFill_C_ExecuteUbergraph_BasicGradientFill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BasicGradientFill_C_ExecuteUbergraph_BasicGradientFill) == 0x000004, "Wrong alignment on BasicGradientFill_C_ExecuteUbergraph_BasicGradientFill");
static_assert(sizeof(BasicGradientFill_C_ExecuteUbergraph_BasicGradientFill) == 0x000008, "Wrong size on BasicGradientFill_C_ExecuteUbergraph_BasicGradientFill");
static_assert(offsetof(BasicGradientFill_C_ExecuteUbergraph_BasicGradientFill, EntryPoint) == 0x000000, "Member 'BasicGradientFill_C_ExecuteUbergraph_BasicGradientFill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BasicGradientFill_C_ExecuteUbergraph_BasicGradientFill, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BasicGradientFill_C_ExecuteUbergraph_BasicGradientFill::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function BasicGradientFill.BasicGradientFill_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BasicGradientFill_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BasicGradientFill_C_PreConstruct) == 0x000001, "Wrong alignment on BasicGradientFill_C_PreConstruct");
static_assert(sizeof(BasicGradientFill_C_PreConstruct) == 0x000001, "Wrong size on BasicGradientFill_C_PreConstruct");
static_assert(offsetof(BasicGradientFill_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BasicGradientFill_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BasicGradientFill.BasicGradientFill_C.Set Fill
// 0x0038 (0x0038 - 0x0000)
struct BasicGradientFill_C_Set_Fill final
{
public:
	struct FLinearColor                           Param_Color_1;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Param_Color_2;                                     // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rotation__0_Minus_1_;                              // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BasicGradientFill_C_Set_Fill) == 0x000008, "Wrong alignment on BasicGradientFill_C_Set_Fill");
static_assert(sizeof(BasicGradientFill_C_Set_Fill) == 0x000038, "Wrong size on BasicGradientFill_C_Set_Fill");
static_assert(offsetof(BasicGradientFill_C_Set_Fill, Param_Color_1) == 0x000000, "Member 'BasicGradientFill_C_Set_Fill::Param_Color_1' has a wrong offset!");
static_assert(offsetof(BasicGradientFill_C_Set_Fill, Param_Color_2) == 0x000010, "Member 'BasicGradientFill_C_Set_Fill::Param_Color_2' has a wrong offset!");
static_assert(offsetof(BasicGradientFill_C_Set_Fill, Rotation__0_Minus_1_) == 0x000020, "Member 'BasicGradientFill_C_Set_Fill::Rotation__0_Minus_1_' has a wrong offset!");
static_assert(offsetof(BasicGradientFill_C_Set_Fill, CallFunc_FClamp_ReturnValue) == 0x000024, "Member 'BasicGradientFill_C_Set_Fill::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasicGradientFill_C_Set_Fill, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000028, "Member 'BasicGradientFill_C_Set_Fill::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BasicGradientFill_C_Set_Fill, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BasicGradientFill_C_Set_Fill::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BasicGradientFill.BasicGradientFill_C.Set Brush Size
// 0x0080 (0x0080 - 0x0000)
struct BasicGradientFill_C_Set_Brush_Size final
{
public:
	struct FVector2D                              Param_Brush_Size;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0008(0x0078)()
};
static_assert(alignof(BasicGradientFill_C_Set_Brush_Size) == 0x000008, "Wrong alignment on BasicGradientFill_C_Set_Brush_Size");
static_assert(sizeof(BasicGradientFill_C_Set_Brush_Size) == 0x000080, "Wrong size on BasicGradientFill_C_Set_Brush_Size");
static_assert(offsetof(BasicGradientFill_C_Set_Brush_Size, Param_Brush_Size) == 0x000000, "Member 'BasicGradientFill_C_Set_Brush_Size::Param_Brush_Size' has a wrong offset!");
static_assert(offsetof(BasicGradientFill_C_Set_Brush_Size, K2Node_MakeStruct_SlateBrush) == 0x000008, "Member 'BasicGradientFill_C_Set_Brush_Size::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

}

