#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BluGloInventory

#include "Basic.hpp"


namespace SDK::Params
{

// Function BluGloInventory.BluGloInventory_C.ExecuteUbergraph_BluGloInventory
// 0x0050 (0x0050 - 0x0000)
struct BluGloInventory_C_ExecuteUbergraph_BluGloInventory final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UFortWorldItem* NewItem, int32 Count)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TArray<class UFortWorldItem*>& ItemsAdded, TArray<class UFortWorldItem*>& ItemsRemoved)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInOutpostZone_ReturnValue;              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BluGloInventory_C_ExecuteUbergraph_BluGloInventory) == 0x000008, "Wrong alignment on BluGloInventory_C_ExecuteUbergraph_BluGloInventory");
static_assert(sizeof(BluGloInventory_C_ExecuteUbergraph_BluGloInventory) == 0x000050, "Wrong size on BluGloInventory_C_ExecuteUbergraph_BluGloInventory");
static_assert(offsetof(BluGloInventory_C_ExecuteUbergraph_BluGloInventory, EntryPoint) == 0x000000, "Member 'BluGloInventory_C_ExecuteUbergraph_BluGloInventory::EntryPoint' has a wrong offset!");
static_assert(offsetof(BluGloInventory_C_ExecuteUbergraph_BluGloInventory, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BluGloInventory_C_ExecuteUbergraph_BluGloInventory::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BluGloInventory_C_ExecuteUbergraph_BluGloInventory, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'BluGloInventory_C_ExecuteUbergraph_BluGloInventory::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BluGloInventory_C_ExecuteUbergraph_BluGloInventory, K2Node_CreateDelegate_OutputDelegate3) == 0x000028, "Member 'BluGloInventory_C_ExecuteUbergraph_BluGloInventory::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BluGloInventory_C_ExecuteUbergraph_BluGloInventory, CallFunc_GetContext_ReturnValue) == 0x000038, "Member 'BluGloInventory_C_ExecuteUbergraph_BluGloInventory::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloInventory_C_ExecuteUbergraph_BluGloInventory, CallFunc_GetContext_ReturnValue2) == 0x000040, "Member 'BluGloInventory_C_ExecuteUbergraph_BluGloInventory::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BluGloInventory_C_ExecuteUbergraph_BluGloInventory, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BluGloInventory_C_ExecuteUbergraph_BluGloInventory::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloInventory_C_ExecuteUbergraph_BluGloInventory, CallFunc_IsInOutpostZone_ReturnValue) == 0x000049, "Member 'BluGloInventory_C_ExecuteUbergraph_BluGloInventory::CallFunc_IsInOutpostZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloInventory_C_ExecuteUbergraph_BluGloInventory, CallFunc_Not_PreBool_ReturnValue) == 0x00004A, "Member 'BluGloInventory_C_ExecuteUbergraph_BluGloInventory::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloInventory_C_ExecuteUbergraph_BluGloInventory, CallFunc_IsValid_ReturnValue2) == 0x00004B, "Member 'BluGloInventory_C_ExecuteUbergraph_BluGloInventory::CallFunc_IsValid_ReturnValue2' has a wrong offset!");

// Function BluGloInventory.BluGloInventory_C.HandleItemPickedUp
// 0x0010 (0x0010 - 0x0000)
struct BluGloInventory_C_HandleItemPickedUp final
{
public:
	class UFortWorldItem*                         New_Item;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BluGloInventory_C_HandleItemPickedUp) == 0x000008, "Wrong alignment on BluGloInventory_C_HandleItemPickedUp");
static_assert(sizeof(BluGloInventory_C_HandleItemPickedUp) == 0x000010, "Wrong size on BluGloInventory_C_HandleItemPickedUp");
static_assert(offsetof(BluGloInventory_C_HandleItemPickedUp, New_Item) == 0x000000, "Member 'BluGloInventory_C_HandleItemPickedUp::New_Item' has a wrong offset!");
static_assert(offsetof(BluGloInventory_C_HandleItemPickedUp, Count) == 0x000008, "Member 'BluGloInventory_C_HandleItemPickedUp::Count' has a wrong offset!");

// Function BluGloInventory.BluGloInventory_C.HandleOnWorldItemListChanged
// 0x0020 (0x0020 - 0x0000)
struct BluGloInventory_C_HandleOnWorldItemListChanged final
{
public:
	TArray<class UFortWorldItem*>                 Items_Added;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<class UFortWorldItem*>                 Items_Removed;                                     // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BluGloInventory_C_HandleOnWorldItemListChanged) == 0x000008, "Wrong alignment on BluGloInventory_C_HandleOnWorldItemListChanged");
static_assert(sizeof(BluGloInventory_C_HandleOnWorldItemListChanged) == 0x000020, "Wrong size on BluGloInventory_C_HandleOnWorldItemListChanged");
static_assert(offsetof(BluGloInventory_C_HandleOnWorldItemListChanged, Items_Added) == 0x000000, "Member 'BluGloInventory_C_HandleOnWorldItemListChanged::Items_Added' has a wrong offset!");
static_assert(offsetof(BluGloInventory_C_HandleOnWorldItemListChanged, Items_Removed) == 0x000010, "Member 'BluGloInventory_C_HandleOnWorldItemListChanged::Items_Removed' has a wrong offset!");

// Function BluGloInventory.BluGloInventory_C.Update
// 0x0060 (0x0060 - 0x0000)
struct BluGloInventory_C_Update final
{
public:
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue2;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortBluGloManager*                     CallFunc_GetBluGloManager_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetBluGloItemDefinition_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumInInventory_ReturnValue;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumInInventory_ReturnValue2;           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0040(0x0018)()
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BluGloInventory_C_Update) == 0x000008, "Wrong alignment on BluGloInventory_C_Update");
static_assert(sizeof(BluGloInventory_C_Update) == 0x000060, "Wrong size on BluGloInventory_C_Update");
static_assert(offsetof(BluGloInventory_C_Update, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'BluGloInventory_C_Update::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloInventory_C_Update, CallFunc_GetContext_ReturnValue2) == 0x000008, "Member 'BluGloInventory_C_Update::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BluGloInventory_C_Update, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BluGloInventory_C_Update::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloInventory_C_Update, CallFunc_IsValid_ReturnValue2) == 0x000011, "Member 'BluGloInventory_C_Update::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BluGloInventory_C_Update, CallFunc_GetBluGloManager_ReturnValue) == 0x000018, "Member 'BluGloInventory_C_Update::CallFunc_GetBluGloManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloInventory_C_Update, CallFunc_IsValid_ReturnValue3) == 0x000020, "Member 'BluGloInventory_C_Update::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BluGloInventory_C_Update, CallFunc_GetBluGloItemDefinition_ReturnValue) == 0x000028, "Member 'BluGloInventory_C_Update::CallFunc_GetBluGloItemDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloInventory_C_Update, CallFunc_GetNumInInventory_ReturnValue) == 0x000030, "Member 'BluGloInventory_C_Update::CallFunc_GetNumInInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloInventory_C_Update, CallFunc_GetNumInInventory_ReturnValue2) == 0x000034, "Member 'BluGloInventory_C_Update::CallFunc_GetNumInInventory_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BluGloInventory_C_Update, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BluGloInventory_C_Update::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloInventory_C_Update, CallFunc_Conv_IntToText_ReturnValue) == 0x000040, "Member 'BluGloInventory_C_Update::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGloInventory_C_Update, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000058, "Member 'BluGloInventory_C_Update::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

}

