#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BluGloInventory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BluGloInventory.BluGloInventory_C
// 0x0020 (0x0230 - 0x0210)
class UBluGloInventory_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UCommonNumericTextBlock*                BluGloInventoryTotal;                              // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItemDefinition*                    TutorialBluGloItemDefinition;                      // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentBluGloTotal;                                // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BluGloInventory(int32 EntryPoint);
	void Construct();
	void HandleItemPickedUp(class UFortWorldItem* New_Item, int32 Count);
	void HandleWorldItemsChanged();
	void HandleOnWorldItemListChanged(TArray<class UFortWorldItem*>& Items_Added, TArray<class UFortWorldItem*>& Items_Removed);
	void Update();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BluGloInventory_C">();
	}
	static class UBluGloInventory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBluGloInventory_C>();
	}
};
static_assert(alignof(UBluGloInventory_C) == 0x000008, "Wrong alignment on UBluGloInventory_C");
static_assert(sizeof(UBluGloInventory_C) == 0x000230, "Wrong size on UBluGloInventory_C");
static_assert(offsetof(UBluGloInventory_C, UberGraphFrame) == 0x000210, "Member 'UBluGloInventory_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBluGloInventory_C, BluGloInventoryTotal) == 0x000218, "Member 'UBluGloInventory_C::BluGloInventoryTotal' has a wrong offset!");
static_assert(offsetof(UBluGloInventory_C, TutorialBluGloItemDefinition) == 0x000220, "Member 'UBluGloInventory_C::TutorialBluGloItemDefinition' has a wrong offset!");
static_assert(offsetof(UBluGloInventory_C, CurrentBluGloTotal) == 0x000228, "Member 'UBluGloInventory_C::CurrentBluGloTotal' has a wrong offset!");

}

