#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BluGlow_MorphAnimation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BluGlow_MorphAnimation.BluGlow_MorphAnimation_C.ExecuteUbergraph_BluGlow_MorphAnimation
// 0x00D8 (0x00D8 - 0x0000)
struct BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0018(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sin_ReturnValue;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Cos_ReturnValue;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue3;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sin_ReturnValue2;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue4;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0040(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x0050(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation) == 0x000008, "Wrong alignment on BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation");
static_assert(sizeof(BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation) == 0x0000D8, "Wrong size on BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation");
static_assert(offsetof(BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation, EntryPoint) == 0x000000, "Member 'BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation, CallFunc_Add_IntInt_ReturnValue2) == 0x000008, "Member 'BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00000C, "Member 'BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation, CallFunc_Add_FloatFloat_ReturnValue) == 0x000010, "Member 'BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000018, "Member 'BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000024, "Member 'BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation, CallFunc_Add_FloatFloat_ReturnValue2) == 0x000028, "Member 'BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation, CallFunc_Sin_ReturnValue) == 0x00002C, "Member 'BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation::CallFunc_Sin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation, CallFunc_Cos_ReturnValue) == 0x000030, "Member 'BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation::CallFunc_Cos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation, CallFunc_Add_FloatFloat_ReturnValue3) == 0x000034, "Member 'BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation::CallFunc_Add_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation, CallFunc_Sin_ReturnValue2) == 0x000038, "Member 'BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation::CallFunc_Sin_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation, CallFunc_Add_FloatFloat_ReturnValue4) == 0x00003C, "Member 'BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation::CallFunc_Add_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation, CallFunc_MakeRotator_ReturnValue) == 0x000040, "Member 'BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x000050, "Member 'BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation, CallFunc_Percent_IntInt_ReturnValue) == 0x0000D0, "Member 'BluGlow_MorphAnimation_C_ExecuteUbergraph_BluGlow_MorphAnimation::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");

}

