#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BottomBarWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BottomBarWidget.BottomBarWidget_C
// 0x0020 (0x0230 - 0x0210)
class UBottomBarWidget_C final : public UCommonUserWidget
{
public:
	class UInputReflector_C*                      InputReflector;                                    // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_1;                                        // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMargin                                DefaultButtonMargin;                               // 0x0220(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BottomBarWidget_C">();
	}
	static class UBottomBarWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBottomBarWidget_C>();
	}
};
static_assert(alignof(UBottomBarWidget_C) == 0x000008, "Wrong alignment on UBottomBarWidget_C");
static_assert(sizeof(UBottomBarWidget_C) == 0x000230, "Wrong size on UBottomBarWidget_C");
static_assert(offsetof(UBottomBarWidget_C, InputReflector) == 0x000210, "Member 'UBottomBarWidget_C::InputReflector' has a wrong offset!");
static_assert(offsetof(UBottomBarWidget_C, SafeZone_1) == 0x000218, "Member 'UBottomBarWidget_C::SafeZone_1' has a wrong offset!");
static_assert(offsetof(UBottomBarWidget_C, DefaultButtonMargin) == 0x000220, "Member 'UBottomBarWidget_C::DefaultButtonMargin' has a wrong offset!");

}

