#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FortExpeditionReturnsWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FortExpeditionReturnsWidget.BP_FortExpeditionReturnsWidget_C.OnExpeditionCompleted__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_FortExpeditionReturnsWidget_C_OnExpeditionCompleted__DelegateSignature final
{
public:
	class UFortExpeditionItem*                    Param_Item;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FortExpeditionReturnsWidget_C_OnExpeditionCompleted__DelegateSignature) == 0x000008, "Wrong alignment on BP_FortExpeditionReturnsWidget_C_OnExpeditionCompleted__DelegateSignature");
static_assert(sizeof(BP_FortExpeditionReturnsWidget_C_OnExpeditionCompleted__DelegateSignature) == 0x000008, "Wrong size on BP_FortExpeditionReturnsWidget_C_OnExpeditionCompleted__DelegateSignature");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_OnExpeditionCompleted__DelegateSignature, Param_Item) == 0x000000, "Member 'BP_FortExpeditionReturnsWidget_C_OnExpeditionCompleted__DelegateSignature::Param_Item' has a wrong offset!");

// Function BP_FortExpeditionReturnsWidget.BP_FortExpeditionReturnsWidget_C.ExecuteUbergraph_BP_FortExpeditionReturnsWidget
// 0x0020 (0x0020 - 0x0000)
struct BP_FortExpeditionReturnsWidget_C_ExecuteUbergraph_BP_FortExpeditionReturnsWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Get_Mcp_Relative_Utc_Now_UtcNow;          // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UFortExpeditionItem*                    K2Node_Event_InItem;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsExpeditionCompleted_ReturnValue;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FortExpeditionReturnsWidget_C_ExecuteUbergraph_BP_FortExpeditionReturnsWidget) == 0x000008, "Wrong alignment on BP_FortExpeditionReturnsWidget_C_ExecuteUbergraph_BP_FortExpeditionReturnsWidget");
static_assert(sizeof(BP_FortExpeditionReturnsWidget_C_ExecuteUbergraph_BP_FortExpeditionReturnsWidget) == 0x000020, "Wrong size on BP_FortExpeditionReturnsWidget_C_ExecuteUbergraph_BP_FortExpeditionReturnsWidget");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_ExecuteUbergraph_BP_FortExpeditionReturnsWidget, EntryPoint) == 0x000000, "Member 'BP_FortExpeditionReturnsWidget_C_ExecuteUbergraph_BP_FortExpeditionReturnsWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_ExecuteUbergraph_BP_FortExpeditionReturnsWidget, CallFunc_Get_Mcp_Relative_Utc_Now_UtcNow) == 0x000008, "Member 'BP_FortExpeditionReturnsWidget_C_ExecuteUbergraph_BP_FortExpeditionReturnsWidget::CallFunc_Get_Mcp_Relative_Utc_Now_UtcNow' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_ExecuteUbergraph_BP_FortExpeditionReturnsWidget, K2Node_Event_InItem) == 0x000010, "Member 'BP_FortExpeditionReturnsWidget_C_ExecuteUbergraph_BP_FortExpeditionReturnsWidget::K2Node_Event_InItem' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_ExecuteUbergraph_BP_FortExpeditionReturnsWidget, K2Node_Event_IsDesignTime) == 0x000018, "Member 'BP_FortExpeditionReturnsWidget_C_ExecuteUbergraph_BP_FortExpeditionReturnsWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_ExecuteUbergraph_BP_FortExpeditionReturnsWidget, CallFunc_IsExpeditionCompleted_ReturnValue) == 0x000019, "Member 'BP_FortExpeditionReturnsWidget_C_ExecuteUbergraph_BP_FortExpeditionReturnsWidget::CallFunc_IsExpeditionCompleted_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_ExecuteUbergraph_BP_FortExpeditionReturnsWidget, CallFunc_IsValid_ReturnValue) == 0x00001A, "Member 'BP_FortExpeditionReturnsWidget_C_ExecuteUbergraph_BP_FortExpeditionReturnsWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_FortExpeditionReturnsWidget.BP_FortExpeditionReturnsWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_FortExpeditionReturnsWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FortExpeditionReturnsWidget_C_PreConstruct) == 0x000001, "Wrong alignment on BP_FortExpeditionReturnsWidget_C_PreConstruct");
static_assert(sizeof(BP_FortExpeditionReturnsWidget_C_PreConstruct) == 0x000001, "Wrong size on BP_FortExpeditionReturnsWidget_C_PreConstruct");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_FortExpeditionReturnsWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BP_FortExpeditionReturnsWidget.BP_FortExpeditionReturnsWidget_C.SetData
// 0x0008 (0x0008 - 0x0000)
struct BP_FortExpeditionReturnsWidget_C_SetData final
{
public:
	class UFortExpeditionItem*                    InItem;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FortExpeditionReturnsWidget_C_SetData) == 0x000008, "Wrong alignment on BP_FortExpeditionReturnsWidget_C_SetData");
static_assert(sizeof(BP_FortExpeditionReturnsWidget_C_SetData) == 0x000008, "Wrong size on BP_FortExpeditionReturnsWidget_C_SetData");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_SetData, InItem) == 0x000000, "Member 'BP_FortExpeditionReturnsWidget_C_SetData::InItem' has a wrong offset!");

// Function BP_FortExpeditionReturnsWidget.BP_FortExpeditionReturnsWidget_C.Refresh In Progress Widgets
// 0x0010 (0x0010 - 0x0000)
struct BP_FortExpeditionReturnsWidget_C_Refresh_In_Progress_Widgets final
{
public:
	class UFortExpeditionItem*                    Param_Item;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExpeditionInProgress_ReturnValue;       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FortExpeditionReturnsWidget_C_Refresh_In_Progress_Widgets) == 0x000008, "Wrong alignment on BP_FortExpeditionReturnsWidget_C_Refresh_In_Progress_Widgets");
static_assert(sizeof(BP_FortExpeditionReturnsWidget_C_Refresh_In_Progress_Widgets) == 0x000010, "Wrong size on BP_FortExpeditionReturnsWidget_C_Refresh_In_Progress_Widgets");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Refresh_In_Progress_Widgets, Param_Item) == 0x000000, "Member 'BP_FortExpeditionReturnsWidget_C_Refresh_In_Progress_Widgets::Param_Item' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Refresh_In_Progress_Widgets, CallFunc_IsExpeditionInProgress_ReturnValue) == 0x000008, "Member 'BP_FortExpeditionReturnsWidget_C_Refresh_In_Progress_Widgets::CallFunc_IsExpeditionInProgress_ReturnValue' has a wrong offset!");

// Function BP_FortExpeditionReturnsWidget.BP_FortExpeditionReturnsWidget_C.Set Expedition Return Time
// 0x00B0 (0x00B0 - 0x0000)
struct BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Time final
{
public:
	class UFortExpeditionItem*                    Param_Item;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_MakeTimespan_ReturnValue;                 // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsExpeditionCompleted_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Get_Mcp_Relative_Utc_Now_UtcNow;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetRemainingExpeditionDuration_ReturnValue; // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_Add_TimespanTimespan_ReturnValue;         // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetTimespanAsText_ReturnValue;            // 0x0030(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0018)()
};
static_assert(alignof(BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Time) == 0x000008, "Wrong alignment on BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Time");
static_assert(sizeof(BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Time) == 0x0000B0, "Wrong size on BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Time");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Time, Param_Item) == 0x000000, "Member 'BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Time::Param_Item' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Time, CallFunc_MakeTimespan_ReturnValue) == 0x000008, "Member 'BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Time::CallFunc_MakeTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Time, CallFunc_IsExpeditionCompleted_ReturnValue) == 0x000010, "Member 'BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Time::CallFunc_IsExpeditionCompleted_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Time, CallFunc_Get_Mcp_Relative_Utc_Now_UtcNow) == 0x000018, "Member 'BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Time::CallFunc_Get_Mcp_Relative_Utc_Now_UtcNow' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Time, CallFunc_GetRemainingExpeditionDuration_ReturnValue) == 0x000020, "Member 'BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Time::CallFunc_GetRemainingExpeditionDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Time, CallFunc_Add_TimespanTimespan_ReturnValue) == 0x000028, "Member 'BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Time::CallFunc_Add_TimespanTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Time, CallFunc_GetTimespanAsText_ReturnValue) == 0x000030, "Member 'BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Time::CallFunc_GetTimespanAsText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Time, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Time::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Time, K2Node_MakeArray_Array) == 0x000088, "Member 'BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Time::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Time, CallFunc_Format_ReturnValue) == 0x000098, "Member 'BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Time::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function BP_FortExpeditionReturnsWidget.BP_FortExpeditionReturnsWidget_C.Set Expedition Return Progress
// 0x0040 (0x0040 - 0x0000)
struct BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress final
{
public:
	class UFortExpeditionItem*                    Param_Item;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortExpeditionItemDefinition*          CallFunc_Get_Expedition_Item_Definition_ItemDef;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_Get_Mcp_Relative_Utc_Now_UtcNow;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetRemainingExpeditionDuration_ReturnValue; // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress) == 0x000008, "Wrong alignment on BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress");
static_assert(sizeof(BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress) == 0x000040, "Wrong size on BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress, Param_Item) == 0x000000, "Member 'BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress::Param_Item' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress, CallFunc_Get_Expedition_Item_Definition_ItemDef) == 0x000008, "Member 'BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress::CallFunc_Get_Expedition_Item_Definition_ItemDef' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress, CallFunc_Get_Mcp_Relative_Utc_Now_UtcNow) == 0x000010, "Member 'BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress::CallFunc_Get_Mcp_Relative_Utc_Now_UtcNow' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress, CallFunc_GetRemainingExpeditionDuration_ReturnValue) == 0x000020, "Member 'BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress::CallFunc_GetRemainingExpeditionDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress, CallFunc_GetTotalSeconds_ReturnValue) == 0x000028, "Member 'BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress::CallFunc_GetTotalSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress, CallFunc_FCeil_ReturnValue) == 0x00002C, "Member 'BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000030, "Member 'BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000034, "Member 'BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000038, "Member 'BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress, CallFunc_FClamp_ReturnValue) == 0x00003C, "Member 'BP_FortExpeditionReturnsWidget_C_Set_Expedition_Return_Progress::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function BP_FortExpeditionReturnsWidget.BP_FortExpeditionReturnsWidget_C.Get Expedition Item Definition
// 0x0028 (0x0028 - 0x0000)
struct BP_FortExpeditionReturnsWidget_C_Get_Expedition_Item_Definition final
{
public:
	class UFortExpeditionItem*                    Param_Item;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortExpeditionItemDefinition*          ItemDef;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortExpeditionItemDefinition*          K2Node_DynamicCast_AsFort_Expedition_Item_Definition; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FortExpeditionReturnsWidget_C_Get_Expedition_Item_Definition) == 0x000008, "Wrong alignment on BP_FortExpeditionReturnsWidget_C_Get_Expedition_Item_Definition");
static_assert(sizeof(BP_FortExpeditionReturnsWidget_C_Get_Expedition_Item_Definition) == 0x000028, "Wrong size on BP_FortExpeditionReturnsWidget_C_Get_Expedition_Item_Definition");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Get_Expedition_Item_Definition, Param_Item) == 0x000000, "Member 'BP_FortExpeditionReturnsWidget_C_Get_Expedition_Item_Definition::Param_Item' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Get_Expedition_Item_Definition, ItemDef) == 0x000008, "Member 'BP_FortExpeditionReturnsWidget_C_Get_Expedition_Item_Definition::ItemDef' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Get_Expedition_Item_Definition, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000010, "Member 'BP_FortExpeditionReturnsWidget_C_Get_Expedition_Item_Definition::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Get_Expedition_Item_Definition, K2Node_DynamicCast_AsFort_Expedition_Item_Definition) == 0x000018, "Member 'BP_FortExpeditionReturnsWidget_C_Get_Expedition_Item_Definition::K2Node_DynamicCast_AsFort_Expedition_Item_Definition' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Get_Expedition_Item_Definition, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_FortExpeditionReturnsWidget_C_Get_Expedition_Item_Definition::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_FortExpeditionReturnsWidget.BP_FortExpeditionReturnsWidget_C.Get Mcp Relative Utc Now
// 0x0028 (0x0028 - 0x0000)
struct BP_FortExpeditionReturnsWidget_C_Get_Mcp_Relative_Utc_Now final
{
public:
	struct FDateTime                              UtcNow;                                            // 0x0000(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_GetMcpRelativeUtcNow_ReturnValue;         // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FortExpeditionReturnsWidget_C_Get_Mcp_Relative_Utc_Now) == 0x000008, "Wrong alignment on BP_FortExpeditionReturnsWidget_C_Get_Mcp_Relative_Utc_Now");
static_assert(sizeof(BP_FortExpeditionReturnsWidget_C_Get_Mcp_Relative_Utc_Now) == 0x000028, "Wrong size on BP_FortExpeditionReturnsWidget_C_Get_Mcp_Relative_Utc_Now");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Get_Mcp_Relative_Utc_Now, UtcNow) == 0x000000, "Member 'BP_FortExpeditionReturnsWidget_C_Get_Mcp_Relative_Utc_Now::UtcNow' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Get_Mcp_Relative_Utc_Now, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'BP_FortExpeditionReturnsWidget_C_Get_Mcp_Relative_Utc_Now::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Get_Mcp_Relative_Utc_Now, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000010, "Member 'BP_FortExpeditionReturnsWidget_C_Get_Mcp_Relative_Utc_Now::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Get_Mcp_Relative_Utc_Now, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_FortExpeditionReturnsWidget_C_Get_Mcp_Relative_Utc_Now::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FortExpeditionReturnsWidget_C_Get_Mcp_Relative_Utc_Now, CallFunc_GetMcpRelativeUtcNow_ReturnValue) == 0x000020, "Member 'BP_FortExpeditionReturnsWidget_C_Get_Mcp_Relative_Utc_Now::CallFunc_GetMcpRelativeUtcNow_ReturnValue' has a wrong offset!");

}

