#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerControllerOutpost

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PlayerControllerOutpost.BP_PlayerControllerOutpost_C.ExecuteUbergraph_BP_PlayerControllerOutpost
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerControllerOutpost_C_ExecuteUbergraph_BP_PlayerControllerOutpost final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_GetHelp;                        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerControllerOutpost_C_ExecuteUbergraph_BP_PlayerControllerOutpost) == 0x000004, "Wrong alignment on BP_PlayerControllerOutpost_C_ExecuteUbergraph_BP_PlayerControllerOutpost");
static_assert(sizeof(BP_PlayerControllerOutpost_C_ExecuteUbergraph_BP_PlayerControllerOutpost) == 0x000008, "Wrong size on BP_PlayerControllerOutpost_C_ExecuteUbergraph_BP_PlayerControllerOutpost");
static_assert(offsetof(BP_PlayerControllerOutpost_C_ExecuteUbergraph_BP_PlayerControllerOutpost, EntryPoint) == 0x000000, "Member 'BP_PlayerControllerOutpost_C_ExecuteUbergraph_BP_PlayerControllerOutpost::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerOutpost_C_ExecuteUbergraph_BP_PlayerControllerOutpost, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_PlayerControllerOutpost_C_ExecuteUbergraph_BP_PlayerControllerOutpost::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerOutpost_C_ExecuteUbergraph_BP_PlayerControllerOutpost, K2Node_CustomEvent_GetHelp) == 0x000005, "Member 'BP_PlayerControllerOutpost_C_ExecuteUbergraph_BP_PlayerControllerOutpost::K2Node_CustomEvent_GetHelp' has a wrong offset!");

// Function BP_PlayerControllerOutpost.BP_PlayerControllerOutpost_C.ServerStartExpandingOutpost
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerControllerOutpost_C_ServerStartExpandingOutpost final
{
public:
	bool                                          Param_GetHelp;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerControllerOutpost_C_ServerStartExpandingOutpost) == 0x000001, "Wrong alignment on BP_PlayerControllerOutpost_C_ServerStartExpandingOutpost");
static_assert(sizeof(BP_PlayerControllerOutpost_C_ServerStartExpandingOutpost) == 0x000001, "Wrong size on BP_PlayerControllerOutpost_C_ServerStartExpandingOutpost");
static_assert(offsetof(BP_PlayerControllerOutpost_C_ServerStartExpandingOutpost, Param_GetHelp) == 0x000000, "Member 'BP_PlayerControllerOutpost_C_ServerStartExpandingOutpost::Param_GetHelp' has a wrong offset!");

}

