#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CheckFrontEndRewardsAction

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FrontEndRewards_Definition_structs.hpp"


namespace SDK::Params
{

// Function CheckFrontEndRewardsAction.CheckFrontEndRewardsAction_C.ExecuteUbergraph_CheckFrontEndRewardsAction
// 0x0078 (0x0078 - 0x0000)
struct CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortScriptedActionParams              K2Node_Event_Params;                               // 0x0008(0x0030)(NoDestructor)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPendingLogout_ReturnValue;              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Is_FrontEndRewards_Running_bRunning;      // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue2;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanShowFrontendRewards_ReturnValue;       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetCachedWidget_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFrontEndRewards_Widget_C*              K2Node_DynamicCast_AsFront_End_Rewards_Widget;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction) == 0x000008, "Wrong alignment on CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction");
static_assert(sizeof(CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction) == 0x000078, "Wrong size on CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction");
static_assert(offsetof(CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction, EntryPoint) == 0x000000, "Member 'CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction::EntryPoint' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction, K2Node_Event_Params) == 0x000008, "Member 'CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction::K2Node_Event_Params' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000038, "Member 'CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction, CallFunc_GetContext_ReturnValue) == 0x000040, "Member 'CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction, CallFunc_IsPendingLogout_ReturnValue) == 0x000049, "Member 'CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction::CallFunc_IsPendingLogout_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction, CallFunc_Not_PreBool_ReturnValue) == 0x00004A, "Member 'CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction, CallFunc_Is_FrontEndRewards_Running_bRunning) == 0x00004B, "Member 'CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction::CallFunc_Is_FrontEndRewards_Running_bRunning' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction, CallFunc_GetUIManagerWidget_ReturnValue2) == 0x000050, "Member 'CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction::CallFunc_GetUIManagerWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction, CallFunc_CanShowFrontendRewards_ReturnValue) == 0x000058, "Member 'CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction::CallFunc_CanShowFrontendRewards_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction, CallFunc_GetCachedWidget_ReturnValue) == 0x000060, "Member 'CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction::CallFunc_GetCachedWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction, K2Node_DynamicCast_AsFront_End_Rewards_Widget) == 0x000068, "Member 'CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction::K2Node_DynamicCast_AsFront_End_Rewards_Widget' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'CheckFrontEndRewardsAction_C_ExecuteUbergraph_CheckFrontEndRewardsAction::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function CheckFrontEndRewardsAction.CheckFrontEndRewardsAction_C.Execute
// 0x0030 (0x0030 - 0x0000)
struct CheckFrontEndRewardsAction_C_Execute final
{
public:
	struct FFortScriptedActionParams              Params_0;                                          // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(CheckFrontEndRewardsAction_C_Execute) == 0x000008, "Wrong alignment on CheckFrontEndRewardsAction_C_Execute");
static_assert(sizeof(CheckFrontEndRewardsAction_C_Execute) == 0x000030, "Wrong size on CheckFrontEndRewardsAction_C_Execute");
static_assert(offsetof(CheckFrontEndRewardsAction_C_Execute, Params_0) == 0x000000, "Member 'CheckFrontEndRewardsAction_C_Execute::Params_0' has a wrong offset!");

// Function CheckFrontEndRewardsAction.CheckFrontEndRewardsAction_C.CompleteRewardsAction
// 0x0030 (0x0030 - 0x0000)
struct CheckFrontEndRewardsAction_C_CompleteRewardsAction final
{
public:
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateFrontEnd*                 K2Node_DynamicCast_AsFort_Game_State_Front_End;    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CheckFrontEndRewardsAction_C_CompleteRewardsAction) == 0x000008, "Wrong alignment on CheckFrontEndRewardsAction_C_CompleteRewardsAction");
static_assert(sizeof(CheckFrontEndRewardsAction_C_CompleteRewardsAction) == 0x000030, "Wrong size on CheckFrontEndRewardsAction_C_CompleteRewardsAction");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CompleteRewardsAction, CallFunc_GetGameState_ReturnValue) == 0x000000, "Member 'CheckFrontEndRewardsAction_C_CompleteRewardsAction::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CompleteRewardsAction, K2Node_DynamicCast_AsFort_Game_State_Front_End) == 0x000008, "Member 'CheckFrontEndRewardsAction_C_CompleteRewardsAction::K2Node_DynamicCast_AsFort_Game_State_Front_End' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CompleteRewardsAction, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'CheckFrontEndRewardsAction_C_CompleteRewardsAction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CompleteRewardsAction, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'CheckFrontEndRewardsAction_C_CompleteRewardsAction::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CompleteRewardsAction, CallFunc_GetContext_ReturnValue2) == 0x000020, "Member 'CheckFrontEndRewardsAction_C_CompleteRewardsAction::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CompleteRewardsAction, CallFunc_GetQuestManager_ReturnValue) == 0x000028, "Member 'CheckFrontEndRewardsAction_C_CompleteRewardsAction::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");

// Function CheckFrontEndRewardsAction.CheckFrontEndRewardsAction_C.PopulateMissionRewards
// 0x0010 (0x0010 - 0x0000)
struct CheckFrontEndRewardsAction_C_PopulateMissionRewards final
{
public:
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreMissionRewardsAvailable_ReturnValue;   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CheckFrontEndRewardsAction_C_PopulateMissionRewards) == 0x000008, "Wrong alignment on CheckFrontEndRewardsAction_C_PopulateMissionRewards");
static_assert(sizeof(CheckFrontEndRewardsAction_C_PopulateMissionRewards) == 0x000010, "Wrong size on CheckFrontEndRewardsAction_C_PopulateMissionRewards");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateMissionRewards, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'CheckFrontEndRewardsAction_C_PopulateMissionRewards::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateMissionRewards, CallFunc_AreMissionRewardsAvailable_ReturnValue) == 0x000008, "Member 'CheckFrontEndRewardsAction_C_PopulateMissionRewards::CallFunc_AreMissionRewardsAvailable_ReturnValue' has a wrong offset!");

// Function CheckFrontEndRewardsAction.CheckFrontEndRewardsAction_C.PopulateQuestRewards
// 0x00A0 (0x00A0 - 0x0000)
struct CheckFrontEndRewardsAction_C_PopulateQuestRewards final
{
public:
	TArray<class UFortQuestItem*>                 TempNewQuests;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UFortQuestItem*>                 TempCompletedQuests;                               // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortQuestItem*>                 CallFunc_GetCompletedQuests_Completed_Quests;      // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItem*                         CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFortItemInstanceQuantityPair>  CallFunc_GetPreviewRewards_ReturnValue;            // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_HasVisibleRewards_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortItemInstanceQuantityPair          CallFunc_Array_Get_Item2;                          // 0x0078(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItem*                         K2Node_DynamicCast_AsFort_Quest_Item;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisibleToUser_ReturnValue;              // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CheckFrontEndRewardsAction_C_PopulateQuestRewards) == 0x000008, "Wrong alignment on CheckFrontEndRewardsAction_C_PopulateQuestRewards");
static_assert(sizeof(CheckFrontEndRewardsAction_C_PopulateQuestRewards) == 0x0000A0, "Wrong size on CheckFrontEndRewardsAction_C_PopulateQuestRewards");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateQuestRewards, TempNewQuests) == 0x000000, "Member 'CheckFrontEndRewardsAction_C_PopulateQuestRewards::TempNewQuests' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateQuestRewards, TempCompletedQuests) == 0x000010, "Member 'CheckFrontEndRewardsAction_C_PopulateQuestRewards::TempCompletedQuests' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateQuestRewards, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'CheckFrontEndRewardsAction_C_PopulateQuestRewards::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateQuestRewards, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'CheckFrontEndRewardsAction_C_PopulateQuestRewards::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateQuestRewards, Temp_int_Array_Index_Variable) == 0x000028, "Member 'CheckFrontEndRewardsAction_C_PopulateQuestRewards::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateQuestRewards, Temp_int_Loop_Counter_Variable2) == 0x00002C, "Member 'CheckFrontEndRewardsAction_C_PopulateQuestRewards::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateQuestRewards, Temp_int_Array_Index_Variable2) == 0x000030, "Member 'CheckFrontEndRewardsAction_C_PopulateQuestRewards::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateQuestRewards, CallFunc_Add_IntInt_ReturnValue2) == 0x000034, "Member 'CheckFrontEndRewardsAction_C_PopulateQuestRewards::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateQuestRewards, CallFunc_GetCompletedQuests_Completed_Quests) == 0x000038, "Member 'CheckFrontEndRewardsAction_C_PopulateQuestRewards::CallFunc_GetCompletedQuests_Completed_Quests' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateQuestRewards, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'CheckFrontEndRewardsAction_C_PopulateQuestRewards::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateQuestRewards, CallFunc_Array_Get_Item) == 0x000050, "Member 'CheckFrontEndRewardsAction_C_PopulateQuestRewards::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateQuestRewards, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'CheckFrontEndRewardsAction_C_PopulateQuestRewards::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateQuestRewards, CallFunc_Array_Add_ReturnValue) == 0x00005C, "Member 'CheckFrontEndRewardsAction_C_PopulateQuestRewards::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateQuestRewards, CallFunc_GetPreviewRewards_ReturnValue) == 0x000060, "Member 'CheckFrontEndRewardsAction_C_PopulateQuestRewards::CallFunc_GetPreviewRewards_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateQuestRewards, CallFunc_HasVisibleRewards_ReturnValue) == 0x000070, "Member 'CheckFrontEndRewardsAction_C_PopulateQuestRewards::CallFunc_HasVisibleRewards_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateQuestRewards, CallFunc_Array_Get_Item2) == 0x000078, "Member 'CheckFrontEndRewardsAction_C_PopulateQuestRewards::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateQuestRewards, CallFunc_Array_Length_ReturnValue2) == 0x000088, "Member 'CheckFrontEndRewardsAction_C_PopulateQuestRewards::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateQuestRewards, K2Node_DynamicCast_AsFort_Quest_Item) == 0x000090, "Member 'CheckFrontEndRewardsAction_C_PopulateQuestRewards::K2Node_DynamicCast_AsFort_Quest_Item' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateQuestRewards, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'CheckFrontEndRewardsAction_C_PopulateQuestRewards::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateQuestRewards, CallFunc_Less_IntInt_ReturnValue2) == 0x000099, "Member 'CheckFrontEndRewardsAction_C_PopulateQuestRewards::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateQuestRewards, CallFunc_IsVisibleToUser_ReturnValue) == 0x00009A, "Member 'CheckFrontEndRewardsAction_C_PopulateQuestRewards::CallFunc_IsVisibleToUser_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateQuestRewards, CallFunc_Array_Add_ReturnValue2) == 0x00009C, "Member 'CheckFrontEndRewardsAction_C_PopulateQuestRewards::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");

// Function CheckFrontEndRewardsAction.CheckFrontEndRewardsAction_C.GetCompletedQuests
// 0x0030 (0x0030 - 0x0000)
struct CheckFrontEndRewardsAction_C_GetCompletedQuests final
{
public:
	TArray<class UFortQuestItem*>                 Completed_Quests;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortQuestItem*>                 CallFunc_GetCompletedQuests_OutCompletedQuests;    // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(CheckFrontEndRewardsAction_C_GetCompletedQuests) == 0x000008, "Wrong alignment on CheckFrontEndRewardsAction_C_GetCompletedQuests");
static_assert(sizeof(CheckFrontEndRewardsAction_C_GetCompletedQuests) == 0x000030, "Wrong size on CheckFrontEndRewardsAction_C_GetCompletedQuests");
static_assert(offsetof(CheckFrontEndRewardsAction_C_GetCompletedQuests, Completed_Quests) == 0x000000, "Member 'CheckFrontEndRewardsAction_C_GetCompletedQuests::Completed_Quests' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_GetCompletedQuests, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'CheckFrontEndRewardsAction_C_GetCompletedQuests::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_GetCompletedQuests, CallFunc_GetQuestManager_ReturnValue) == 0x000018, "Member 'CheckFrontEndRewardsAction_C_GetCompletedQuests::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_GetCompletedQuests, CallFunc_GetCompletedQuests_OutCompletedQuests) == 0x000020, "Member 'CheckFrontEndRewardsAction_C_GetCompletedQuests::CallFunc_GetCompletedQuests_OutCompletedQuests' has a wrong offset!");

// Function CheckFrontEndRewardsAction.CheckFrontEndRewardsAction_C.PopulateUnseenQuests
// 0x0040 (0x0040 - 0x0000)
struct CheckFrontEndRewardsAction_C_PopulateUnseenQuests final
{
public:
	EFortQuestType                                QuestType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortQuestItem*>                 TempNewQuests;                                     // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_GetNextUnseenQuest_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasBeenSeenLocally_ReturnValue;           // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisibleToUser_ReturnValue;              // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CheckFrontEndRewardsAction_C_PopulateUnseenQuests) == 0x000008, "Wrong alignment on CheckFrontEndRewardsAction_C_PopulateUnseenQuests");
static_assert(sizeof(CheckFrontEndRewardsAction_C_PopulateUnseenQuests) == 0x000040, "Wrong size on CheckFrontEndRewardsAction_C_PopulateUnseenQuests");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateUnseenQuests, QuestType) == 0x000000, "Member 'CheckFrontEndRewardsAction_C_PopulateUnseenQuests::QuestType' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateUnseenQuests, TempNewQuests) == 0x000008, "Member 'CheckFrontEndRewardsAction_C_PopulateUnseenQuests::TempNewQuests' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateUnseenQuests, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'CheckFrontEndRewardsAction_C_PopulateUnseenQuests::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateUnseenQuests, CallFunc_GetQuestManager_ReturnValue) == 0x000020, "Member 'CheckFrontEndRewardsAction_C_PopulateUnseenQuests::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateUnseenQuests, CallFunc_GetNextUnseenQuest_ReturnValue) == 0x000028, "Member 'CheckFrontEndRewardsAction_C_PopulateUnseenQuests::CallFunc_GetNextUnseenQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateUnseenQuests, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'CheckFrontEndRewardsAction_C_PopulateUnseenQuests::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateUnseenQuests, CallFunc_HasBeenSeenLocally_ReturnValue) == 0x000031, "Member 'CheckFrontEndRewardsAction_C_PopulateUnseenQuests::CallFunc_HasBeenSeenLocally_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateUnseenQuests, CallFunc_Not_PreBool_ReturnValue) == 0x000032, "Member 'CheckFrontEndRewardsAction_C_PopulateUnseenQuests::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateUnseenQuests, CallFunc_IsVisibleToUser_ReturnValue) == 0x000033, "Member 'CheckFrontEndRewardsAction_C_PopulateUnseenQuests::CallFunc_IsVisibleToUser_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateUnseenQuests, CallFunc_Array_Add_ReturnValue) == 0x000034, "Member 'CheckFrontEndRewardsAction_C_PopulateUnseenQuests::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateUnseenQuests, CallFunc_BooleanAND_ReturnValue) == 0x000038, "Member 'CheckFrontEndRewardsAction_C_PopulateUnseenQuests::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function CheckFrontEndRewardsAction.CheckFrontEndRewardsAction_C.OpenFrontEndRewards
// 0x0070 (0x0070 - 0x0000)
struct CheckFrontEndRewardsAction_C_OpenFrontEndRewards final
{
public:
	class UFrontEndRewards_Widget_C*              LocalRewardsWidget;                                // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFrontEndRewards_Widget_C* RewardsWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UFrontEndRewards_Widget_C* RewardsWidget)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UFrontEndRewards_Widget_C* RewardsWidget)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetCachedWidget_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFrontEndRewards_Widget_C*              K2Node_DynamicCast_AsFront_End_Rewards_Widget;     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CheckFrontEndRewardsAction_C_OpenFrontEndRewards) == 0x000008, "Wrong alignment on CheckFrontEndRewardsAction_C_OpenFrontEndRewards");
static_assert(sizeof(CheckFrontEndRewardsAction_C_OpenFrontEndRewards) == 0x000070, "Wrong size on CheckFrontEndRewardsAction_C_OpenFrontEndRewards");
static_assert(offsetof(CheckFrontEndRewardsAction_C_OpenFrontEndRewards, LocalRewardsWidget) == 0x000000, "Member 'CheckFrontEndRewardsAction_C_OpenFrontEndRewards::LocalRewardsWidget' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_OpenFrontEndRewards, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'CheckFrontEndRewardsAction_C_OpenFrontEndRewards::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_OpenFrontEndRewards, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'CheckFrontEndRewardsAction_C_OpenFrontEndRewards::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_OpenFrontEndRewards, CallFunc_GetContext_ReturnValue2) == 0x000020, "Member 'CheckFrontEndRewardsAction_C_OpenFrontEndRewards::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_OpenFrontEndRewards, CallFunc_IsInZone_ReturnValue) == 0x000028, "Member 'CheckFrontEndRewardsAction_C_OpenFrontEndRewards::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_OpenFrontEndRewards, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'CheckFrontEndRewardsAction_C_OpenFrontEndRewards::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_OpenFrontEndRewards, K2Node_CreateDelegate_OutputDelegate3) == 0x000040, "Member 'CheckFrontEndRewardsAction_C_OpenFrontEndRewards::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_OpenFrontEndRewards, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000050, "Member 'CheckFrontEndRewardsAction_C_OpenFrontEndRewards::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_OpenFrontEndRewards, CallFunc_GetCachedWidget_ReturnValue) == 0x000058, "Member 'CheckFrontEndRewardsAction_C_OpenFrontEndRewards::CallFunc_GetCachedWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_OpenFrontEndRewards, K2Node_DynamicCast_AsFront_End_Rewards_Widget) == 0x000060, "Member 'CheckFrontEndRewardsAction_C_OpenFrontEndRewards::K2Node_DynamicCast_AsFront_End_Rewards_Widget' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_OpenFrontEndRewards, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'CheckFrontEndRewardsAction_C_OpenFrontEndRewards::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function CheckFrontEndRewardsAction.CheckFrontEndRewardsAction_C.PopulateCollectionBookRewards
// 0x0028 (0x0028 - 0x0000)
struct CheckFrontEndRewardsAction_C_PopulateCollectionBookRewards final
{
public:
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortCollectionBookManager*             CallFunc_GetCollectionBookManager_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFortCollectionBookRewards>     CallFunc_PopulateCollectionBookRewards_OutAvailableRewards; // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CheckFrontEndRewardsAction_C_PopulateCollectionBookRewards) == 0x000008, "Wrong alignment on CheckFrontEndRewardsAction_C_PopulateCollectionBookRewards");
static_assert(sizeof(CheckFrontEndRewardsAction_C_PopulateCollectionBookRewards) == 0x000028, "Wrong size on CheckFrontEndRewardsAction_C_PopulateCollectionBookRewards");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateCollectionBookRewards, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'CheckFrontEndRewardsAction_C_PopulateCollectionBookRewards::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateCollectionBookRewards, CallFunc_GetCollectionBookManager_ReturnValue) == 0x000008, "Member 'CheckFrontEndRewardsAction_C_PopulateCollectionBookRewards::CallFunc_GetCollectionBookManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateCollectionBookRewards, CallFunc_PopulateCollectionBookRewards_OutAvailableRewards) == 0x000010, "Member 'CheckFrontEndRewardsAction_C_PopulateCollectionBookRewards::CallFunc_PopulateCollectionBookRewards_OutAvailableRewards' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateCollectionBookRewards, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'CheckFrontEndRewardsAction_C_PopulateCollectionBookRewards::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateCollectionBookRewards, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'CheckFrontEndRewardsAction_C_PopulateCollectionBookRewards::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function CheckFrontEndRewardsAction.CheckFrontEndRewardsAction_C.HandleRewardsClaimed
// 0x0010 (0x0010 - 0x0000)
struct CheckFrontEndRewardsAction_C_HandleRewardsClaimed final
{
public:
	class UFrontEndRewards_Widget_C*              RewardsWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CheckFrontEndRewardsAction_C_HandleRewardsClaimed) == 0x000008, "Wrong alignment on CheckFrontEndRewardsAction_C_HandleRewardsClaimed");
static_assert(sizeof(CheckFrontEndRewardsAction_C_HandleRewardsClaimed) == 0x000010, "Wrong size on CheckFrontEndRewardsAction_C_HandleRewardsClaimed");
static_assert(offsetof(CheckFrontEndRewardsAction_C_HandleRewardsClaimed, RewardsWidget) == 0x000000, "Member 'CheckFrontEndRewardsAction_C_HandleRewardsClaimed::RewardsWidget' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_HandleRewardsClaimed, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000008, "Member 'CheckFrontEndRewardsAction_C_HandleRewardsClaimed::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function CheckFrontEndRewardsAction.CheckFrontEndRewardsAction_C.Clear
// 0x0088 (0x0088 - 0x0000)
struct CheckFrontEndRewardsAction_C_Clear final
{
public:
	TArray<struct FFortCollectionBookRewards>     K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UFortExpeditionItem*>            K2Node_MakeArray_Array2;                           // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UFortQuestItem*>                 K2Node_MakeArray_Array3;                           // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UFortQuestItem*>                 K2Node_MakeArray_Array4;                           // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	struct FFrontEndRewards_Definition            K2Node_MakeStruct_FrontEndRewards_Definition;      // 0x0040(0x0048)(HasGetValueTypeHash)
};
static_assert(alignof(CheckFrontEndRewardsAction_C_Clear) == 0x000008, "Wrong alignment on CheckFrontEndRewardsAction_C_Clear");
static_assert(sizeof(CheckFrontEndRewardsAction_C_Clear) == 0x000088, "Wrong size on CheckFrontEndRewardsAction_C_Clear");
static_assert(offsetof(CheckFrontEndRewardsAction_C_Clear, K2Node_MakeArray_Array) == 0x000000, "Member 'CheckFrontEndRewardsAction_C_Clear::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_Clear, K2Node_MakeArray_Array2) == 0x000010, "Member 'CheckFrontEndRewardsAction_C_Clear::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_Clear, K2Node_MakeArray_Array3) == 0x000020, "Member 'CheckFrontEndRewardsAction_C_Clear::K2Node_MakeArray_Array3' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_Clear, K2Node_MakeArray_Array4) == 0x000030, "Member 'CheckFrontEndRewardsAction_C_Clear::K2Node_MakeArray_Array4' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_Clear, K2Node_MakeStruct_FrontEndRewards_Definition) == 0x000040, "Member 'CheckFrontEndRewardsAction_C_Clear::K2Node_MakeStruct_FrontEndRewards_Definition' has a wrong offset!");

// Function CheckFrontEndRewardsAction.CheckFrontEndRewardsAction_C.HandleRewardsClaimError
// 0x0018 (0x0018 - 0x0000)
struct CheckFrontEndRewardsAction_C_HandleRewardsClaimError final
{
public:
	class UFrontEndRewards_Widget_C*              RewardsWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_FrontEndRewards_Running_bRunning;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CheckFrontEndRewardsAction_C_HandleRewardsClaimError) == 0x000008, "Wrong alignment on CheckFrontEndRewardsAction_C_HandleRewardsClaimError");
static_assert(sizeof(CheckFrontEndRewardsAction_C_HandleRewardsClaimError) == 0x000018, "Wrong size on CheckFrontEndRewardsAction_C_HandleRewardsClaimError");
static_assert(offsetof(CheckFrontEndRewardsAction_C_HandleRewardsClaimError, RewardsWidget) == 0x000000, "Member 'CheckFrontEndRewardsAction_C_HandleRewardsClaimError::RewardsWidget' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_HandleRewardsClaimError, CallFunc_Is_FrontEndRewards_Running_bRunning) == 0x000008, "Member 'CheckFrontEndRewardsAction_C_HandleRewardsClaimError::CallFunc_Is_FrontEndRewards_Running_bRunning' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_HandleRewardsClaimError, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000010, "Member 'CheckFrontEndRewardsAction_C_HandleRewardsClaimError::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function CheckFrontEndRewardsAction.CheckFrontEndRewardsAction_C.PopulateMissionAlertRewards
// 0x0010 (0x0010 - 0x0000)
struct CheckFrontEndRewardsAction_C_PopulateMissionAlertRewards final
{
public:
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPendingMissionAlertRewards_ReturnValue; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CheckFrontEndRewardsAction_C_PopulateMissionAlertRewards) == 0x000008, "Wrong alignment on CheckFrontEndRewardsAction_C_PopulateMissionAlertRewards");
static_assert(sizeof(CheckFrontEndRewardsAction_C_PopulateMissionAlertRewards) == 0x000010, "Wrong size on CheckFrontEndRewardsAction_C_PopulateMissionAlertRewards");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateMissionAlertRewards, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'CheckFrontEndRewardsAction_C_PopulateMissionAlertRewards::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_PopulateMissionAlertRewards, CallFunc_HasPendingMissionAlertRewards_ReturnValue) == 0x000008, "Member 'CheckFrontEndRewardsAction_C_PopulateMissionAlertRewards::CallFunc_HasPendingMissionAlertRewards_ReturnValue' has a wrong offset!");

// Function CheckFrontEndRewardsAction.CheckFrontEndRewardsAction_C.Is FrontEndRewards Running
// 0x0028 (0x0028 - 0x0000)
struct CheckFrontEndRewardsAction_C_Is_FrontEndRewards_Running final
{
public:
	bool                                          bRunning;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetCachedWidget_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFrontEndRewards_Widget_C*              K2Node_DynamicCast_AsFront_End_Rewards_Widget;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CheckFrontEndRewardsAction_C_Is_FrontEndRewards_Running) == 0x000008, "Wrong alignment on CheckFrontEndRewardsAction_C_Is_FrontEndRewards_Running");
static_assert(sizeof(CheckFrontEndRewardsAction_C_Is_FrontEndRewards_Running) == 0x000028, "Wrong size on CheckFrontEndRewardsAction_C_Is_FrontEndRewards_Running");
static_assert(offsetof(CheckFrontEndRewardsAction_C_Is_FrontEndRewards_Running, bRunning) == 0x000000, "Member 'CheckFrontEndRewardsAction_C_Is_FrontEndRewards_Running::bRunning' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_Is_FrontEndRewards_Running, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000008, "Member 'CheckFrontEndRewardsAction_C_Is_FrontEndRewards_Running::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_Is_FrontEndRewards_Running, CallFunc_GetCachedWidget_ReturnValue) == 0x000010, "Member 'CheckFrontEndRewardsAction_C_Is_FrontEndRewards_Running::CallFunc_GetCachedWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_Is_FrontEndRewards_Running, K2Node_DynamicCast_AsFront_End_Rewards_Widget) == 0x000018, "Member 'CheckFrontEndRewardsAction_C_Is_FrontEndRewards_Running::K2Node_DynamicCast_AsFront_End_Rewards_Widget' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_Is_FrontEndRewards_Running, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'CheckFrontEndRewardsAction_C_Is_FrontEndRewards_Running::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function CheckFrontEndRewardsAction.CheckFrontEndRewardsAction_C.CanShowFrontendRewards
// 0x0050 (0x0050 - 0x0000)
struct CheckFrontEndRewardsAction_C_CanShowFrontendRewards final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInLobby_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIManager_C*                           K2Node_DynamicCast_AsUIManager;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMatchmakingLocal_ReturnValue;           // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShowingModalsConfirmationsErrors_ReturnValue; // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreContext*                      CallFunc_GetContext_ReturnValue2;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortStoreState                               CallFunc_GetStoreState_ReturnValue;                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue3;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortPartyMemberLocation                      CallFunc_GetLocalPartyMemberLocation_Location;     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLocalPartyMemberLocation_ReturnValue;  // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue2;           // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue4;                   // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CheckFrontEndRewardsAction_C_CanShowFrontendRewards) == 0x000008, "Wrong alignment on CheckFrontEndRewardsAction_C_CanShowFrontendRewards");
static_assert(sizeof(CheckFrontEndRewardsAction_C_CanShowFrontendRewards) == 0x000050, "Wrong size on CheckFrontEndRewardsAction_C_CanShowFrontendRewards");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CanShowFrontendRewards, ReturnValue) == 0x000000, "Member 'CheckFrontEndRewardsAction_C_CanShowFrontendRewards::ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CanShowFrontendRewards, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'CheckFrontEndRewardsAction_C_CanShowFrontendRewards::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CanShowFrontendRewards, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000010, "Member 'CheckFrontEndRewardsAction_C_CanShowFrontendRewards::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CanShowFrontendRewards, CallFunc_IsInLobby_ReturnValue) == 0x000018, "Member 'CheckFrontEndRewardsAction_C_CanShowFrontendRewards::CallFunc_IsInLobby_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CanShowFrontendRewards, K2Node_DynamicCast_AsUIManager) == 0x000020, "Member 'CheckFrontEndRewardsAction_C_CanShowFrontendRewards::K2Node_DynamicCast_AsUIManager' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CanShowFrontendRewards, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'CheckFrontEndRewardsAction_C_CanShowFrontendRewards::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CanShowFrontendRewards, CallFunc_IsMatchmakingLocal_ReturnValue) == 0x000029, "Member 'CheckFrontEndRewardsAction_C_CanShowFrontendRewards::CallFunc_IsMatchmakingLocal_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CanShowFrontendRewards, CallFunc_IsShowingModalsConfirmationsErrors_ReturnValue) == 0x00002A, "Member 'CheckFrontEndRewardsAction_C_CanShowFrontendRewards::CallFunc_IsShowingModalsConfirmationsErrors_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CanShowFrontendRewards, CallFunc_GetContext_ReturnValue2) == 0x000030, "Member 'CheckFrontEndRewardsAction_C_CanShowFrontendRewards::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CanShowFrontendRewards, CallFunc_BooleanOR_ReturnValue) == 0x000038, "Member 'CheckFrontEndRewardsAction_C_CanShowFrontendRewards::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CanShowFrontendRewards, CallFunc_GetStoreState_ReturnValue) == 0x000039, "Member 'CheckFrontEndRewardsAction_C_CanShowFrontendRewards::CallFunc_GetStoreState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CanShowFrontendRewards, CallFunc_BooleanOR_ReturnValue2) == 0x00003A, "Member 'CheckFrontEndRewardsAction_C_CanShowFrontendRewards::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CanShowFrontendRewards, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00003B, "Member 'CheckFrontEndRewardsAction_C_CanShowFrontendRewards::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CanShowFrontendRewards, CallFunc_GetContext_ReturnValue3) == 0x000040, "Member 'CheckFrontEndRewardsAction_C_CanShowFrontendRewards::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CanShowFrontendRewards, CallFunc_BooleanOR_ReturnValue3) == 0x000048, "Member 'CheckFrontEndRewardsAction_C_CanShowFrontendRewards::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CanShowFrontendRewards, CallFunc_GetLocalPartyMemberLocation_Location) == 0x000049, "Member 'CheckFrontEndRewardsAction_C_CanShowFrontendRewards::CallFunc_GetLocalPartyMemberLocation_Location' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CanShowFrontendRewards, CallFunc_GetLocalPartyMemberLocation_ReturnValue) == 0x00004A, "Member 'CheckFrontEndRewardsAction_C_CanShowFrontendRewards::CallFunc_GetLocalPartyMemberLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CanShowFrontendRewards, CallFunc_NotEqual_ByteByte_ReturnValue2) == 0x00004B, "Member 'CheckFrontEndRewardsAction_C_CanShowFrontendRewards::CallFunc_NotEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CanShowFrontendRewards, CallFunc_BooleanAND_ReturnValue) == 0x00004C, "Member 'CheckFrontEndRewardsAction_C_CanShowFrontendRewards::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CanShowFrontendRewards, CallFunc_BooleanOR_ReturnValue4) == 0x00004D, "Member 'CheckFrontEndRewardsAction_C_CanShowFrontendRewards::CallFunc_BooleanOR_ReturnValue4' has a wrong offset!");
static_assert(offsetof(CheckFrontEndRewardsAction_C_CanShowFrontendRewards, CallFunc_Not_PreBool_ReturnValue) == 0x00004E, "Member 'CheckFrontEndRewardsAction_C_CanShowFrontendRewards::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function CheckFrontEndRewardsAction.CheckFrontEndRewardsAction_C.HandleRewardsIgnored
// 0x0008 (0x0008 - 0x0000)
struct CheckFrontEndRewardsAction_C_HandleRewardsIgnored final
{
public:
	class UFrontEndRewards_Widget_C*              RewardsWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CheckFrontEndRewardsAction_C_HandleRewardsIgnored) == 0x000008, "Wrong alignment on CheckFrontEndRewardsAction_C_HandleRewardsIgnored");
static_assert(sizeof(CheckFrontEndRewardsAction_C_HandleRewardsIgnored) == 0x000008, "Wrong size on CheckFrontEndRewardsAction_C_HandleRewardsIgnored");
static_assert(offsetof(CheckFrontEndRewardsAction_C_HandleRewardsIgnored, RewardsWidget) == 0x000000, "Member 'CheckFrontEndRewardsAction_C_HandleRewardsIgnored::RewardsWidget' has a wrong offset!");

}

