#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChoiceCardName

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function ChoiceCardName.ChoiceCardName_C.UpdateText
// 0x00B0 (0x00B0 - 0x0000)
struct ChoiceCardName_C_UpdateText final
{
public:
	class FText                                   Param_DisplayText;                                 // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	EFortRarity                                   Rarity;                                            // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x0028(0x0080)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue2;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChoiceCardName_C_UpdateText) == 0x000008, "Wrong alignment on ChoiceCardName_C_UpdateText");
static_assert(sizeof(ChoiceCardName_C_UpdateText) == 0x0000B0, "Wrong size on ChoiceCardName_C_UpdateText");
static_assert(offsetof(ChoiceCardName_C_UpdateText, Param_DisplayText) == 0x000000, "Member 'ChoiceCardName_C_UpdateText::Param_DisplayText' has a wrong offset!");
static_assert(offsetof(ChoiceCardName_C_UpdateText, Rarity) == 0x000018, "Member 'ChoiceCardName_C_UpdateText::Rarity' has a wrong offset!");
static_assert(offsetof(ChoiceCardName_C_UpdateText, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'ChoiceCardName_C_UpdateText::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ChoiceCardName_C_UpdateText, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'ChoiceCardName_C_UpdateText::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChoiceCardName_C_UpdateText, CallFunc_BPGetRarityData_ReturnValue) == 0x000028, "Member 'ChoiceCardName_C_UpdateText::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChoiceCardName_C_UpdateText, CallFunc_GetDynamicMaterial_ReturnValue2) == 0x0000A8, "Member 'ChoiceCardName_C_UpdateText::CallFunc_GetDynamicMaterial_ReturnValue2' has a wrong offset!");

}

