#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CollectionBookSectionRewardWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CollectionBookSectionRewardWidget.CollectionBookSectionRewardWidget_C
// 0x0028 (0x02A8 - 0x0280)
class UCollectionBookSectionRewardWidget_C final : public UFortCollectionBookSectionCompletionRewardWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 CheckmarkImage;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           RewardPendingBox;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  RewardStatusSwitcher;                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextRewardName;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CollectionBookSectionRewardWidget(int32 EntryPoint);
	void OnRewardStatusChanged(ECollectionBookRewardStatus NewStatus);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CollectionBookSectionRewardWidget_C">();
	}
	static class UCollectionBookSectionRewardWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollectionBookSectionRewardWidget_C>();
	}
};
static_assert(alignof(UCollectionBookSectionRewardWidget_C) == 0x000008, "Wrong alignment on UCollectionBookSectionRewardWidget_C");
static_assert(sizeof(UCollectionBookSectionRewardWidget_C) == 0x0002A8, "Wrong size on UCollectionBookSectionRewardWidget_C");
static_assert(offsetof(UCollectionBookSectionRewardWidget_C, UberGraphFrame) == 0x000280, "Member 'UCollectionBookSectionRewardWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCollectionBookSectionRewardWidget_C, CheckmarkImage) == 0x000288, "Member 'UCollectionBookSectionRewardWidget_C::CheckmarkImage' has a wrong offset!");
static_assert(offsetof(UCollectionBookSectionRewardWidget_C, RewardPendingBox) == 0x000290, "Member 'UCollectionBookSectionRewardWidget_C::RewardPendingBox' has a wrong offset!");
static_assert(offsetof(UCollectionBookSectionRewardWidget_C, RewardStatusSwitcher) == 0x000298, "Member 'UCollectionBookSectionRewardWidget_C::RewardStatusSwitcher' has a wrong offset!");
static_assert(offsetof(UCollectionBookSectionRewardWidget_C, TextRewardName) == 0x0002A0, "Member 'UCollectionBookSectionRewardWidget_C::TextRewardName' has a wrong offset!");

}

