#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CollectionBookSectionTileWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function CollectionBookSectionTileWidget.CollectionBookSectionTileWidget_C.ExecuteUbergraph_CollectionBookSectionTileWidget
// 0x0030 (0x0030 - 0x0000)
struct CollectionBookSectionTileWidget_C_ExecuteUbergraph_CollectionBookSectionTileWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCollectionBookState                      Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_NumFilledSlots;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NumSlots;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCollectionBookState                      K2Node_Event_SectionState;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCollectionBookSectionTileRewardWidget_C* K2Node_DynamicCast_AsCollection_Book_Section_Tile_Reward_Widget; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CollectionBookSectionTileWidget_C_ExecuteUbergraph_CollectionBookSectionTileWidget) == 0x000008, "Wrong alignment on CollectionBookSectionTileWidget_C_ExecuteUbergraph_CollectionBookSectionTileWidget");
static_assert(sizeof(CollectionBookSectionTileWidget_C_ExecuteUbergraph_CollectionBookSectionTileWidget) == 0x000030, "Wrong size on CollectionBookSectionTileWidget_C_ExecuteUbergraph_CollectionBookSectionTileWidget");
static_assert(offsetof(CollectionBookSectionTileWidget_C_ExecuteUbergraph_CollectionBookSectionTileWidget, EntryPoint) == 0x000000, "Member 'CollectionBookSectionTileWidget_C_ExecuteUbergraph_CollectionBookSectionTileWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(CollectionBookSectionTileWidget_C_ExecuteUbergraph_CollectionBookSectionTileWidget, Temp_byte_Variable) == 0x000004, "Member 'CollectionBookSectionTileWidget_C_ExecuteUbergraph_CollectionBookSectionTileWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CollectionBookSectionTileWidget_C_ExecuteUbergraph_CollectionBookSectionTileWidget, K2Node_Event_NumFilledSlots) == 0x000008, "Member 'CollectionBookSectionTileWidget_C_ExecuteUbergraph_CollectionBookSectionTileWidget::K2Node_Event_NumFilledSlots' has a wrong offset!");
static_assert(offsetof(CollectionBookSectionTileWidget_C_ExecuteUbergraph_CollectionBookSectionTileWidget, K2Node_Event_NumSlots) == 0x00000C, "Member 'CollectionBookSectionTileWidget_C_ExecuteUbergraph_CollectionBookSectionTileWidget::K2Node_Event_NumSlots' has a wrong offset!");
static_assert(offsetof(CollectionBookSectionTileWidget_C_ExecuteUbergraph_CollectionBookSectionTileWidget, K2Node_Event_SectionState) == 0x000010, "Member 'CollectionBookSectionTileWidget_C_ExecuteUbergraph_CollectionBookSectionTileWidget::K2Node_Event_SectionState' has a wrong offset!");
static_assert(offsetof(CollectionBookSectionTileWidget_C_ExecuteUbergraph_CollectionBookSectionTileWidget, K2Node_DynamicCast_AsCollection_Book_Section_Tile_Reward_Widget) == 0x000018, "Member 'CollectionBookSectionTileWidget_C_ExecuteUbergraph_CollectionBookSectionTileWidget::K2Node_DynamicCast_AsCollection_Book_Section_Tile_Reward_Widget' has a wrong offset!");
static_assert(offsetof(CollectionBookSectionTileWidget_C_ExecuteUbergraph_CollectionBookSectionTileWidget, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'CollectionBookSectionTileWidget_C_ExecuteUbergraph_CollectionBookSectionTileWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CollectionBookSectionTileWidget_C_ExecuteUbergraph_CollectionBookSectionTileWidget, K2Node_Select_Default) == 0x000028, "Member 'CollectionBookSectionTileWidget_C_ExecuteUbergraph_CollectionBookSectionTileWidget::K2Node_Select_Default' has a wrong offset!");

// Function CollectionBookSectionTileWidget.CollectionBookSectionTileWidget_C.OnSectionSlotUpdate
// 0x000C (0x000C - 0x0000)
struct CollectionBookSectionTileWidget_C_OnSectionSlotUpdate final
{
public:
	int32                                         NumFilledSlots;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumSlots;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCollectionBookState                      SectionState;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CollectionBookSectionTileWidget_C_OnSectionSlotUpdate) == 0x000004, "Wrong alignment on CollectionBookSectionTileWidget_C_OnSectionSlotUpdate");
static_assert(sizeof(CollectionBookSectionTileWidget_C_OnSectionSlotUpdate) == 0x00000C, "Wrong size on CollectionBookSectionTileWidget_C_OnSectionSlotUpdate");
static_assert(offsetof(CollectionBookSectionTileWidget_C_OnSectionSlotUpdate, NumFilledSlots) == 0x000000, "Member 'CollectionBookSectionTileWidget_C_OnSectionSlotUpdate::NumFilledSlots' has a wrong offset!");
static_assert(offsetof(CollectionBookSectionTileWidget_C_OnSectionSlotUpdate, NumSlots) == 0x000004, "Member 'CollectionBookSectionTileWidget_C_OnSectionSlotUpdate::NumSlots' has a wrong offset!");
static_assert(offsetof(CollectionBookSectionTileWidget_C_OnSectionSlotUpdate, SectionState) == 0x000008, "Member 'CollectionBookSectionTileWidget_C_OnSectionSlotUpdate::SectionState' has a wrong offset!");

}

