#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CollectionBookWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function CollectionBookWidget.CollectionBookWidget_C.ExecuteUbergraph_CollectionBookWidget
// 0x0080 (0x0080 - 0x0000)
struct CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCollectionBookManager*             CallFunc_GetCollectionBookManager_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalculateBookXp_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortCollectionBookManager*             CallFunc_GetCollectionBookManager_ReturnValue2;    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItem*                       K2Node_CustomEvent_ItemSlotted;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_SlotId;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue3;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortCollectionBookManager*             CallFunc_GetCollectionBookManager_ReturnValue3;    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFortAccountItem* ItemSlotted, class FName SlotId)> K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class UCollectionBookPrimaryPanel_C*          K2Node_DynamicCast_AsCollection_Book_Primary_Panel; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget) == 0x000008, "Wrong alignment on CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget");
static_assert(sizeof(CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget) == 0x000080, "Wrong size on CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget");
static_assert(offsetof(CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget, EntryPoint) == 0x000000, "Member 'CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget, CallFunc_GetCollectionBookManager_ReturnValue) == 0x000018, "Member 'CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget::CallFunc_GetCollectionBookManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget, CallFunc_CalculateBookXp_ReturnValue) == 0x000020, "Member 'CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget::CallFunc_CalculateBookXp_ReturnValue' has a wrong offset!");
static_assert(offsetof(CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000024, "Member 'CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget, CallFunc_BooleanAND_ReturnValue) == 0x000025, "Member 'CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget, CallFunc_GetContext_ReturnValue2) == 0x000028, "Member 'CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget, CallFunc_GetCollectionBookManager_ReturnValue2) == 0x000030, "Member 'CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget::CallFunc_GetCollectionBookManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget, K2Node_CustomEvent_ItemSlotted) == 0x000038, "Member 'CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget::K2Node_CustomEvent_ItemSlotted' has a wrong offset!");
static_assert(offsetof(CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget, K2Node_CustomEvent_SlotId) == 0x000040, "Member 'CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget::K2Node_CustomEvent_SlotId' has a wrong offset!");
static_assert(offsetof(CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget, CallFunc_GetContext_ReturnValue3) == 0x000048, "Member 'CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget, CallFunc_GetCollectionBookManager_ReturnValue3) == 0x000058, "Member 'CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget::CallFunc_GetCollectionBookManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget, K2Node_DynamicCast_AsCollection_Book_Primary_Panel) == 0x000070, "Member 'CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget::K2Node_DynamicCast_AsCollection_Book_Primary_Panel' has a wrong offset!");
static_assert(offsetof(CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'CollectionBookWidget_C_ExecuteUbergraph_CollectionBookWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function CollectionBookWidget.CollectionBookWidget_C.SlotItemComplete
// 0x0010 (0x0010 - 0x0000)
struct CollectionBookWidget_C_SlotItemComplete final
{
public:
	class UFortAccountItem*                       ItemSlotted;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SlotId;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CollectionBookWidget_C_SlotItemComplete) == 0x000008, "Wrong alignment on CollectionBookWidget_C_SlotItemComplete");
static_assert(sizeof(CollectionBookWidget_C_SlotItemComplete) == 0x000010, "Wrong size on CollectionBookWidget_C_SlotItemComplete");
static_assert(offsetof(CollectionBookWidget_C_SlotItemComplete, ItemSlotted) == 0x000000, "Member 'CollectionBookWidget_C_SlotItemComplete::ItemSlotted' has a wrong offset!");
static_assert(offsetof(CollectionBookWidget_C_SlotItemComplete, SlotId) == 0x000008, "Member 'CollectionBookWidget_C_SlotItemComplete::SlotId' has a wrong offset!");

}

