#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CollectionBookPageListWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CollectionBookPageListWidget.CollectionBookPageListWidget_C
// 0x0098 (0x0848 - 0x07B0)
class UCollectionBookPageListWidget_C final : public UFortCollectionBookPageListWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07B0(0x0008)(Transient, DuplicateTransient)
	class UCommonBorder*                          AvailableSlotsBorder;                              // 0x07B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_0;                            // 0x07C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  ExpansionStateSwitcher;                            // 0x07C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x07D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x07D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x07E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  PageCategorySwitcher;                              // 0x07E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                PageSpacer;                                        // 0x07F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 CategoryTextStyle;                                 // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 PageTextStyle;                                     // 0x0800(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CategoryButtonStyle;                               // 0x0808(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 PageButtonStyle;                                   // 0x0810(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AvailableSlotBorderColor1ParamName;                // 0x0818(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AvailableSlotBorderColor2ParamName;                // 0x0820(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           AvailableSlotBorderSelectedColor;                  // 0x0828(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           AvailableSlotBorderDeselectedColor;                // 0x0838(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CollectionBookPageListWidget(int32 EntryPoint);
	void OnSelectionChanged(class UCommonButton* ThisButton, bool bSelected);
	void OnPageDetailsUpdated(int32 NumAvailableSlots, EFortCollectionBookState State);
	void PreConstruct(bool IsDesignTime);
	void OnExpansionChanged(bool bExpanded);
	void SetupAsPage(class UFortCollectionBookPage* Page);
	void SetupAsCategory(class UFortCollectionBookCategory* Category);
	void UpdateAvailableSlotsBorderColors();
	void Update_Available_Slots_Widget(int32 NumAvailableSlots);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CollectionBookPageListWidget_C">();
	}
	static class UCollectionBookPageListWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollectionBookPageListWidget_C>();
	}
};
static_assert(alignof(UCollectionBookPageListWidget_C) == 0x000008, "Wrong alignment on UCollectionBookPageListWidget_C");
static_assert(sizeof(UCollectionBookPageListWidget_C) == 0x000848, "Wrong size on UCollectionBookPageListWidget_C");
static_assert(offsetof(UCollectionBookPageListWidget_C, UberGraphFrame) == 0x0007B0, "Member 'UCollectionBookPageListWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCollectionBookPageListWidget_C, AvailableSlotsBorder) == 0x0007B8, "Member 'UCollectionBookPageListWidget_C::AvailableSlotsBorder' has a wrong offset!");
static_assert(offsetof(UCollectionBookPageListWidget_C, CommonWidgetSwitcher_0) == 0x0007C0, "Member 'UCollectionBookPageListWidget_C::CommonWidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UCollectionBookPageListWidget_C, ExpansionStateSwitcher) == 0x0007C8, "Member 'UCollectionBookPageListWidget_C::ExpansionStateSwitcher' has a wrong offset!");
static_assert(offsetof(UCollectionBookPageListWidget_C, Image_0) == 0x0007D0, "Member 'UCollectionBookPageListWidget_C::Image_0' has a wrong offset!");
static_assert(offsetof(UCollectionBookPageListWidget_C, Image_1) == 0x0007D8, "Member 'UCollectionBookPageListWidget_C::Image_1' has a wrong offset!");
static_assert(offsetof(UCollectionBookPageListWidget_C, Image_2) == 0x0007E0, "Member 'UCollectionBookPageListWidget_C::Image_2' has a wrong offset!");
static_assert(offsetof(UCollectionBookPageListWidget_C, PageCategorySwitcher) == 0x0007E8, "Member 'UCollectionBookPageListWidget_C::PageCategorySwitcher' has a wrong offset!");
static_assert(offsetof(UCollectionBookPageListWidget_C, PageSpacer) == 0x0007F0, "Member 'UCollectionBookPageListWidget_C::PageSpacer' has a wrong offset!");
static_assert(offsetof(UCollectionBookPageListWidget_C, CategoryTextStyle) == 0x0007F8, "Member 'UCollectionBookPageListWidget_C::CategoryTextStyle' has a wrong offset!");
static_assert(offsetof(UCollectionBookPageListWidget_C, PageTextStyle) == 0x000800, "Member 'UCollectionBookPageListWidget_C::PageTextStyle' has a wrong offset!");
static_assert(offsetof(UCollectionBookPageListWidget_C, CategoryButtonStyle) == 0x000808, "Member 'UCollectionBookPageListWidget_C::CategoryButtonStyle' has a wrong offset!");
static_assert(offsetof(UCollectionBookPageListWidget_C, PageButtonStyle) == 0x000810, "Member 'UCollectionBookPageListWidget_C::PageButtonStyle' has a wrong offset!");
static_assert(offsetof(UCollectionBookPageListWidget_C, AvailableSlotBorderColor1ParamName) == 0x000818, "Member 'UCollectionBookPageListWidget_C::AvailableSlotBorderColor1ParamName' has a wrong offset!");
static_assert(offsetof(UCollectionBookPageListWidget_C, AvailableSlotBorderColor2ParamName) == 0x000820, "Member 'UCollectionBookPageListWidget_C::AvailableSlotBorderColor2ParamName' has a wrong offset!");
static_assert(offsetof(UCollectionBookPageListWidget_C, AvailableSlotBorderSelectedColor) == 0x000828, "Member 'UCollectionBookPageListWidget_C::AvailableSlotBorderSelectedColor' has a wrong offset!");
static_assert(offsetof(UCollectionBookPageListWidget_C, AvailableSlotBorderDeselectedColor) == 0x000838, "Member 'UCollectionBookPageListWidget_C::AvailableSlotBorderDeselectedColor' has a wrong offset!");

}

