#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomMatchmakingKeyModal

#include "Basic.hpp"


namespace SDK::Params
{

// Function CustomMatchmakingKeyModal.CustomMatchmakingKeyModal_C.BndEvt__AcceptButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CustomMatchmakingKeyModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomMatchmakingKeyModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CustomMatchmakingKeyModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CustomMatchmakingKeyModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CustomMatchmakingKeyModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CustomMatchmakingKeyModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CustomMatchmakingKeyModal_C_BndEvt__AcceptButton_K2Node_ComponentBoundEvent_26_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CustomMatchmakingKeyModal.CustomMatchmakingKeyModal_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct CustomMatchmakingKeyModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomMatchmakingKeyModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on CustomMatchmakingKeyModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(CustomMatchmakingKeyModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on CustomMatchmakingKeyModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(CustomMatchmakingKeyModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'CustomMatchmakingKeyModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function CustomMatchmakingKeyModal.CustomMatchmakingKeyModal_C.ExecuteUbergraph_CustomMatchmakingKeyModal
// 0x0098 (0x0098 - 0x0000)
struct CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue2;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue2;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCustomMatchmakingKey_ReturnValue;      // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0068(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal) == 0x000008, "Wrong alignment on CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal");
static_assert(sizeof(CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal) == 0x000098, "Wrong size on CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal");
static_assert(offsetof(CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal, EntryPoint) == 0x000000, "Member 'CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal::EntryPoint' has a wrong offset!");
static_assert(offsetof(CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal, K2Node_ComponentBoundEvent_Button2) == 0x000018, "Member 'CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000020, "Member 'CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal, K2Node_ComponentBoundEvent_Button) == 0x000028, "Member 'CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal, CallFunc_GetUIManagerWidget_ReturnValue2) == 0x000030, "Member 'CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal::CallFunc_GetUIManagerWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal, CallFunc_GetContext_ReturnValue2) == 0x000038, "Member 'CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal, CallFunc_GetCustomMatchmakingKey_ReturnValue) == 0x000040, "Member 'CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal::CallFunc_GetCustomMatchmakingKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal, CallFunc_GetText_ReturnValue) == 0x000068, "Member 'CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal, CallFunc_Conv_TextToString_ReturnValue) == 0x000080, "Member 'CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal, CallFunc_GetUINavigationManager_ReturnValue) == 0x000090, "Member 'CustomMatchmakingKeyModal_C_ExecuteUbergraph_CustomMatchmakingKeyModal::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

}

