#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DefaultObjectiveContentWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DefaultObjectiveContentWidget.DefaultObjectiveContentWidget_C
// 0x0028 (0x0238 - 0x0210)
class UDefaultObjectiveContentWidget_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UMissionObjectiveProgressBarsManager_C* MissionObjectiveProgressBarsManager;               // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             RichTextSlot;                                      // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AFortObjectiveBase*                     TrackedObjective;                                  // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bConfigureAsHUD;                                   // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_DefaultObjectiveContentWidget(int32 EntryPoint);
	void HandleUpdate(class AFortMissionState* MissionState);
	void HandleObjectiveVisibilityChanged(class AFortObjectiveBase* Objective, bool bNewVisibility);
	void HandleObjectiveStatusChanged(class AFortObjectiveBase* Objective, EFortObjectiveStatus NewStatus);
	void Setup(class AFortObjectiveBase* Objective, bool bInConfigureAsHUD);
	void Update();
	void GetRichTextBlock(class UMissionRichText_C** MissionRichTextBlock);
	void CreateRichTextBlock(const class FText& Text);
	void HandleTimerComponentUpdated(class UFortMissionTimerComponent* InTimerComponent);
	void GetHeightEstimate(float* Height);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DefaultObjectiveContentWidget_C">();
	}
	static class UDefaultObjectiveContentWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultObjectiveContentWidget_C>();
	}
};
static_assert(alignof(UDefaultObjectiveContentWidget_C) == 0x000008, "Wrong alignment on UDefaultObjectiveContentWidget_C");
static_assert(sizeof(UDefaultObjectiveContentWidget_C) == 0x000238, "Wrong size on UDefaultObjectiveContentWidget_C");
static_assert(offsetof(UDefaultObjectiveContentWidget_C, UberGraphFrame) == 0x000210, "Member 'UDefaultObjectiveContentWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDefaultObjectiveContentWidget_C, MissionObjectiveProgressBarsManager) == 0x000218, "Member 'UDefaultObjectiveContentWidget_C::MissionObjectiveProgressBarsManager' has a wrong offset!");
static_assert(offsetof(UDefaultObjectiveContentWidget_C, RichTextSlot) == 0x000220, "Member 'UDefaultObjectiveContentWidget_C::RichTextSlot' has a wrong offset!");
static_assert(offsetof(UDefaultObjectiveContentWidget_C, TrackedObjective) == 0x000228, "Member 'UDefaultObjectiveContentWidget_C::TrackedObjective' has a wrong offset!");
static_assert(offsetof(UDefaultObjectiveContentWidget_C, bConfigureAsHUD) == 0x000230, "Member 'UDefaultObjectiveContentWidget_C::bConfigureAsHUD' has a wrong offset!");

}

