#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DONOTUSE

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DONOTUSE.DONOTUSE_C
// 0x0020 (0x0228 - 0x0208)
class UDONOTUSE_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UFortMultiSizeItemCard*                 FortMultiSizeItemCard_0;                           // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItem*                              Item;                                              // 0x0218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EFortItemCardSize                             ItemCardSize;                                      // 0x0220(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_DONOTUSE(int32 EntryPoint);
	void Refresh();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DONOTUSE_C">();
	}
	static class UDONOTUSE_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDONOTUSE_C>();
	}
};
static_assert(alignof(UDONOTUSE_C) == 0x000008, "Wrong alignment on UDONOTUSE_C");
static_assert(sizeof(UDONOTUSE_C) == 0x000228, "Wrong size on UDONOTUSE_C");
static_assert(offsetof(UDONOTUSE_C, UberGraphFrame) == 0x000208, "Member 'UDONOTUSE_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDONOTUSE_C, FortMultiSizeItemCard_0) == 0x000210, "Member 'UDONOTUSE_C::FortMultiSizeItemCard_0' has a wrong offset!");
static_assert(offsetof(UDONOTUSE_C, Item) == 0x000218, "Member 'UDONOTUSE_C::Item' has a wrong offset!");
static_assert(offsetof(UDONOTUSE_C, ItemCardSize) == 0x000220, "Member 'UDONOTUSE_C::ItemCardSize' has a wrong offset!");

}

