#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EulaTab

#include "Basic.hpp"


namespace SDK::Params
{

// Function EulaTab.EulaTab_C.ExecuteUbergraph_EulaTab
// 0x0038 (0x0038 - 0x0000)
struct EulaTab_C_ExecuteUbergraph_EulaTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileApp_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue2;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetEulaText_ReturnValue;                  // 0x0020(0x0018)()
};
static_assert(alignof(EulaTab_C_ExecuteUbergraph_EulaTab) == 0x000008, "Wrong alignment on EulaTab_C_ExecuteUbergraph_EulaTab");
static_assert(sizeof(EulaTab_C_ExecuteUbergraph_EulaTab) == 0x000038, "Wrong size on EulaTab_C_ExecuteUbergraph_EulaTab");
static_assert(offsetof(EulaTab_C_ExecuteUbergraph_EulaTab, EntryPoint) == 0x000000, "Member 'EulaTab_C_ExecuteUbergraph_EulaTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(EulaTab_C_ExecuteUbergraph_EulaTab, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'EulaTab_C_ExecuteUbergraph_EulaTab::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(EulaTab_C_ExecuteUbergraph_EulaTab, CallFunc_IsMobileApp_ReturnValue) == 0x000010, "Member 'EulaTab_C_ExecuteUbergraph_EulaTab::CallFunc_IsMobileApp_ReturnValue' has a wrong offset!");
static_assert(offsetof(EulaTab_C_ExecuteUbergraph_EulaTab, CallFunc_GetContext_ReturnValue2) == 0x000018, "Member 'EulaTab_C_ExecuteUbergraph_EulaTab::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(EulaTab_C_ExecuteUbergraph_EulaTab, CallFunc_GetEulaText_ReturnValue) == 0x000020, "Member 'EulaTab_C_ExecuteUbergraph_EulaTab::CallFunc_GetEulaText_ReturnValue' has a wrong offset!");

// Function EulaTab.EulaTab_C.Activate Scroll Box
// 0x0008 (0x0008 - 0x0000)
struct EulaTab_C_Activate_Scroll_Box final
{
public:
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EulaTab_C_Activate_Scroll_Box) == 0x000008, "Wrong alignment on EulaTab_C_Activate_Scroll_Box");
static_assert(sizeof(EulaTab_C_Activate_Scroll_Box) == 0x000008, "Wrong size on EulaTab_C_Activate_Scroll_Box");
static_assert(offsetof(EulaTab_C_Activate_Scroll_Box, CallFunc_GetUINavigationManager_ReturnValue) == 0x000000, "Member 'EulaTab_C_Activate_Scroll_Box::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

}

