#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExpeditionSquadSlotButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ExpeditionSquadSlotButton.ExpeditionSquadSlotButton_C
// 0x0048 (0x0820 - 0x07D8)
class UExpeditionSquadSlotButton_C final : public UFortSquadSlotSelectorButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07D8(0x0008)(Transient, DuplicateTransient)
	int32                                         SquadSlotIndex;                                    // 0x07E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_7E4[0x4];                                      // 0x07E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnSquadSlotSelected;                               // 0x07E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnSquadSlotUpdated;                                // 0x07F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnSquadSlotOpened;                                 // 0x0808(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	EFortItemCardSize                             SlottedItemCardSize;                               // 0x0818(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void OnSquadSlotSelected__DelegateSignature(int32 Param_SquadSlotIndex);
	void OnSquadSlotUpdated__DelegateSignature(class UFortItem* Item);
	void OnSquadSlotOpened__DelegateSignature();
	void ExecuteUbergraph_ExpeditionSquadSlotButton(int32 EntryPoint);
	void OnSelected();
	void OnDoubleClicked();
	void HandlePostDifferentSquadSlotSetBP();
	void SquadSlotWidgetUpdated();
	void OnClicked();
	void PreConstruct(bool IsDesignTime);
	void Get_Squad_Data(class FName* OutSquadId, int32* OutSquadSlotIndex, TArray<EFortItemType>* ItemTypes);
	void Send_to_Skill_Tree();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ExpeditionSquadSlotButton_C">();
	}
	static class UExpeditionSquadSlotButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExpeditionSquadSlotButton_C>();
	}
};
static_assert(alignof(UExpeditionSquadSlotButton_C) == 0x000008, "Wrong alignment on UExpeditionSquadSlotButton_C");
static_assert(sizeof(UExpeditionSquadSlotButton_C) == 0x000820, "Wrong size on UExpeditionSquadSlotButton_C");
static_assert(offsetof(UExpeditionSquadSlotButton_C, UberGraphFrame) == 0x0007D8, "Member 'UExpeditionSquadSlotButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UExpeditionSquadSlotButton_C, SquadSlotIndex) == 0x0007E0, "Member 'UExpeditionSquadSlotButton_C::SquadSlotIndex' has a wrong offset!");
static_assert(offsetof(UExpeditionSquadSlotButton_C, OnSquadSlotSelected) == 0x0007E8, "Member 'UExpeditionSquadSlotButton_C::OnSquadSlotSelected' has a wrong offset!");
static_assert(offsetof(UExpeditionSquadSlotButton_C, OnSquadSlotUpdated) == 0x0007F8, "Member 'UExpeditionSquadSlotButton_C::OnSquadSlotUpdated' has a wrong offset!");
static_assert(offsetof(UExpeditionSquadSlotButton_C, OnSquadSlotOpened) == 0x000808, "Member 'UExpeditionSquadSlotButton_C::OnSquadSlotOpened' has a wrong offset!");
static_assert(offsetof(UExpeditionSquadSlotButton_C, SlottedItemCardSize) == 0x000818, "Member 'UExpeditionSquadSlotButton_C::SlottedItemCardSize' has a wrong offset!");

}

