#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortHeroSupportPerkWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FortHeroSupportPerkWidget.FortHeroSupportPerkWidget_C
// 0x0088 (0x0588 - 0x0500)
class UFortHeroSupportPerkWidget_C final : public UFortHeroSupportPerkWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0500(0x0008)(Transient, DuplicateTransient)
	class UCommonBorder*                          BorderShell;                                       // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  DescriptionTextSwitcher;                           // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          EvolutionBorder;                                   // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageSquadBonusType;                               // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InvalidForSlotImage;                               // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       InvalidSlotText;                                   // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockedPerkImage;                                   // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          PerkBoxBorder;                                     // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SquadBonusTypeText;                                // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StarsRequired;                                     // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          StatFocus;                                         // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       UnlockAtText;                                      // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         UnlockText;                                        // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 Name_Text_Style;                                   // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UClass*                                 Description_Text_Style;                            // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          SupportTypeMatchesDisplay;                         // 0x0580(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DisplayHeaderIfActive;                             // 0x0581(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DisplayedOutsideOfHeroSquad;                       // 0x0582(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_FortHeroSupportPerkWidget(int32 EntryPoint);
	void OnStateChanged();
	void Construct();
	void OnSupportTypeUpdated();
	void OnHeroUpdated();
	void Update(bool Param_DisplayedOutsideOfHeroSquad, EFortSupportBonusType TargetedSupportType);
	void UpdateVisibility();
	void UpdateLockedVisibility();
	void UpdateActiveDisplay();
	void UpdateEmptyVisibility();
	void UpdateComparisonVisibility();
	void IsInInvalidSlot(bool* InInvalidSlot);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FortHeroSupportPerkWidget_C">();
	}
	static class UFortHeroSupportPerkWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortHeroSupportPerkWidget_C>();
	}
};
static_assert(alignof(UFortHeroSupportPerkWidget_C) == 0x000008, "Wrong alignment on UFortHeroSupportPerkWidget_C");
static_assert(sizeof(UFortHeroSupportPerkWidget_C) == 0x000588, "Wrong size on UFortHeroSupportPerkWidget_C");
static_assert(offsetof(UFortHeroSupportPerkWidget_C, UberGraphFrame) == 0x000500, "Member 'UFortHeroSupportPerkWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFortHeroSupportPerkWidget_C, BorderShell) == 0x000508, "Member 'UFortHeroSupportPerkWidget_C::BorderShell' has a wrong offset!");
static_assert(offsetof(UFortHeroSupportPerkWidget_C, DescriptionTextSwitcher) == 0x000510, "Member 'UFortHeroSupportPerkWidget_C::DescriptionTextSwitcher' has a wrong offset!");
static_assert(offsetof(UFortHeroSupportPerkWidget_C, EvolutionBorder) == 0x000518, "Member 'UFortHeroSupportPerkWidget_C::EvolutionBorder' has a wrong offset!");
static_assert(offsetof(UFortHeroSupportPerkWidget_C, ImageSquadBonusType) == 0x000520, "Member 'UFortHeroSupportPerkWidget_C::ImageSquadBonusType' has a wrong offset!");
static_assert(offsetof(UFortHeroSupportPerkWidget_C, InvalidForSlotImage) == 0x000528, "Member 'UFortHeroSupportPerkWidget_C::InvalidForSlotImage' has a wrong offset!");
static_assert(offsetof(UFortHeroSupportPerkWidget_C, InvalidSlotText) == 0x000530, "Member 'UFortHeroSupportPerkWidget_C::InvalidSlotText' has a wrong offset!");
static_assert(offsetof(UFortHeroSupportPerkWidget_C, LockedPerkImage) == 0x000538, "Member 'UFortHeroSupportPerkWidget_C::LockedPerkImage' has a wrong offset!");
static_assert(offsetof(UFortHeroSupportPerkWidget_C, PerkBoxBorder) == 0x000540, "Member 'UFortHeroSupportPerkWidget_C::PerkBoxBorder' has a wrong offset!");
static_assert(offsetof(UFortHeroSupportPerkWidget_C, SquadBonusTypeText) == 0x000548, "Member 'UFortHeroSupportPerkWidget_C::SquadBonusTypeText' has a wrong offset!");
static_assert(offsetof(UFortHeroSupportPerkWidget_C, StarsRequired) == 0x000550, "Member 'UFortHeroSupportPerkWidget_C::StarsRequired' has a wrong offset!");
static_assert(offsetof(UFortHeroSupportPerkWidget_C, StatFocus) == 0x000558, "Member 'UFortHeroSupportPerkWidget_C::StatFocus' has a wrong offset!");
static_assert(offsetof(UFortHeroSupportPerkWidget_C, UnlockAtText) == 0x000560, "Member 'UFortHeroSupportPerkWidget_C::UnlockAtText' has a wrong offset!");
static_assert(offsetof(UFortHeroSupportPerkWidget_C, UnlockText) == 0x000568, "Member 'UFortHeroSupportPerkWidget_C::UnlockText' has a wrong offset!");
static_assert(offsetof(UFortHeroSupportPerkWidget_C, Name_Text_Style) == 0x000570, "Member 'UFortHeroSupportPerkWidget_C::Name_Text_Style' has a wrong offset!");
static_assert(offsetof(UFortHeroSupportPerkWidget_C, Description_Text_Style) == 0x000578, "Member 'UFortHeroSupportPerkWidget_C::Description_Text_Style' has a wrong offset!");
static_assert(offsetof(UFortHeroSupportPerkWidget_C, SupportTypeMatchesDisplay) == 0x000580, "Member 'UFortHeroSupportPerkWidget_C::SupportTypeMatchesDisplay' has a wrong offset!");
static_assert(offsetof(UFortHeroSupportPerkWidget_C, DisplayHeaderIfActive) == 0x000581, "Member 'UFortHeroSupportPerkWidget_C::DisplayHeaderIfActive' has a wrong offset!");
static_assert(offsetof(UFortHeroSupportPerkWidget_C, DisplayedOutsideOfHeroSquad) == 0x000582, "Member 'UFortHeroSupportPerkWidget_C::DisplayedOutsideOfHeroSquad' has a wrong offset!");

}

