#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortniteUI

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "Slate_structs.hpp"
#include "Party_structs.hpp"
#include "CommonUI_structs.hpp"


namespace SDK::Params
{

// Function FortniteUI.FortSquadSlotsView.CreateAndAddSquadSlotButton
// 0x0078 (0x0078 - 0x0000)
struct FortSquadSlotsView_CreateAndAddSquadSlotButton final
{
public:
	int32                                         SquadSlotIndex;                                    // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHomebaseSquadSlot                     SquadSlotDefinition;                               // 0x0008(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UWidget*                                OutSquadSlotButtonHost;                            // 0x0068(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortSquadSlotSelectorButton*           ReturnValue;                                       // 0x0070(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortSquadSlotsView_CreateAndAddSquadSlotButton) == 0x000008, "Wrong alignment on FortSquadSlotsView_CreateAndAddSquadSlotButton");
static_assert(sizeof(FortSquadSlotsView_CreateAndAddSquadSlotButton) == 0x000078, "Wrong size on FortSquadSlotsView_CreateAndAddSquadSlotButton");
static_assert(offsetof(FortSquadSlotsView_CreateAndAddSquadSlotButton, SquadSlotIndex) == 0x000000, "Member 'FortSquadSlotsView_CreateAndAddSquadSlotButton::SquadSlotIndex' has a wrong offset!");
static_assert(offsetof(FortSquadSlotsView_CreateAndAddSquadSlotButton, SquadSlotDefinition) == 0x000008, "Member 'FortSquadSlotsView_CreateAndAddSquadSlotButton::SquadSlotDefinition' has a wrong offset!");
static_assert(offsetof(FortSquadSlotsView_CreateAndAddSquadSlotButton, OutSquadSlotButtonHost) == 0x000068, "Member 'FortSquadSlotsView_CreateAndAddSquadSlotButton::OutSquadSlotButtonHost' has a wrong offset!");
static_assert(offsetof(FortSquadSlotsView_CreateAndAddSquadSlotButton, ReturnValue) == 0x000070, "Member 'FortSquadSlotsView_CreateAndAddSquadSlotButton::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortSquadSlotsView.HandleButtonClicked
// 0x0010 (0x0010 - 0x0000)
struct FortSquadSlotsView_HandleButtonClicked final
{
public:
	class UCommonButton*                          CommittedButton;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ButtonIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortSquadSlotsView_HandleButtonClicked) == 0x000008, "Wrong alignment on FortSquadSlotsView_HandleButtonClicked");
static_assert(sizeof(FortSquadSlotsView_HandleButtonClicked) == 0x000010, "Wrong size on FortSquadSlotsView_HandleButtonClicked");
static_assert(offsetof(FortSquadSlotsView_HandleButtonClicked, CommittedButton) == 0x000000, "Member 'FortSquadSlotsView_HandleButtonClicked::CommittedButton' has a wrong offset!");
static_assert(offsetof(FortSquadSlotsView_HandleButtonClicked, ButtonIndex) == 0x000008, "Member 'FortSquadSlotsView_HandleButtonClicked::ButtonIndex' has a wrong offset!");

// Function FortniteUI.FortSquadSlotsView.HandleHoveredButtonChanged
// 0x0010 (0x0010 - 0x0000)
struct FortSquadSlotsView_HandleHoveredButtonChanged final
{
public:
	class UCommonButton*                          HoveredButton;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ButtonIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortSquadSlotsView_HandleHoveredButtonChanged) == 0x000008, "Wrong alignment on FortSquadSlotsView_HandleHoveredButtonChanged");
static_assert(sizeof(FortSquadSlotsView_HandleHoveredButtonChanged) == 0x000010, "Wrong size on FortSquadSlotsView_HandleHoveredButtonChanged");
static_assert(offsetof(FortSquadSlotsView_HandleHoveredButtonChanged, HoveredButton) == 0x000000, "Member 'FortSquadSlotsView_HandleHoveredButtonChanged::HoveredButton' has a wrong offset!");
static_assert(offsetof(FortSquadSlotsView_HandleHoveredButtonChanged, ButtonIndex) == 0x000008, "Member 'FortSquadSlotsView_HandleHoveredButtonChanged::ButtonIndex' has a wrong offset!");

// Function FortniteUI.FortSquadSlotsView.HandleSelectedButtonChanged
// 0x0010 (0x0010 - 0x0000)
struct FortSquadSlotsView_HandleSelectedButtonChanged final
{
public:
	class UCommonButton*                          SelectedButton;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ButtonIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortSquadSlotsView_HandleSelectedButtonChanged) == 0x000008, "Wrong alignment on FortSquadSlotsView_HandleSelectedButtonChanged");
static_assert(sizeof(FortSquadSlotsView_HandleSelectedButtonChanged) == 0x000010, "Wrong size on FortSquadSlotsView_HandleSelectedButtonChanged");
static_assert(offsetof(FortSquadSlotsView_HandleSelectedButtonChanged, SelectedButton) == 0x000000, "Member 'FortSquadSlotsView_HandleSelectedButtonChanged::SelectedButton' has a wrong offset!");
static_assert(offsetof(FortSquadSlotsView_HandleSelectedButtonChanged, ButtonIndex) == 0x000008, "Member 'FortSquadSlotsView_HandleSelectedButtonChanged::ButtonIndex' has a wrong offset!");

// DelegateFunction FortniteUI.FortSquadSlotsView.OnDifferentSquadSlotSelected__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortSquadSlotsView_OnDifferentSquadSlotSelected__DelegateSignature final
{
public:
	int32                                         SquadSlotIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortSquadSlotsView_OnDifferentSquadSlotSelected__DelegateSignature) == 0x000004, "Wrong alignment on FortSquadSlotsView_OnDifferentSquadSlotSelected__DelegateSignature");
static_assert(sizeof(FortSquadSlotsView_OnDifferentSquadSlotSelected__DelegateSignature) == 0x000004, "Wrong size on FortSquadSlotsView_OnDifferentSquadSlotSelected__DelegateSignature");
static_assert(offsetof(FortSquadSlotsView_OnDifferentSquadSlotSelected__DelegateSignature, SquadSlotIndex) == 0x000000, "Member 'FortSquadSlotsView_OnDifferentSquadSlotSelected__DelegateSignature::SquadSlotIndex' has a wrong offset!");

// DelegateFunction FortniteUI.FortSquadSlotsView.OnRequestOpenSquadSlot__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct FortSquadSlotsView_OnRequestOpenSquadSlot__DelegateSignature final
{
public:
	int32                                         SquadSlotIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortSquadSlotsView_OnRequestOpenSquadSlot__DelegateSignature) == 0x000004, "Wrong alignment on FortSquadSlotsView_OnRequestOpenSquadSlot__DelegateSignature");
static_assert(sizeof(FortSquadSlotsView_OnRequestOpenSquadSlot__DelegateSignature) == 0x000004, "Wrong size on FortSquadSlotsView_OnRequestOpenSquadSlot__DelegateSignature");
static_assert(offsetof(FortSquadSlotsView_OnRequestOpenSquadSlot__DelegateSignature, SquadSlotIndex) == 0x000000, "Member 'FortSquadSlotsView_OnRequestOpenSquadSlot__DelegateSignature::SquadSlotIndex' has a wrong offset!");

// Function FortniteUI.FortSquadSlotsView.SelectSlot
// 0x0004 (0x0004 - 0x0000)
struct FortSquadSlotsView_SelectSlot final
{
public:
	int32                                         SquadSlotIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortSquadSlotsView_SelectSlot) == 0x000004, "Wrong alignment on FortSquadSlotsView_SelectSlot");
static_assert(sizeof(FortSquadSlotsView_SelectSlot) == 0x000004, "Wrong size on FortSquadSlotsView_SelectSlot");
static_assert(offsetof(FortSquadSlotsView_SelectSlot, SquadSlotIndex) == 0x000000, "Member 'FortSquadSlotsView_SelectSlot::SquadSlotIndex' has a wrong offset!");

// Function FortniteUI.FortSquadSlotsView.SetIdOfSquadToManageBP
// 0x0008 (0x0008 - 0x0000)
struct FortSquadSlotsView_SetIdOfSquadToManageBP final
{
public:
	class FName                                   SquadId;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortSquadSlotsView_SetIdOfSquadToManageBP) == 0x000004, "Wrong alignment on FortSquadSlotsView_SetIdOfSquadToManageBP");
static_assert(sizeof(FortSquadSlotsView_SetIdOfSquadToManageBP) == 0x000008, "Wrong size on FortSquadSlotsView_SetIdOfSquadToManageBP");
static_assert(offsetof(FortSquadSlotsView_SetIdOfSquadToManageBP, SquadId) == 0x000000, "Member 'FortSquadSlotsView_SetIdOfSquadToManageBP::SquadId' has a wrong offset!");

// Function FortniteUI.FortSquadSlotsView.SetInPreviewMode
// 0x0001 (0x0001 - 0x0000)
struct FortSquadSlotsView_SetInPreviewMode final
{
public:
	bool                                          bPreview;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortSquadSlotsView_SetInPreviewMode) == 0x000001, "Wrong alignment on FortSquadSlotsView_SetInPreviewMode");
static_assert(sizeof(FortSquadSlotsView_SetInPreviewMode) == 0x000001, "Wrong size on FortSquadSlotsView_SetInPreviewMode");
static_assert(offsetof(FortSquadSlotsView_SetInPreviewMode, bPreview) == 0x000000, "Member 'FortSquadSlotsView_SetInPreviewMode::bPreview' has a wrong offset!");

// Function FortniteUI.FortSquadSlotsView.SetIsSelectionLocked
// 0x0001 (0x0001 - 0x0000)
struct FortSquadSlotsView_SetIsSelectionLocked final
{
public:
	bool                                          ShouldSelectionBeLocked;                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortSquadSlotsView_SetIsSelectionLocked) == 0x000001, "Wrong alignment on FortSquadSlotsView_SetIsSelectionLocked");
static_assert(sizeof(FortSquadSlotsView_SetIsSelectionLocked) == 0x000001, "Wrong size on FortSquadSlotsView_SetIsSelectionLocked");
static_assert(offsetof(FortSquadSlotsView_SetIsSelectionLocked, ShouldSelectionBeLocked) == 0x000000, "Member 'FortSquadSlotsView_SetIsSelectionLocked::ShouldSelectionBeLocked' has a wrong offset!");

// Function FortniteUI.FortSquadSlotsView.GetIdOfSquadToManageBP
// 0x0008 (0x0008 - 0x0000)
struct FortSquadSlotsView_GetIdOfSquadToManageBP final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortSquadSlotsView_GetIdOfSquadToManageBP) == 0x000004, "Wrong alignment on FortSquadSlotsView_GetIdOfSquadToManageBP");
static_assert(sizeof(FortSquadSlotsView_GetIdOfSquadToManageBP) == 0x000008, "Wrong size on FortSquadSlotsView_GetIdOfSquadToManageBP");
static_assert(offsetof(FortSquadSlotsView_GetIdOfSquadToManageBP, ReturnValue) == 0x000000, "Member 'FortSquadSlotsView_GetIdOfSquadToManageBP::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortSquadSlotsView.GetIndexOfSelectedSquadSlot
// 0x0004 (0x0004 - 0x0000)
struct FortSquadSlotsView_GetIndexOfSelectedSquadSlot final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortSquadSlotsView_GetIndexOfSelectedSquadSlot) == 0x000004, "Wrong alignment on FortSquadSlotsView_GetIndexOfSelectedSquadSlot");
static_assert(sizeof(FortSquadSlotsView_GetIndexOfSelectedSquadSlot) == 0x000004, "Wrong size on FortSquadSlotsView_GetIndexOfSelectedSquadSlot");
static_assert(offsetof(FortSquadSlotsView_GetIndexOfSelectedSquadSlot, ReturnValue) == 0x000000, "Member 'FortSquadSlotsView_GetIndexOfSelectedSquadSlot::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortSquadSlotsView.TryGetStaticSquadDataBP
// 0x0090 (0x0090 - 0x0000)
struct FortSquadSlotsView_TryGetStaticSquadDataBP final
{
public:
	struct FHomebaseSquad                         OutSquadData;                                      // 0x0000(0x0088)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortSquadSlotsView_TryGetStaticSquadDataBP) == 0x000008, "Wrong alignment on FortSquadSlotsView_TryGetStaticSquadDataBP");
static_assert(sizeof(FortSquadSlotsView_TryGetStaticSquadDataBP) == 0x000090, "Wrong size on FortSquadSlotsView_TryGetStaticSquadDataBP");
static_assert(offsetof(FortSquadSlotsView_TryGetStaticSquadDataBP, OutSquadData) == 0x000000, "Member 'FortSquadSlotsView_TryGetStaticSquadDataBP::OutSquadData' has a wrong offset!");
static_assert(offsetof(FortSquadSlotsView_TryGetStaticSquadDataBP, ReturnValue) == 0x000088, "Member 'FortSquadSlotsView_TryGetStaticSquadDataBP::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortItemPickerBase.CanItemBeComitted
// 0x0010 (0x0010 - 0x0000)
struct FortItemPickerBase_CanItemBeComitted final
{
public:
	const class UFortItem*                        ItemToCommit;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortItemPickerBase_CanItemBeComitted) == 0x000008, "Wrong alignment on FortItemPickerBase_CanItemBeComitted");
static_assert(sizeof(FortItemPickerBase_CanItemBeComitted) == 0x000010, "Wrong size on FortItemPickerBase_CanItemBeComitted");
static_assert(offsetof(FortItemPickerBase_CanItemBeComitted, ItemToCommit) == 0x000000, "Member 'FortItemPickerBase_CanItemBeComitted::ItemToCommit' has a wrong offset!");
static_assert(offsetof(FortItemPickerBase_CanItemBeComitted, ReturnValue) == 0x000008, "Member 'FortItemPickerBase_CanItemBeComitted::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortItemPickerBase.HandlePickerItemClicked
// 0x0008 (0x0008 - 0x0000)
struct FortItemPickerBase_HandlePickerItemClicked final
{
public:
	const class UObject*                          ObjectOfClickedTile;                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortItemPickerBase_HandlePickerItemClicked) == 0x000008, "Wrong alignment on FortItemPickerBase_HandlePickerItemClicked");
static_assert(sizeof(FortItemPickerBase_HandlePickerItemClicked) == 0x000008, "Wrong size on FortItemPickerBase_HandlePickerItemClicked");
static_assert(offsetof(FortItemPickerBase_HandlePickerItemClicked, ObjectOfClickedTile) == 0x000000, "Member 'FortItemPickerBase_HandlePickerItemClicked::ObjectOfClickedTile' has a wrong offset!");

// Function FortniteUI.FortItemPickerBase.HandlePickerItemDoubleClicked
// 0x0008 (0x0008 - 0x0000)
struct FortItemPickerBase_HandlePickerItemDoubleClicked final
{
public:
	const class UObject*                          ObjectOfClickedTile;                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortItemPickerBase_HandlePickerItemDoubleClicked) == 0x000008, "Wrong alignment on FortItemPickerBase_HandlePickerItemDoubleClicked");
static_assert(sizeof(FortItemPickerBase_HandlePickerItemDoubleClicked) == 0x000008, "Wrong size on FortItemPickerBase_HandlePickerItemDoubleClicked");
static_assert(offsetof(FortItemPickerBase_HandlePickerItemDoubleClicked, ObjectOfClickedTile) == 0x000000, "Member 'FortItemPickerBase_HandlePickerItemDoubleClicked::ObjectOfClickedTile' has a wrong offset!");

// Function FortniteUI.FortItemPickerBase.HandlePickerItemHovered
// 0x0008 (0x0008 - 0x0000)
struct FortItemPickerBase_HandlePickerItemHovered final
{
public:
	const class UObject*                          ObjectOfHoveredTile;                               // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortItemPickerBase_HandlePickerItemHovered) == 0x000008, "Wrong alignment on FortItemPickerBase_HandlePickerItemHovered");
static_assert(sizeof(FortItemPickerBase_HandlePickerItemHovered) == 0x000008, "Wrong size on FortItemPickerBase_HandlePickerItemHovered");
static_assert(offsetof(FortItemPickerBase_HandlePickerItemHovered, ObjectOfHoveredTile) == 0x000000, "Member 'FortItemPickerBase_HandlePickerItemHovered::ObjectOfHoveredTile' has a wrong offset!");

// Function FortniteUI.FortItemPickerBase.HandlePickerItemSelected
// 0x0010 (0x0010 - 0x0000)
struct FortItemPickerBase_HandlePickerItemSelected final
{
public:
	const class UObject*                          ObjectWhoseSelectionChanged;                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortItemPickerBase_HandlePickerItemSelected) == 0x000008, "Wrong alignment on FortItemPickerBase_HandlePickerItemSelected");
static_assert(sizeof(FortItemPickerBase_HandlePickerItemSelected) == 0x000010, "Wrong size on FortItemPickerBase_HandlePickerItemSelected");
static_assert(offsetof(FortItemPickerBase_HandlePickerItemSelected, ObjectWhoseSelectionChanged) == 0x000000, "Member 'FortItemPickerBase_HandlePickerItemSelected::ObjectWhoseSelectionChanged' has a wrong offset!");
static_assert(offsetof(FortItemPickerBase_HandlePickerItemSelected, bIsSelected) == 0x000008, "Member 'FortItemPickerBase_HandlePickerItemSelected::bIsSelected' has a wrong offset!");

// Function FortniteUI.FortItemPickerBase.HandlePickerTileCreated
// 0x0008 (0x0008 - 0x0000)
struct FortItemPickerBase_HandlePickerTileCreated final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortItemPickerBase_HandlePickerTileCreated) == 0x000008, "Wrong alignment on FortItemPickerBase_HandlePickerTileCreated");
static_assert(sizeof(FortItemPickerBase_HandlePickerTileCreated) == 0x000008, "Wrong size on FortItemPickerBase_HandlePickerTileCreated");
static_assert(offsetof(FortItemPickerBase_HandlePickerTileCreated, Widget) == 0x000000, "Member 'FortItemPickerBase_HandlePickerTileCreated::Widget' has a wrong offset!");

// Function FortniteUI.FortItemPickerBase.HandlePickerTileDestroyed
// 0x0008 (0x0008 - 0x0000)
struct FortItemPickerBase_HandlePickerTileDestroyed final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortItemPickerBase_HandlePickerTileDestroyed) == 0x000008, "Wrong alignment on FortItemPickerBase_HandlePickerTileDestroyed");
static_assert(sizeof(FortItemPickerBase_HandlePickerTileDestroyed) == 0x000008, "Wrong size on FortItemPickerBase_HandlePickerTileDestroyed");
static_assert(offsetof(FortItemPickerBase_HandlePickerTileDestroyed, Widget) == 0x000000, "Member 'FortItemPickerBase_HandlePickerTileDestroyed::Widget' has a wrong offset!");

// DelegateFunction FortniteUI.FortItemPickerBase.OnItemSelectionEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct FortItemPickerBase_OnItemSelectionEvent__DelegateSignature final
{
public:
	class UFortItem*                              SelectedItem;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortItemPickerBase_OnItemSelectionEvent__DelegateSignature) == 0x000008, "Wrong alignment on FortItemPickerBase_OnItemSelectionEvent__DelegateSignature");
static_assert(sizeof(FortItemPickerBase_OnItemSelectionEvent__DelegateSignature) == 0x000008, "Wrong size on FortItemPickerBase_OnItemSelectionEvent__DelegateSignature");
static_assert(offsetof(FortItemPickerBase_OnItemSelectionEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'FortItemPickerBase_OnItemSelectionEvent__DelegateSignature::SelectedItem' has a wrong offset!");

// Function FortniteUI.FortItemPickerBase.SetSelectedIndex
// 0x0008 (0x0008 - 0x0000)
struct FortItemPickerBase_SetSelectedIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortItemPickerBase_SetSelectedIndex) == 0x000004, "Wrong alignment on FortItemPickerBase_SetSelectedIndex");
static_assert(sizeof(FortItemPickerBase_SetSelectedIndex) == 0x000008, "Wrong size on FortItemPickerBase_SetSelectedIndex");
static_assert(offsetof(FortItemPickerBase_SetSelectedIndex, Param_Index) == 0x000000, "Member 'FortItemPickerBase_SetSelectedIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(FortItemPickerBase_SetSelectedIndex, ReturnValue) == 0x000004, "Member 'FortItemPickerBase_SetSelectedIndex::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortItemPickerBase.SetSelectedItem
// 0x0008 (0x0008 - 0x0000)
struct FortItemPickerBase_SetSelectedItem final
{
public:
	const class UFortItem*                        ItemToSelect;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortItemPickerBase_SetSelectedItem) == 0x000008, "Wrong alignment on FortItemPickerBase_SetSelectedItem");
static_assert(sizeof(FortItemPickerBase_SetSelectedItem) == 0x000008, "Wrong size on FortItemPickerBase_SetSelectedItem");
static_assert(offsetof(FortItemPickerBase_SetSelectedItem, ItemToSelect) == 0x000000, "Member 'FortItemPickerBase_SetSelectedItem::ItemToSelect' has a wrong offset!");

// Function FortniteUI.FortItemPickerBase.TryCommitSelectedItem
// 0x0001 (0x0001 - 0x0000)
struct FortItemPickerBase_TryCommitSelectedItem final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortItemPickerBase_TryCommitSelectedItem) == 0x000001, "Wrong alignment on FortItemPickerBase_TryCommitSelectedItem");
static_assert(sizeof(FortItemPickerBase_TryCommitSelectedItem) == 0x000001, "Wrong size on FortItemPickerBase_TryCommitSelectedItem");
static_assert(offsetof(FortItemPickerBase_TryCommitSelectedItem, ReturnValue) == 0x000000, "Member 'FortItemPickerBase_TryCommitSelectedItem::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortItemPickerBase.GetIndexForItem
// 0x0010 (0x0010 - 0x0000)
struct FortItemPickerBase_GetIndexForItem final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortItemPickerBase_GetIndexForItem) == 0x000008, "Wrong alignment on FortItemPickerBase_GetIndexForItem");
static_assert(sizeof(FortItemPickerBase_GetIndexForItem) == 0x000010, "Wrong size on FortItemPickerBase_GetIndexForItem");
static_assert(offsetof(FortItemPickerBase_GetIndexForItem, Item) == 0x000000, "Member 'FortItemPickerBase_GetIndexForItem::Item' has a wrong offset!");
static_assert(offsetof(FortItemPickerBase_GetIndexForItem, ReturnValue) == 0x000008, "Member 'FortItemPickerBase_GetIndexForItem::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortItemPickerBase.GetSelectedItem
// 0x0008 (0x0008 - 0x0000)
struct FortItemPickerBase_GetSelectedItem final
{
public:
	class UFortItem*                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortItemPickerBase_GetSelectedItem) == 0x000008, "Wrong alignment on FortItemPickerBase_GetSelectedItem");
static_assert(sizeof(FortItemPickerBase_GetSelectedItem) == 0x000008, "Wrong size on FortItemPickerBase_GetSelectedItem");
static_assert(offsetof(FortItemPickerBase_GetSelectedItem, ReturnValue) == 0x000000, "Member 'FortItemPickerBase_GetSelectedItem::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortAsyncAction_ShowConfirmation.ShowConfirmationDialog
// 0x0080 (0x0080 - 0x0000)
struct FortAsyncAction_ShowConfirmation_ShowConfirmationDialog final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Title;                                             // 0x0008(0x0018)(Parm, NativeAccessSpecifierPublic)
	class FText                                   MESSAGE;                                           // 0x0020(0x0018)(Parm, NativeAccessSpecifierPublic)
	class FText                                   ConfirmButtonText;                                 // 0x0038(0x0018)(Parm, NativeAccessSpecifierPublic)
	class FText                                   DeclineButtonText;                                 // 0x0050(0x0018)(Parm, NativeAccessSpecifierPublic)
	class UFortUserWidget*                        InAdditionalContent;                               // 0x0068(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InDisplayTime;                                     // 0x0070(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_ShowConfirmation*      ReturnValue;                                       // 0x0078(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAsyncAction_ShowConfirmation_ShowConfirmationDialog) == 0x000008, "Wrong alignment on FortAsyncAction_ShowConfirmation_ShowConfirmationDialog");
static_assert(sizeof(FortAsyncAction_ShowConfirmation_ShowConfirmationDialog) == 0x000080, "Wrong size on FortAsyncAction_ShowConfirmation_ShowConfirmationDialog");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_ShowConfirmationDialog, InWorldContextObject) == 0x000000, "Member 'FortAsyncAction_ShowConfirmation_ShowConfirmationDialog::InWorldContextObject' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_ShowConfirmationDialog, Title) == 0x000008, "Member 'FortAsyncAction_ShowConfirmation_ShowConfirmationDialog::Title' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_ShowConfirmationDialog, MESSAGE) == 0x000020, "Member 'FortAsyncAction_ShowConfirmation_ShowConfirmationDialog::MESSAGE' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_ShowConfirmationDialog, ConfirmButtonText) == 0x000038, "Member 'FortAsyncAction_ShowConfirmation_ShowConfirmationDialog::ConfirmButtonText' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_ShowConfirmationDialog, DeclineButtonText) == 0x000050, "Member 'FortAsyncAction_ShowConfirmation_ShowConfirmationDialog::DeclineButtonText' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_ShowConfirmationDialog, InAdditionalContent) == 0x000068, "Member 'FortAsyncAction_ShowConfirmation_ShowConfirmationDialog::InAdditionalContent' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_ShowConfirmationDialog, InDisplayTime) == 0x000070, "Member 'FortAsyncAction_ShowConfirmation_ShowConfirmationDialog::InDisplayTime' has a wrong offset!");
static_assert(offsetof(FortAsyncAction_ShowConfirmation_ShowConfirmationDialog, ReturnValue) == 0x000078, "Member 'FortAsyncAction_ShowConfirmation_ShowConfirmationDialog::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortUIStateWidget_NUI.OnEnterState
// 0x0001 (0x0001 - 0x0000)
struct FortUIStateWidget_NUI_OnEnterState final
{
public:
	EFortUIState                                  PreviousUIState;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortUIStateWidget_NUI_OnEnterState) == 0x000001, "Wrong alignment on FortUIStateWidget_NUI_OnEnterState");
static_assert(sizeof(FortUIStateWidget_NUI_OnEnterState) == 0x000001, "Wrong size on FortUIStateWidget_NUI_OnEnterState");
static_assert(offsetof(FortUIStateWidget_NUI_OnEnterState, PreviousUIState) == 0x000000, "Member 'FortUIStateWidget_NUI_OnEnterState::PreviousUIState' has a wrong offset!");

// Function FortniteUI.FortUIStateWidget_NUI.OnExitState
// 0x0001 (0x0001 - 0x0000)
struct FortUIStateWidget_NUI_OnExitState final
{
public:
	EFortUIState                                  NextUIState;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortUIStateWidget_NUI_OnExitState) == 0x000001, "Wrong alignment on FortUIStateWidget_NUI_OnExitState");
static_assert(sizeof(FortUIStateWidget_NUI_OnExitState) == 0x000001, "Wrong size on FortUIStateWidget_NUI_OnExitState");
static_assert(offsetof(FortUIStateWidget_NUI_OnExitState, NextUIState) == 0x000000, "Member 'FortUIStateWidget_NUI_OnExitState::NextUIState' has a wrong offset!");

// Function FortniteUI.FortUIStateWidget_NUI.OnFrontEndVisibilityUpdated
// 0x0003 (0x0003 - 0x0000)
struct FortUIStateWidget_NUI_OnFrontEndVisibilityUpdated final
{
public:
	bool                                          bHideHeader;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideFooter;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideChatWidget;                                   // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortUIStateWidget_NUI_OnFrontEndVisibilityUpdated) == 0x000001, "Wrong alignment on FortUIStateWidget_NUI_OnFrontEndVisibilityUpdated");
static_assert(sizeof(FortUIStateWidget_NUI_OnFrontEndVisibilityUpdated) == 0x000003, "Wrong size on FortUIStateWidget_NUI_OnFrontEndVisibilityUpdated");
static_assert(offsetof(FortUIStateWidget_NUI_OnFrontEndVisibilityUpdated, bHideHeader) == 0x000000, "Member 'FortUIStateWidget_NUI_OnFrontEndVisibilityUpdated::bHideHeader' has a wrong offset!");
static_assert(offsetof(FortUIStateWidget_NUI_OnFrontEndVisibilityUpdated, bHideFooter) == 0x000001, "Member 'FortUIStateWidget_NUI_OnFrontEndVisibilityUpdated::bHideFooter' has a wrong offset!");
static_assert(offsetof(FortUIStateWidget_NUI_OnFrontEndVisibilityUpdated, bHideChatWidget) == 0x000002, "Member 'FortUIStateWidget_NUI_OnFrontEndVisibilityUpdated::bHideChatWidget' has a wrong offset!");

// Function FortniteUI.FortUIStateWidget_NUI.PopContentWidget
// 0x0008 (0x0008 - 0x0000)
struct FortUIStateWidget_NUI_PopContentWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortUIStateWidget_NUI_PopContentWidget) == 0x000008, "Wrong alignment on FortUIStateWidget_NUI_PopContentWidget");
static_assert(sizeof(FortUIStateWidget_NUI_PopContentWidget) == 0x000008, "Wrong size on FortUIStateWidget_NUI_PopContentWidget");
static_assert(offsetof(FortUIStateWidget_NUI_PopContentWidget, ReturnValue) == 0x000000, "Member 'FortUIStateWidget_NUI_PopContentWidget::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortUIStateWidget_NUI.PopContentWidgetInternal
// 0x0010 (0x0010 - 0x0000)
struct FortUIStateWidget_NUI_PopContentWidgetInternal final
{
public:
	struct FContentPushState                      State;                                             // 0x0000(0x0003)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortUIStateWidget_NUI_PopContentWidgetInternal) == 0x000008, "Wrong alignment on FortUIStateWidget_NUI_PopContentWidgetInternal");
static_assert(sizeof(FortUIStateWidget_NUI_PopContentWidgetInternal) == 0x000010, "Wrong size on FortUIStateWidget_NUI_PopContentWidgetInternal");
static_assert(offsetof(FortUIStateWidget_NUI_PopContentWidgetInternal, State) == 0x000000, "Member 'FortUIStateWidget_NUI_PopContentWidgetInternal::State' has a wrong offset!");
static_assert(offsetof(FortUIStateWidget_NUI_PopContentWidgetInternal, ReturnValue) == 0x000008, "Member 'FortUIStateWidget_NUI_PopContentWidgetInternal::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortUIStateWidget_NUI.PushContentWidget
// 0x0008 (0x0008 - 0x0000)
struct FortUIStateWidget_NUI_PushContentWidget final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortUIStateWidget_NUI_PushContentWidget) == 0x000008, "Wrong alignment on FortUIStateWidget_NUI_PushContentWidget");
static_assert(sizeof(FortUIStateWidget_NUI_PushContentWidget) == 0x000008, "Wrong size on FortUIStateWidget_NUI_PushContentWidget");
static_assert(offsetof(FortUIStateWidget_NUI_PushContentWidget, Widget) == 0x000000, "Member 'FortUIStateWidget_NUI_PushContentWidget::Widget' has a wrong offset!");

// Function FortniteUI.FortUIStateWidget_NUI.PushContentWidgetAdvanced
// 0x0010 (0x0010 - 0x0000)
struct FortUIStateWidget_NUI_PushContentWidgetAdvanced final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideHeader;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideFooter;                                       // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideChatWidget;                                   // 0x000A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortUIStateWidget_NUI_PushContentWidgetAdvanced) == 0x000008, "Wrong alignment on FortUIStateWidget_NUI_PushContentWidgetAdvanced");
static_assert(sizeof(FortUIStateWidget_NUI_PushContentWidgetAdvanced) == 0x000010, "Wrong size on FortUIStateWidget_NUI_PushContentWidgetAdvanced");
static_assert(offsetof(FortUIStateWidget_NUI_PushContentWidgetAdvanced, Widget) == 0x000000, "Member 'FortUIStateWidget_NUI_PushContentWidgetAdvanced::Widget' has a wrong offset!");
static_assert(offsetof(FortUIStateWidget_NUI_PushContentWidgetAdvanced, bHideHeader) == 0x000008, "Member 'FortUIStateWidget_NUI_PushContentWidgetAdvanced::bHideHeader' has a wrong offset!");
static_assert(offsetof(FortUIStateWidget_NUI_PushContentWidgetAdvanced, bHideFooter) == 0x000009, "Member 'FortUIStateWidget_NUI_PushContentWidgetAdvanced::bHideFooter' has a wrong offset!");
static_assert(offsetof(FortUIStateWidget_NUI_PushContentWidgetAdvanced, bHideChatWidget) == 0x00000A, "Member 'FortUIStateWidget_NUI_PushContentWidgetAdvanced::bHideChatWidget' has a wrong offset!");

// Function FortniteUI.FortUIStateWidget_NUI.PushContentWidgetInternal
// 0x0010 (0x0010 - 0x0000)
struct FortUIStateWidget_NUI_PushContentWidgetInternal final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FContentPushState                      State;                                             // 0x0008(0x0003)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FortUIStateWidget_NUI_PushContentWidgetInternal) == 0x000008, "Wrong alignment on FortUIStateWidget_NUI_PushContentWidgetInternal");
static_assert(sizeof(FortUIStateWidget_NUI_PushContentWidgetInternal) == 0x000010, "Wrong size on FortUIStateWidget_NUI_PushContentWidgetInternal");
static_assert(offsetof(FortUIStateWidget_NUI_PushContentWidgetInternal, Widget) == 0x000000, "Member 'FortUIStateWidget_NUI_PushContentWidgetInternal::Widget' has a wrong offset!");
static_assert(offsetof(FortUIStateWidget_NUI_PushContentWidgetInternal, State) == 0x000008, "Member 'FortUIStateWidget_NUI_PushContentWidgetInternal::State' has a wrong offset!");

// Function FortniteUI.FortUIStateWidget_NUI.SetFrontEndVisibility
// 0x0003 (0x0003 - 0x0000)
struct FortUIStateWidget_NUI_SetFrontEndVisibility final
{
public:
	bool                                          bHideHeader;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideFooter;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideChatWidget;                                   // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortUIStateWidget_NUI_SetFrontEndVisibility) == 0x000001, "Wrong alignment on FortUIStateWidget_NUI_SetFrontEndVisibility");
static_assert(sizeof(FortUIStateWidget_NUI_SetFrontEndVisibility) == 0x000003, "Wrong size on FortUIStateWidget_NUI_SetFrontEndVisibility");
static_assert(offsetof(FortUIStateWidget_NUI_SetFrontEndVisibility, bHideHeader) == 0x000000, "Member 'FortUIStateWidget_NUI_SetFrontEndVisibility::bHideHeader' has a wrong offset!");
static_assert(offsetof(FortUIStateWidget_NUI_SetFrontEndVisibility, bHideFooter) == 0x000001, "Member 'FortUIStateWidget_NUI_SetFrontEndVisibility::bHideFooter' has a wrong offset!");
static_assert(offsetof(FortUIStateWidget_NUI_SetFrontEndVisibility, bHideChatWidget) == 0x000002, "Member 'FortUIStateWidget_NUI_SetFrontEndVisibility::bHideChatWidget' has a wrong offset!");

// Function FortniteUI.AthenaAccountContext.GetBattleBookPurchaseLimit
// 0x0008 (0x0008 - 0x0000)
struct AthenaAccountContext_GetBattleBookPurchaseLimit final
{
public:
	int32                                         MaxNumLevelsPossibleToPurchase;                    // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BonusLevelsGranted;                                // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAccountContext_GetBattleBookPurchaseLimit) == 0x000004, "Wrong alignment on AthenaAccountContext_GetBattleBookPurchaseLimit");
static_assert(sizeof(AthenaAccountContext_GetBattleBookPurchaseLimit) == 0x000008, "Wrong size on AthenaAccountContext_GetBattleBookPurchaseLimit");
static_assert(offsetof(AthenaAccountContext_GetBattleBookPurchaseLimit, MaxNumLevelsPossibleToPurchase) == 0x000000, "Member 'AthenaAccountContext_GetBattleBookPurchaseLimit::MaxNumLevelsPossibleToPurchase' has a wrong offset!");
static_assert(offsetof(AthenaAccountContext_GetBattleBookPurchaseLimit, BonusLevelsGranted) == 0x000004, "Member 'AthenaAccountContext_GetBattleBookPurchaseLimit::BonusLevelsGranted' has a wrong offset!");

// Function FortniteUI.AthenaAccountContext.SimulateBattleBookPurchase
// 0x000C (0x000C - 0x0000)
struct AthenaAccountContext_SimulateBattleBookPurchase final
{
public:
	int32                                         NumLevelsToPurchase;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BonusLevelsGranted;                                // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverLimit;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AthenaAccountContext_SimulateBattleBookPurchase) == 0x000004, "Wrong alignment on AthenaAccountContext_SimulateBattleBookPurchase");
static_assert(sizeof(AthenaAccountContext_SimulateBattleBookPurchase) == 0x00000C, "Wrong size on AthenaAccountContext_SimulateBattleBookPurchase");
static_assert(offsetof(AthenaAccountContext_SimulateBattleBookPurchase, NumLevelsToPurchase) == 0x000000, "Member 'AthenaAccountContext_SimulateBattleBookPurchase::NumLevelsToPurchase' has a wrong offset!");
static_assert(offsetof(AthenaAccountContext_SimulateBattleBookPurchase, BonusLevelsGranted) == 0x000004, "Member 'AthenaAccountContext_SimulateBattleBookPurchase::BonusLevelsGranted' has a wrong offset!");
static_assert(offsetof(AthenaAccountContext_SimulateBattleBookPurchase, bOverLimit) == 0x000008, "Member 'AthenaAccountContext_SimulateBattleBookPurchase::bOverLimit' has a wrong offset!");

// Function FortniteUI.AthenaAccountContext.GetCurrentSeasonName
// 0x0018 (0x0018 - 0x0000)
struct AthenaAccountContext_GetCurrentSeasonName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AthenaAccountContext_GetCurrentSeasonName) == 0x000008, "Wrong alignment on AthenaAccountContext_GetCurrentSeasonName");
static_assert(sizeof(AthenaAccountContext_GetCurrentSeasonName) == 0x000018, "Wrong size on AthenaAccountContext_GetCurrentSeasonName");
static_assert(offsetof(AthenaAccountContext_GetCurrentSeasonName, ReturnValue) == 0x000000, "Member 'AthenaAccountContext_GetCurrentSeasonName::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortAthenaMatchmakingWidget.GetActivePlaylists
// 0x0010 (0x0010 - 0x0000)
struct FortAthenaMatchmakingWidget_GetActivePlaylists final
{
public:
	TArray<EFortAthenaPlaylist>                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMatchmakingWidget_GetActivePlaylists) == 0x000008, "Wrong alignment on FortAthenaMatchmakingWidget_GetActivePlaylists");
static_assert(sizeof(FortAthenaMatchmakingWidget_GetActivePlaylists) == 0x000010, "Wrong size on FortAthenaMatchmakingWidget_GetActivePlaylists");
static_assert(offsetof(FortAthenaMatchmakingWidget_GetActivePlaylists, ReturnValue) == 0x000000, "Member 'FortAthenaMatchmakingWidget_GetActivePlaylists::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortAthenaMatchmakingWidget.OnChangeTeamFillChanged
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMatchmakingWidget_OnChangeTeamFillChanged final
{
public:
	bool                                          bFill;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMatchmakingWidget_OnChangeTeamFillChanged) == 0x000001, "Wrong alignment on FortAthenaMatchmakingWidget_OnChangeTeamFillChanged");
static_assert(sizeof(FortAthenaMatchmakingWidget_OnChangeTeamFillChanged) == 0x000001, "Wrong size on FortAthenaMatchmakingWidget_OnChangeTeamFillChanged");
static_assert(offsetof(FortAthenaMatchmakingWidget_OnChangeTeamFillChanged, bFill) == 0x000000, "Member 'FortAthenaMatchmakingWidget_OnChangeTeamFillChanged::bFill' has a wrong offset!");

// Function FortniteUI.FortAthenaMatchmakingWidget.OnPlayButtonUpdated
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMatchmakingWidget_OnPlayButtonUpdated final
{
public:
	bool                                          bShowPlayButton;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMatchmakingWidget_OnPlayButtonUpdated) == 0x000001, "Wrong alignment on FortAthenaMatchmakingWidget_OnPlayButtonUpdated");
static_assert(sizeof(FortAthenaMatchmakingWidget_OnPlayButtonUpdated) == 0x000001, "Wrong size on FortAthenaMatchmakingWidget_OnPlayButtonUpdated");
static_assert(offsetof(FortAthenaMatchmakingWidget_OnPlayButtonUpdated, bShowPlayButton) == 0x000000, "Member 'FortAthenaMatchmakingWidget_OnPlayButtonUpdated::bShowPlayButton' has a wrong offset!");

// Function FortniteUI.FortAthenaMatchmakingWidget.OnPlaylistRotatorChanged
// 0x0004 (0x0004 - 0x0000)
struct FortAthenaMatchmakingWidget_OnPlaylistRotatorChanged final
{
public:
	int32                                         PlaylistIndex;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMatchmakingWidget_OnPlaylistRotatorChanged) == 0x000004, "Wrong alignment on FortAthenaMatchmakingWidget_OnPlaylistRotatorChanged");
static_assert(sizeof(FortAthenaMatchmakingWidget_OnPlaylistRotatorChanged) == 0x000004, "Wrong size on FortAthenaMatchmakingWidget_OnPlaylistRotatorChanged");
static_assert(offsetof(FortAthenaMatchmakingWidget_OnPlaylistRotatorChanged, PlaylistIndex) == 0x000000, "Member 'FortAthenaMatchmakingWidget_OnPlaylistRotatorChanged::PlaylistIndex' has a wrong offset!");

// Function FortniteUI.FortAthenaMatchmakingWidget.SetCancelButtonState
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMatchmakingWidget_SetCancelButtonState final
{
public:
	bool                                          bIsMatchmaking;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMatchmakingWidget_SetCancelButtonState) == 0x000001, "Wrong alignment on FortAthenaMatchmakingWidget_SetCancelButtonState");
static_assert(sizeof(FortAthenaMatchmakingWidget_SetCancelButtonState) == 0x000001, "Wrong size on FortAthenaMatchmakingWidget_SetCancelButtonState");
static_assert(offsetof(FortAthenaMatchmakingWidget_SetCancelButtonState, bIsMatchmaking) == 0x000000, "Member 'FortAthenaMatchmakingWidget_SetCancelButtonState::bIsMatchmaking' has a wrong offset!");

// Function FortniteUI.FortAthenaMatchmakingWidget.SetCurrentPlaylist
// 0x0002 (0x0002 - 0x0000)
struct FortAthenaMatchmakingWidget_SetCurrentPlaylist final
{
public:
	EFortAthenaPlaylist                           NewPlaylist;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMatchmakingWidget_SetCurrentPlaylist) == 0x000001, "Wrong alignment on FortAthenaMatchmakingWidget_SetCurrentPlaylist");
static_assert(sizeof(FortAthenaMatchmakingWidget_SetCurrentPlaylist) == 0x000002, "Wrong size on FortAthenaMatchmakingWidget_SetCurrentPlaylist");
static_assert(offsetof(FortAthenaMatchmakingWidget_SetCurrentPlaylist, NewPlaylist) == 0x000000, "Member 'FortAthenaMatchmakingWidget_SetCurrentPlaylist::NewPlaylist' has a wrong offset!");
static_assert(offsetof(FortAthenaMatchmakingWidget_SetCurrentPlaylist, ReturnValue) == 0x000001, "Member 'FortAthenaMatchmakingWidget_SetCurrentPlaylist::ReturnValue' has a wrong offset!");

// Function FortniteUI.FortAthenaMatchmakingWidget.SetPlayButtonState
// 0x0001 (0x0001 - 0x0000)
struct FortAthenaMatchmakingWidget_SetPlayButtonState final
{
public:
	bool                                          bCanMatchmake;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortAthenaMatchmakingWidget_SetPlayButtonState) == 0x000001, "Wrong alignment on FortAthenaMatchmakingWidget_SetPlayButtonState");
static_assert(sizeof(FortAthenaMatchmakingWidget_SetPlayButtonState) == 0x000001, "Wrong size on FortAthenaMatchmakingWidget_SetPlayButtonState");
static_assert(offsetof(FortAthenaMatchmakingWidget_SetPlayButtonState, bCanMatchmake) == 0x000000, "Member 'FortAthenaMatchmakingWidget_SetPlayButtonState::bCanMatchmake' has a wrong offset!");

// Function FortniteUI.FortHUDElementWidget.HandleOnHUDElementVisibilityChanged
// 0x0020 (0x0020 - 0x0000)
struct FortHUDElementWidget_HandleOnHUDElementVisibilityChanged final
{
public:
	struct FGameplayTagContainer                  HiddenHUDElementTags;                              // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortHUDElementWidget_HandleOnHUDElementVisibilityChanged) == 0x000008, "Wrong alignment on FortHUDElementWidget_HandleOnHUDElementVisibilityChanged");
static_assert(sizeof(FortHUDElementWidget_HandleOnHUDElementVisibilityChanged) == 0x000020, "Wrong size on FortHUDElementWidget_HandleOnHUDElementVisibilityChanged");
static_assert(offsetof(FortHUDElementWidget_HandleOnHUDElementVisibilityChanged, HiddenHUDElementTags) == 0x000000, "Member 'FortHUDElementWidget_HandleOnHUDElementVisibilityChanged::HiddenHUDElementTags' has a wrong offset!");

// Function FortniteUI.FortHUDElementWidget.OnVisibilitySetEvent
// 0x0001 (0x0001 - 0x0000)
struct FortHUDElementWidget_OnVisibilitySetEvent final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FortHUDElementWidget_OnVisibilitySetEvent) == 0x000001, "Wrong alignment on FortHUDElementWidget_OnVisibilitySetEvent");
static_assert(sizeof(FortHUDElementWidget_OnVisibilitySetEvent) == 0x000001, "Wrong size on FortHUDElementWidget_OnVisibilitySetEvent");
static_assert(offsetof(FortHUDElementWidget_OnVisibilitySetEvent, InVisibility) == 0x000000, "Member 'FortHUDElementWidget_OnVisibilitySetEvent::InVisibility' has a wrong offset!");

// Function FortniteUI.UINavigationManager.GetDisplayName
// 0x0020 (0x0020 - 0x0000)
struct UINavigationManager_GetDisplayName final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(UINavigationManager_GetDisplayName) == 0x000008, "Wrong alignment on UINavigationManager_GetDisplayName");
static_assert(sizeof(UINavigationManager_GetDisplayName) == 0x000020, "Wrong size on UINavigationManager_GetDisplayName");
static_assert(offsetof(UINavigationManager_GetDisplayName, Param_Index) == 0x000000, "Member 'UINavigationManager_GetDisplayName::Param_Index' has a wrong offset!");
static_assert(offsetof(UINavigationManager_GetDisplayName, ReturnValue) == 0x000008, "Member 'UINavigationManager_GetDisplayName::ReturnValue' has a wrong offset!");

// Function FortniteUI.UINavigationManager.GetStackSize
// 0x0004 (0x0004 - 0x0000)
struct UINavigationManager_GetStackSize final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UINavigationManager_GetStackSize) == 0x000004, "Wrong alignment on UINavigationManager_GetStackSize");
static_assert(sizeof(UINavigationManager_GetStackSize) == 0x000004, "Wrong size on UINavigationManager_GetStackSize");
static_assert(offsetof(UINavigationManager_GetStackSize, ReturnValue) == 0x000000, "Member 'UINavigationManager_GetStackSize::ReturnValue' has a wrong offset!");

// Function FortniteUI.UINavigationManager.NavigationToIndex
// 0x0004 (0x0004 - 0x0000)
struct UINavigationManager_NavigationToIndex final
{
public:
