#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Frontend_Lobby

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Frontend_Lobby.Frontend_Lobby_C
// 0x0018 (0x0398 - 0x0380)
class AFrontend_Lobby_C final : public AFortLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(Transient, DuplicateTransient)
	class FName                                   CurrentBackgroundLevelName;                        // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NewBackgroundLevelName;                            // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Frontend_Lobby(int32 EntryPoint);
	void OnBackgroundChanged();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Frontend_Lobby_C">();
	}
	static class AFrontend_Lobby_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFrontend_Lobby_C>();
	}
};
static_assert(alignof(AFrontend_Lobby_C) == 0x000008, "Wrong alignment on AFrontend_Lobby_C");
static_assert(sizeof(AFrontend_Lobby_C) == 0x000398, "Wrong size on AFrontend_Lobby_C");
static_assert(offsetof(AFrontend_Lobby_C, UberGraphFrame) == 0x000380, "Member 'AFrontend_Lobby_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_C, CurrentBackgroundLevelName) == 0x000388, "Member 'AFrontend_Lobby_C::CurrentBackgroundLevelName' has a wrong offset!");
static_assert(offsetof(AFrontend_Lobby_C, NewBackgroundLevelName) == 0x000390, "Member 'AFrontend_Lobby_C::NewBackgroundLevelName' has a wrong offset!");

}

