#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FullPartyMemberAthena

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FullPartyMemberAthena.FullPartyMemberAthena_C.ExecuteUbergraph_FullPartyMemberAthena
// 0x02E8 (0x02E8 - 0x0000)
struct FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TArray<bool>& MutedStates)>    K2Node_CreateDelegate_OutputDelegate3;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TArray<bool>& TalkingStates)>  K2Node_CreateDelegate_OutputDelegate4;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_PlayerController_C*             K2Node_DynamicCast_AsAthena_Player_Controller;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetSquadKills_Kills;                      // 0x0080(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<bool>                                  CallFunc_GetSquadMuted_MutedStates;                // 0x0090(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<bool>                                  CallFunc_GetSquadTalking_TalkingStates;            // 0x00A0(0x0010)(ZeroConstructor, ReferenceParm)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue2;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaHUDContext*                      CallFunc_GetContext_ReturnValue2;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerStateAthena*                 CallFunc_Array_Get_Item;                           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetPlatformUniqueNetId_ReturnValue;       // 0x00E0(0x0028)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x6];                                      // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTeamMemberInfo                    K2Node_Event_NewInfo;                              // 0x0118(0x01A8)()
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x02C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(TArray<int32>& Kills)>         K2Node_CreateDelegate_OutputDelegate6;             // 0x02D0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_StartsWith_ReturnValue;                   // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena) == 0x000008, "Wrong alignment on FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena");
static_assert(sizeof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena) == 0x0002E8, "Wrong size on FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, EntryPoint) == 0x000000, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::EntryPoint' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, K2Node_CreateDelegate_OutputDelegate3) == 0x000030, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, K2Node_CreateDelegate_OutputDelegate4) == 0x000040, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, K2Node_CreateDelegate_OutputDelegate5) == 0x000050, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, K2Node_Event_IsDesignTime) == 0x000060, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, CallFunc_GetOwningPlayer_ReturnValue) == 0x000068, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, K2Node_DynamicCast_AsAthena_Player_Controller) == 0x000070, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::K2Node_DynamicCast_AsAthena_Player_Controller' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, CallFunc_GetSquadKills_Kills) == 0x000080, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::CallFunc_GetSquadKills_Kills' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, CallFunc_GetSquadMuted_MutedStates) == 0x000090, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::CallFunc_GetSquadMuted_MutedStates' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, CallFunc_GetSquadTalking_TalkingStates) == 0x0000A0, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::CallFunc_GetSquadTalking_TalkingStates' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, CallFunc_GetOwningPlayer_ReturnValue2) == 0x0000B0, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::CallFunc_GetOwningPlayer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x0000B8, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, K2Node_DynamicCast_bSuccess2) == 0x0000C0, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, CallFunc_GetContext_ReturnValue2) == 0x0000C8, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, CallFunc_IsValid_ReturnValue) == 0x0000D8, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, CallFunc_GetPlatformUniqueNetId_ReturnValue) == 0x0000E0, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::CallFunc_GetPlatformUniqueNetId_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, CallFunc_GetOwner_ReturnValue) == 0x000108, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000110, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000111, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, K2Node_Event_NewInfo) == 0x000118, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::K2Node_Event_NewInfo' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, CallFunc_GetPlatformName_ReturnValue) == 0x0002C0, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, K2Node_CreateDelegate_OutputDelegate6) == 0x0002D0, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena, CallFunc_StartsWith_ReturnValue) == 0x0002E0, "Member 'FullPartyMemberAthena_C_ExecuteUbergraph_FullPartyMemberAthena::CallFunc_StartsWith_ReturnValue' has a wrong offset!");

// Function FullPartyMemberAthena.FullPartyMemberAthena_C.OnPlayerInfoChanged
// 0x01A8 (0x01A8 - 0x0000)
struct FullPartyMemberAthena_C_OnPlayerInfoChanged final
{
public:
	struct FFortTeamMemberInfo                    NewInfo;                                           // 0x0000(0x01A8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(FullPartyMemberAthena_C_OnPlayerInfoChanged) == 0x000008, "Wrong alignment on FullPartyMemberAthena_C_OnPlayerInfoChanged");
static_assert(sizeof(FullPartyMemberAthena_C_OnPlayerInfoChanged) == 0x0001A8, "Wrong size on FullPartyMemberAthena_C_OnPlayerInfoChanged");
static_assert(offsetof(FullPartyMemberAthena_C_OnPlayerInfoChanged, NewInfo) == 0x000000, "Member 'FullPartyMemberAthena_C_OnPlayerInfoChanged::NewInfo' has a wrong offset!");

// Function FullPartyMemberAthena.FullPartyMemberAthena_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct FullPartyMemberAthena_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FullPartyMemberAthena_C_PreConstruct) == 0x000001, "Wrong alignment on FullPartyMemberAthena_C_PreConstruct");
static_assert(sizeof(FullPartyMemberAthena_C_PreConstruct) == 0x000001, "Wrong size on FullPartyMemberAthena_C_PreConstruct");
static_assert(offsetof(FullPartyMemberAthena_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'FullPartyMemberAthena_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function FullPartyMemberAthena.FullPartyMemberAthena_C.UpdateMemberInfo
// 0x01B8 (0x01B8 - 0x0000)
struct FullPartyMemberAthena_C_UpdateMemberInfo final
{
public:
	struct FFortTeamMemberInfo                    NewMemberInfo;                                     // 0x0000(0x01A8)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortPartyMemberDisplayState                  CallFunc_GetPartyMemberDisplayState_ReturnValue;   // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FullPartyMemberAthena_C_UpdateMemberInfo) == 0x000008, "Wrong alignment on FullPartyMemberAthena_C_UpdateMemberInfo");
static_assert(sizeof(FullPartyMemberAthena_C_UpdateMemberInfo) == 0x0001B8, "Wrong size on FullPartyMemberAthena_C_UpdateMemberInfo");
static_assert(offsetof(FullPartyMemberAthena_C_UpdateMemberInfo, NewMemberInfo) == 0x000000, "Member 'FullPartyMemberAthena_C_UpdateMemberInfo::NewMemberInfo' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_UpdateMemberInfo, CallFunc_GetContext_ReturnValue) == 0x0001A8, "Member 'FullPartyMemberAthena_C_UpdateMemberInfo::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_UpdateMemberInfo, CallFunc_GetPartyMemberDisplayState_ReturnValue) == 0x0001B0, "Member 'FullPartyMemberAthena_C_UpdateMemberInfo::CallFunc_GetPartyMemberDisplayState_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_UpdateMemberInfo, K2Node_SwitchEnum_CmpSuccess) == 0x0001B1, "Member 'FullPartyMemberAthena_C_UpdateMemberInfo::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function FullPartyMemberAthena.FullPartyMemberAthena_C.ShowConnected
// 0x0048 (0x0048 - 0x0000)
struct FullPartyMemberAthena_C_ShowConnected final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerStateAthena*                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
};
static_assert(alignof(FullPartyMemberAthena_C_ShowConnected) == 0x000008, "Wrong alignment on FullPartyMemberAthena_C_ShowConnected");
static_assert(sizeof(FullPartyMemberAthena_C_ShowConnected) == 0x000048, "Wrong size on FullPartyMemberAthena_C_ShowConnected");
static_assert(offsetof(FullPartyMemberAthena_C_ShowConnected, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'FullPartyMemberAthena_C_ShowConnected::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ShowConnected, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000008, "Member 'FullPartyMemberAthena_C_ShowConnected::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ShowConnected, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'FullPartyMemberAthena_C_ShowConnected::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ShowConnected, CallFunc_Array_Get_Item) == 0x000018, "Member 'FullPartyMemberAthena_C_ShowConnected::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ShowConnected, CallFunc_GetPlayerName_ReturnValue) == 0x000020, "Member 'FullPartyMemberAthena_C_ShowConnected::CallFunc_GetPlayerName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_ShowConnected, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'FullPartyMemberAthena_C_ShowConnected::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function FullPartyMemberAthena.FullPartyMemberAthena_C.UpdateDimensions
// 0x0008 (0x0008 - 0x0000)
struct FullPartyMemberAthena_C_UpdateDimensions final
{
public:
	struct FVector2D                              NewDimensions;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyMemberAthena_C_UpdateDimensions) == 0x000004, "Wrong alignment on FullPartyMemberAthena_C_UpdateDimensions");
static_assert(sizeof(FullPartyMemberAthena_C_UpdateDimensions) == 0x000008, "Wrong size on FullPartyMemberAthena_C_UpdateDimensions");
static_assert(offsetof(FullPartyMemberAthena_C_UpdateDimensions, NewDimensions) == 0x000000, "Member 'FullPartyMemberAthena_C_UpdateDimensions::NewDimensions' has a wrong offset!");

// Function FullPartyMemberAthena.FullPartyMemberAthena_C.DuplicateConnectedWidget
// 0x0018 (0x0018 - 0x0000)
struct FullPartyMemberAthena_C_DuplicateConnectedWidget final
{
public:
	class UFullPartyMemberConnected_C*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFullPartyMemberConnected_C*            CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyMemberAthena_C_DuplicateConnectedWidget) == 0x000008, "Wrong alignment on FullPartyMemberAthena_C_DuplicateConnectedWidget");
static_assert(sizeof(FullPartyMemberAthena_C_DuplicateConnectedWidget) == 0x000018, "Wrong size on FullPartyMemberAthena_C_DuplicateConnectedWidget");
static_assert(offsetof(FullPartyMemberAthena_C_DuplicateConnectedWidget, ReturnValue) == 0x000000, "Member 'FullPartyMemberAthena_C_DuplicateConnectedWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_DuplicateConnectedWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'FullPartyMemberAthena_C_DuplicateConnectedWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_DuplicateConnectedWidget, CallFunc_Create_ReturnValue) == 0x000010, "Member 'FullPartyMemberAthena_C_DuplicateConnectedWidget::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function FullPartyMemberAthena.FullPartyMemberAthena_C.UpdateLocalPlayerAction
// 0x0028 (0x0028 - 0x0000)
struct FullPartyMemberAthena_C_UpdateLocalPlayerAction final
{
public:
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUITeamInfo*                        CallFunc_GetLocalPlayerTeam_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FUniqueNetIdRepl>               CallFunc_GetTeamMemberIDs_TeamMemberIDs;           // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FullPartyMemberAthena_C_UpdateLocalPlayerAction) == 0x000008, "Wrong alignment on FullPartyMemberAthena_C_UpdateLocalPlayerAction");
static_assert(sizeof(FullPartyMemberAthena_C_UpdateLocalPlayerAction) == 0x000028, "Wrong size on FullPartyMemberAthena_C_UpdateLocalPlayerAction");
static_assert(offsetof(FullPartyMemberAthena_C_UpdateLocalPlayerAction, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'FullPartyMemberAthena_C_UpdateLocalPlayerAction::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_UpdateLocalPlayerAction, CallFunc_GetLocalPlayerTeam_ReturnValue) == 0x000008, "Member 'FullPartyMemberAthena_C_UpdateLocalPlayerAction::CallFunc_GetLocalPlayerTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_UpdateLocalPlayerAction, CallFunc_GetTeamMemberIDs_TeamMemberIDs) == 0x000010, "Member 'FullPartyMemberAthena_C_UpdateLocalPlayerAction::CallFunc_GetTeamMemberIDs_TeamMemberIDs' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_UpdateLocalPlayerAction, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'FullPartyMemberAthena_C_UpdateLocalPlayerAction::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_UpdateLocalPlayerAction, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000024, "Member 'FullPartyMemberAthena_C_UpdateLocalPlayerAction::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function FullPartyMemberAthena.FullPartyMemberAthena_C.HandleLocalPlayerActionsResult
// 0x0028 (0x0028 - 0x0000)
struct FullPartyMemberAthena_C_HandleLocalPlayerActionsResult final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue2;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyMemberAthena_C_HandleLocalPlayerActionsResult) == 0x000008, "Wrong alignment on FullPartyMemberAthena_C_HandleLocalPlayerActionsResult");
static_assert(sizeof(FullPartyMemberAthena_C_HandleLocalPlayerActionsResult) == 0x000028, "Wrong size on FullPartyMemberAthena_C_HandleLocalPlayerActionsResult");
static_assert(offsetof(FullPartyMemberAthena_C_HandleLocalPlayerActionsResult, Result) == 0x000000, "Member 'FullPartyMemberAthena_C_HandleLocalPlayerActionsResult::Result' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_HandleLocalPlayerActionsResult, ResultName) == 0x000008, "Member 'FullPartyMemberAthena_C_HandleLocalPlayerActionsResult::ResultName' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_HandleLocalPlayerActionsResult, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'FullPartyMemberAthena_C_HandleLocalPlayerActionsResult::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_HandleLocalPlayerActionsResult, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'FullPartyMemberAthena_C_HandleLocalPlayerActionsResult::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_HandleLocalPlayerActionsResult, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000019, "Member 'FullPartyMemberAthena_C_HandleLocalPlayerActionsResult::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_HandleLocalPlayerActionsResult, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x00001A, "Member 'FullPartyMemberAthena_C_HandleLocalPlayerActionsResult::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_HandleLocalPlayerActionsResult, CallFunc_GetContext_ReturnValue2) == 0x000020, "Member 'FullPartyMemberAthena_C_HandleLocalPlayerActionsResult::CallFunc_GetContext_ReturnValue2' has a wrong offset!");

// Function FullPartyMemberAthena.FullPartyMemberAthena_C.MakeLocalPlayerConfirmActions
// 0x01B8 (0x01B8 - 0x0000)
struct FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions final
{
public:
	bool                                          LocalPlayerAlone;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConfirmationDialogAction>      OutConfirmActions;                                 // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor)
	TArray<struct FConfirmationDialogAction>      ConfirmActions;                                    // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue2;           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConfirmationDialogAction              K2Node_MakeStruct_ConfirmationDialogAction;        // 0x0040(0x00B8)()
	struct FConfirmationDialogAction              K2Node_MakeStruct_ConfirmationDialogAction2;       // 0x00F8(0x00B8)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions) == 0x000008, "Wrong alignment on FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions");
static_assert(sizeof(FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions) == 0x0001B8, "Wrong size on FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions");
static_assert(offsetof(FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions, LocalPlayerAlone) == 0x000000, "Member 'FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions::LocalPlayerAlone' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions, OutConfirmActions) == 0x000008, "Member 'FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions::OutConfirmActions' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions, ConfirmActions) == 0x000018, "Member 'FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions::ConfirmActions' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions, CallFunc_GetPlatformName_ReturnValue) == 0x000028, "Member 'FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000038, "Member 'FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions, CallFunc_EqualEqual_StrStr_ReturnValue2) == 0x000039, "Member 'FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions::CallFunc_EqualEqual_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions, CallFunc_BooleanOR_ReturnValue) == 0x00003A, "Member 'FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions, K2Node_MakeStruct_ConfirmationDialogAction) == 0x000040, "Member 'FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions::K2Node_MakeStruct_ConfirmationDialogAction' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions, K2Node_MakeStruct_ConfirmationDialogAction2) == 0x0000F8, "Member 'FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions::K2Node_MakeStruct_ConfirmationDialogAction2' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions, CallFunc_Array_Add_ReturnValue) == 0x0001B0, "Member 'FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions, CallFunc_Array_Add_ReturnValue2) == 0x0001B4, "Member 'FullPartyMemberAthena_C_MakeLocalPlayerConfirmActions::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");

// Function FullPartyMemberAthena.FullPartyMemberAthena_C.InitializeConnectedWidget
// 0x0008 (0x0008 - 0x0000)
struct FullPartyMemberAthena_C_InitializeConnectedWidget final
{
public:
	class UFullPartyMemberConnected_C*            ConnectedWidget;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyMemberAthena_C_InitializeConnectedWidget) == 0x000008, "Wrong alignment on FullPartyMemberAthena_C_InitializeConnectedWidget");
static_assert(sizeof(FullPartyMemberAthena_C_InitializeConnectedWidget) == 0x000008, "Wrong size on FullPartyMemberAthena_C_InitializeConnectedWidget");
static_assert(offsetof(FullPartyMemberAthena_C_InitializeConnectedWidget, ConnectedWidget) == 0x000000, "Member 'FullPartyMemberAthena_C_InitializeConnectedWidget::ConnectedWidget' has a wrong offset!");

// Function FullPartyMemberAthena.FullPartyMemberAthena_C.HandleAthenaTeamMemberChanged
// 0x0028 (0x0028 - 0x0000)
struct FullPartyMemberAthena_C_HandleAthenaTeamMemberChanged final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerStateAthena*                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FullPartyMemberAthena_C_HandleAthenaTeamMemberChanged) == 0x000008, "Wrong alignment on FullPartyMemberAthena_C_HandleAthenaTeamMemberChanged");
static_assert(sizeof(FullPartyMemberAthena_C_HandleAthenaTeamMemberChanged) == 0x000028, "Wrong size on FullPartyMemberAthena_C_HandleAthenaTeamMemberChanged");
static_assert(offsetof(FullPartyMemberAthena_C_HandleAthenaTeamMemberChanged, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'FullPartyMemberAthena_C_HandleAthenaTeamMemberChanged::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_HandleAthenaTeamMemberChanged, K2Node_DynamicCast_AsFort_Player_Controller_Athena) == 0x000008, "Member 'FullPartyMemberAthena_C_HandleAthenaTeamMemberChanged::K2Node_DynamicCast_AsFort_Player_Controller_Athena' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_HandleAthenaTeamMemberChanged, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'FullPartyMemberAthena_C_HandleAthenaTeamMemberChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_HandleAthenaTeamMemberChanged, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000011, "Member 'FullPartyMemberAthena_C_HandleAthenaTeamMemberChanged::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_HandleAthenaTeamMemberChanged, CallFunc_Array_Get_Item) == 0x000018, "Member 'FullPartyMemberAthena_C_HandleAthenaTeamMemberChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_HandleAthenaTeamMemberChanged, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'FullPartyMemberAthena_C_HandleAthenaTeamMemberChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_HandleAthenaTeamMemberChanged, CallFunc_BooleanAND_ReturnValue) == 0x000021, "Member 'FullPartyMemberAthena_C_HandleAthenaTeamMemberChanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function FullPartyMemberAthena.FullPartyMemberAthena_C.HandleAthenaTeamMemberMuteChanged
// 0x0018 (0x0018 - 0x0000)
struct FullPartyMemberAthena_C_HandleAthenaTeamMemberMuteChanged final
{
public:
	TArray<bool>                                  Mutes;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FullPartyMemberAthena_C_HandleAthenaTeamMemberMuteChanged) == 0x000008, "Wrong alignment on FullPartyMemberAthena_C_HandleAthenaTeamMemberMuteChanged");
static_assert(sizeof(FullPartyMemberAthena_C_HandleAthenaTeamMemberMuteChanged) == 0x000018, "Wrong size on FullPartyMemberAthena_C_HandleAthenaTeamMemberMuteChanged");
static_assert(offsetof(FullPartyMemberAthena_C_HandleAthenaTeamMemberMuteChanged, Mutes) == 0x000000, "Member 'FullPartyMemberAthena_C_HandleAthenaTeamMemberMuteChanged::Mutes' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_HandleAthenaTeamMemberMuteChanged, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000010, "Member 'FullPartyMemberAthena_C_HandleAthenaTeamMemberMuteChanged::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_HandleAthenaTeamMemberMuteChanged, CallFunc_Array_Get_Item) == 0x000011, "Member 'FullPartyMemberAthena_C_HandleAthenaTeamMemberMuteChanged::CallFunc_Array_Get_Item' has a wrong offset!");

// Function FullPartyMemberAthena.FullPartyMemberAthena_C.HandleAthenaTeamMemberTalkingChanged
// 0x0018 (0x0018 - 0x0000)
struct FullPartyMemberAthena_C_HandleAthenaTeamMemberTalkingChanged final
{
public:
	TArray<bool>                                  Talking;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FullPartyMemberAthena_C_HandleAthenaTeamMemberTalkingChanged) == 0x000008, "Wrong alignment on FullPartyMemberAthena_C_HandleAthenaTeamMemberTalkingChanged");
static_assert(sizeof(FullPartyMemberAthena_C_HandleAthenaTeamMemberTalkingChanged) == 0x000018, "Wrong size on FullPartyMemberAthena_C_HandleAthenaTeamMemberTalkingChanged");
static_assert(offsetof(FullPartyMemberAthena_C_HandleAthenaTeamMemberTalkingChanged, Talking) == 0x000000, "Member 'FullPartyMemberAthena_C_HandleAthenaTeamMemberTalkingChanged::Talking' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_HandleAthenaTeamMemberTalkingChanged, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000010, "Member 'FullPartyMemberAthena_C_HandleAthenaTeamMemberTalkingChanged::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_HandleAthenaTeamMemberTalkingChanged, CallFunc_Array_Get_Item) == 0x000011, "Member 'FullPartyMemberAthena_C_HandleAthenaTeamMemberTalkingChanged::CallFunc_Array_Get_Item' has a wrong offset!");

// Function FullPartyMemberAthena.FullPartyMemberAthena_C.SetTeamMemberIndex
// 0x0004 (0x0004 - 0x0000)
struct FullPartyMemberAthena_C_SetTeamMemberIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyMemberAthena_C_SetTeamMemberIndex) == 0x000004, "Wrong alignment on FullPartyMemberAthena_C_SetTeamMemberIndex");
static_assert(sizeof(FullPartyMemberAthena_C_SetTeamMemberIndex) == 0x000004, "Wrong size on FullPartyMemberAthena_C_SetTeamMemberIndex");
static_assert(offsetof(FullPartyMemberAthena_C_SetTeamMemberIndex, Param_Index) == 0x000000, "Member 'FullPartyMemberAthena_C_SetTeamMemberIndex::Param_Index' has a wrong offset!");

// Function FullPartyMemberAthena.FullPartyMemberAthena_C.HighlightEmptyBanner
// 0x0020 (0x0020 - 0x0000)
struct FullPartyMemberAthena_C_HighlightEmptyBanner final
{
public:
	bool                                          BannerIsHighlighted;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable2;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FullPartyMemberAthena_C_HighlightEmptyBanner) == 0x000008, "Wrong alignment on FullPartyMemberAthena_C_HighlightEmptyBanner");
static_assert(sizeof(FullPartyMemberAthena_C_HighlightEmptyBanner) == 0x000020, "Wrong size on FullPartyMemberAthena_C_HighlightEmptyBanner");
static_assert(offsetof(FullPartyMemberAthena_C_HighlightEmptyBanner, BannerIsHighlighted) == 0x000000, "Member 'FullPartyMemberAthena_C_HighlightEmptyBanner::BannerIsHighlighted' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_HighlightEmptyBanner, Temp_bool_Variable) == 0x000001, "Member 'FullPartyMemberAthena_C_HighlightEmptyBanner::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_HighlightEmptyBanner, Temp_object_Variable) == 0x000008, "Member 'FullPartyMemberAthena_C_HighlightEmptyBanner::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_HighlightEmptyBanner, Temp_object_Variable2) == 0x000010, "Member 'FullPartyMemberAthena_C_HighlightEmptyBanner::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_HighlightEmptyBanner, K2Node_Select_Default) == 0x000018, "Member 'FullPartyMemberAthena_C_HighlightEmptyBanner::K2Node_Select_Default' has a wrong offset!");

// Function FullPartyMemberAthena.FullPartyMemberAthena_C.HandleAthenaTeamMemberKillsChanged
// 0x0048 (0x0048 - 0x0000)
struct FullPartyMemberAthena_C_HandleAthenaTeamMemberKillsChanged final
{
public:
	TArray<int32>                                 Kills;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue2;              // 0x0030(0x0018)()
};
static_assert(alignof(FullPartyMemberAthena_C_HandleAthenaTeamMemberKillsChanged) == 0x000008, "Wrong alignment on FullPartyMemberAthena_C_HandleAthenaTeamMemberKillsChanged");
static_assert(sizeof(FullPartyMemberAthena_C_HandleAthenaTeamMemberKillsChanged) == 0x000048, "Wrong size on FullPartyMemberAthena_C_HandleAthenaTeamMemberKillsChanged");
static_assert(offsetof(FullPartyMemberAthena_C_HandleAthenaTeamMemberKillsChanged, Kills) == 0x000000, "Member 'FullPartyMemberAthena_C_HandleAthenaTeamMemberKillsChanged::Kills' has a wrong offset!");
static_assert(offsetof(FullPartyMemberAthena_C_HandleAthenaTeamMemberKillsChanged, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'FullPartyMemberAthena_C_HandleAthenaTeamMemberKillsChanged::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
