#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FullPartyBarAthena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FullPartyBarAthena.FullPartyBarAthena_C
// 0x0258 (0x0468 - 0x0210)
class UFullPartyBarAthena_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UHorizontalBox*                         PartyMembers;                                      // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         RemotePlayer0;                                     // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFullPartyMemberAthena_C*               RemotePlayer0_FPM;                                 // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         RemotePlayer1;                                     // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFullPartyMemberAthena_C*               RemotePlayer1_FPM;                                 // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         RemotePlayer2;                                     // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFullPartyMemberAthena_C*               RemotePlayer2_FPM;                                 // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         RemotePlayer3;                                     // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFullPartyMemberAthena_C*               RemotePlayer3_FPM;                                 // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFortTeamMemberInfo                    EmptyPartyMember;                                  // 0x0260(0x01A8)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FConfirmationDialogAction>      PrivacyConfirmOptions;                             // 0x0408(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FName                                   DeclineAction;                                     // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Public;                                            // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Friends;                                           // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Private;                                           // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPartyFinder_C*                         PartyFinder;                                       // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrivacyWidget_C*                       PrivacyWidget;                                     // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnButtonHovered;                                   // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FFriendCode>                    FriendCodes;                                       // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void OnButtonHovered__DelegateSignature(const class FText& HelpText);
	void ExecuteUbergraph_FullPartyBarAthena(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__LocalPlayer_K2Node_ComponentBoundEvent_178_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__LocalPlayer_K2Node_ComponentBoundEvent_14_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_13_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_12_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_10_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_9_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Destruct();
	void BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__LocalPlayer_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void BindDelegates();
	void Initialize();
	void HandlePartybarUIFeatureChanged(EFortUIFeature Feature, EFortUIFeatureState FeatureState, EFortUIFeatureStateReason Reason);
	void OpenPartyPrivacy();
	bool IsTeammateSlotPopulated(int32 InSlotNUmber);
	void GetTotalNumFriendCodes(int32* Num_Codes);
	class UWidget* Get_Fortitude_ToolTipWidget();
	class UWidget* Get_Offense_ToolTipWidget();
	class UWidget* Get_Resistance_ToolTipWidget();
	class UWidget* Get_Tech_ToolTipWidget();
	bool GetTooltipStat(const struct FGameplayTag& Token, struct FFortDisplayAttribute* OutDisplayAttribute);
	void GetHoverText(int32 PlayerIndex, class FText* Output);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FullPartyBarAthena_C">();
	}
	static class UFullPartyBarAthena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFullPartyBarAthena_C>();
	}
};
static_assert(alignof(UFullPartyBarAthena_C) == 0x000008, "Wrong alignment on UFullPartyBarAthena_C");
static_assert(sizeof(UFullPartyBarAthena_C) == 0x000468, "Wrong size on UFullPartyBarAthena_C");
static_assert(offsetof(UFullPartyBarAthena_C, UberGraphFrame) == 0x000210, "Member 'UFullPartyBarAthena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFullPartyBarAthena_C, PartyMembers) == 0x000218, "Member 'UFullPartyBarAthena_C::PartyMembers' has a wrong offset!");
static_assert(offsetof(UFullPartyBarAthena_C, RemotePlayer0) == 0x000220, "Member 'UFullPartyBarAthena_C::RemotePlayer0' has a wrong offset!");
static_assert(offsetof(UFullPartyBarAthena_C, RemotePlayer0_FPM) == 0x000228, "Member 'UFullPartyBarAthena_C::RemotePlayer0_FPM' has a wrong offset!");
static_assert(offsetof(UFullPartyBarAthena_C, RemotePlayer1) == 0x000230, "Member 'UFullPartyBarAthena_C::RemotePlayer1' has a wrong offset!");
static_assert(offsetof(UFullPartyBarAthena_C, RemotePlayer1_FPM) == 0x000238, "Member 'UFullPartyBarAthena_C::RemotePlayer1_FPM' has a wrong offset!");
static_assert(offsetof(UFullPartyBarAthena_C, RemotePlayer2) == 0x000240, "Member 'UFullPartyBarAthena_C::RemotePlayer2' has a wrong offset!");
static_assert(offsetof(UFullPartyBarAthena_C, RemotePlayer2_FPM) == 0x000248, "Member 'UFullPartyBarAthena_C::RemotePlayer2_FPM' has a wrong offset!");
static_assert(offsetof(UFullPartyBarAthena_C, RemotePlayer3) == 0x000250, "Member 'UFullPartyBarAthena_C::RemotePlayer3' has a wrong offset!");
static_assert(offsetof(UFullPartyBarAthena_C, RemotePlayer3_FPM) == 0x000258, "Member 'UFullPartyBarAthena_C::RemotePlayer3_FPM' has a wrong offset!");
static_assert(offsetof(UFullPartyBarAthena_C, EmptyPartyMember) == 0x000260, "Member 'UFullPartyBarAthena_C::EmptyPartyMember' has a wrong offset!");
static_assert(offsetof(UFullPartyBarAthena_C, PrivacyConfirmOptions) == 0x000408, "Member 'UFullPartyBarAthena_C::PrivacyConfirmOptions' has a wrong offset!");
static_assert(offsetof(UFullPartyBarAthena_C, DeclineAction) == 0x000418, "Member 'UFullPartyBarAthena_C::DeclineAction' has a wrong offset!");
static_assert(offsetof(UFullPartyBarAthena_C, Public) == 0x000420, "Member 'UFullPartyBarAthena_C::Public' has a wrong offset!");
static_assert(offsetof(UFullPartyBarAthena_C, Friends) == 0x000428, "Member 'UFullPartyBarAthena_C::Friends' has a wrong offset!");
static_assert(offsetof(UFullPartyBarAthena_C, Private) == 0x000430, "Member 'UFullPartyBarAthena_C::Private' has a wrong offset!");
static_assert(offsetof(UFullPartyBarAthena_C, PartyFinder) == 0x000438, "Member 'UFullPartyBarAthena_C::PartyFinder' has a wrong offset!");
static_assert(offsetof(UFullPartyBarAthena_C, PrivacyWidget) == 0x000440, "Member 'UFullPartyBarAthena_C::PrivacyWidget' has a wrong offset!");
static_assert(offsetof(UFullPartyBarAthena_C, OnButtonHovered) == 0x000448, "Member 'UFullPartyBarAthena_C::OnButtonHovered' has a wrong offset!");
static_assert(offsetof(UFullPartyBarAthena_C, FriendCodes) == 0x000458, "Member 'UFullPartyBarAthena_C::FriendCodes' has a wrong offset!");

}

