#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FullPartyBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FullPartyBar.FullPartyBar_C
// 0x02B8 (0x04C8 - 0x0210)
class UFullPartyBar_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UCommonBorder*                          Fortitude;                                         // 0x0218(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FortitudeImage;                                    // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       FortitudeText;                                     // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         LocalPlayer;                                       // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFullPartyMember_C*                     LocalPlayer_FPM;                                   // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          Offense;                                           // 0x0240(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OffenseImage;                                      // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       OffenseText;                                       // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         RemotePlayer1;                                     // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFullPartyMember_C*                     RemotePlayer1_FPM;                                 // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         RemotePlayer2;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFullPartyMember_C*                     RemotePlayer2_FPM;                                 // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanelButton_C*                         RemotePlayer3;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFullPartyMember_C*                     RemotePlayer3_FPM;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          Resistance;                                        // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ResistanceImage;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ResistanceText;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          Tech;                                              // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TechImage;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TechText;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortUITeamInfo*                        LocalTeam;                                         // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortTeamMemberInfo                    EmptyPartyMember;                                  // 0x02C0(0x01A8)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FConfirmationDialogAction>      PrivacyConfirmOptions;                             // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FName                                   DeclineAction;                                     // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Public;                                            // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Friends;                                           // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Private;                                           // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPartyFinder_C*                         PartyFinder;                                       // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrivacyWidget_C*                       PrivacyWidget;                                     // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnButtonHovered;                                   // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FFriendCode>                    FriendCodes;                                       // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void OnButtonHovered__DelegateSignature(const class FText& HelpText);
	void ExecuteUbergraph_FullPartyBar(int32 EntryPoint);
	void BndEvt__LocalPlayer_K2Node_ComponentBoundEvent_14_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_13_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_12_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_11_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_10_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_9_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Destruct();
	void BndEvt__RemotePlayer3_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__RemotePlayer2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__RemotePlayer1_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__LocalPlayer_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void BindDelegates();
	void Initialize();
	void HandlePartybarUIFeatureChanged(EFortUIFeature Feature, EFortUIFeatureState FeatureState, EFortUIFeatureStateReason Reason);
	void OpenPartyPrivacy();
	bool IsTeammateSlotPopulated(int32 InSlotNUmber);
	void GetTotalNumFriendCodes(int32* Num_Codes);
	class UWidget* Get_Fortitude_ToolTipWidget();
	class UWidget* Get_Offense_ToolTipWidget();
	class UWidget* Get_Resistance_ToolTipWidget();
	class UWidget* Get_Tech_ToolTipWidget();
	void InitializeStatLabels();
	bool GetTooltipStat(const struct FGameplayTag& Token, struct FFortDisplayAttribute* OutDisplayAttribute);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FullPartyBar_C">();
	}
	static class UFullPartyBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFullPartyBar_C>();
	}
};
static_assert(alignof(UFullPartyBar_C) == 0x000008, "Wrong alignment on UFullPartyBar_C");
static_assert(sizeof(UFullPartyBar_C) == 0x0004C8, "Wrong size on UFullPartyBar_C");
static_assert(offsetof(UFullPartyBar_C, UberGraphFrame) == 0x000210, "Member 'UFullPartyBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, Fortitude) == 0x000218, "Member 'UFullPartyBar_C::Fortitude' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, FortitudeImage) == 0x000220, "Member 'UFullPartyBar_C::FortitudeImage' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, FortitudeText) == 0x000228, "Member 'UFullPartyBar_C::FortitudeText' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, LocalPlayer) == 0x000230, "Member 'UFullPartyBar_C::LocalPlayer' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, LocalPlayer_FPM) == 0x000238, "Member 'UFullPartyBar_C::LocalPlayer_FPM' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, Offense) == 0x000240, "Member 'UFullPartyBar_C::Offense' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, OffenseImage) == 0x000248, "Member 'UFullPartyBar_C::OffenseImage' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, OffenseText) == 0x000250, "Member 'UFullPartyBar_C::OffenseText' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, RemotePlayer1) == 0x000258, "Member 'UFullPartyBar_C::RemotePlayer1' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, RemotePlayer1_FPM) == 0x000260, "Member 'UFullPartyBar_C::RemotePlayer1_FPM' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, RemotePlayer2) == 0x000268, "Member 'UFullPartyBar_C::RemotePlayer2' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, RemotePlayer2_FPM) == 0x000270, "Member 'UFullPartyBar_C::RemotePlayer2_FPM' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, RemotePlayer3) == 0x000278, "Member 'UFullPartyBar_C::RemotePlayer3' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, RemotePlayer3_FPM) == 0x000280, "Member 'UFullPartyBar_C::RemotePlayer3_FPM' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, Resistance) == 0x000288, "Member 'UFullPartyBar_C::Resistance' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, ResistanceImage) == 0x000290, "Member 'UFullPartyBar_C::ResistanceImage' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, ResistanceText) == 0x000298, "Member 'UFullPartyBar_C::ResistanceText' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, Tech) == 0x0002A0, "Member 'UFullPartyBar_C::Tech' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, TechImage) == 0x0002A8, "Member 'UFullPartyBar_C::TechImage' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, TechText) == 0x0002B0, "Member 'UFullPartyBar_C::TechText' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, LocalTeam) == 0x0002B8, "Member 'UFullPartyBar_C::LocalTeam' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, EmptyPartyMember) == 0x0002C0, "Member 'UFullPartyBar_C::EmptyPartyMember' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, PrivacyConfirmOptions) == 0x000468, "Member 'UFullPartyBar_C::PrivacyConfirmOptions' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, DeclineAction) == 0x000478, "Member 'UFullPartyBar_C::DeclineAction' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, Public) == 0x000480, "Member 'UFullPartyBar_C::Public' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, Friends) == 0x000488, "Member 'UFullPartyBar_C::Friends' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, Private) == 0x000490, "Member 'UFullPartyBar_C::Private' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, PartyFinder) == 0x000498, "Member 'UFullPartyBar_C::PartyFinder' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, PrivacyWidget) == 0x0004A0, "Member 'UFullPartyBar_C::PrivacyWidget' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, OnButtonHovered) == 0x0004A8, "Member 'UFullPartyBar_C::OnButtonHovered' has a wrong offset!");
static_assert(offsetof(UFullPartyBar_C, FriendCodes) == 0x0004B8, "Member 'UFullPartyBar_C::FriendCodes' has a wrong offset!");

}

