#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Medkit

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_Medkit.GA_Athena_Medkit_C.ExecuteUbergraph_GA_Athena_Medkit
// 0x0230 (0x0230 - 0x0000)
struct GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x0008(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0040(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable2;                             // 0x0080(0x0020)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData3;                    // 0x00A0(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag3;                // 0x00C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate3;             // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue2;            // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x00E0(0x0040)(ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0138(0x0020)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0158(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x016C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_MakeStruct_GameplayCueParameters;           // 0x0178(0x00B8)(ContainsInstancedReference)
};
static_assert(alignof(GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit) == 0x000008, "Wrong alignment on GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit");
static_assert(sizeof(GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit) == 0x000230, "Wrong size on GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit");
static_assert(offsetof(GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit, EntryPoint) == 0x000000, "Member 'GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit, K2Node_CustomEvent_TargetData2) == 0x000008, "Member 'GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit, K2Node_CustomEvent_ApplicationTag2) == 0x000028, "Member 'GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit, K2Node_CustomEvent_TargetData) == 0x000040, "Member 'GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit, K2Node_CustomEvent_ApplicationTag) == 0x000060, "Member 'GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit, K2Node_CreateDelegate_OutputDelegate2) == 0x000068, "Member 'GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit, Temp_struct_Variable) == 0x000078, "Member 'GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit, Temp_struct_Variable2) == 0x000080, "Member 'GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit, K2Node_CustomEvent_TargetData3) == 0x0000A0, "Member 'GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit::K2Node_CustomEvent_TargetData3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit, K2Node_CustomEvent_ApplicationTag3) == 0x0000C0, "Member 'GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit::K2Node_CustomEvent_ApplicationTag3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit, K2Node_CreateDelegate_OutputDelegate3) == 0x0000C8, "Member 'GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit, CallFunc_K2_CommitAbility_ReturnValue) == 0x0000D8, "Member 'GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit, CallFunc_K2_CommitAbility_ReturnValue2) == 0x0000D9, "Member 'GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit::CallFunc_K2_CommitAbility_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit, CallFunc_GetActorInfo_ReturnValue) == 0x0000E0, "Member 'GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000120, "Member 'GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit, K2Node_DynamicCast_bSuccess) == 0x000128, "Member 'GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x000130, "Member 'GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000138, "Member 'GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000158, "Member 'GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit, CallFunc_IsValid_ReturnValue) == 0x000168, "Member 'GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00016C, "Member 'GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit, K2Node_MakeStruct_GameplayCueParameters) == 0x000178, "Member 'GA_Athena_Medkit_C_ExecuteUbergraph_GA_Athena_Medkit::K2Node_MakeStruct_GameplayCueParameters' has a wrong offset!");

// Function GA_Athena_Medkit.GA_Athena_Medkit_C.Triggered_4F161F934DDA0C407BD9A48EEEE7DDCE
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Medkit_C_Triggered_4F161F934DDA0C407BD9A48EEEE7DDCE final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Medkit_C_Triggered_4F161F934DDA0C407BD9A48EEEE7DDCE) == 0x000008, "Wrong alignment on GA_Athena_Medkit_C_Triggered_4F161F934DDA0C407BD9A48EEEE7DDCE");
static_assert(sizeof(GA_Athena_Medkit_C_Triggered_4F161F934DDA0C407BD9A48EEEE7DDCE) == 0x000028, "Wrong size on GA_Athena_Medkit_C_Triggered_4F161F934DDA0C407BD9A48EEEE7DDCE");
static_assert(offsetof(GA_Athena_Medkit_C_Triggered_4F161F934DDA0C407BD9A48EEEE7DDCE, TargetData) == 0x000000, "Member 'GA_Athena_Medkit_C_Triggered_4F161F934DDA0C407BD9A48EEEE7DDCE::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_Triggered_4F161F934DDA0C407BD9A48EEEE7DDCE, ApplicationTag) == 0x000020, "Member 'GA_Athena_Medkit_C_Triggered_4F161F934DDA0C407BD9A48EEEE7DDCE::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Medkit.GA_Athena_Medkit_C.Cancelled_4F161F934DDA0C407BD9A48EEEE7DDCE
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Medkit_C_Cancelled_4F161F934DDA0C407BD9A48EEEE7DDCE final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Medkit_C_Cancelled_4F161F934DDA0C407BD9A48EEEE7DDCE) == 0x000008, "Wrong alignment on GA_Athena_Medkit_C_Cancelled_4F161F934DDA0C407BD9A48EEEE7DDCE");
static_assert(sizeof(GA_Athena_Medkit_C_Cancelled_4F161F934DDA0C407BD9A48EEEE7DDCE) == 0x000028, "Wrong size on GA_Athena_Medkit_C_Cancelled_4F161F934DDA0C407BD9A48EEEE7DDCE");
static_assert(offsetof(GA_Athena_Medkit_C_Cancelled_4F161F934DDA0C407BD9A48EEEE7DDCE, TargetData) == 0x000000, "Member 'GA_Athena_Medkit_C_Cancelled_4F161F934DDA0C407BD9A48EEEE7DDCE::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_Cancelled_4F161F934DDA0C407BD9A48EEEE7DDCE, ApplicationTag) == 0x000020, "Member 'GA_Athena_Medkit_C_Cancelled_4F161F934DDA0C407BD9A48EEEE7DDCE::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Medkit.GA_Athena_Medkit_C.Completed_4F161F934DDA0C407BD9A48EEEE7DDCE
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Medkit_C_Completed_4F161F934DDA0C407BD9A48EEEE7DDCE final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Medkit_C_Completed_4F161F934DDA0C407BD9A48EEEE7DDCE) == 0x000008, "Wrong alignment on GA_Athena_Medkit_C_Completed_4F161F934DDA0C407BD9A48EEEE7DDCE");
static_assert(sizeof(GA_Athena_Medkit_C_Completed_4F161F934DDA0C407BD9A48EEEE7DDCE) == 0x000028, "Wrong size on GA_Athena_Medkit_C_Completed_4F161F934DDA0C407BD9A48EEEE7DDCE");
static_assert(offsetof(GA_Athena_Medkit_C_Completed_4F161F934DDA0C407BD9A48EEEE7DDCE, TargetData) == 0x000000, "Member 'GA_Athena_Medkit_C_Completed_4F161F934DDA0C407BD9A48EEEE7DDCE::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_Completed_4F161F934DDA0C407BD9A48EEEE7DDCE, ApplicationTag) == 0x000020, "Member 'GA_Athena_Medkit_C_Completed_4F161F934DDA0C407BD9A48EEEE7DDCE::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Medkit.GA_Athena_Medkit_C.K2_CanActivateAbility
// 0x0088 (0x0088 - 0x0000)
struct GA_Athena_Medkit_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0040(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_Medkit_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_Athena_Medkit_C_K2_CanActivateAbility");
static_assert(sizeof(GA_Athena_Medkit_C_K2_CanActivateAbility) == 0x000088, "Wrong size on GA_Athena_Medkit_C_K2_CanActivateAbility");
static_assert(offsetof(GA_Athena_Medkit_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_Athena_Medkit_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_K2_CanActivateAbility, RelevantTags) == 0x000040, "Member 'GA_Athena_Medkit_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_K2_CanActivateAbility, ReturnValue) == 0x000060, "Member 'GA_Athena_Medkit_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_K2_CanActivateAbility, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000068, "Member 'GA_Athena_Medkit_C_K2_CanActivateAbility::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_K2_CanActivateAbility, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'GA_Athena_Medkit_C_K2_CanActivateAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_K2_CanActivateAbility, CallFunc_GetHealth_ReturnValue) == 0x000074, "Member 'GA_Athena_Medkit_C_K2_CanActivateAbility::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_K2_CanActivateAbility, CallFunc_GetMaxHealth_ReturnValue) == 0x000078, "Member 'GA_Athena_Medkit_C_K2_CanActivateAbility::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_K2_CanActivateAbility, CallFunc_FCeil_ReturnValue) == 0x00007C, "Member 'GA_Athena_Medkit_C_K2_CanActivateAbility::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_K2_CanActivateAbility, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000080, "Member 'GA_Athena_Medkit_C_K2_CanActivateAbility::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Medkit_C_K2_CanActivateAbility, CallFunc_Less_FloatFloat_ReturnValue) == 0x000084, "Member 'GA_Athena_Medkit_C_K2_CanActivateAbility::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

}

