#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Bandage

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_Bandage.GA_Athena_Bandage_C.ExecuteUbergraph_GA_Athena_Bandage
// 0x0240 (0x0240 - 0x0000)
struct GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_MakeStruct_GameplayCueParameters;           // 0x0008(0x00B8)(ContainsInstancedReference)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x00D0(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x00F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x00F8(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0130(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable2;                             // 0x0138(0x0020)()
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData3;                    // 0x0158(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag3;                // 0x0178(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0180(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue2;            // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0198(0x0040)(ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x01F0(0x0020)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0210(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0234(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage) == 0x000008, "Wrong alignment on GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage");
static_assert(sizeof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage) == 0x000240, "Wrong size on GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, EntryPoint) == 0x000000, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, K2Node_MakeStruct_GameplayCueParameters) == 0x000008, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::K2Node_MakeStruct_GameplayCueParameters' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, K2Node_CreateDelegate_OutputDelegate) == 0x0000C0, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, K2Node_CustomEvent_TargetData2) == 0x0000D0, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, K2Node_CustomEvent_ApplicationTag2) == 0x0000F0, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, K2Node_CustomEvent_TargetData) == 0x0000F8, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, K2Node_CustomEvent_ApplicationTag) == 0x000118, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, K2Node_CreateDelegate_OutputDelegate2) == 0x000120, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, Temp_struct_Variable) == 0x000130, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, Temp_struct_Variable2) == 0x000138, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, K2Node_CustomEvent_TargetData3) == 0x000158, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::K2Node_CustomEvent_TargetData3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, K2Node_CustomEvent_ApplicationTag3) == 0x000178, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::K2Node_CustomEvent_ApplicationTag3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, K2Node_CreateDelegate_OutputDelegate3) == 0x000180, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, CallFunc_K2_CommitAbility_ReturnValue) == 0x000190, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, CallFunc_K2_CommitAbility_ReturnValue2) == 0x000191, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::CallFunc_K2_CommitAbility_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, CallFunc_GetActorInfo_ReturnValue) == 0x000198, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0001D8, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, K2Node_DynamicCast_bSuccess) == 0x0001E0, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x0001E8, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0001F0, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000210, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, CallFunc_IsValid_ReturnValue) == 0x000220, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, CallFunc_GetHealth_ReturnValue) == 0x000224, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000228, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, CallFunc_FClamp_ReturnValue) == 0x00022C, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, CallFunc_FTrunc_ReturnValue) == 0x000230, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000234, "Member 'GA_Athena_Bandage_C_ExecuteUbergraph_GA_Athena_Bandage::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

// Function GA_Athena_Bandage.GA_Athena_Bandage_C.Triggered_BFC97FED4C67D0ACBCFD4E8BA1BBAADF
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Bandage_C_Triggered_BFC97FED4C67D0ACBCFD4E8BA1BBAADF final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Bandage_C_Triggered_BFC97FED4C67D0ACBCFD4E8BA1BBAADF) == 0x000008, "Wrong alignment on GA_Athena_Bandage_C_Triggered_BFC97FED4C67D0ACBCFD4E8BA1BBAADF");
static_assert(sizeof(GA_Athena_Bandage_C_Triggered_BFC97FED4C67D0ACBCFD4E8BA1BBAADF) == 0x000028, "Wrong size on GA_Athena_Bandage_C_Triggered_BFC97FED4C67D0ACBCFD4E8BA1BBAADF");
static_assert(offsetof(GA_Athena_Bandage_C_Triggered_BFC97FED4C67D0ACBCFD4E8BA1BBAADF, TargetData) == 0x000000, "Member 'GA_Athena_Bandage_C_Triggered_BFC97FED4C67D0ACBCFD4E8BA1BBAADF::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_Triggered_BFC97FED4C67D0ACBCFD4E8BA1BBAADF, ApplicationTag) == 0x000020, "Member 'GA_Athena_Bandage_C_Triggered_BFC97FED4C67D0ACBCFD4E8BA1BBAADF::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Bandage.GA_Athena_Bandage_C.Cancelled_BFC97FED4C67D0ACBCFD4E8BA1BBAADF
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Bandage_C_Cancelled_BFC97FED4C67D0ACBCFD4E8BA1BBAADF final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Bandage_C_Cancelled_BFC97FED4C67D0ACBCFD4E8BA1BBAADF) == 0x000008, "Wrong alignment on GA_Athena_Bandage_C_Cancelled_BFC97FED4C67D0ACBCFD4E8BA1BBAADF");
static_assert(sizeof(GA_Athena_Bandage_C_Cancelled_BFC97FED4C67D0ACBCFD4E8BA1BBAADF) == 0x000028, "Wrong size on GA_Athena_Bandage_C_Cancelled_BFC97FED4C67D0ACBCFD4E8BA1BBAADF");
static_assert(offsetof(GA_Athena_Bandage_C_Cancelled_BFC97FED4C67D0ACBCFD4E8BA1BBAADF, TargetData) == 0x000000, "Member 'GA_Athena_Bandage_C_Cancelled_BFC97FED4C67D0ACBCFD4E8BA1BBAADF::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_Cancelled_BFC97FED4C67D0ACBCFD4E8BA1BBAADF, ApplicationTag) == 0x000020, "Member 'GA_Athena_Bandage_C_Cancelled_BFC97FED4C67D0ACBCFD4E8BA1BBAADF::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Bandage.GA_Athena_Bandage_C.Completed_BFC97FED4C67D0ACBCFD4E8BA1BBAADF
// 0x0028 (0x0028 - 0x0000)
struct GA_Athena_Bandage_C_Completed_BFC97FED4C67D0ACBCFD4E8BA1BBAADF final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Bandage_C_Completed_BFC97FED4C67D0ACBCFD4E8BA1BBAADF) == 0x000008, "Wrong alignment on GA_Athena_Bandage_C_Completed_BFC97FED4C67D0ACBCFD4E8BA1BBAADF");
static_assert(sizeof(GA_Athena_Bandage_C_Completed_BFC97FED4C67D0ACBCFD4E8BA1BBAADF) == 0x000028, "Wrong size on GA_Athena_Bandage_C_Completed_BFC97FED4C67D0ACBCFD4E8BA1BBAADF");
static_assert(offsetof(GA_Athena_Bandage_C_Completed_BFC97FED4C67D0ACBCFD4E8BA1BBAADF, TargetData) == 0x000000, "Member 'GA_Athena_Bandage_C_Completed_BFC97FED4C67D0ACBCFD4E8BA1BBAADF::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_Completed_BFC97FED4C67D0ACBCFD4E8BA1BBAADF, ApplicationTag) == 0x000020, "Member 'GA_Athena_Bandage_C_Completed_BFC97FED4C67D0ACBCFD4E8BA1BBAADF::ApplicationTag' has a wrong offset!");

// Function GA_Athena_Bandage.GA_Athena_Bandage_C.K2_CanActivateAbility
// 0x0088 (0x0088 - 0x0000)
struct GA_Athena_Bandage_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0040(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_Bandage_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_Athena_Bandage_C_K2_CanActivateAbility");
static_assert(sizeof(GA_Athena_Bandage_C_K2_CanActivateAbility) == 0x000088, "Wrong size on GA_Athena_Bandage_C_K2_CanActivateAbility");
static_assert(offsetof(GA_Athena_Bandage_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_Athena_Bandage_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_K2_CanActivateAbility, RelevantTags) == 0x000040, "Member 'GA_Athena_Bandage_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_K2_CanActivateAbility, ReturnValue) == 0x000060, "Member 'GA_Athena_Bandage_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_K2_CanActivateAbility, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000068, "Member 'GA_Athena_Bandage_C_K2_CanActivateAbility::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_K2_CanActivateAbility, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'GA_Athena_Bandage_C_K2_CanActivateAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_K2_CanActivateAbility, CallFunc_GetHealth_ReturnValue) == 0x000074, "Member 'GA_Athena_Bandage_C_K2_CanActivateAbility::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_K2_CanActivateAbility, CallFunc_FCeil_ReturnValue) == 0x000078, "Member 'GA_Athena_Bandage_C_K2_CanActivateAbility::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_K2_CanActivateAbility, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00007C, "Member 'GA_Athena_Bandage_C_K2_CanActivateAbility::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Bandage_C_K2_CanActivateAbility, CallFunc_Less_FloatFloat_ReturnValue) == 0x000080, "Member 'GA_Athena_Bandage_C_K2_CanActivateAbility::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

}

