#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_Melee_Generic_EventGraph

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GAB_Melee_Generic_EventGraph.GAB_Melee_Generic_EventGraph_C
// 0x0018 (0x0AC8 - 0x0AB0)
class UGAB_Melee_Generic_EventGraph_C : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB0(0x0008)(Transient, DuplicateTransient)
	bool                                          Stamina_Lockout;                                   // 0x0AB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Debug;                                             // 0x0AB9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ABA[0x2];                                      // 0x0ABA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DebugSpecificHitNumber;                            // 0x0ABC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Counter;                                           // 0x0AC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GAB_Melee_Generic_EventGraph(int32 EntryPoint);
	void Cancelled_8C20D6D3411A3D7E54D6049F69DF10BE(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_8C20D6D3411A3D7E54D6049F69DF10BE(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void K2_ActivateAbility();
	void Triggered_8C20D6D3411A3D7E54D6049F69DF10BE(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAB_Melee_Generic_EventGraph_C">();
	}
	static class UGAB_Melee_Generic_EventGraph_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAB_Melee_Generic_EventGraph_C>();
	}
};
static_assert(alignof(UGAB_Melee_Generic_EventGraph_C) == 0x000008, "Wrong alignment on UGAB_Melee_Generic_EventGraph_C");
static_assert(sizeof(UGAB_Melee_Generic_EventGraph_C) == 0x000AC8, "Wrong size on UGAB_Melee_Generic_EventGraph_C");
static_assert(offsetof(UGAB_Melee_Generic_EventGraph_C, UberGraphFrame) == 0x000AB0, "Member 'UGAB_Melee_Generic_EventGraph_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGAB_Melee_Generic_EventGraph_C, Stamina_Lockout) == 0x000AB8, "Member 'UGAB_Melee_Generic_EventGraph_C::Stamina_Lockout' has a wrong offset!");
static_assert(offsetof(UGAB_Melee_Generic_EventGraph_C, Debug) == 0x000AB9, "Member 'UGAB_Melee_Generic_EventGraph_C::Debug' has a wrong offset!");
static_assert(offsetof(UGAB_Melee_Generic_EventGraph_C, DebugSpecificHitNumber) == 0x000ABC, "Member 'UGAB_Melee_Generic_EventGraph_C::DebugSpecificHitNumber' has a wrong offset!");
static_assert(offsetof(UGAB_Melee_Generic_EventGraph_C, Counter) == 0x000AC0, "Member 'UGAB_Melee_Generic_EventGraph_C::Counter' has a wrong offset!");

}

