#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_GM_MaxHealthIncrease_Major

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCNL_GM_MaxHealthIncrease_Major.GCNL_GM_MaxHealthIncrease_Major_C.OnActive
// 0x00D8 (0x00D8 - 0x0000)
struct GCNL_GM_MaxHealthIncrease_Major_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEnemyPawn_Parent_C*                    K2Node_DynamicCast_AsEnemy_Pawn_Parent;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GCNL_GM_MaxHealthIncrease_Major_C_OnActive) == 0x000008, "Wrong alignment on GCNL_GM_MaxHealthIncrease_Major_C_OnActive");
static_assert(sizeof(GCNL_GM_MaxHealthIncrease_Major_C_OnActive) == 0x0000D8, "Wrong size on GCNL_GM_MaxHealthIncrease_Major_C_OnActive");
static_assert(offsetof(GCNL_GM_MaxHealthIncrease_Major_C_OnActive, MyTarget) == 0x000000, "Member 'GCNL_GM_MaxHealthIncrease_Major_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_GM_MaxHealthIncrease_Major_C_OnActive, Parameters) == 0x000008, "Member 'GCNL_GM_MaxHealthIncrease_Major_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_GM_MaxHealthIncrease_Major_C_OnActive, ReturnValue) == 0x0000C0, "Member 'GCNL_GM_MaxHealthIncrease_Major_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_GM_MaxHealthIncrease_Major_C_OnActive, K2Node_DynamicCast_AsEnemy_Pawn_Parent) == 0x0000C8, "Member 'GCNL_GM_MaxHealthIncrease_Major_C_OnActive::K2Node_DynamicCast_AsEnemy_Pawn_Parent' has a wrong offset!");
static_assert(offsetof(GCNL_GM_MaxHealthIncrease_Major_C_OnActive, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'GCNL_GM_MaxHealthIncrease_Major_C_OnActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

