#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNS_GM_OnPreviewEmoji

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GCNS_GM_OnPreviewEmoji.GCNS_GM_OnPreviewEmoji_C.OnStartParticleSystemSpawned
// 0x0188 (0x0188 - 0x0000)
struct GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned final
{
public:
	class UParticleSystemComponent*               SpawnedParticleSysComponent;                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FVector                                CallFunc_Random_360_VectorInRange_Random_Vector_Result_; // 0x00C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaEmojiItemDefinition*             K2Node_DynamicCast_AsAthena_Emoji_Item_Definition; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00E4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00F0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue2;            // 0x00FC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0108(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned) == 0x000008, "Wrong alignment on GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned");
static_assert(sizeof(GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned) == 0x000188, "Wrong size on GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned");
static_assert(offsetof(GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned, SpawnedParticleSysComponent) == 0x000000, "Member 'GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned::SpawnedParticleSysComponent' has a wrong offset!");
static_assert(offsetof(GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned, Parameters) == 0x000008, "Member 'GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned::Parameters' has a wrong offset!");
static_assert(offsetof(GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned, CallFunc_Random_360_VectorInRange_Random_Vector_Result_) == 0x0000C0, "Member 'GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned::CallFunc_Random_360_VectorInRange_Random_Vector_Result_' has a wrong offset!");
static_assert(offsetof(GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned, CallFunc_BreakVector_X) == 0x0000CC, "Member 'GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned, CallFunc_BreakVector_Y) == 0x0000D0, "Member 'GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned, CallFunc_BreakVector_Z) == 0x0000D4, "Member 'GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned, K2Node_DynamicCast_AsAthena_Emoji_Item_Definition) == 0x0000D8, "Member 'GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned::K2Node_DynamicCast_AsAthena_Emoji_Item_Definition' has a wrong offset!");
static_assert(offsetof(GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned, CallFunc_MakeVector_ReturnValue) == 0x0000E4, "Member 'GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned, CallFunc_Add_VectorVector_ReturnValue) == 0x0000F0, "Member 'GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned, CallFunc_Add_VectorVector_ReturnValue2) == 0x0000FC, "Member 'GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned::CallFunc_Add_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000108, "Member 'GCNS_GM_OnPreviewEmoji_C_OnStartParticleSystemSpawned::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

}

