#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HelpWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function HelpWidget.HelpWidget_C.ExecuteUbergraph_HelpWidget
// 0x0018 (0x0018 - 0x0000)
struct HelpWidget_C_ExecuteUbergraph_HelpWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HelpWidget_C_ExecuteUbergraph_HelpWidget) == 0x000008, "Wrong alignment on HelpWidget_C_ExecuteUbergraph_HelpWidget");
static_assert(sizeof(HelpWidget_C_ExecuteUbergraph_HelpWidget) == 0x000018, "Wrong size on HelpWidget_C_ExecuteUbergraph_HelpWidget");
static_assert(offsetof(HelpWidget_C_ExecuteUbergraph_HelpWidget, EntryPoint) == 0x000000, "Member 'HelpWidget_C_ExecuteUbergraph_HelpWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(HelpWidget_C_ExecuteUbergraph_HelpWidget, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000008, "Member 'HelpWidget_C_ExecuteUbergraph_HelpWidget::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(HelpWidget_C_ExecuteUbergraph_HelpWidget, K2Node_ComponentBoundEvent_Button) == 0x000010, "Member 'HelpWidget_C_ExecuteUbergraph_HelpWidget::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function HelpWidget.HelpWidget_C.BndEvt__ButtonClose_K2Node_ComponentBoundEvent_28_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct HelpWidget_C_BndEvt__ButtonClose_K2Node_ComponentBoundEvent_28_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HelpWidget_C_BndEvt__ButtonClose_K2Node_ComponentBoundEvent_28_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on HelpWidget_C_BndEvt__ButtonClose_K2Node_ComponentBoundEvent_28_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(HelpWidget_C_BndEvt__ButtonClose_K2Node_ComponentBoundEvent_28_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on HelpWidget_C_BndEvt__ButtonClose_K2Node_ComponentBoundEvent_28_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(HelpWidget_C_BndEvt__ButtonClose_K2Node_ComponentBoundEvent_28_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'HelpWidget_C_BndEvt__ButtonClose_K2Node_ComponentBoundEvent_28_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function HelpWidget.HelpWidget_C.Init
// 0x00A0 (0x00A0 - 0x0000)
struct HelpWidget_C_Init final
{
public:
	class FText                                   InTitle;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InDescription;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InStep1_Text;                                      // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InStep2_Text;                                      // 0x0048(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InStep3_Text;                                      // 0x0060(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTexture2D*                             InStep1_Picture;                                   // 0x0078(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             InStep2_Picture;                                   // 0x0080(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             InStep3_Picture;                                   // 0x0088(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InNumOfSteps;                                      // 0x0090(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0097(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HelpWidget_C_Init) == 0x000008, "Wrong alignment on HelpWidget_C_Init");
static_assert(sizeof(HelpWidget_C_Init) == 0x0000A0, "Wrong size on HelpWidget_C_Init");
static_assert(offsetof(HelpWidget_C_Init, InTitle) == 0x000000, "Member 'HelpWidget_C_Init::InTitle' has a wrong offset!");
static_assert(offsetof(HelpWidget_C_Init, InDescription) == 0x000018, "Member 'HelpWidget_C_Init::InDescription' has a wrong offset!");
static_assert(offsetof(HelpWidget_C_Init, InStep1_Text) == 0x000030, "Member 'HelpWidget_C_Init::InStep1_Text' has a wrong offset!");
static_assert(offsetof(HelpWidget_C_Init, InStep2_Text) == 0x000048, "Member 'HelpWidget_C_Init::InStep2_Text' has a wrong offset!");
static_assert(offsetof(HelpWidget_C_Init, InStep3_Text) == 0x000060, "Member 'HelpWidget_C_Init::InStep3_Text' has a wrong offset!");
static_assert(offsetof(HelpWidget_C_Init, InStep1_Picture) == 0x000078, "Member 'HelpWidget_C_Init::InStep1_Picture' has a wrong offset!");
static_assert(offsetof(HelpWidget_C_Init, InStep2_Picture) == 0x000080, "Member 'HelpWidget_C_Init::InStep2_Picture' has a wrong offset!");
static_assert(offsetof(HelpWidget_C_Init, InStep3_Picture) == 0x000088, "Member 'HelpWidget_C_Init::InStep3_Picture' has a wrong offset!");
static_assert(offsetof(HelpWidget_C_Init, InNumOfSteps) == 0x000090, "Member 'HelpWidget_C_Init::InNumOfSteps' has a wrong offset!");
static_assert(offsetof(HelpWidget_C_Init, Temp_bool_Variable) == 0x000094, "Member 'HelpWidget_C_Init::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HelpWidget_C_Init, Temp_byte_Variable) == 0x000095, "Member 'HelpWidget_C_Init::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HelpWidget_C_Init, Temp_byte_Variable2) == 0x000096, "Member 'HelpWidget_C_Init::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(HelpWidget_C_Init, Temp_bool_Variable2) == 0x000097, "Member 'HelpWidget_C_Init::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(HelpWidget_C_Init, Temp_byte_Variable3) == 0x000098, "Member 'HelpWidget_C_Init::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(HelpWidget_C_Init, Temp_byte_Variable4) == 0x000099, "Member 'HelpWidget_C_Init::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(HelpWidget_C_Init, CallFunc_Greater_IntInt_ReturnValue) == 0x00009A, "Member 'HelpWidget_C_Init::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HelpWidget_C_Init, CallFunc_Greater_IntInt_ReturnValue2) == 0x00009B, "Member 'HelpWidget_C_Init::CallFunc_Greater_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HelpWidget_C_Init, K2Node_Select_Default) == 0x00009C, "Member 'HelpWidget_C_Init::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HelpWidget_C_Init, K2Node_Select2_Default) == 0x00009D, "Member 'HelpWidget_C_Init::K2Node_Select2_Default' has a wrong offset!");

}

