#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeroSquadManagementScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HeroSquadManagementScreen.HeroSquadManagementScreen_C
// 0x0050 (0x0510 - 0x04C0)
class UHeroSquadManagementScreen_C final : public UFortHeroSquadManagementScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       AniShowSlotInfo;                                   // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       HidePicker;                                        // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       AniHideSlotInfo;                                   // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowPicker;                                        // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderSlotInfo;                                    // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextSlotBody;                                      // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextSlotHeader;                                    // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    InputBackAction;                                   // 0x0500(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_HeroSquadManagementScreen(int32 EntryPoint);
	void BndEvt__SquadSlotsView_K2Node_ComponentBoundEvent_2_OnDifferentSquadSlotSelected__DelegateSignature(int32 SquadSlotIndex);
	void HandleSquadSlotPickerHidden();
	void HandleSquadSlotPickerShown();
	void OnDeactivated();
	void SetDefaultScroll();
	void Construct();
	void OnActivated();
	ESlateVisibility GetInZoneVisibility();
	void HandleClosePicker(bool* bPassThrough);
	void ShowSlotInfo(const class FText& HeaderText, const class FText& BodyText);
	void HideSlotInfo();
	void Update_Hero_Squad_Bonus_Tiles_SubIcon_Glow_State();
	void Update_Hero_Squad_Bonus_Highlight_State();
	void HandleHideSlotInfoAni();
	void HandlePickerHideAni();
	void HandlePickerShowAni();
	void HandleShowSlotInfoAni();
	void UpdateSquadSlotInfoPanel(int32 SquadSlotIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HeroSquadManagementScreen_C">();
	}
	static class UHeroSquadManagementScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHeroSquadManagementScreen_C>();
	}
};
static_assert(alignof(UHeroSquadManagementScreen_C) == 0x000008, "Wrong alignment on UHeroSquadManagementScreen_C");
static_assert(sizeof(UHeroSquadManagementScreen_C) == 0x000510, "Wrong size on UHeroSquadManagementScreen_C");
static_assert(offsetof(UHeroSquadManagementScreen_C, UberGraphFrame) == 0x0004C0, "Member 'UHeroSquadManagementScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHeroSquadManagementScreen_C, AniShowSlotInfo) == 0x0004C8, "Member 'UHeroSquadManagementScreen_C::AniShowSlotInfo' has a wrong offset!");
static_assert(offsetof(UHeroSquadManagementScreen_C, HidePicker) == 0x0004D0, "Member 'UHeroSquadManagementScreen_C::HidePicker' has a wrong offset!");
static_assert(offsetof(UHeroSquadManagementScreen_C, AniHideSlotInfo) == 0x0004D8, "Member 'UHeroSquadManagementScreen_C::AniHideSlotInfo' has a wrong offset!");
static_assert(offsetof(UHeroSquadManagementScreen_C, ShowPicker) == 0x0004E0, "Member 'UHeroSquadManagementScreen_C::ShowPicker' has a wrong offset!");
static_assert(offsetof(UHeroSquadManagementScreen_C, BorderSlotInfo) == 0x0004E8, "Member 'UHeroSquadManagementScreen_C::BorderSlotInfo' has a wrong offset!");
static_assert(offsetof(UHeroSquadManagementScreen_C, TextSlotBody) == 0x0004F0, "Member 'UHeroSquadManagementScreen_C::TextSlotBody' has a wrong offset!");
static_assert(offsetof(UHeroSquadManagementScreen_C, TextSlotHeader) == 0x0004F8, "Member 'UHeroSquadManagementScreen_C::TextSlotHeader' has a wrong offset!");
static_assert(offsetof(UHeroSquadManagementScreen_C, InputBackAction) == 0x000500, "Member 'UHeroSquadManagementScreen_C::InputBackAction' has a wrong offset!");

}

