#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InfoWindow

#include "Basic.hpp"


namespace SDK::Params
{

// Function InfoWindow.InfoWindow_C.ExecuteUbergraph_InfoWindow
// 0x0060 (0x0060 - 0x0000)
struct InfoWindow_C_ExecuteUbergraph_InfoWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UFortItemDefinition* Entry_Item_Definition)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInfoEntry_C*                           K2Node_DynamicCast_AsInfo_Entry;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    K2Node_CustomEvent_Entry_Item_Definition;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetItemAt_ReturnValue;                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetListWidget_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InfoWindow_C_ExecuteUbergraph_InfoWindow) == 0x000008, "Wrong alignment on InfoWindow_C_ExecuteUbergraph_InfoWindow");
static_assert(sizeof(InfoWindow_C_ExecuteUbergraph_InfoWindow) == 0x000060, "Wrong size on InfoWindow_C_ExecuteUbergraph_InfoWindow");
static_assert(offsetof(InfoWindow_C_ExecuteUbergraph_InfoWindow, EntryPoint) == 0x000000, "Member 'InfoWindow_C_ExecuteUbergraph_InfoWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(InfoWindow_C_ExecuteUbergraph_InfoWindow, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'InfoWindow_C_ExecuteUbergraph_InfoWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(InfoWindow_C_ExecuteUbergraph_InfoWindow, K2Node_ComponentBoundEvent_Widget) == 0x000018, "Member 'InfoWindow_C_ExecuteUbergraph_InfoWindow::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(InfoWindow_C_ExecuteUbergraph_InfoWindow, K2Node_DynamicCast_AsInfo_Entry) == 0x000020, "Member 'InfoWindow_C_ExecuteUbergraph_InfoWindow::K2Node_DynamicCast_AsInfo_Entry' has a wrong offset!");
static_assert(offsetof(InfoWindow_C_ExecuteUbergraph_InfoWindow, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'InfoWindow_C_ExecuteUbergraph_InfoWindow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InfoWindow_C_ExecuteUbergraph_InfoWindow, K2Node_CustomEvent_Entry_Item_Definition) == 0x000030, "Member 'InfoWindow_C_ExecuteUbergraph_InfoWindow::K2Node_CustomEvent_Entry_Item_Definition' has a wrong offset!");
static_assert(offsetof(InfoWindow_C_ExecuteUbergraph_InfoWindow, CallFunc_GetUINavigationManager_ReturnValue) == 0x000038, "Member 'InfoWindow_C_ExecuteUbergraph_InfoWindow::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(InfoWindow_C_ExecuteUbergraph_InfoWindow, K2Node_ComponentBoundEvent_Button) == 0x000040, "Member 'InfoWindow_C_ExecuteUbergraph_InfoWindow::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(InfoWindow_C_ExecuteUbergraph_InfoWindow, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000048, "Member 'InfoWindow_C_ExecuteUbergraph_InfoWindow::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(InfoWindow_C_ExecuteUbergraph_InfoWindow, CallFunc_GetItemAt_ReturnValue) == 0x000050, "Member 'InfoWindow_C_ExecuteUbergraph_InfoWindow::CallFunc_GetItemAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InfoWindow_C_ExecuteUbergraph_InfoWindow, CallFunc_GetListWidget_ReturnValue) == 0x000058, "Member 'InfoWindow_C_ExecuteUbergraph_InfoWindow::CallFunc_GetListWidget_ReturnValue' has a wrong offset!");

// Function InfoWindow.InfoWindow_C.Set Info
// 0x0008 (0x0008 - 0x0000)
struct InfoWindow_C_Set_Info final
{
public:
	class UFortItemDefinition*                    Entry_Item_Definition;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InfoWindow_C_Set_Info) == 0x000008, "Wrong alignment on InfoWindow_C_Set_Info");
static_assert(sizeof(InfoWindow_C_Set_Info) == 0x000008, "Wrong size on InfoWindow_C_Set_Info");
static_assert(offsetof(InfoWindow_C_Set_Info, Entry_Item_Definition) == 0x000000, "Member 'InfoWindow_C_Set_Info::Entry_Item_Definition' has a wrong offset!");

// Function InfoWindow.InfoWindow_C.BndEvt__InfoButtons_K2Node_ComponentBoundEvent_212_OnListViewItemWidgetCreated__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct InfoWindow_C_BndEvt__InfoButtons_K2Node_ComponentBoundEvent_212_OnListViewItemWidgetCreated__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InfoWindow_C_BndEvt__InfoButtons_K2Node_ComponentBoundEvent_212_OnListViewItemWidgetCreated__DelegateSignature) == 0x000008, "Wrong alignment on InfoWindow_C_BndEvt__InfoButtons_K2Node_ComponentBoundEvent_212_OnListViewItemWidgetCreated__DelegateSignature");
static_assert(sizeof(InfoWindow_C_BndEvt__InfoButtons_K2Node_ComponentBoundEvent_212_OnListViewItemWidgetCreated__DelegateSignature) == 0x000008, "Wrong size on InfoWindow_C_BndEvt__InfoButtons_K2Node_ComponentBoundEvent_212_OnListViewItemWidgetCreated__DelegateSignature");
static_assert(offsetof(InfoWindow_C_BndEvt__InfoButtons_K2Node_ComponentBoundEvent_212_OnListViewItemWidgetCreated__DelegateSignature, Widget) == 0x000000, "Member 'InfoWindow_C_BndEvt__InfoButtons_K2Node_ComponentBoundEvent_212_OnListViewItemWidgetCreated__DelegateSignature::Widget' has a wrong offset!");

// Function InfoWindow.InfoWindow_C.BndEvt__IconTextButton_K2Node_ComponentBoundEvent_37_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct InfoWindow_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_37_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InfoWindow_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_37_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on InfoWindow_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_37_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(InfoWindow_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_37_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on InfoWindow_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_37_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(InfoWindow_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_37_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'InfoWindow_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_37_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function InfoWindow.InfoWindow_C.AddInfo
// 0x0050 (0x0050 - 0x0000)
struct InfoWindow_C_AddInfo final
{
public:
	TArray<class UFortItemDefinition*>            Info_Items;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class FText                                   Param_Title;                                       // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	TArray<class UFortItemDefinition*>            NewLocalVar_0;                                     // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class UObject*                                CallFunc_GetItemAt_ReturnValue;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    K2Node_DynamicCast_AsFort_Item_Definition;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InfoWindow_C_AddInfo) == 0x000008, "Wrong alignment on InfoWindow_C_AddInfo");
static_assert(sizeof(InfoWindow_C_AddInfo) == 0x000050, "Wrong size on InfoWindow_C_AddInfo");
static_assert(offsetof(InfoWindow_C_AddInfo, Info_Items) == 0x000000, "Member 'InfoWindow_C_AddInfo::Info_Items' has a wrong offset!");
static_assert(offsetof(InfoWindow_C_AddInfo, Param_Title) == 0x000010, "Member 'InfoWindow_C_AddInfo::Param_Title' has a wrong offset!");
static_assert(offsetof(InfoWindow_C_AddInfo, NewLocalVar_0) == 0x000028, "Member 'InfoWindow_C_AddInfo::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(InfoWindow_C_AddInfo, CallFunc_GetItemAt_ReturnValue) == 0x000038, "Member 'InfoWindow_C_AddInfo::CallFunc_GetItemAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InfoWindow_C_AddInfo, K2Node_DynamicCast_AsFort_Item_Definition) == 0x000040, "Member 'InfoWindow_C_AddInfo::K2Node_DynamicCast_AsFort_Item_Definition' has a wrong offset!");
static_assert(offsetof(InfoWindow_C_AddInfo, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'InfoWindow_C_AddInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InfoWindow_C_AddInfo, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'InfoWindow_C_AddInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function InfoWindow.InfoWindow_C.Initialize
// 0x0010 (0x0010 - 0x0000)
struct InfoWindow_C_Initialize final
{
public:
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputManager*                    CallFunc_GetInputManager_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InfoWindow_C_Initialize) == 0x000008, "Wrong alignment on InfoWindow_C_Initialize");
static_assert(sizeof(InfoWindow_C_Initialize) == 0x000010, "Wrong size on InfoWindow_C_Initialize");
static_assert(offsetof(InfoWindow_C_Initialize, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'InfoWindow_C_Initialize::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(InfoWindow_C_Initialize, CallFunc_GetInputManager_ReturnValue) == 0x000008, "Member 'InfoWindow_C_Initialize::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");

}

