#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Interaction_DefenderBeacon

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function Interaction_DefenderBeacon.Interaction_DefenderBeacon_C.ExecuteUbergraph_Interaction_DefenderBeacon
// 0x00B8 (0x00B8 - 0x0000)
struct Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   CallFunc_GetLastInteractErrorText_ReturnValue;     // 0x0030(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_K2_FindExistingItemForDefinition_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_K2_FindExistingItemForDefinition_ReturnValue2; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckAmmoValid_AmmoValid;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckAmmoValid_AmmoValid2;                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRemainingAmmo_ReturnValue;             // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               CallFunc_GetAmmoWorldItemDefinition_BP_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	class AFortWeapon*                            K2Node_CustomEvent_NewWeapon;                      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWeapon*                            K2Node_CustomEvent_OldWeapon;                      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortWeapon* NewWeapon, class AFortWeapon* PrevWeapon)> K2Node_CreateDelegate_OutputDelegate3;             // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon) == 0x000008, "Wrong alignment on Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon");
static_assert(sizeof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon) == 0x0000B8, "Wrong size on Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon");
static_assert(offsetof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon, EntryPoint) == 0x000000, "Member 'Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon::EntryPoint' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000010, "Member 'Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon, CallFunc_GetLastInteractErrorText_ReturnValue) == 0x000030, "Member 'Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon::CallFunc_GetLastInteractErrorText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000048, "Member 'Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon, CallFunc_IsValid_ReturnValue2) == 0x00004A, "Member 'Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon, CallFunc_IsValid_ReturnValue3) == 0x00004B, "Member 'Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon, CallFunc_K2_FindExistingItemForDefinition_ReturnValue) == 0x000050, "Member 'Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon::CallFunc_K2_FindExistingItemForDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon, CallFunc_IsValid_ReturnValue4) == 0x000058, "Member 'Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon, CallFunc_IsValid_ReturnValue5) == 0x000059, "Member 'Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon, CallFunc_IsValid_ReturnValue6) == 0x00005A, "Member 'Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon, CallFunc_K2_FindExistingItemForDefinition_ReturnValue2) == 0x000060, "Member 'Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon::CallFunc_K2_FindExistingItemForDefinition_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon, CallFunc_CheckAmmoValid_AmmoValid) == 0x000068, "Member 'Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon::CallFunc_CheckAmmoValid_AmmoValid' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon, CallFunc_CheckAmmoValid_AmmoValid2) == 0x000069, "Member 'Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon::CallFunc_CheckAmmoValid_AmmoValid2' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon, CallFunc_GetRemainingAmmo_ReturnValue) == 0x00006C, "Member 'Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon::CallFunc_GetRemainingAmmo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon, CallFunc_GetAmmoWorldItemDefinition_BP_ReturnValue) == 0x000070, "Member 'Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon::CallFunc_GetAmmoWorldItemDefinition_BP_ReturnValue' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon, CallFunc_CreateTemporaryItemInstanceBP_ReturnValue) == 0x000078, "Member 'Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon::CallFunc_CreateTemporaryItemInstanceBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon, CallFunc_IsValid_ReturnValue7) == 0x000080, "Member 'Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon, K2Node_CreateDelegate_OutputDelegate2) == 0x000088, "Member 'Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon, K2Node_CustomEvent_NewWeapon) == 0x000098, "Member 'Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon::K2Node_CustomEvent_NewWeapon' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon, K2Node_CustomEvent_OldWeapon) == 0x0000A0, "Member 'Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon::K2Node_CustomEvent_OldWeapon' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon, K2Node_CreateDelegate_OutputDelegate3) == 0x0000A8, "Member 'Interaction_DefenderBeacon_C_ExecuteUbergraph_Interaction_DefenderBeacon::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");

// Function Interaction_DefenderBeacon.Interaction_DefenderBeacon_C.OnDefenderEquippedWeapon
// 0x0010 (0x0010 - 0x0000)
struct Interaction_DefenderBeacon_C_OnDefenderEquippedWeapon final
{
public:
	class AFortWeapon*                            NewWeapon;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWeapon*                            OldWeapon;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Interaction_DefenderBeacon_C_OnDefenderEquippedWeapon) == 0x000008, "Wrong alignment on Interaction_DefenderBeacon_C_OnDefenderEquippedWeapon");
static_assert(sizeof(Interaction_DefenderBeacon_C_OnDefenderEquippedWeapon) == 0x000010, "Wrong size on Interaction_DefenderBeacon_C_OnDefenderEquippedWeapon");
static_assert(offsetof(Interaction_DefenderBeacon_C_OnDefenderEquippedWeapon, NewWeapon) == 0x000000, "Member 'Interaction_DefenderBeacon_C_OnDefenderEquippedWeapon::NewWeapon' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_OnDefenderEquippedWeapon, OldWeapon) == 0x000008, "Member 'Interaction_DefenderBeacon_C_OnDefenderEquippedWeapon::OldWeapon' has a wrong offset!");

// Function Interaction_DefenderBeacon.Interaction_DefenderBeacon_C.DisplayWeaponType
// 0x0038 (0x0038 - 0x0000)
struct Interaction_DefenderBeacon_C_DisplayWeaponType final
{
public:
	class AFortAIPawn*                            LocalDefenderPawn;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           TagMelee;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           TagPistol;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           TagSniper;                                         // 0x0018(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           TagShotgun;                                        // 0x0020(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           TagAssault;                                        // 0x0028(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Interaction_DefenderBeacon_C_DisplayWeaponType) == 0x000008, "Wrong alignment on Interaction_DefenderBeacon_C_DisplayWeaponType");
static_assert(sizeof(Interaction_DefenderBeacon_C_DisplayWeaponType) == 0x000038, "Wrong size on Interaction_DefenderBeacon_C_DisplayWeaponType");
static_assert(offsetof(Interaction_DefenderBeacon_C_DisplayWeaponType, LocalDefenderPawn) == 0x000000, "Member 'Interaction_DefenderBeacon_C_DisplayWeaponType::LocalDefenderPawn' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_DisplayWeaponType, TagMelee) == 0x000008, "Member 'Interaction_DefenderBeacon_C_DisplayWeaponType::TagMelee' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_DisplayWeaponType, TagPistol) == 0x000010, "Member 'Interaction_DefenderBeacon_C_DisplayWeaponType::TagPistol' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_DisplayWeaponType, TagSniper) == 0x000018, "Member 'Interaction_DefenderBeacon_C_DisplayWeaponType::TagSniper' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_DisplayWeaponType, TagShotgun) == 0x000020, "Member 'Interaction_DefenderBeacon_C_DisplayWeaponType::TagShotgun' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_DisplayWeaponType, TagAssault) == 0x000028, "Member 'Interaction_DefenderBeacon_C_DisplayWeaponType::TagAssault' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_DisplayWeaponType, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'Interaction_DefenderBeacon_C_DisplayWeaponType::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_DisplayWeaponType, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000031, "Member 'Interaction_DefenderBeacon_C_DisplayWeaponType::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");

// Function Interaction_DefenderBeacon.Interaction_DefenderBeacon_C.CheckAmmoValid
// 0x0018 (0x0018 - 0x0000)
struct Interaction_DefenderBeacon_C_CheckAmmoValid final
{
public:
	bool                                          AmmoValid;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn*                            LocalDefenderPawn;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Interaction_DefenderBeacon_C_CheckAmmoValid) == 0x000008, "Wrong alignment on Interaction_DefenderBeacon_C_CheckAmmoValid");
static_assert(sizeof(Interaction_DefenderBeacon_C_CheckAmmoValid) == 0x000018, "Wrong size on Interaction_DefenderBeacon_C_CheckAmmoValid");
static_assert(offsetof(Interaction_DefenderBeacon_C_CheckAmmoValid, AmmoValid) == 0x000000, "Member 'Interaction_DefenderBeacon_C_CheckAmmoValid::AmmoValid' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_CheckAmmoValid, LocalDefenderPawn) == 0x000008, "Member 'Interaction_DefenderBeacon_C_CheckAmmoValid::LocalDefenderPawn' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_CheckAmmoValid, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'Interaction_DefenderBeacon_C_CheckAmmoValid::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Interaction_DefenderBeacon_C_CheckAmmoValid, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000011, "Member 'Interaction_DefenderBeacon_C_CheckAmmoValid::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");

}

