#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Interaction_DefenderBeacon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Interaction_DefenderBeacon.Interaction_DefenderBeacon_C
// 0x00C8 (0x02E0 - 0x0218)
class UInteraction_DefenderBeacon_C final : public UFortUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0218(0x0008)(Transient, DuplicateTransient)
	class UFortMultiSizeItemCard*                 AmmoItemCard;                                      // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               AmmoSelection;                                     // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               AmmoSlot;                                          // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               AmmoSlotLocked;                                    // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 DefenderItemCard;                                  // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DefenderSelection;                                 // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               DefenderSlotEmpty;                                 // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ErrorTextBlock;                                    // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconWeaponAssault;                                 // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconWeaponMelee;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconWeaponPistol;                                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconWeaponShotgun;                                 // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconWeaponSniper;                                  // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageInteraction;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         InteractBox;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         InteractErrorBox;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ItemHBox;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 WeaponItemCard;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               WeaponSelection;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               WeaponSlotEmpty;                                   // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               WeaponSlotLocked;                                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABuildingTrapDefender*                  OurDefenderTrap;                                   // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UFortItem*                              DefenderItem;                                      // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAIPawn*                            DefenderPawn;                                      // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Interaction_DefenderBeacon(int32 EntryPoint);
	void OnDefenderEquippedWeapon(class AFortWeapon* NewWeapon, class AFortWeapon* OldWeapon);
	void Destruct();
	void UpdateDefenderBeaconWidget();
	void Construct();
	void DisplayWeaponType();
	void CheckAmmoValid(bool* AmmoValid);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Interaction_DefenderBeacon_C">();
	}
	static class UInteraction_DefenderBeacon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInteraction_DefenderBeacon_C>();
	}
};
static_assert(alignof(UInteraction_DefenderBeacon_C) == 0x000008, "Wrong alignment on UInteraction_DefenderBeacon_C");
static_assert(sizeof(UInteraction_DefenderBeacon_C) == 0x0002E0, "Wrong size on UInteraction_DefenderBeacon_C");
static_assert(offsetof(UInteraction_DefenderBeacon_C, UberGraphFrame) == 0x000218, "Member 'UInteraction_DefenderBeacon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UInteraction_DefenderBeacon_C, AmmoItemCard) == 0x000220, "Member 'UInteraction_DefenderBeacon_C::AmmoItemCard' has a wrong offset!");
static_assert(offsetof(UInteraction_DefenderBeacon_C, AmmoSelection) == 0x000228, "Member 'UInteraction_DefenderBeacon_C::AmmoSelection' has a wrong offset!");
static_assert(offsetof(UInteraction_DefenderBeacon_C, AmmoSlot) == 0x000230, "Member 'UInteraction_DefenderBeacon_C::AmmoSlot' has a wrong offset!");
static_assert(offsetof(UInteraction_DefenderBeacon_C, AmmoSlotLocked) == 0x000238, "Member 'UInteraction_DefenderBeacon_C::AmmoSlotLocked' has a wrong offset!");
static_assert(offsetof(UInteraction_DefenderBeacon_C, DefenderItemCard) == 0x000240, "Member 'UInteraction_DefenderBeacon_C::DefenderItemCard' has a wrong offset!");
static_assert(offsetof(UInteraction_DefenderBeacon_C, DefenderSelection) == 0x000248, "Member 'UInteraction_DefenderBeacon_C::DefenderSelection' has a wrong offset!");
static_assert(offsetof(UInteraction_DefenderBeacon_C, DefenderSlotEmpty) == 0x000250, "Member 'UInteraction_DefenderBeacon_C::DefenderSlotEmpty' has a wrong offset!");
static_assert(offsetof(UInteraction_DefenderBeacon_C, ErrorTextBlock) == 0x000258, "Member 'UInteraction_DefenderBeacon_C::ErrorTextBlock' has a wrong offset!");
static_assert(offsetof(UInteraction_DefenderBeacon_C, IconWeaponAssault) == 0x000260, "Member 'UInteraction_DefenderBeacon_C::IconWeaponAssault' has a wrong offset!");
static_assert(offsetof(UInteraction_DefenderBeacon_C, IconWeaponMelee) == 0x000268, "Member 'UInteraction_DefenderBeacon_C::IconWeaponMelee' has a wrong offset!");
static_assert(offsetof(UInteraction_DefenderBeacon_C, IconWeaponPistol) == 0x000270, "Member 'UInteraction_DefenderBeacon_C::IconWeaponPistol' has a wrong offset!");
static_assert(offsetof(UInteraction_DefenderBeacon_C, IconWeaponShotgun) == 0x000278, "Member 'UInteraction_DefenderBeacon_C::IconWeaponShotgun' has a wrong offset!");
static_assert(offsetof(UInteraction_DefenderBeacon_C, IconWeaponSniper) == 0x000280, "Member 'UInteraction_DefenderBeacon_C::IconWeaponSniper' has a wrong offset!");
static_assert(offsetof(UInteraction_DefenderBeacon_C, ImageInteraction) == 0x000288, "Member 'UInteraction_DefenderBeacon_C::ImageInteraction' has a wrong offset!");
static_assert(offsetof(UInteraction_DefenderBeacon_C, InteractBox) == 0x000290, "Member 'UInteraction_DefenderBeacon_C::InteractBox' has a wrong offset!");
static_assert(offsetof(UInteraction_DefenderBeacon_C, InteractErrorBox) == 0x000298, "Member 'UInteraction_DefenderBeacon_C::InteractErrorBox' has a wrong offset!");
static_assert(offsetof(UInteraction_DefenderBeacon_C, ItemHBox) == 0x0002A0, "Member 'UInteraction_DefenderBeacon_C::ItemHBox' has a wrong offset!");
static_assert(offsetof(UInteraction_DefenderBeacon_C, WeaponItemCard) == 0x0002A8, "Member 'UInteraction_DefenderBeacon_C::WeaponItemCard' has a wrong offset!");
static_assert(offsetof(UInteraction_DefenderBeacon_C, WeaponSelection) == 0x0002B0, "Member 'UInteraction_DefenderBeacon_C::WeaponSelection' has a wrong offset!");
static_assert(offsetof(UInteraction_DefenderBeacon_C, WeaponSlotEmpty) == 0x0002B8, "Member 'UInteraction_DefenderBeacon_C::WeaponSlotEmpty' has a wrong offset!");
static_assert(offsetof(UInteraction_DefenderBeacon_C, WeaponSlotLocked) == 0x0002C0, "Member 'UInteraction_DefenderBeacon_C::WeaponSlotLocked' has a wrong offset!");
static_assert(offsetof(UInteraction_DefenderBeacon_C, OurDefenderTrap) == 0x0002C8, "Member 'UInteraction_DefenderBeacon_C::OurDefenderTrap' has a wrong offset!");
static_assert(offsetof(UInteraction_DefenderBeacon_C, DefenderItem) == 0x0002D0, "Member 'UInteraction_DefenderBeacon_C::DefenderItem' has a wrong offset!");
static_assert(offsetof(UInteraction_DefenderBeacon_C, DefenderPawn) == 0x0002D8, "Member 'UInteraction_DefenderBeacon_C::DefenderPawn' has a wrong offset!");

}

