#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InterestIndicatorWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function InterestIndicatorWidget.InterestIndicatorWidget_C.ExecuteUbergraph_InterestIndicatorWidget
// 0x0004 (0x0004 - 0x0000)
struct InterestIndicatorWidget_C_ExecuteUbergraph_InterestIndicatorWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InterestIndicatorWidget_C_ExecuteUbergraph_InterestIndicatorWidget) == 0x000004, "Wrong alignment on InterestIndicatorWidget_C_ExecuteUbergraph_InterestIndicatorWidget");
static_assert(sizeof(InterestIndicatorWidget_C_ExecuteUbergraph_InterestIndicatorWidget) == 0x000004, "Wrong size on InterestIndicatorWidget_C_ExecuteUbergraph_InterestIndicatorWidget");
static_assert(offsetof(InterestIndicatorWidget_C_ExecuteUbergraph_InterestIndicatorWidget, EntryPoint) == 0x000000, "Member 'InterestIndicatorWidget_C_ExecuteUbergraph_InterestIndicatorWidget::EntryPoint' has a wrong offset!");

// Function InterestIndicatorWidget.InterestIndicatorWidget_C.SetDisplayText
// 0x0020 (0x0020 - 0x0000)
struct InterestIndicatorWidget_C_SetDisplayText final
{
public:
	class FText                                   Description;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InterestIndicatorWidget_C_SetDisplayText) == 0x000008, "Wrong alignment on InterestIndicatorWidget_C_SetDisplayText");
static_assert(sizeof(InterestIndicatorWidget_C_SetDisplayText) == 0x000020, "Wrong size on InterestIndicatorWidget_C_SetDisplayText");
static_assert(offsetof(InterestIndicatorWidget_C_SetDisplayText, Description) == 0x000000, "Member 'InterestIndicatorWidget_C_SetDisplayText::Description' has a wrong offset!");
static_assert(offsetof(InterestIndicatorWidget_C_SetDisplayText, Temp_bool_Variable) == 0x000018, "Member 'InterestIndicatorWidget_C_SetDisplayText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(InterestIndicatorWidget_C_SetDisplayText, CallFunc_TextIsEmpty_ReturnValue) == 0x000019, "Member 'InterestIndicatorWidget_C_SetDisplayText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(InterestIndicatorWidget_C_SetDisplayText, Temp_byte_Variable) == 0x00001A, "Member 'InterestIndicatorWidget_C_SetDisplayText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(InterestIndicatorWidget_C_SetDisplayText, Temp_byte_Variable2) == 0x00001B, "Member 'InterestIndicatorWidget_C_SetDisplayText::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(InterestIndicatorWidget_C_SetDisplayText, K2Node_Select_Default) == 0x00001C, "Member 'InterestIndicatorWidget_C_SetDisplayText::K2Node_Select_Default' has a wrong offset!");

// Function InterestIndicatorWidget.InterestIndicatorWidget_C.SetDisplayImage
// 0x0010 (0x0010 - 0x0000)
struct InterestIndicatorWidget_C_SetDisplayImage final
{
public:
	class UTexture2D*                             Icon;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InterestIndicatorWidget_C_SetDisplayImage) == 0x000008, "Wrong alignment on InterestIndicatorWidget_C_SetDisplayImage");
static_assert(sizeof(InterestIndicatorWidget_C_SetDisplayImage) == 0x000010, "Wrong size on InterestIndicatorWidget_C_SetDisplayImage");
static_assert(offsetof(InterestIndicatorWidget_C_SetDisplayImage, Icon) == 0x000000, "Member 'InterestIndicatorWidget_C_SetDisplayImage::Icon' has a wrong offset!");
static_assert(offsetof(InterestIndicatorWidget_C_SetDisplayImage, Temp_bool_Variable) == 0x000008, "Member 'InterestIndicatorWidget_C_SetDisplayImage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(InterestIndicatorWidget_C_SetDisplayImage, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000009, "Member 'InterestIndicatorWidget_C_SetDisplayImage::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(InterestIndicatorWidget_C_SetDisplayImage, Temp_byte_Variable) == 0x00000A, "Member 'InterestIndicatorWidget_C_SetDisplayImage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(InterestIndicatorWidget_C_SetDisplayImage, Temp_byte_Variable2) == 0x00000B, "Member 'InterestIndicatorWidget_C_SetDisplayImage::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(InterestIndicatorWidget_C_SetDisplayImage, K2Node_Select_Default) == 0x00000C, "Member 'InterestIndicatorWidget_C_SetDisplayImage::K2Node_Select_Default' has a wrong offset!");

// Function InterestIndicatorWidget.InterestIndicatorWidget_C.InitPointOfInterest
// 0x0030 (0x0030 - 0x0000)
struct InterestIndicatorWidget_C_InitPointOfInterest final
{
public:
	class AActor*                                 PointOfInterest;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   DisplayText;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTexture2D*                             DisplayImage;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InterestIndicatorWidget_C_InitPointOfInterest) == 0x000008, "Wrong alignment on InterestIndicatorWidget_C_InitPointOfInterest");
static_assert(sizeof(InterestIndicatorWidget_C_InitPointOfInterest) == 0x000030, "Wrong size on InterestIndicatorWidget_C_InitPointOfInterest");
static_assert(offsetof(InterestIndicatorWidget_C_InitPointOfInterest, PointOfInterest) == 0x000000, "Member 'InterestIndicatorWidget_C_InitPointOfInterest::PointOfInterest' has a wrong offset!");
static_assert(offsetof(InterestIndicatorWidget_C_InitPointOfInterest, DisplayText) == 0x000008, "Member 'InterestIndicatorWidget_C_InitPointOfInterest::DisplayText' has a wrong offset!");
static_assert(offsetof(InterestIndicatorWidget_C_InitPointOfInterest, DisplayImage) == 0x000020, "Member 'InterestIndicatorWidget_C_InitPointOfInterest::DisplayImage' has a wrong offset!");
static_assert(offsetof(InterestIndicatorWidget_C_InitPointOfInterest, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000028, "Member 'InterestIndicatorWidget_C_InitPointOfInterest::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function InterestIndicatorWidget.InterestIndicatorWidget_C.RemovePointOfInterest
// 0x0010 (0x0010 - 0x0000)
struct InterestIndicatorWidget_C_RemovePointOfInterest final
{
public:
	class AActor*                                 PointOfInterest;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Removed;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InterestIndicatorWidget_C_RemovePointOfInterest) == 0x000008, "Wrong alignment on InterestIndicatorWidget_C_RemovePointOfInterest");
static_assert(sizeof(InterestIndicatorWidget_C_RemovePointOfInterest) == 0x000010, "Wrong size on InterestIndicatorWidget_C_RemovePointOfInterest");
static_assert(offsetof(InterestIndicatorWidget_C_RemovePointOfInterest, PointOfInterest) == 0x000000, "Member 'InterestIndicatorWidget_C_RemovePointOfInterest::PointOfInterest' has a wrong offset!");
static_assert(offsetof(InterestIndicatorWidget_C_RemovePointOfInterest, Removed) == 0x000008, "Member 'InterestIndicatorWidget_C_RemovePointOfInterest::Removed' has a wrong offset!");
static_assert(offsetof(InterestIndicatorWidget_C_RemovePointOfInterest, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000009, "Member 'InterestIndicatorWidget_C_RemovePointOfInterest::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

