#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemCraftingIngredientListEntryHaveNeedVerbose

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemCraftingIngredientListEntryHaveNeedVerbose.ItemCraftingIngredientListEntryHaveNeedVerbose_C
// 0x0048 (0x0280 - 0x0238)
class UItemCraftingIngredientListEntryHaveNeedVerbose_C final : public UFortItemQuantityListEntryBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UFortItemCountTextBlock*                ItemCountHave;                                     // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItemCountTextBlock*                ItemCountNeed;                                     // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItemIcon*                          ItemIcon;                                          // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItemDisplayNameText*               ItemName;                                          // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextDescription;                                   // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextSlash;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bOverrideTextStyle;                                // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 TextStyle;                                         // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ItemCraftingIngredientListEntryHaveNeedVerbose(int32 EntryPoint);
	void HandleDifferentItemOrQuantitySetBP(const bool IsBeingReset);
	void PreConstruct(bool IsDesignTime);
	void DoDesignTimeRandomization();
	void Refresh();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemCraftingIngredientListEntryHaveNeedVerbose_C">();
	}
	static class UItemCraftingIngredientListEntryHaveNeedVerbose_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemCraftingIngredientListEntryHaveNeedVerbose_C>();
	}
};
static_assert(alignof(UItemCraftingIngredientListEntryHaveNeedVerbose_C) == 0x000008, "Wrong alignment on UItemCraftingIngredientListEntryHaveNeedVerbose_C");
static_assert(sizeof(UItemCraftingIngredientListEntryHaveNeedVerbose_C) == 0x000280, "Wrong size on UItemCraftingIngredientListEntryHaveNeedVerbose_C");
static_assert(offsetof(UItemCraftingIngredientListEntryHaveNeedVerbose_C, UberGraphFrame) == 0x000238, "Member 'UItemCraftingIngredientListEntryHaveNeedVerbose_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemCraftingIngredientListEntryHaveNeedVerbose_C, ItemCountHave) == 0x000240, "Member 'UItemCraftingIngredientListEntryHaveNeedVerbose_C::ItemCountHave' has a wrong offset!");
static_assert(offsetof(UItemCraftingIngredientListEntryHaveNeedVerbose_C, ItemCountNeed) == 0x000248, "Member 'UItemCraftingIngredientListEntryHaveNeedVerbose_C::ItemCountNeed' has a wrong offset!");
static_assert(offsetof(UItemCraftingIngredientListEntryHaveNeedVerbose_C, ItemIcon) == 0x000250, "Member 'UItemCraftingIngredientListEntryHaveNeedVerbose_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UItemCraftingIngredientListEntryHaveNeedVerbose_C, ItemName) == 0x000258, "Member 'UItemCraftingIngredientListEntryHaveNeedVerbose_C::ItemName' has a wrong offset!");
static_assert(offsetof(UItemCraftingIngredientListEntryHaveNeedVerbose_C, TextDescription) == 0x000260, "Member 'UItemCraftingIngredientListEntryHaveNeedVerbose_C::TextDescription' has a wrong offset!");
static_assert(offsetof(UItemCraftingIngredientListEntryHaveNeedVerbose_C, TextSlash) == 0x000268, "Member 'UItemCraftingIngredientListEntryHaveNeedVerbose_C::TextSlash' has a wrong offset!");
static_assert(offsetof(UItemCraftingIngredientListEntryHaveNeedVerbose_C, bOverrideTextStyle) == 0x000270, "Member 'UItemCraftingIngredientListEntryHaveNeedVerbose_C::bOverrideTextStyle' has a wrong offset!");
static_assert(offsetof(UItemCraftingIngredientListEntryHaveNeedVerbose_C, TextStyle) == 0x000278, "Member 'UItemCraftingIngredientListEntryHaveNeedVerbose_C::TextStyle' has a wrong offset!");

}

