#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemInspectEvolutionChoiceEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PanelButton_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemInspectEvolutionChoiceEntry.ItemInspectEvolutionChoiceEntry_C
// 0x0070 (0x0820 - 0x07B0)
class UItemInspectEvolutionChoiceEntry_C final : public UPanelButton_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ItemInspectEvolutionChoiceEntry_C;  // 0x07B0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Grow;                                              // 0x07B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DisabledOverlay;                                   // 0x07C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x07C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x07D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 ItemCard;                                          // 0x07D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnEvolutionChoiceHovered;                          // 0x07E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnEvolutionChoiceUnhovered;                        // 0x07F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnEvolutionChoiceSelected;                         // 0x0800(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UFortItem*                              ItemRepresented;                                   // 0x0810(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RecipeIndexRepresented;                            // 0x0818(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnEvolutionChoiceHovered__DelegateSignature(class UFortItem* Item, int32 RecipeIndex);
	void OnEvolutionChoiceUnhovered__DelegateSignature(class UFortItem* Item);
	void OnEvolutionChoiceSelected__DelegateSignature(class UFortItem* Item, int32 RecipeIndex);
	void ExecuteUbergraph_ItemInspectEvolutionChoiceEntry(int32 EntryPoint);
	void OnSelected();
	void SetItemToRepresent(class UFortItem* Item, int32 RecipeIndex, bool EnabledChoice);
	void SelectEvolutionChoice();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemInspectEvolutionChoiceEntry_C">();
	}
	static class UItemInspectEvolutionChoiceEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemInspectEvolutionChoiceEntry_C>();
	}
};
static_assert(alignof(UItemInspectEvolutionChoiceEntry_C) == 0x000008, "Wrong alignment on UItemInspectEvolutionChoiceEntry_C");
static_assert(sizeof(UItemInspectEvolutionChoiceEntry_C) == 0x000820, "Wrong size on UItemInspectEvolutionChoiceEntry_C");
static_assert(offsetof(UItemInspectEvolutionChoiceEntry_C, UberGraphFrame_ItemInspectEvolutionChoiceEntry_C) == 0x0007B0, "Member 'UItemInspectEvolutionChoiceEntry_C::UberGraphFrame_ItemInspectEvolutionChoiceEntry_C' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionChoiceEntry_C, Grow) == 0x0007B8, "Member 'UItemInspectEvolutionChoiceEntry_C::Grow' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionChoiceEntry_C, DisabledOverlay) == 0x0007C0, "Member 'UItemInspectEvolutionChoiceEntry_C::DisabledOverlay' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionChoiceEntry_C, Image_0) == 0x0007C8, "Member 'UItemInspectEvolutionChoiceEntry_C::Image_0' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionChoiceEntry_C, Image_1) == 0x0007D0, "Member 'UItemInspectEvolutionChoiceEntry_C::Image_1' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionChoiceEntry_C, ItemCard) == 0x0007D8, "Member 'UItemInspectEvolutionChoiceEntry_C::ItemCard' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionChoiceEntry_C, OnEvolutionChoiceHovered) == 0x0007E0, "Member 'UItemInspectEvolutionChoiceEntry_C::OnEvolutionChoiceHovered' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionChoiceEntry_C, OnEvolutionChoiceUnhovered) == 0x0007F0, "Member 'UItemInspectEvolutionChoiceEntry_C::OnEvolutionChoiceUnhovered' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionChoiceEntry_C, OnEvolutionChoiceSelected) == 0x000800, "Member 'UItemInspectEvolutionChoiceEntry_C::OnEvolutionChoiceSelected' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionChoiceEntry_C, ItemRepresented) == 0x000810, "Member 'UItemInspectEvolutionChoiceEntry_C::ItemRepresented' has a wrong offset!");
static_assert(offsetof(UItemInspectEvolutionChoiceEntry_C, RecipeIndexRepresented) == 0x000818, "Member 'UItemInspectEvolutionChoiceEntry_C::RecipeIndexRepresented' has a wrong offset!");

}

