#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemTransformSlotEntry

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function ItemTransformSlotEntry.ItemTransformSlotEntry_C.ExecuteUbergraph_ItemTransformSlotEntry
// 0x0050 (0x0050 - 0x0000)
struct ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button3;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Selected;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue2;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue2;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry) == 0x000008, "Wrong alignment on ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry");
static_assert(sizeof(ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry) == 0x000050, "Wrong size on ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry");
static_assert(offsetof(ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry, EntryPoint) == 0x000000, "Member 'ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry, K2Node_ComponentBoundEvent_Button3) == 0x000008, "Member 'ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry, K2Node_Event_IsDesignTime) == 0x000010, "Member 'ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry, K2Node_ComponentBoundEvent_Button2) == 0x000018, "Member 'ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry, K2Node_ComponentBoundEvent_Button) == 0x000020, "Member 'ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry, K2Node_ComponentBoundEvent_Selected) == 0x000028, "Member 'ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry::K2Node_ComponentBoundEvent_Selected' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry, CallFunc_IsUsingGamepad_ReturnValue) == 0x000038, "Member 'ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry, CallFunc_GetContext_ReturnValue2) == 0x000040, "Member 'ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry, CallFunc_IsUsingGamepad_ReturnValue2) == 0x000048, "Member 'ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry::CallFunc_IsUsingGamepad_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry, CallFunc_Not_PreBool_ReturnValue) == 0x000049, "Member 'ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry, CallFunc_BooleanAND_ReturnValue) == 0x00004A, "Member 'ItemTransformSlotEntry_C_ExecuteUbergraph_ItemTransformSlotEntry::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function ItemTransformSlotEntry.ItemTransformSlotEntry_C.BndEvt__PanelButton_K2Node_ComponentBoundEvent_115_CommonSelectedStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct ItemTransformSlotEntry_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_115_CommonSelectedStateChanged__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemTransformSlotEntry_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_115_CommonSelectedStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on ItemTransformSlotEntry_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_115_CommonSelectedStateChanged__DelegateSignature");
static_assert(sizeof(ItemTransformSlotEntry_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_115_CommonSelectedStateChanged__DelegateSignature) == 0x000010, "Wrong size on ItemTransformSlotEntry_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_115_CommonSelectedStateChanged__DelegateSignature");
static_assert(offsetof(ItemTransformSlotEntry_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_115_CommonSelectedStateChanged__DelegateSignature, Button) == 0x000000, "Member 'ItemTransformSlotEntry_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_115_CommonSelectedStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotEntry_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_115_CommonSelectedStateChanged__DelegateSignature, Selected) == 0x000008, "Member 'ItemTransformSlotEntry_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_115_CommonSelectedStateChanged__DelegateSignature::Selected' has a wrong offset!");

// Function ItemTransformSlotEntry.ItemTransformSlotEntry_C.BndEvt__PanelButton_K2Node_ComponentBoundEvent_93_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ItemTransformSlotEntry_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_93_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemTransformSlotEntry_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_93_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ItemTransformSlotEntry_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_93_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ItemTransformSlotEntry_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_93_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ItemTransformSlotEntry_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_93_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ItemTransformSlotEntry_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_93_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ItemTransformSlotEntry_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_93_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ItemTransformSlotEntry.ItemTransformSlotEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ItemTransformSlotEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemTransformSlotEntry_C_PreConstruct) == 0x000001, "Wrong alignment on ItemTransformSlotEntry_C_PreConstruct");
static_assert(sizeof(ItemTransformSlotEntry_C_PreConstruct) == 0x000001, "Wrong size on ItemTransformSlotEntry_C_PreConstruct");
static_assert(offsetof(ItemTransformSlotEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ItemTransformSlotEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ItemTransformSlotEntry.ItemTransformSlotEntry_C.BndEvt__PanelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ItemTransformSlotEntry_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemTransformSlotEntry_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ItemTransformSlotEntry_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ItemTransformSlotEntry_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ItemTransformSlotEntry_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ItemTransformSlotEntry_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ItemTransformSlotEntry_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ItemTransformSlotEntry.ItemTransformSlotEntry_C.SetSacrificeItem
// 0x0038 (0x0038 - 0x0000)
struct ItemTransformSlotEntry_C_SetSacrificeItem final
{
public:
	class UFortItem*                              SelectedSacrificeItem;                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransmogSacrifice                     CallFunc_GetTransmogSacrificeDataFromItemDefintion_OutTransmogData; // 0x0020(0x0010)()
	bool                                          CallFunc_GetTransmogSacrificeDataFromItemDefintion_ReturnValue; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemTransformSlotEntry_C_SetSacrificeItem) == 0x000008, "Wrong alignment on ItemTransformSlotEntry_C_SetSacrificeItem");
static_assert(sizeof(ItemTransformSlotEntry_C_SetSacrificeItem) == 0x000038, "Wrong size on ItemTransformSlotEntry_C_SetSacrificeItem");
static_assert(offsetof(ItemTransformSlotEntry_C_SetSacrificeItem, SelectedSacrificeItem) == 0x000000, "Member 'ItemTransformSlotEntry_C_SetSacrificeItem::SelectedSacrificeItem' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotEntry_C_SetSacrificeItem, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000008, "Member 'ItemTransformSlotEntry_C_SetSacrificeItem::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotEntry_C_SetSacrificeItem, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'ItemTransformSlotEntry_C_SetSacrificeItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotEntry_C_SetSacrificeItem, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'ItemTransformSlotEntry_C_SetSacrificeItem::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotEntry_C_SetSacrificeItem, CallFunc_GetTransmogSacrificeDataFromItemDefintion_OutTransmogData) == 0x000020, "Member 'ItemTransformSlotEntry_C_SetSacrificeItem::CallFunc_GetTransmogSacrificeDataFromItemDefintion_OutTransmogData' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotEntry_C_SetSacrificeItem, CallFunc_GetTransmogSacrificeDataFromItemDefintion_ReturnValue) == 0x000030, "Member 'ItemTransformSlotEntry_C_SetSacrificeItem::CallFunc_GetTransmogSacrificeDataFromItemDefintion_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotEntry_C_SetSacrificeItem, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000034, "Member 'ItemTransformSlotEntry_C_SetSacrificeItem::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");

// Function ItemTransformSlotEntry.ItemTransformSlotEntry_C.SetSlotSelection
// 0x0001 (0x0001 - 0x0000)
struct ItemTransformSlotEntry_C_SetSlotSelection final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemTransformSlotEntry_C_SetSlotSelection) == 0x000001, "Wrong alignment on ItemTransformSlotEntry_C_SetSlotSelection");
static_assert(sizeof(ItemTransformSlotEntry_C_SetSlotSelection) == 0x000001, "Wrong size on ItemTransformSlotEntry_C_SetSlotSelection");
static_assert(offsetof(ItemTransformSlotEntry_C_SetSlotSelection, Selected) == 0x000000, "Member 'ItemTransformSlotEntry_C_SetSlotSelection::Selected' has a wrong offset!");

}

