#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemManagementItemTileButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemManagementItemTileButton.ItemManagementItemTileButton_C
// 0x00A8 (0x08A8 - 0x0800)
class UItemManagementItemTileButton_C final : public UFortItemManagementItemTileButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0800(0x0008)(Transient, DuplicateTransient)
	class UBorder*                                CurrentlySlottedIndicatorLayer;                    // 0x0808(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                EquipSlotBorder;                                   // 0x0810(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EquipSlotOverlay;                                  // 0x0818(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0820(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageSquad;                                        // 0x0828(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               InputActionWrapper;                                // 0x0830(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ItemWidgetHolder;                                  // 0x0838(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    MarkForMulchAction;                                // 0x0840(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MulchCountText;                                    // 0x0848(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                MulchIndicatorBorder;                              // 0x0850(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                MulchStateBorder;                                  // 0x0858(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MulchStateBox;                                     // 0x0860(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MulchStateIndicatorImage;                          // 0x0868(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNormalBangWrapper_C*                   NormalBangWrapper;                                 // 0x0870(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           NotCraftableIconVerticalBox;                       // 0x0878(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               QuantityProducedOverlay;                           // 0x0880(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       QuantityProducedText;                              // 0x0888(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TileDimmer;                                        // 0x0890(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VaultOverflowedIndicator;                          // 0x0898(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                VaultOverflowedIndicatorLayer;                     // 0x08A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ItemManagementItemTileButton(int32 EntryPoint);
	void OnClicked();
	void HandleItemChangedBP();
	void OnSelected();
	void OnDragCancelled(const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void HandleEquipSlotChanged(int32 EquipSlot);
	void HandleHasItemToCompareDetailsWithChanged();
	void HandleHasItemToDetailChanged();
	void OnUnhovered();
	void OnHovered();
	void HandleDifferentItemManagementModeSetBP();
	void HandleItemMulchStateChanged();
	void UpdateMulchStateBox();
	void UpdateStyle();
	struct FEventReply On_ItemWidgetHolder_MouseButtonDown(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent);
	void OnDragDetected(const struct FGeometry& MyGeometry, struct FPointerEvent& PointerEvent, class UDragDropOperation** Operation);
	void SetEquipSlotOverlay(int32 EquipSlot);
	void UpdateInteractionWidgetVisibility();
	void UpdateBangState();
	void UpdateQuantityProduced();
	void HandleSlottedSurvivor();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemManagementItemTileButton_C">();
	}
	static class UItemManagementItemTileButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemManagementItemTileButton_C>();
	}
};
static_assert(alignof(UItemManagementItemTileButton_C) == 0x000008, "Wrong alignment on UItemManagementItemTileButton_C");
static_assert(sizeof(UItemManagementItemTileButton_C) == 0x0008A8, "Wrong size on UItemManagementItemTileButton_C");
static_assert(offsetof(UItemManagementItemTileButton_C, UberGraphFrame) == 0x000800, "Member 'UItemManagementItemTileButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemManagementItemTileButton_C, CurrentlySlottedIndicatorLayer) == 0x000808, "Member 'UItemManagementItemTileButton_C::CurrentlySlottedIndicatorLayer' has a wrong offset!");
static_assert(offsetof(UItemManagementItemTileButton_C, EquipSlotBorder) == 0x000810, "Member 'UItemManagementItemTileButton_C::EquipSlotBorder' has a wrong offset!");
static_assert(offsetof(UItemManagementItemTileButton_C, EquipSlotOverlay) == 0x000818, "Member 'UItemManagementItemTileButton_C::EquipSlotOverlay' has a wrong offset!");
static_assert(offsetof(UItemManagementItemTileButton_C, Image_0) == 0x000820, "Member 'UItemManagementItemTileButton_C::Image_0' has a wrong offset!");
static_assert(offsetof(UItemManagementItemTileButton_C, ImageSquad) == 0x000828, "Member 'UItemManagementItemTileButton_C::ImageSquad' has a wrong offset!");
static_assert(offsetof(UItemManagementItemTileButton_C, InputActionWrapper) == 0x000830, "Member 'UItemManagementItemTileButton_C::InputActionWrapper' has a wrong offset!");
static_assert(offsetof(UItemManagementItemTileButton_C, ItemWidgetHolder) == 0x000838, "Member 'UItemManagementItemTileButton_C::ItemWidgetHolder' has a wrong offset!");
static_assert(offsetof(UItemManagementItemTileButton_C, MarkForMulchAction) == 0x000840, "Member 'UItemManagementItemTileButton_C::MarkForMulchAction' has a wrong offset!");
static_assert(offsetof(UItemManagementItemTileButton_C, MulchCountText) == 0x000848, "Member 'UItemManagementItemTileButton_C::MulchCountText' has a wrong offset!");
static_assert(offsetof(UItemManagementItemTileButton_C, MulchIndicatorBorder) == 0x000850, "Member 'UItemManagementItemTileButton_C::MulchIndicatorBorder' has a wrong offset!");
static_assert(offsetof(UItemManagementItemTileButton_C, MulchStateBorder) == 0x000858, "Member 'UItemManagementItemTileButton_C::MulchStateBorder' has a wrong offset!");
static_assert(offsetof(UItemManagementItemTileButton_C, MulchStateBox) == 0x000860, "Member 'UItemManagementItemTileButton_C::MulchStateBox' has a wrong offset!");
static_assert(offsetof(UItemManagementItemTileButton_C, MulchStateIndicatorImage) == 0x000868, "Member 'UItemManagementItemTileButton_C::MulchStateIndicatorImage' has a wrong offset!");
static_assert(offsetof(UItemManagementItemTileButton_C, NormalBangWrapper) == 0x000870, "Member 'UItemManagementItemTileButton_C::NormalBangWrapper' has a wrong offset!");
static_assert(offsetof(UItemManagementItemTileButton_C, NotCraftableIconVerticalBox) == 0x000878, "Member 'UItemManagementItemTileButton_C::NotCraftableIconVerticalBox' has a wrong offset!");
static_assert(offsetof(UItemManagementItemTileButton_C, QuantityProducedOverlay) == 0x000880, "Member 'UItemManagementItemTileButton_C::QuantityProducedOverlay' has a wrong offset!");
static_assert(offsetof(UItemManagementItemTileButton_C, QuantityProducedText) == 0x000888, "Member 'UItemManagementItemTileButton_C::QuantityProducedText' has a wrong offset!");
static_assert(offsetof(UItemManagementItemTileButton_C, TileDimmer) == 0x000890, "Member 'UItemManagementItemTileButton_C::TileDimmer' has a wrong offset!");
static_assert(offsetof(UItemManagementItemTileButton_C, VaultOverflowedIndicator) == 0x000898, "Member 'UItemManagementItemTileButton_C::VaultOverflowedIndicator' has a wrong offset!");
static_assert(offsetof(UItemManagementItemTileButton_C, VaultOverflowedIndicatorLayer) == 0x0008A0, "Member 'UItemManagementItemTileButton_C::VaultOverflowedIndicatorLayer' has a wrong offset!");

}

