#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemManagementDetailsModeBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.ExecuteUbergraph_ItemManagementDetailsModeBox
// 0x0148 (0x0148 - 0x0000)
struct ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMulchConfirmationItem_C*               CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0028(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0040(0x0018)()
	class UWidget*                                K2Node_ComponentBoundEvent_ActiveWidget;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ActiveWidgetIndex;      // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDetailsHostPanel*              K2Node_DynamicCast_AsFort_Item_Details_Host_Panel; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetWidgetAtIndex_ReturnValue;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDetailsHostPanel*              K2Node_DynamicCast_AsFort_Item_Details_Host_Panel2; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_TabId4;                 // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_TabButton4;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_TabId3;                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_TabButton3;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_TabId2;                 // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_TabButton2;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable;                                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_TabId;                  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_TabButton;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bUsingGamepad;                        // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              K2Node_CustomEvent_Item;                           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumInStack_ReturnValue;                // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0110(0x0018)()
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             K2Node_CustomEvent_Result;                         // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName;                     // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox");
static_assert(sizeof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox) == 0x000148, "Wrong size on ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, EntryPoint) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, CallFunc_Create_ReturnValue) == 0x000008, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, Temp_bool_Variable) == 0x000020, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, Temp_text_Variable) == 0x000028, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, Temp_text_Variable2) == 0x000040, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_ComponentBoundEvent_ActiveWidget) == 0x000058, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_ComponentBoundEvent_ActiveWidget' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_ComponentBoundEvent_ActiveWidgetIndex) == 0x000060, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_ComponentBoundEvent_ActiveWidgetIndex' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000064, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_DynamicCast_AsFort_Item_Details_Host_Panel) == 0x000068, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_DynamicCast_AsFort_Item_Details_Host_Panel' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, CallFunc_GetWidgetAtIndex_ReturnValue) == 0x000078, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::CallFunc_GetWidgetAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_DynamicCast_AsFort_Item_Details_Host_Panel2) == 0x000080, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_DynamicCast_AsFort_Item_Details_Host_Panel2' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_DynamicCast_bSuccess2) == 0x000088, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_ComponentBoundEvent_TabId4) == 0x000090, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_ComponentBoundEvent_TabId4' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_ComponentBoundEvent_TabButton4) == 0x000098, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_ComponentBoundEvent_TabButton4' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_ComponentBoundEvent_TabId3) == 0x0000A0, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_ComponentBoundEvent_TabId3' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_ComponentBoundEvent_TabButton3) == 0x0000A8, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_ComponentBoundEvent_TabButton3' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_ComponentBoundEvent_TabId2) == 0x0000B0, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_ComponentBoundEvent_TabId2' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_ComponentBoundEvent_TabButton2) == 0x0000B8, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_ComponentBoundEvent_TabButton2' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_SwitchEnum_CmpSuccess) == 0x0000C0, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, CallFunc_GetContext_ReturnValue) == 0x0000C8, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, Temp_byte_Variable) == 0x0000D0, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000D1, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_ComponentBoundEvent_TabId) == 0x0000D8, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_ComponentBoundEvent_TabId' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_ComponentBoundEvent_TabButton) == 0x0000E0, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_ComponentBoundEvent_TabButton' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_Event_bUsingGamepad) == 0x0000E8, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_Event_bUsingGamepad' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_CustomEvent_Item) == 0x0000F0, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_CustomEvent_Item' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, CallFunc_IsValid_ReturnValue) == 0x0000F8, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, CallFunc_GetNumInStack_ReturnValue) == 0x0000FC, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::CallFunc_GetNumInStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, CallFunc_Greater_IntInt_ReturnValue) == 0x000100, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, Temp_name_Variable) == 0x000108, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_Select_Default) == 0x000110, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue) == 0x000128, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_CustomEvent_Result) == 0x000130, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, K2Node_CustomEvent_ResultName) == 0x000138, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::K2Node_CustomEvent_ResultName' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox, CallFunc_IsValid_ReturnValue2) == 0x000140, "Member 'ItemManagementDetailsModeBox_C_ExecuteUbergraph_ItemManagementDetailsModeBox::CallFunc_IsValid_ReturnValue2' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.OnDestroyItem
// 0x0008 (0x0008 - 0x0000)
struct ItemManagementDetailsModeBox_C_OnDestroyItem final
{
public:
	class UFortItem*                              Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_OnDestroyItem) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_OnDestroyItem");
static_assert(sizeof(ItemManagementDetailsModeBox_C_OnDestroyItem) == 0x000008, "Wrong size on ItemManagementDetailsModeBox_C_OnDestroyItem");
static_assert(offsetof(ItemManagementDetailsModeBox_C_OnDestroyItem, Item) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_OnDestroyItem::Item' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.OnInputModeChanged
// 0x0001 (0x0001 - 0x0000)
struct ItemManagementDetailsModeBox_C_OnInputModeChanged final
{
public:
	bool                                          bUsingGamepad;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_OnInputModeChanged) == 0x000001, "Wrong alignment on ItemManagementDetailsModeBox_C_OnInputModeChanged");
static_assert(sizeof(ItemManagementDetailsModeBox_C_OnInputModeChanged) == 0x000001, "Wrong size on ItemManagementDetailsModeBox_C_OnInputModeChanged");
static_assert(offsetof(ItemManagementDetailsModeBox_C_OnInputModeChanged, bUsingGamepad) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_OnInputModeChanged::bUsingGamepad' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.BndEvt__DetailPanelTabList-MSB_K2Node_ComponentBoundEvent_18_OnTabButtonCreated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusMSB_K2Node_ComponentBoundEvent_18_OnTabButtonCreated__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusMSB_K2Node_ComponentBoundEvent_18_OnTabButtonCreated__DelegateSignature) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusMSB_K2Node_ComponentBoundEvent_18_OnTabButtonCreated__DelegateSignature");
static_assert(sizeof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusMSB_K2Node_ComponentBoundEvent_18_OnTabButtonCreated__DelegateSignature) == 0x000010, "Wrong size on ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusMSB_K2Node_ComponentBoundEvent_18_OnTabButtonCreated__DelegateSignature");
static_assert(offsetof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusMSB_K2Node_ComponentBoundEvent_18_OnTabButtonCreated__DelegateSignature, TabId) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusMSB_K2Node_ComponentBoundEvent_18_OnTabButtonCreated__DelegateSignature::TabId' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusMSB_K2Node_ComponentBoundEvent_18_OnTabButtonCreated__DelegateSignature, TabButton) == 0x000008, "Member 'ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusMSB_K2Node_ComponentBoundEvent_18_OnTabButtonCreated__DelegateSignature::TabButton' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.BndEvt__DetailPanelTabList-OI_K2Node_ComponentBoundEvent_27_OnTabButtonCreated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOI_K2Node_ComponentBoundEvent_27_OnTabButtonCreated__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOI_K2Node_ComponentBoundEvent_27_OnTabButtonCreated__DelegateSignature) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOI_K2Node_ComponentBoundEvent_27_OnTabButtonCreated__DelegateSignature");
static_assert(sizeof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOI_K2Node_ComponentBoundEvent_27_OnTabButtonCreated__DelegateSignature) == 0x000010, "Wrong size on ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOI_K2Node_ComponentBoundEvent_27_OnTabButtonCreated__DelegateSignature");
static_assert(offsetof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOI_K2Node_ComponentBoundEvent_27_OnTabButtonCreated__DelegateSignature, TabId) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOI_K2Node_ComponentBoundEvent_27_OnTabButtonCreated__DelegateSignature::TabId' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOI_K2Node_ComponentBoundEvent_27_OnTabButtonCreated__DelegateSignature, TabButton) == 0x000008, "Member 'ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOI_K2Node_ComponentBoundEvent_27_OnTabButtonCreated__DelegateSignature::TabButton' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.BndEvt__DetailPanelTabList-OP_K2Node_ComponentBoundEvent_15_OnTabButtonCreated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOP_K2Node_ComponentBoundEvent_15_OnTabButtonCreated__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOP_K2Node_ComponentBoundEvent_15_OnTabButtonCreated__DelegateSignature) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOP_K2Node_ComponentBoundEvent_15_OnTabButtonCreated__DelegateSignature");
static_assert(sizeof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOP_K2Node_ComponentBoundEvent_15_OnTabButtonCreated__DelegateSignature) == 0x000010, "Wrong size on ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOP_K2Node_ComponentBoundEvent_15_OnTabButtonCreated__DelegateSignature");
static_assert(offsetof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOP_K2Node_ComponentBoundEvent_15_OnTabButtonCreated__DelegateSignature, TabId) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOP_K2Node_ComponentBoundEvent_15_OnTabButtonCreated__DelegateSignature::TabId' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOP_K2Node_ComponentBoundEvent_15_OnTabButtonCreated__DelegateSignature, TabButton) == 0x000008, "Member 'ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOP_K2Node_ComponentBoundEvent_15_OnTabButtonCreated__DelegateSignature::TabButton' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.BndEvt__DetailPanelTabList-OPI_K2Node_ComponentBoundEvent_4_OnTabButtonCreated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOPI_K2Node_ComponentBoundEvent_4_OnTabButtonCreated__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOPI_K2Node_ComponentBoundEvent_4_OnTabButtonCreated__DelegateSignature) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOPI_K2Node_ComponentBoundEvent_4_OnTabButtonCreated__DelegateSignature");
static_assert(sizeof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOPI_K2Node_ComponentBoundEvent_4_OnTabButtonCreated__DelegateSignature) == 0x000010, "Wrong size on ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOPI_K2Node_ComponentBoundEvent_4_OnTabButtonCreated__DelegateSignature");
static_assert(offsetof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOPI_K2Node_ComponentBoundEvent_4_OnTabButtonCreated__DelegateSignature, TabId) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOPI_K2Node_ComponentBoundEvent_4_OnTabButtonCreated__DelegateSignature::TabId' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOPI_K2Node_ComponentBoundEvent_4_OnTabButtonCreated__DelegateSignature, TabButton) == 0x000008, "Member 'ItemManagementDetailsModeBox_C_BndEvt__DetailPanelTabListMinusOPI_K2Node_ComponentBoundEvent_4_OnTabButtonCreated__DelegateSignature::TabButton' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.BndEvt__DetailPanelWidgetSwitcher_K2Node_ComponentBoundEvent_16_OnActiveWidgetChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct ItemManagementDetailsModeBox_C_BndEvt__DetailPanelWidgetSwitcher_K2Node_ComponentBoundEvent_16_OnActiveWidgetChanged__DelegateSignature final
{
public:
	class UWidget*                                ActiveWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ActiveWidgetIndex;                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelWidgetSwitcher_K2Node_ComponentBoundEvent_16_OnActiveWidgetChanged__DelegateSignature) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_BndEvt__DetailPanelWidgetSwitcher_K2Node_ComponentBoundEvent_16_OnActiveWidgetChanged__DelegateSignature");
static_assert(sizeof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelWidgetSwitcher_K2Node_ComponentBoundEvent_16_OnActiveWidgetChanged__DelegateSignature) == 0x000010, "Wrong size on ItemManagementDetailsModeBox_C_BndEvt__DetailPanelWidgetSwitcher_K2Node_ComponentBoundEvent_16_OnActiveWidgetChanged__DelegateSignature");
static_assert(offsetof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelWidgetSwitcher_K2Node_ComponentBoundEvent_16_OnActiveWidgetChanged__DelegateSignature, ActiveWidget) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_BndEvt__DetailPanelWidgetSwitcher_K2Node_ComponentBoundEvent_16_OnActiveWidgetChanged__DelegateSignature::ActiveWidget' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_BndEvt__DetailPanelWidgetSwitcher_K2Node_ComponentBoundEvent_16_OnActiveWidgetChanged__DelegateSignature, ActiveWidgetIndex) == 0x000008, "Member 'ItemManagementDetailsModeBox_C_BndEvt__DetailPanelWidgetSwitcher_K2Node_ComponentBoundEvent_16_OnActiveWidgetChanged__DelegateSignature::ActiveWidgetIndex' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.DialogResult_475B18A9452A639A04116D83A8B1CC22
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) ItemManagementDetailsModeBox_C_DialogResult_475B18A9452A639A04116D83A8B1CC22 final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_DialogResult_475B18A9452A639A04116D83A8B1CC22) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_DialogResult_475B18A9452A639A04116D83A8B1CC22");
static_assert(sizeof(ItemManagementDetailsModeBox_C_DialogResult_475B18A9452A639A04116D83A8B1CC22) == 0x000010, "Wrong size on ItemManagementDetailsModeBox_C_DialogResult_475B18A9452A639A04116D83A8B1CC22");
static_assert(offsetof(ItemManagementDetailsModeBox_C_DialogResult_475B18A9452A639A04116D83A8B1CC22, Result) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_DialogResult_475B18A9452A639A04116D83A8B1CC22::Result' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_DialogResult_475B18A9452A639A04116D83A8B1CC22, ResultName) == 0x000008, "Member 'ItemManagementDetailsModeBox_C_DialogResult_475B18A9452A639A04116D83A8B1CC22::ResultName' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.HandleBack
// 0x0018 (0x0018 - 0x0000)
struct ItemManagementDetailsModeBox_C_HandleBack final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemManagementScreen_C*                K2Node_DynamicCast_AsItem_Management_Screen;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_HandleBack) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_HandleBack");
static_assert(sizeof(ItemManagementDetailsModeBox_C_HandleBack) == 0x000018, "Wrong size on ItemManagementDetailsModeBox_C_HandleBack");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleBack, Passthrough) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_HandleBack::Passthrough' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleBack, K2Node_DynamicCast_AsItem_Management_Screen) == 0x000008, "Member 'ItemManagementDetailsModeBox_C_HandleBack::K2Node_DynamicCast_AsItem_Management_Screen' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleBack, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ItemManagementDetailsModeBox_C_HandleBack::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.HandleInspect
// 0x0001 (0x0001 - 0x0000)
struct ItemManagementDetailsModeBox_C_HandleInspect final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_HandleInspect) == 0x000001, "Wrong alignment on ItemManagementDetailsModeBox_C_HandleInspect");
static_assert(sizeof(ItemManagementDetailsModeBox_C_HandleInspect) == 0x000001, "Wrong size on ItemManagementDetailsModeBox_C_HandleInspect");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleInspect, Passthrough) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_HandleInspect::Passthrough' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.HandleCompare
// 0x0002 (0x0002 - 0x0000)
struct ItemManagementDetailsModeBox_C_HandleCompare final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_HandleCompare) == 0x000001, "Wrong alignment on ItemManagementDetailsModeBox_C_HandleCompare");
static_assert(sizeof(ItemManagementDetailsModeBox_C_HandleCompare) == 0x000002, "Wrong size on ItemManagementDetailsModeBox_C_HandleCompare");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleCompare, Passthrough) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_HandleCompare::Passthrough' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleCompare, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'ItemManagementDetailsModeBox_C_HandleCompare::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.HandleMulch
// 0x0001 (0x0001 - 0x0000)
struct ItemManagementDetailsModeBox_C_HandleMulch final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_HandleMulch) == 0x000001, "Wrong alignment on ItemManagementDetailsModeBox_C_HandleMulch");
static_assert(sizeof(ItemManagementDetailsModeBox_C_HandleMulch) == 0x000001, "Wrong size on ItemManagementDetailsModeBox_C_HandleMulch");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleMulch, Passthrough) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_HandleMulch::Passthrough' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.HandleSort
// 0x0001 (0x0001 - 0x0000)
struct ItemManagementDetailsModeBox_C_HandleSort final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_HandleSort) == 0x000001, "Wrong alignment on ItemManagementDetailsModeBox_C_HandleSort");
static_assert(sizeof(ItemManagementDetailsModeBox_C_HandleSort) == 0x000001, "Wrong size on ItemManagementDetailsModeBox_C_HandleSort");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleSort, Passthrough) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_HandleSort::Passthrough' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.TrySetupInputHandling
// 0x0020 (0x0020 - 0x0000)
struct ItemManagementDetailsModeBox_C_TrySetupInputHandling final
{
public:
	bool                                          CallFunc_IsSchematic_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCommonInputActionHandlerData>  CallFunc_GetInputActions_InputActionDataRows;      // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_GetInputActions_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_TrySetupInputHandling) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_TrySetupInputHandling");
static_assert(sizeof(ItemManagementDetailsModeBox_C_TrySetupInputHandling) == 0x000020, "Wrong size on ItemManagementDetailsModeBox_C_TrySetupInputHandling");
static_assert(offsetof(ItemManagementDetailsModeBox_C_TrySetupInputHandling, CallFunc_IsSchematic_ReturnValue) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_TrySetupInputHandling::CallFunc_IsSchematic_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_TrySetupInputHandling, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'ItemManagementDetailsModeBox_C_TrySetupInputHandling::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_TrySetupInputHandling, CallFunc_GetInputActions_InputActionDataRows) == 0x000008, "Member 'ItemManagementDetailsModeBox_C_TrySetupInputHandling::CallFunc_GetInputActions_InputActionDataRows' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_TrySetupInputHandling, CallFunc_GetInputActions_ReturnValue) == 0x000018, "Member 'ItemManagementDetailsModeBox_C_TrySetupInputHandling::CallFunc_GetInputActions_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_TrySetupInputHandling, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000019, "Member 'ItemManagementDetailsModeBox_C_TrySetupInputHandling::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_TrySetupInputHandling, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x00001A, "Member 'ItemManagementDetailsModeBox_C_TrySetupInputHandling::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_TrySetupInputHandling, K2Node_SwitchEnum_CmpSuccess) == 0x00001B, "Member 'ItemManagementDetailsModeBox_C_TrySetupInputHandling::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_TrySetupInputHandling, CallFunc_BooleanOR_ReturnValue) == 0x00001C, "Member 'ItemManagementDetailsModeBox_C_TrySetupInputHandling::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_TrySetupInputHandling, K2Node_SwitchEnum2_CmpSuccess) == 0x00001D, "Member 'ItemManagementDetailsModeBox_C_TrySetupInputHandling::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.HandleConsumeItem
// 0x0058 (0x0058 - 0x0000)
struct ItemManagementDetailsModeBox_C_HandleConsumeItem final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue2;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputManager*                    CallFunc_GetInputManager_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue3;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBoostsRoot_C*                          CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue4;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortConsumableAccountItem*             K2Node_DynamicCast_AsFort_Consumable_Account_Item; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanActivateOnOthers_ReturnValue;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanActivateOnSelf_ReturnValue;            // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_HandleConsumeItem) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_HandleConsumeItem");
static_assert(sizeof(ItemManagementDetailsModeBox_C_HandleConsumeItem) == 0x000058, "Wrong size on ItemManagementDetailsModeBox_C_HandleConsumeItem");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleConsumeItem, Passthrough) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_HandleConsumeItem::Passthrough' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleConsumeItem, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'ItemManagementDetailsModeBox_C_HandleConsumeItem::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleConsumeItem, CallFunc_GetContext_ReturnValue2) == 0x000010, "Member 'ItemManagementDetailsModeBox_C_HandleConsumeItem::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleConsumeItem, CallFunc_GetInputManager_ReturnValue) == 0x000018, "Member 'ItemManagementDetailsModeBox_C_HandleConsumeItem::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleConsumeItem, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'ItemManagementDetailsModeBox_C_HandleConsumeItem::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleConsumeItem, CallFunc_GetContext_ReturnValue3) == 0x000028, "Member 'ItemManagementDetailsModeBox_C_HandleConsumeItem::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleConsumeItem, CallFunc_Create_ReturnValue) == 0x000030, "Member 'ItemManagementDetailsModeBox_C_HandleConsumeItem::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleConsumeItem, CallFunc_IsInZone_ReturnValue) == 0x000038, "Member 'ItemManagementDetailsModeBox_C_HandleConsumeItem::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleConsumeItem, CallFunc_GetContext_ReturnValue4) == 0x000040, "Member 'ItemManagementDetailsModeBox_C_HandleConsumeItem::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleConsumeItem, K2Node_DynamicCast_AsFort_Consumable_Account_Item) == 0x000048, "Member 'ItemManagementDetailsModeBox_C_HandleConsumeItem::K2Node_DynamicCast_AsFort_Consumable_Account_Item' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleConsumeItem, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'ItemManagementDetailsModeBox_C_HandleConsumeItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleConsumeItem, CallFunc_CanActivateOnOthers_ReturnValue) == 0x000051, "Member 'ItemManagementDetailsModeBox_C_HandleConsumeItem::CallFunc_CanActivateOnOthers_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleConsumeItem, CallFunc_CanActivateOnSelf_ReturnValue) == 0x000052, "Member 'ItemManagementDetailsModeBox_C_HandleConsumeItem::CallFunc_CanActivateOnSelf_ReturnValue' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.HandleCraft
// 0x0018 (0x0018 - 0x0000)
struct ItemManagementDetailsModeBox_C_HandleCraft final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSchematicItem*                     K2Node_DynamicCast_AsFort_Schematic_Item;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_HandleCraft) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_HandleCraft");
static_assert(sizeof(ItemManagementDetailsModeBox_C_HandleCraft) == 0x000018, "Wrong size on ItemManagementDetailsModeBox_C_HandleCraft");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleCraft, Passthrough) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_HandleCraft::Passthrough' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleCraft, K2Node_DynamicCast_AsFort_Schematic_Item) == 0x000008, "Member 'ItemManagementDetailsModeBox_C_HandleCraft::K2Node_DynamicCast_AsFort_Schematic_Item' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleCraft, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ItemManagementDetailsModeBox_C_HandleCraft::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.ShowSelection
// 0x0001 (0x0001 - 0x0000)
struct ItemManagementDetailsModeBox_C_ShowSelection final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_ShowSelection) == 0x000001, "Wrong alignment on ItemManagementDetailsModeBox_C_ShowSelection");
static_assert(sizeof(ItemManagementDetailsModeBox_C_ShowSelection) == 0x000001, "Wrong size on ItemManagementDetailsModeBox_C_ShowSelection");
static_assert(offsetof(ItemManagementDetailsModeBox_C_ShowSelection, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_ShowSelection::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.HandleDrop
// 0x0001 (0x0001 - 0x0000)
struct ItemManagementDetailsModeBox_C_HandleDrop final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_HandleDrop) == 0x000001, "Wrong alignment on ItemManagementDetailsModeBox_C_HandleDrop");
static_assert(sizeof(ItemManagementDetailsModeBox_C_HandleDrop) == 0x000001, "Wrong size on ItemManagementDetailsModeBox_C_HandleDrop");
static_assert(offsetof(ItemManagementDetailsModeBox_C_HandleDrop, Passthrough) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_HandleDrop::Passthrough' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.RegisterDropOrDestroy
// 0x0050 (0x0050 - 0x0000)
struct ItemManagementDetailsModeBox_C_RegisterDropOrDestroy final
{
public:
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0010(0x0010)(NoDestructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle2;             // 0x0040(0x0010)(NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_RegisterDropOrDestroy) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_RegisterDropOrDestroy");
static_assert(sizeof(ItemManagementDetailsModeBox_C_RegisterDropOrDestroy) == 0x000050, "Wrong size on ItemManagementDetailsModeBox_C_RegisterDropOrDestroy");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterDropOrDestroy, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_RegisterDropOrDestroy::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterDropOrDestroy, K2Node_MakeStruct_DataTableRowHandle) == 0x000010, "Member 'ItemManagementDetailsModeBox_C_RegisterDropOrDestroy::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterDropOrDestroy, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'ItemManagementDetailsModeBox_C_RegisterDropOrDestroy::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterDropOrDestroy, CallFunc_IsInZone_ReturnValue) == 0x000028, "Member 'ItemManagementDetailsModeBox_C_RegisterDropOrDestroy::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterDropOrDestroy, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'ItemManagementDetailsModeBox_C_RegisterDropOrDestroy::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterDropOrDestroy, K2Node_MakeStruct_DataTableRowHandle2) == 0x000040, "Member 'ItemManagementDetailsModeBox_C_RegisterDropOrDestroy::K2Node_MakeStruct_DataTableRowHandle2' has a wrong offset!");

// Function ItemManagementDetailsModeBox.ItemManagementDetailsModeBox_C.RegisterCraft
// 0x0080 (0x0080 - 0x0000)
struct ItemManagementDetailsModeBox_C_RegisterCraft final
{
public:
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFrontendCraftingEnabled_ReturnValue;    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue2;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue3;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TArray<class UFortWorldItem*>& ItemsAdded, TArray<class UFortWorldItem*>& ItemsRemoved)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate4;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0070(0x0010)(NoDestructor)
};
static_assert(alignof(ItemManagementDetailsModeBox_C_RegisterCraft) == 0x000008, "Wrong alignment on ItemManagementDetailsModeBox_C_RegisterCraft");
static_assert(sizeof(ItemManagementDetailsModeBox_C_RegisterCraft) == 0x000080, "Wrong size on ItemManagementDetailsModeBox_C_RegisterCraft");
static_assert(offsetof(ItemManagementDetailsModeBox_C_RegisterCraft, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'ItemManagementDetailsModeBox_C_RegisterCraft::CallFunc_GetContext_ReturnValue' has a wrong offset!");
