#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemManagementItemTileButton

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ItemManagementItemTileButton.ItemManagementItemTileButton_C.ExecuteUbergraph_ItemManagementItemTileButton
// 0x0120 (0x0120 - 0x0000)
struct ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreContextMenusEnabled_ReturnValue;       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable2;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemManagementMode                       CallFunc_GetItemManagementMode_ReturnValue;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemManagementMode                       CallFunc_GetItemManagementMode_ReturnValue2;       // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_EquipSlot;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0030(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_CanItemBeMulched_OutRestrictionReason;    // 0x0040(0x0018)()
	bool                                          CallFunc_CanItemBeMulched_ReturnValue;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_PointerEvent;                         // 0x0060(0x0070)()
	class UDragDropOperation*                     K2Node_Event_Operation;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemManagementInventoryPanel_C*        K2Node_DynamicCast_AsItem_Management_Inventory_Panel; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemManagementMode                       CallFunc_GetItemManagementMode_ReturnValue3;       // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EB[0x5];                                       // 0x00EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemManagementScreen_C*                K2Node_DynamicCast_AsItem_Management_Screen;       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemManagementScreen_C*                K2Node_DynamicCast_AsItem_Management_Screen2;      // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAccountItem*                       K2Node_DynamicCast_AsFort_Account_Item;            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInventoryOverflowItem_ReturnValue;      // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton) == 0x000008, "Wrong alignment on ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton");
static_assert(sizeof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton) == 0x000120, "Wrong size on ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, EntryPoint) == 0x000000, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, Temp_float_Variable) == 0x000010, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, CallFunc_AreContextMenusEnabled_ReturnValue) == 0x000014, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::CallFunc_AreContextMenusEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, Temp_float_Variable2) == 0x000018, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, Temp_bool_Variable) == 0x00001C, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, Temp_byte_Variable) == 0x00001D, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, Temp_byte_Variable2) == 0x00001E, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, Temp_bool_Variable2) == 0x00001F, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, CallFunc_GetItemManagementMode_ReturnValue) == 0x000020, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::CallFunc_GetItemManagementMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, K2Node_SwitchEnum_CmpSuccess) == 0x000022, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, CallFunc_GetItemManagementMode_ReturnValue2) == 0x000023, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::CallFunc_GetItemManagementMode_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, Temp_byte_Variable3) == 0x000024, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000025, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, CallFunc_IsHovered_ReturnValue) == 0x000026, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, K2Node_Event_EquipSlot) == 0x000028, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::K2Node_Event_EquipSlot' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, K2Node_Select_Default) == 0x00002C, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, K2Node_MakeStruct_LinearColor) == 0x000030, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, CallFunc_CanItemBeMulched_OutRestrictionReason) == 0x000040, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::CallFunc_CanItemBeMulched_OutRestrictionReason' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, CallFunc_CanItemBeMulched_ReturnValue) == 0x000058, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::CallFunc_CanItemBeMulched_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, CallFunc_Not_PreBool_ReturnValue2) == 0x000059, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, CallFunc_Not_PreBool_ReturnValue3) == 0x00005A, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, K2Node_Event_PointerEvent) == 0x000060, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::K2Node_Event_PointerEvent' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, K2Node_Event_Operation) == 0x0000D0, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::K2Node_Event_Operation' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, CallFunc_BooleanAND_ReturnValue) == 0x0000D8, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, CallFunc_BooleanAND_ReturnValue2) == 0x0000D9, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, K2Node_DynamicCast_AsItem_Management_Inventory_Panel) == 0x0000E0, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::K2Node_DynamicCast_AsItem_Management_Inventory_Panel' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, K2Node_DynamicCast_bSuccess) == 0x0000E8, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, CallFunc_GetItemManagementMode_ReturnValue3) == 0x0000E9, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::CallFunc_GetItemManagementMode_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, K2Node_SwitchEnum2_CmpSuccess) == 0x0000EA, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, K2Node_DynamicCast_AsItem_Management_Screen) == 0x0000F0, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::K2Node_DynamicCast_AsItem_Management_Screen' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, K2Node_DynamicCast_bSuccess2) == 0x0000F8, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, K2Node_DynamicCast_AsItem_Management_Screen2) == 0x000100, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::K2Node_DynamicCast_AsItem_Management_Screen2' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, K2Node_DynamicCast_bSuccess3) == 0x000108, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, Temp_byte_Variable4) == 0x000109, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, K2Node_DynamicCast_AsFort_Account_Item) == 0x000110, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::K2Node_DynamicCast_AsFort_Account_Item' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, K2Node_DynamicCast_bSuccess4) == 0x000118, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, Temp_bool_Variable3) == 0x000119, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, CallFunc_IsInventoryOverflowItem_ReturnValue) == 0x00011A, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::CallFunc_IsInventoryOverflowItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, K2Node_Select2_Default) == 0x00011B, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, K2Node_Select3_Default) == 0x00011C, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x00011D, "Member 'ItemManagementItemTileButton_C_ExecuteUbergraph_ItemManagementItemTileButton::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");

// Function ItemManagementItemTileButton.ItemManagementItemTileButton_C.OnDragCancelled
// 0x0078 (0x0078 - 0x0000)
struct ItemManagementItemTileButton_C_OnDragCancelled final
{
public:
	struct FPointerEvent                          PointerEvent;                                      // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemManagementItemTileButton_C_OnDragCancelled) == 0x000008, "Wrong alignment on ItemManagementItemTileButton_C_OnDragCancelled");
static_assert(sizeof(ItemManagementItemTileButton_C_OnDragCancelled) == 0x000078, "Wrong size on ItemManagementItemTileButton_C_OnDragCancelled");
static_assert(offsetof(ItemManagementItemTileButton_C_OnDragCancelled, PointerEvent) == 0x000000, "Member 'ItemManagementItemTileButton_C_OnDragCancelled::PointerEvent' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_OnDragCancelled, Operation) == 0x000070, "Member 'ItemManagementItemTileButton_C_OnDragCancelled::Operation' has a wrong offset!");

// Function ItemManagementItemTileButton.ItemManagementItemTileButton_C.HandleEquipSlotChanged
// 0x0004 (0x0004 - 0x0000)
struct ItemManagementItemTileButton_C_HandleEquipSlotChanged final
{
public:
	int32                                         EquipSlot;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemManagementItemTileButton_C_HandleEquipSlotChanged) == 0x000004, "Wrong alignment on ItemManagementItemTileButton_C_HandleEquipSlotChanged");
static_assert(sizeof(ItemManagementItemTileButton_C_HandleEquipSlotChanged) == 0x000004, "Wrong size on ItemManagementItemTileButton_C_HandleEquipSlotChanged");
static_assert(offsetof(ItemManagementItemTileButton_C_HandleEquipSlotChanged, EquipSlot) == 0x000000, "Member 'ItemManagementItemTileButton_C_HandleEquipSlotChanged::EquipSlot' has a wrong offset!");

// Function ItemManagementItemTileButton.ItemManagementItemTileButton_C.UpdateMulchStateBox
// 0x0078 (0x0078 - 0x0000)
struct ItemManagementItemTileButton_C_UpdateMulchStateBox final
{
public:
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0000(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable2;                             // 0x0010(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_CanItemBeMulched_OutRestrictionReason;    // 0x0028(0x0018)()
	bool                                          CallFunc_CanItemBeMulched_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0048(0x0018)()
	EFortItemManagementMode                       CallFunc_GetItemManagementMode_ReturnValue;        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemManagementMode                       CallFunc_GetItemManagementMode_ReturnValue2;       // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67[0x1];                                       // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select2_Default;                            // 0x0068(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemManagementItemTileButton_C_UpdateMulchStateBox) == 0x000008, "Wrong alignment on ItemManagementItemTileButton_C_UpdateMulchStateBox");
static_assert(sizeof(ItemManagementItemTileButton_C_UpdateMulchStateBox) == 0x000078, "Wrong size on ItemManagementItemTileButton_C_UpdateMulchStateBox");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateMulchStateBox, Temp_struct_Variable) == 0x000000, "Member 'ItemManagementItemTileButton_C_UpdateMulchStateBox::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateMulchStateBox, Temp_struct_Variable2) == 0x000010, "Member 'ItemManagementItemTileButton_C_UpdateMulchStateBox::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateMulchStateBox, Temp_bool_Variable) == 0x000020, "Member 'ItemManagementItemTileButton_C_UpdateMulchStateBox::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateMulchStateBox, Temp_byte_Variable) == 0x000021, "Member 'ItemManagementItemTileButton_C_UpdateMulchStateBox::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateMulchStateBox, Temp_byte_Variable2) == 0x000022, "Member 'ItemManagementItemTileButton_C_UpdateMulchStateBox::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateMulchStateBox, Temp_bool_Variable2) == 0x000023, "Member 'ItemManagementItemTileButton_C_UpdateMulchStateBox::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateMulchStateBox, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'ItemManagementItemTileButton_C_UpdateMulchStateBox::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateMulchStateBox, CallFunc_CanItemBeMulched_OutRestrictionReason) == 0x000028, "Member 'ItemManagementItemTileButton_C_UpdateMulchStateBox::CallFunc_CanItemBeMulched_OutRestrictionReason' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateMulchStateBox, CallFunc_CanItemBeMulched_ReturnValue) == 0x000040, "Member 'ItemManagementItemTileButton_C_UpdateMulchStateBox::CallFunc_CanItemBeMulched_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateMulchStateBox, CallFunc_Not_PreBool_ReturnValue) == 0x000041, "Member 'ItemManagementItemTileButton_C_UpdateMulchStateBox::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateMulchStateBox, CallFunc_Conv_IntToText_ReturnValue) == 0x000048, "Member 'ItemManagementItemTileButton_C_UpdateMulchStateBox::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateMulchStateBox, CallFunc_GetItemManagementMode_ReturnValue) == 0x000060, "Member 'ItemManagementItemTileButton_C_UpdateMulchStateBox::CallFunc_GetItemManagementMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateMulchStateBox, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000061, "Member 'ItemManagementItemTileButton_C_UpdateMulchStateBox::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateMulchStateBox, CallFunc_GetItemManagementMode_ReturnValue2) == 0x000062, "Member 'ItemManagementItemTileButton_C_UpdateMulchStateBox::CallFunc_GetItemManagementMode_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateMulchStateBox, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000063, "Member 'ItemManagementItemTileButton_C_UpdateMulchStateBox::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateMulchStateBox, CallFunc_BooleanAND_ReturnValue) == 0x000064, "Member 'ItemManagementItemTileButton_C_UpdateMulchStateBox::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateMulchStateBox, CallFunc_BooleanAND_ReturnValue2) == 0x000065, "Member 'ItemManagementItemTileButton_C_UpdateMulchStateBox::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateMulchStateBox, K2Node_Select_Default) == 0x000066, "Member 'ItemManagementItemTileButton_C_UpdateMulchStateBox::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateMulchStateBox, K2Node_Select2_Default) == 0x000068, "Member 'ItemManagementItemTileButton_C_UpdateMulchStateBox::K2Node_Select2_Default' has a wrong offset!");

// Function ItemManagementItemTileButton.ItemManagementItemTileButton_C.UpdateStyle
// 0x0048 (0x0048 - 0x0000)
struct ItemManagementItemTileButton_C_UpdateStyle final
{
public:
	class UClass*                                 Temp_class_Variable;                               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable2;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable3;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable4;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select2_Default;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemManagementMode                       CallFunc_GetItemManagementMode_ReturnValue;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementItemTileButton_C_UpdateStyle) == 0x000008, "Wrong alignment on ItemManagementItemTileButton_C_UpdateStyle");
static_assert(sizeof(ItemManagementItemTileButton_C_UpdateStyle) == 0x000048, "Wrong size on ItemManagementItemTileButton_C_UpdateStyle");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateStyle, Temp_class_Variable) == 0x000000, "Member 'ItemManagementItemTileButton_C_UpdateStyle::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateStyle, Temp_class_Variable2) == 0x000008, "Member 'ItemManagementItemTileButton_C_UpdateStyle::Temp_class_Variable2' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateStyle, Temp_bool_Variable) == 0x000010, "Member 'ItemManagementItemTileButton_C_UpdateStyle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateStyle, Temp_class_Variable3) == 0x000018, "Member 'ItemManagementItemTileButton_C_UpdateStyle::Temp_class_Variable3' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateStyle, Temp_class_Variable4) == 0x000020, "Member 'ItemManagementItemTileButton_C_UpdateStyle::Temp_class_Variable4' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateStyle, Temp_bool_Variable2) == 0x000028, "Member 'ItemManagementItemTileButton_C_UpdateStyle::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateStyle, K2Node_Select_Default) == 0x000030, "Member 'ItemManagementItemTileButton_C_UpdateStyle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateStyle, K2Node_Select2_Default) == 0x000038, "Member 'ItemManagementItemTileButton_C_UpdateStyle::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateStyle, CallFunc_GetItemManagementMode_ReturnValue) == 0x000040, "Member 'ItemManagementItemTileButton_C_UpdateStyle::CallFunc_GetItemManagementMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_UpdateStyle, K2Node_SwitchEnum_CmpSuccess) == 0x000041, "Member 'ItemManagementItemTileButton_C_UpdateStyle::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function ItemManagementItemTileButton.ItemManagementItemTileButton_C.On_ItemWidgetHolder_MouseButtonDown
// 0x03B0 (0x03B0 - 0x0000)
struct ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0160(0x00B8)()
	struct FEventReply                            CallFunc_DetectDrag_ReturnValue;                   // 0x0218(0x00B8)()
	bool                                          CallFunc_IsSchematic_ReturnValue;                  // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemManagementScreen_C*                K2Node_DynamicCast_AsItem_Management_Screen;       // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanNOR_ReturnValue;                   // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F2[0x6];                                      // 0x02F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Unhandled_ReturnValue2;                   // 0x02F8(0x00B8)()
};
static_assert(alignof(ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown) == 0x000008, "Wrong alignment on ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown");
static_assert(sizeof(ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown) == 0x0003B0, "Wrong size on ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown");
static_assert(offsetof(ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown, MyGeometry) == 0x000000, "Member 'ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown, MouseEvent) == 0x000038, "Member 'ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown, ReturnValue) == 0x0000A8, "Member 'ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown, CallFunc_Unhandled_ReturnValue) == 0x000160, "Member 'ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown::CallFunc_Unhandled_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown, CallFunc_DetectDrag_ReturnValue) == 0x000218, "Member 'ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown::CallFunc_DetectDrag_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown, CallFunc_IsSchematic_ReturnValue) == 0x0002D0, "Member 'ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown::CallFunc_IsSchematic_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown, CallFunc_GetContext_ReturnValue) == 0x0002D8, "Member 'ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown, CallFunc_IsUsingGamepad_ReturnValue) == 0x0002E0, "Member 'ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown, K2Node_DynamicCast_AsItem_Management_Screen) == 0x0002E8, "Member 'ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown::K2Node_DynamicCast_AsItem_Management_Screen' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown, K2Node_DynamicCast_bSuccess) == 0x0002F0, "Member 'ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown, CallFunc_BooleanNOR_ReturnValue) == 0x0002F1, "Member 'ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown::CallFunc_BooleanNOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown, CallFunc_Unhandled_ReturnValue2) == 0x0002F8, "Member 'ItemManagementItemTileButton_C_On_ItemWidgetHolder_MouseButtonDown::CallFunc_Unhandled_ReturnValue2' has a wrong offset!");

// Function ItemManagementItemTileButton.ItemManagementItemTileButton_C.OnDragDetected
// 0x0120 (0x0120 - 0x0000)
struct ItemManagementItemTileButton_C_OnDragDetected final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDragDropOperation*                     CallFunc_CreateDragDropOperation_ReturnValue;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemManagementInventoryPanel_C*        K2Node_DynamicCast_AsItem_Management_Inventory_Panel; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemDragIcon_C*                        CallFunc_Create_ReturnValue;                       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSmallPreviewImage_ReturnValue;         // 0x00E0(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementItemTileButton_C_OnDragDetected) == 0x000008, "Wrong alignment on ItemManagementItemTileButton_C_OnDragDetected");
static_assert(sizeof(ItemManagementItemTileButton_C_OnDragDetected) == 0x000120, "Wrong size on ItemManagementItemTileButton_C_OnDragDetected");
static_assert(offsetof(ItemManagementItemTileButton_C_OnDragDetected, MyGeometry) == 0x000000, "Member 'ItemManagementItemTileButton_C_OnDragDetected::MyGeometry' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_OnDragDetected, PointerEvent) == 0x000038, "Member 'ItemManagementItemTileButton_C_OnDragDetected::PointerEvent' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_OnDragDetected, Operation) == 0x0000A8, "Member 'ItemManagementItemTileButton_C_OnDragDetected::Operation' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_OnDragDetected, CallFunc_CreateDragDropOperation_ReturnValue) == 0x0000B0, "Member 'ItemManagementItemTileButton_C_OnDragDetected::CallFunc_CreateDragDropOperation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_OnDragDetected, K2Node_DynamicCast_AsItem_Management_Inventory_Panel) == 0x0000B8, "Member 'ItemManagementItemTileButton_C_OnDragDetected::K2Node_DynamicCast_AsItem_Management_Inventory_Panel' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_OnDragDetected, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'ItemManagementItemTileButton_C_OnDragDetected::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_OnDragDetected, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000C8, "Member 'ItemManagementItemTileButton_C_OnDragDetected::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_OnDragDetected, CallFunc_Create_ReturnValue) == 0x0000D0, "Member 'ItemManagementItemTileButton_C_OnDragDetected::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_OnDragDetected, CallFunc_IsValid_ReturnValue) == 0x0000D8, "Member 'ItemManagementItemTileButton_C_OnDragDetected::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_OnDragDetected, CallFunc_GetSmallPreviewImage_ReturnValue) == 0x0000E0, "Member 'ItemManagementItemTileButton_C_OnDragDetected::CallFunc_GetSmallPreviewImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_OnDragDetected, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000108, "Member 'ItemManagementItemTileButton_C_OnDragDetected::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_OnDragDetected, K2Node_DynamicCast_AsTexture_2D) == 0x000110, "Member 'ItemManagementItemTileButton_C_OnDragDetected::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_OnDragDetected, K2Node_DynamicCast_bSuccess2) == 0x000118, "Member 'ItemManagementItemTileButton_C_OnDragDetected::K2Node_DynamicCast_bSuccess2' has a wrong offset!");

// Function ItemManagementItemTileButton.ItemManagementItemTileButton_C.SetEquipSlotOverlay
// 0x0008 (0x0008 - 0x0000)
struct ItemManagementItemTileButton_C_SetEquipSlotOverlay final
{
public:
	int32                                         EquipSlot;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ItemManagementItemTileButton_C_SetEquipSlotOverlay) == 0x000004, "Wrong alignment on ItemManagementItemTileButton_C_SetEquipSlotOverlay");
static_assert(sizeof(ItemManagementItemTileButton_C_SetEquipSlotOverlay) == 0x000008, "Wrong size on ItemManagementItemTileButton_C_SetEquipSlotOverlay");
static_assert(offsetof(ItemManagementItemTileButton_C_SetEquipSlotOverlay, EquipSlot) == 0x000000, "Member 'ItemManagementItemTileButton_C_SetEquipSlotOverlay::EquipSlot' has a wrong offset!");
static_assert(offsetof(ItemManagementItemTileButton_C_SetEquipSlotOverlay, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'ItemManagementItemTileButton_C_SetEquipSlotOverlay::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function ItemManagementItemTileButton.ItemManagementItemTileButton_C.UpdateInteractionWidgetVisibility
// 0x0080 (0x0080 - 0x0000)
struct ItemManagementItemTileButton_C_UpdateInteractionWidgetVisibility final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue2;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemManagementScreen_C*                K2Node_DynamicCast_AsItem_Management_Screen;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFrontendCraftingEnabled_ReturnValue;    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemManagementScreen_C*                K2Node_DynamicCast_AsItem_Management_Screen2;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable8;                               // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue4;         // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetData_ReturnValue;                      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              K2Node_DynamicCast_AsFort_Item;                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSchematicItem*                     K2Node_DynamicCast_AsFort_Schematic_Item;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEquipAvailable_EquipAvailable;          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortCraftFailCause                           CallFunc_CanCraftSchematic_FailCause;              // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanCraftSchematic_ReturnValue;            // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMaxTransferCount_Count;                // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemType                                 CallFunc_GetType_ReturnValue;                      // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
