#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemTransformSlotItemPickerTileButton

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function ItemTransformSlotItemPickerTileButton.ItemTransformSlotItemPickerTileButton_C.ExecuteUbergraph_ItemTransformSlotItemPickerTileButton
// 0x0060 (0x0060 - 0x0000)
struct ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_InData;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonListView*                        K2Node_Event_OwningList;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              K2Node_DynamicCast_AsFort_Item;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransmogSacrifice                     CallFunc_GetTransmogSacrificeDataFromItemDefintion_OutTransmogData; // 0x0040(0x0010)()
	bool                                          CallFunc_GetTransmogSacrificeDataFromItemDefintion_ReturnValue; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton) == 0x000008, "Wrong alignment on ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton");
static_assert(sizeof(ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton) == 0x000060, "Wrong size on ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton");
static_assert(offsetof(ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton, EntryPoint) == 0x000000, "Member 'ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton, K2Node_Event_InData) == 0x000008, "Member 'ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton::K2Node_Event_InData' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton, K2Node_Event_OwningList) == 0x000010, "Member 'ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton::K2Node_Event_OwningList' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton, K2Node_DynamicCast_AsFort_Item) == 0x000018, "Member 'ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton::K2Node_DynamicCast_AsFort_Item' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000028, "Member 'ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton, Temp_bool_Variable) == 0x000038, "Member 'ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton, CallFunc_GetTransmogSacrificeDataFromItemDefintion_OutTransmogData) == 0x000040, "Member 'ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton::CallFunc_GetTransmogSacrificeDataFromItemDefintion_OutTransmogData' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton, CallFunc_GetTransmogSacrificeDataFromItemDefintion_ReturnValue) == 0x000050, "Member 'ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton::CallFunc_GetTransmogSacrificeDataFromItemDefintion_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000054, "Member 'ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton, K2Node_Select_Default) == 0x000058, "Member 'ItemTransformSlotItemPickerTileButton_C_ExecuteUbergraph_ItemTransformSlotItemPickerTileButton::K2Node_Select_Default' has a wrong offset!");

// Function ItemTransformSlotItemPickerTileButton.ItemTransformSlotItemPickerTileButton_C.SetData
// 0x0010 (0x0010 - 0x0000)
struct ItemTransformSlotItemPickerTileButton_C_SetData final
{
public:
	class UObject*                                InData;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonListView*                        OwningList;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ItemTransformSlotItemPickerTileButton_C_SetData) == 0x000008, "Wrong alignment on ItemTransformSlotItemPickerTileButton_C_SetData");
static_assert(sizeof(ItemTransformSlotItemPickerTileButton_C_SetData) == 0x000010, "Wrong size on ItemTransformSlotItemPickerTileButton_C_SetData");
static_assert(offsetof(ItemTransformSlotItemPickerTileButton_C_SetData, InData) == 0x000000, "Member 'ItemTransformSlotItemPickerTileButton_C_SetData::InData' has a wrong offset!");
static_assert(offsetof(ItemTransformSlotItemPickerTileButton_C_SetData, OwningList) == 0x000008, "Member 'ItemTransformSlotItemPickerTileButton_C_SetData::OwningList' has a wrong offset!");

}

