#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemTransformSlotScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ItemTransformSlotScreen.ItemTransformSlotScreen_C
// 0x00C0 (0x02D0 - 0x0210)
class UItemTransformSlotScreen_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UItemTransformItemPicker_C*             ItemTransformItemPicker;                           // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemTransformResultInfo_C*             ItemTransformResultInfo;                           // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemTransformSlotEntry_C*              Slot1;                                             // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemTransformSlotEntry_C*              Slot2;                                             // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemTransformSlotEntry_C*              Slot3;                                             // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemTransformSlotEntry_C*              Slot4;                                             // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemTransformSlotEntry_C*              Slot5;                                             // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItem*                              SelectedKey;                                       // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortItem*>                      SacrificeItems;                                    // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UItemTransformSlotEntry_C*>      SacrificeItemSlotWidgets;                          // 0x0268(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	UMulticastDelegateProperty_                   OnTransformConfirmed;                              // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FFortItemTransformFilterTabLabelInfo> ItemPickerFilterTabs;                              // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	UMulticastDelegateProperty_                   OnTransformButtonUpdated;                          // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnItemPickerClosed;                                // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnItemPickerOpened;                                // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UCommonButtonGroup*                     ButtonGroup;                                       // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnTransformConfirmed__DelegateSignature(TArray<class UFortItem*>& ItemsToSacrifice, int32 SacrificePoints, int32 CurrentTier);
	void OnTransformButtonUpdated__DelegateSignature(bool TransformActive);
	void OnItemPickerClosed__DelegateSignature();
	void OnItemPickerOpened__DelegateSignature();
	void ExecuteUbergraph_ItemTransformSlotScreen(int32 EntryPoint);
	void HandleSlotButton_DoubleClicked(class UCommonButton* AssociatedButton, int32 ButtonIndex);
	void HandleSlotButton_Clicked(class UCommonButton* AssociatedButton, int32 ButtonIndex);
	void BndEvt__ItemTransformResultInfo_K2Node_ComponentBoundEvent_225_OnUpdateSacrificeInfo__DelegateSignature(bool TransformActive);
	void BndEvt__ItemTransformResultInfo_K2Node_ComponentBoundEvent_2_OnTransformConfirmed__DelegateSignature(int32 SacrificePoints, int32 CurrentTier);
	void Construct();
	void BndEvt__ItemTransformItemPicker_K2Node_ComponentBoundEvent_0_OnItemSelected__DelegateSignature(class UFortItem* SelectedItem);
	void OpenSlotScreen();
	void OpenItemPicker();
	void SetupSlotScreen();
	void CloseItemPicker();
	void ResetScreen();
	void Get_Transform_Data(TArray<class UFortItem*>* Param_SacrificeItems, int32* CurrentSacrificePoints, int32* CurrentTier);
	void Navigate_to_Button(int32 Param_Index);
	void NavigateToFirstItem();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemTransformSlotScreen_C">();
	}
	static class UItemTransformSlotScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemTransformSlotScreen_C>();
	}
};
static_assert(alignof(UItemTransformSlotScreen_C) == 0x000008, "Wrong alignment on UItemTransformSlotScreen_C");
static_assert(sizeof(UItemTransformSlotScreen_C) == 0x0002D0, "Wrong size on UItemTransformSlotScreen_C");
static_assert(offsetof(UItemTransformSlotScreen_C, UberGraphFrame) == 0x000210, "Member 'UItemTransformSlotScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UItemTransformSlotScreen_C, ItemTransformItemPicker) == 0x000218, "Member 'UItemTransformSlotScreen_C::ItemTransformItemPicker' has a wrong offset!");
static_assert(offsetof(UItemTransformSlotScreen_C, ItemTransformResultInfo) == 0x000220, "Member 'UItemTransformSlotScreen_C::ItemTransformResultInfo' has a wrong offset!");
static_assert(offsetof(UItemTransformSlotScreen_C, Slot1) == 0x000228, "Member 'UItemTransformSlotScreen_C::Slot1' has a wrong offset!");
static_assert(offsetof(UItemTransformSlotScreen_C, Slot2) == 0x000230, "Member 'UItemTransformSlotScreen_C::Slot2' has a wrong offset!");
static_assert(offsetof(UItemTransformSlotScreen_C, Slot3) == 0x000238, "Member 'UItemTransformSlotScreen_C::Slot3' has a wrong offset!");
static_assert(offsetof(UItemTransformSlotScreen_C, Slot4) == 0x000240, "Member 'UItemTransformSlotScreen_C::Slot4' has a wrong offset!");
static_assert(offsetof(UItemTransformSlotScreen_C, Slot5) == 0x000248, "Member 'UItemTransformSlotScreen_C::Slot5' has a wrong offset!");
static_assert(offsetof(UItemTransformSlotScreen_C, SelectedKey) == 0x000250, "Member 'UItemTransformSlotScreen_C::SelectedKey' has a wrong offset!");
static_assert(offsetof(UItemTransformSlotScreen_C, SacrificeItems) == 0x000258, "Member 'UItemTransformSlotScreen_C::SacrificeItems' has a wrong offset!");
static_assert(offsetof(UItemTransformSlotScreen_C, SacrificeItemSlotWidgets) == 0x000268, "Member 'UItemTransformSlotScreen_C::SacrificeItemSlotWidgets' has a wrong offset!");
static_assert(offsetof(UItemTransformSlotScreen_C, OnTransformConfirmed) == 0x000278, "Member 'UItemTransformSlotScreen_C::OnTransformConfirmed' has a wrong offset!");
static_assert(offsetof(UItemTransformSlotScreen_C, ItemPickerFilterTabs) == 0x000288, "Member 'UItemTransformSlotScreen_C::ItemPickerFilterTabs' has a wrong offset!");
static_assert(offsetof(UItemTransformSlotScreen_C, OnTransformButtonUpdated) == 0x000298, "Member 'UItemTransformSlotScreen_C::OnTransformButtonUpdated' has a wrong offset!");
static_assert(offsetof(UItemTransformSlotScreen_C, OnItemPickerClosed) == 0x0002A8, "Member 'UItemTransformSlotScreen_C::OnItemPickerClosed' has a wrong offset!");
static_assert(offsetof(UItemTransformSlotScreen_C, OnItemPickerOpened) == 0x0002B8, "Member 'UItemTransformSlotScreen_C::OnItemPickerOpened' has a wrong offset!");
static_assert(offsetof(UItemTransformSlotScreen_C, ButtonGroup) == 0x0002C8, "Member 'UItemTransformSlotScreen_C::ButtonGroup' has a wrong offset!");

}

