#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JournalQuestDetails

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function JournalQuestDetails.JournalQuestDetails_C.ExecuteUbergraph_JournalQuestDetails
// 0x0004 (0x0004 - 0x0000)
struct JournalQuestDetails_C_ExecuteUbergraph_JournalQuestDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JournalQuestDetails_C_ExecuteUbergraph_JournalQuestDetails) == 0x000004, "Wrong alignment on JournalQuestDetails_C_ExecuteUbergraph_JournalQuestDetails");
static_assert(sizeof(JournalQuestDetails_C_ExecuteUbergraph_JournalQuestDetails) == 0x000004, "Wrong size on JournalQuestDetails_C_ExecuteUbergraph_JournalQuestDetails");
static_assert(offsetof(JournalQuestDetails_C_ExecuteUbergraph_JournalQuestDetails, EntryPoint) == 0x000000, "Member 'JournalQuestDetails_C_ExecuteUbergraph_JournalQuestDetails::EntryPoint' has a wrong offset!");

// Function JournalQuestDetails.JournalQuestDetails_C.Setup
// 0x0028 (0x0028 - 0x0000)
struct JournalQuestDetails_C_Setup final
{
public:
	TDelegate<void(class UTexture2D* Image, class FText Title, class FText Subtitle, EFortAnnouncementDisplayPreference DisplayPreference)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JournalQuestDetails_C_Setup) == 0x000008, "Wrong alignment on JournalQuestDetails_C_Setup");
static_assert(sizeof(JournalQuestDetails_C_Setup) == 0x000028, "Wrong size on JournalQuestDetails_C_Setup");
static_assert(offsetof(JournalQuestDetails_C_Setup, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'JournalQuestDetails_C_Setup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_Setup, K2Node_CreateDelegate_OutputDelegate2) == 0x000010, "Member 'JournalQuestDetails_C_Setup::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_Setup, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000020, "Member 'JournalQuestDetails_C_Setup::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function JournalQuestDetails.JournalQuestDetails_C.HandleOnBeginSpokenDialog
// 0x0040 (0x0040 - 0x0000)
struct JournalQuestDetails_C_HandleOnBeginSpokenDialog final
{
public:
	class UTexture2D*                             Image;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Title;                                             // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Subtitle;                                          // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	EFortAnnouncementDisplayPreference            DisplayPreference;                                 // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JournalQuestDetails_C_HandleOnBeginSpokenDialog) == 0x000008, "Wrong alignment on JournalQuestDetails_C_HandleOnBeginSpokenDialog");
static_assert(sizeof(JournalQuestDetails_C_HandleOnBeginSpokenDialog) == 0x000040, "Wrong size on JournalQuestDetails_C_HandleOnBeginSpokenDialog");
static_assert(offsetof(JournalQuestDetails_C_HandleOnBeginSpokenDialog, Image) == 0x000000, "Member 'JournalQuestDetails_C_HandleOnBeginSpokenDialog::Image' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_HandleOnBeginSpokenDialog, Title) == 0x000008, "Member 'JournalQuestDetails_C_HandleOnBeginSpokenDialog::Title' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_HandleOnBeginSpokenDialog, Subtitle) == 0x000020, "Member 'JournalQuestDetails_C_HandleOnBeginSpokenDialog::Subtitle' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_HandleOnBeginSpokenDialog, DisplayPreference) == 0x000038, "Member 'JournalQuestDetails_C_HandleOnBeginSpokenDialog::DisplayPreference' has a wrong offset!");

// Function JournalQuestDetails.JournalQuestDetails_C.HandleOnEndSpokenDialog
// 0x0038 (0x0038 - 0x0000)
struct JournalQuestDetails_C_HandleOnEndSpokenDialog final
{
public:
	class FString                                 Temp_string_Variable;                              // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable2;                             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(JournalQuestDetails_C_HandleOnEndSpokenDialog) == 0x000008, "Wrong alignment on JournalQuestDetails_C_HandleOnEndSpokenDialog");
static_assert(sizeof(JournalQuestDetails_C_HandleOnEndSpokenDialog) == 0x000038, "Wrong size on JournalQuestDetails_C_HandleOnEndSpokenDialog");
static_assert(offsetof(JournalQuestDetails_C_HandleOnEndSpokenDialog, Temp_string_Variable) == 0x000000, "Member 'JournalQuestDetails_C_HandleOnEndSpokenDialog::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_HandleOnEndSpokenDialog, Temp_string_Variable2) == 0x000010, "Member 'JournalQuestDetails_C_HandleOnEndSpokenDialog::Temp_string_Variable2' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_HandleOnEndSpokenDialog, Temp_bool_Variable) == 0x000020, "Member 'JournalQuestDetails_C_HandleOnEndSpokenDialog::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_HandleOnEndSpokenDialog, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'JournalQuestDetails_C_HandleOnEndSpokenDialog::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_HandleOnEndSpokenDialog, K2Node_Select_Default) == 0x000028, "Member 'JournalQuestDetails_C_HandleOnEndSpokenDialog::K2Node_Select_Default' has a wrong offset!");

// Function JournalQuestDetails.JournalQuestDetails_C.UpdatePlayButtonState
// 0x0002 (0x0002 - 0x0000)
struct JournalQuestDetails_C_UpdatePlayButtonState final
{
public:
	EFortQuestState                               CallFunc_GetQuestState_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(JournalQuestDetails_C_UpdatePlayButtonState) == 0x000001, "Wrong alignment on JournalQuestDetails_C_UpdatePlayButtonState");
static_assert(sizeof(JournalQuestDetails_C_UpdatePlayButtonState) == 0x000002, "Wrong size on JournalQuestDetails_C_UpdatePlayButtonState");
static_assert(offsetof(JournalQuestDetails_C_UpdatePlayButtonState, CallFunc_GetQuestState_ReturnValue) == 0x000000, "Member 'JournalQuestDetails_C_UpdatePlayButtonState::CallFunc_GetQuestState_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_UpdatePlayButtonState, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000001, "Member 'JournalQuestDetails_C_UpdatePlayButtonState::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function JournalQuestDetails.JournalQuestDetails_C.UpdatePanelInfo
// 0x0120 (0x0120 - 0x0000)
struct JournalQuestDetails_C_UpdatePanelInfo final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortQuestObjectiveInfo*>        CallFunc_GetFutureObjectives_FutureObjectives;     // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UTexture2D* Image, class FText Title, class FText Subtitle, EFortAnnouncementDisplayPreference DisplayPreference)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDescription_ReturnValue;               // 0x0050(0x0018)()
	struct FSlateBrush                            CallFunc_GetItemSmallPreviewImageBrush_ReturnValue; // 0x0068(0x0078)()
	class UFortQuestItemDefinition*               CallFunc_GetQuestDefinitionBP_ReturnValue;         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x00E8(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortQuestObjectiveInfo*>        CallFunc_GetVisibleObjectives_VisibleObjectives;   // 0x0108(0x0010)(ZeroConstructor, ReferenceParm)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JournalQuestDetails_C_UpdatePanelInfo) == 0x000008, "Wrong alignment on JournalQuestDetails_C_UpdatePanelInfo");
static_assert(sizeof(JournalQuestDetails_C_UpdatePanelInfo) == 0x000120, "Wrong size on JournalQuestDetails_C_UpdatePanelInfo");
static_assert(offsetof(JournalQuestDetails_C_UpdatePanelInfo, Temp_byte_Variable) == 0x000000, "Member 'JournalQuestDetails_C_UpdatePanelInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_UpdatePanelInfo, CallFunc_GetFutureObjectives_FutureObjectives) == 0x000008, "Member 'JournalQuestDetails_C_UpdatePanelInfo::CallFunc_GetFutureObjectives_FutureObjectives' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_UpdatePanelInfo, Temp_byte_Variable2) == 0x000018, "Member 'JournalQuestDetails_C_UpdatePanelInfo::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_UpdatePanelInfo, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'JournalQuestDetails_C_UpdatePanelInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_UpdatePanelInfo, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'JournalQuestDetails_C_UpdatePanelInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_UpdatePanelInfo, CallFunc_Greater_IntInt_ReturnValue) == 0x000030, "Member 'JournalQuestDetails_C_UpdatePanelInfo::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_UpdatePanelInfo, K2Node_CreateDelegate_OutputDelegate2) == 0x000038, "Member 'JournalQuestDetails_C_UpdatePanelInfo::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_UpdatePanelInfo, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000048, "Member 'JournalQuestDetails_C_UpdatePanelInfo::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_UpdatePanelInfo, CallFunc_GetDescription_ReturnValue) == 0x000050, "Member 'JournalQuestDetails_C_UpdatePanelInfo::CallFunc_GetDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_UpdatePanelInfo, CallFunc_GetItemSmallPreviewImageBrush_ReturnValue) == 0x000068, "Member 'JournalQuestDetails_C_UpdatePanelInfo::CallFunc_GetItemSmallPreviewImageBrush_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_UpdatePanelInfo, CallFunc_GetQuestDefinitionBP_ReturnValue) == 0x0000E0, "Member 'JournalQuestDetails_C_UpdatePanelInfo::CallFunc_GetQuestDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_UpdatePanelInfo, CallFunc_GetDisplayName_ReturnValue) == 0x0000E8, "Member 'JournalQuestDetails_C_UpdatePanelInfo::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_UpdatePanelInfo, Temp_bool_Variable) == 0x000100, "Member 'JournalQuestDetails_C_UpdatePanelInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_UpdatePanelInfo, CallFunc_GetVisibleObjectives_VisibleObjectives) == 0x000108, "Member 'JournalQuestDetails_C_UpdatePanelInfo::CallFunc_GetVisibleObjectives_VisibleObjectives' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_UpdatePanelInfo, K2Node_Select_Default) == 0x000118, "Member 'JournalQuestDetails_C_UpdatePanelInfo::K2Node_Select_Default' has a wrong offset!");

// Function JournalQuestDetails.JournalQuestDetails_C.AbandonQuest
// 0x0048 (0x0048 - 0x0000)
struct JournalQuestDetails_C_AbandonQuest final
{
public:
	class UFortQuestItem*                         QuestToAbandon;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          QuestAbandoned_;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortQuestState                               CallFunc_GetQuestState_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRemainingDailyQuestRerolls_ReturnValue; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               CallFunc_GetQuestDefinitionBP_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortQuestType                                CallFunc_GetQuestType_ReturnValue;                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue4;         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(JournalQuestDetails_C_AbandonQuest) == 0x000008, "Wrong alignment on JournalQuestDetails_C_AbandonQuest");
static_assert(sizeof(JournalQuestDetails_C_AbandonQuest) == 0x000048, "Wrong size on JournalQuestDetails_C_AbandonQuest");
static_assert(offsetof(JournalQuestDetails_C_AbandonQuest, QuestToAbandon) == 0x000000, "Member 'JournalQuestDetails_C_AbandonQuest::QuestToAbandon' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_AbandonQuest, QuestAbandoned_) == 0x000008, "Member 'JournalQuestDetails_C_AbandonQuest::QuestAbandoned_' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_AbandonQuest, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'JournalQuestDetails_C_AbandonQuest::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_AbandonQuest, CallFunc_GetQuestState_ReturnValue) == 0x000018, "Member 'JournalQuestDetails_C_AbandonQuest::CallFunc_GetQuestState_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_AbandonQuest, CallFunc_GetQuestManager_ReturnValue) == 0x000020, "Member 'JournalQuestDetails_C_AbandonQuest::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_AbandonQuest, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000028, "Member 'JournalQuestDetails_C_AbandonQuest::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_AbandonQuest, CallFunc_GetRemainingDailyQuestRerolls_ReturnValue) == 0x00002C, "Member 'JournalQuestDetails_C_AbandonQuest::CallFunc_GetRemainingDailyQuestRerolls_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_AbandonQuest, CallFunc_GetQuestDefinitionBP_ReturnValue) == 0x000030, "Member 'JournalQuestDetails_C_AbandonQuest::CallFunc_GetQuestDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_AbandonQuest, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'JournalQuestDetails_C_AbandonQuest::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_AbandonQuest, CallFunc_GetQuestType_ReturnValue) == 0x000039, "Member 'JournalQuestDetails_C_AbandonQuest::CallFunc_GetQuestType_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_AbandonQuest, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x00003A, "Member 'JournalQuestDetails_C_AbandonQuest::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_AbandonQuest, CallFunc_EqualEqual_ByteByte_ReturnValue3) == 0x00003B, "Member 'JournalQuestDetails_C_AbandonQuest::CallFunc_EqualEqual_ByteByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_AbandonQuest, CallFunc_EqualEqual_ByteByte_ReturnValue4) == 0x00003C, "Member 'JournalQuestDetails_C_AbandonQuest::CallFunc_EqualEqual_ByteByte_ReturnValue4' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_AbandonQuest, CallFunc_BooleanOR_ReturnValue) == 0x00003D, "Member 'JournalQuestDetails_C_AbandonQuest::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_AbandonQuest, CallFunc_BooleanOR_ReturnValue2) == 0x00003E, "Member 'JournalQuestDetails_C_AbandonQuest::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_AbandonQuest, CallFunc_BooleanAND_ReturnValue) == 0x00003F, "Member 'JournalQuestDetails_C_AbandonQuest::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_AbandonQuest, CallFunc_BooleanAND_ReturnValue2) == 0x000040, "Member 'JournalQuestDetails_C_AbandonQuest::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");

// Function JournalQuestDetails.JournalQuestDetails_C.StopConversation
// 0x0001 (0x0001 - 0x0000)
struct JournalQuestDetails_C_StopConversation final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(JournalQuestDetails_C_StopConversation) == 0x000001, "Wrong alignment on JournalQuestDetails_C_StopConversation");
static_assert(sizeof(JournalQuestDetails_C_StopConversation) == 0x000001, "Wrong size on JournalQuestDetails_C_StopConversation");
static_assert(offsetof(JournalQuestDetails_C_StopConversation, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'JournalQuestDetails_C_StopConversation::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function JournalQuestDetails.JournalQuestDetails_C.StartConversation
// 0x00B0 (0x00B0 - 0x0000)
struct JournalQuestDetails_C_StartConversation final
{
public:
	class UFortConversation*                      Param_Conversation;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         QuestItem;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOutro_;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortClientAnnouncementData_Conversation K2Node_MakeStruct_FortClientAnnouncementData_Conversation; // 0x0018(0x0010)(NoDestructor)
	class FString                                 Temp_string_Variable;                              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable2;                             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class AFortPlayerController*>          CallFunc_GetLocalFortPlayerControllers_ReturnValue; // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAnnounce_Gen_Quest_Conversation_C*     CallFunc_FinishSpawningActor_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(JournalQuestDetails_C_StartConversation) == 0x000010, "Wrong alignment on JournalQuestDetails_C_StartConversation");
static_assert(sizeof(JournalQuestDetails_C_StartConversation) == 0x0000B0, "Wrong size on JournalQuestDetails_C_StartConversation");
static_assert(offsetof(JournalQuestDetails_C_StartConversation, Param_Conversation) == 0x000000, "Member 'JournalQuestDetails_C_StartConversation::Param_Conversation' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_StartConversation, QuestItem) == 0x000008, "Member 'JournalQuestDetails_C_StartConversation::QuestItem' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_StartConversation, IsOutro_) == 0x000010, "Member 'JournalQuestDetails_C_StartConversation::IsOutro_' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_StartConversation, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'JournalQuestDetails_C_StartConversation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_StartConversation, K2Node_MakeStruct_FortClientAnnouncementData_Conversation) == 0x000018, "Member 'JournalQuestDetails_C_StartConversation::K2Node_MakeStruct_FortClientAnnouncementData_Conversation' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_StartConversation, Temp_string_Variable) == 0x000028, "Member 'JournalQuestDetails_C_StartConversation::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_StartConversation, Temp_string_Variable2) == 0x000038, "Member 'JournalQuestDetails_C_StartConversation::Temp_string_Variable2' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_StartConversation, Temp_bool_Variable) == 0x000048, "Member 'JournalQuestDetails_C_StartConversation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_StartConversation, K2Node_Select_Default) == 0x000050, "Member 'JournalQuestDetails_C_StartConversation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_StartConversation, CallFunc_GetLocalFortPlayerControllers_ReturnValue) == 0x000060, "Member 'JournalQuestDetails_C_StartConversation::CallFunc_GetLocalFortPlayerControllers_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_StartConversation, CallFunc_MakeTransform_ReturnValue) == 0x000070, "Member 'JournalQuestDetails_C_StartConversation::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_StartConversation, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000A0, "Member 'JournalQuestDetails_C_StartConversation::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_StartConversation, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000A8, "Member 'JournalQuestDetails_C_StartConversation::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function JournalQuestDetails.JournalQuestDetails_C.IsQuestAudioPlaying
// 0x0001 (0x0001 - 0x0000)
struct JournalQuestDetails_C_IsQuestAudioPlaying final
{
public:
	bool                                          Param_IsQuestAudioPlaying;                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(JournalQuestDetails_C_IsQuestAudioPlaying) == 0x000001, "Wrong alignment on JournalQuestDetails_C_IsQuestAudioPlaying");
static_assert(sizeof(JournalQuestDetails_C_IsQuestAudioPlaying) == 0x000001, "Wrong size on JournalQuestDetails_C_IsQuestAudioPlaying");
static_assert(offsetof(JournalQuestDetails_C_IsQuestAudioPlaying, Param_IsQuestAudioPlaying) == 0x000000, "Member 'JournalQuestDetails_C_IsQuestAudioPlaying::Param_IsQuestAudioPlaying' has a wrong offset!");

// Function JournalQuestDetails.JournalQuestDetails_C.Set Quest Display Name
// 0x0118 (0x0118 - 0x0000)
struct JournalQuestDetails_C_Set_Quest_Display_Name final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   LocalQuestName;                                    // 0x0018(0x0018)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Get_Streaming_Attached_Quest_Name_ReturnValue; // 0x0078(0x0018)()
	bool                                          CallFunc_Is_Streaming_Quest_bStreamingQuest;       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x0098(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0100(0x0018)()
};
static_assert(alignof(JournalQuestDetails_C_Set_Quest_Display_Name) == 0x000008, "Wrong alignment on JournalQuestDetails_C_Set_Quest_Display_Name");
static_assert(sizeof(JournalQuestDetails_C_Set_Quest_Display_Name) == 0x000118, "Wrong size on JournalQuestDetails_C_Set_Quest_Display_Name");
static_assert(offsetof(JournalQuestDetails_C_Set_Quest_Display_Name, InText) == 0x000000, "Member 'JournalQuestDetails_C_Set_Quest_Display_Name::InText' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_Set_Quest_Display_Name, LocalQuestName) == 0x000018, "Member 'JournalQuestDetails_C_Set_Quest_Display_Name::LocalQuestName' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_Set_Quest_Display_Name, Temp_bool_Variable) == 0x000030, "Member 'JournalQuestDetails_C_Set_Quest_Display_Name::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_Set_Quest_Display_Name, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'JournalQuestDetails_C_Set_Quest_Display_Name::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_Set_Quest_Display_Name, CallFunc_Get_Streaming_Attached_Quest_Name_ReturnValue) == 0x000078, "Member 'JournalQuestDetails_C_Set_Quest_Display_Name::CallFunc_Get_Streaming_Attached_Quest_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_Set_Quest_Display_Name, CallFunc_Is_Streaming_Quest_bStreamingQuest) == 0x000090, "Member 'JournalQuestDetails_C_Set_Quest_Display_Name::CallFunc_Is_Streaming_Quest_bStreamingQuest' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_Set_Quest_Display_Name, K2Node_MakeStruct_FormatArgumentData2) == 0x000098, "Member 'JournalQuestDetails_C_Set_Quest_Display_Name::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_Set_Quest_Display_Name, K2Node_MakeArray_Array) == 0x0000D8, "Member 'JournalQuestDetails_C_Set_Quest_Display_Name::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_Set_Quest_Display_Name, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'JournalQuestDetails_C_Set_Quest_Display_Name::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_Set_Quest_Display_Name, K2Node_Select_Default) == 0x000100, "Member 'JournalQuestDetails_C_Set_Quest_Display_Name::K2Node_Select_Default' has a wrong offset!");

// Function JournalQuestDetails.JournalQuestDetails_C.Get Quest Item Def
// 0x0020 (0x0020 - 0x0000)
struct JournalQuestDetails_C_Get_Quest_Item_Def final
{
public:
	class UFortQuestItemDefinition*               AsFort_Quest_Item_Definition;                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               K2Node_DynamicCast_AsFort_Quest_Item_Definition;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(JournalQuestDetails_C_Get_Quest_Item_Def) == 0x000008, "Wrong alignment on JournalQuestDetails_C_Get_Quest_Item_Def");
static_assert(sizeof(JournalQuestDetails_C_Get_Quest_Item_Def) == 0x000020, "Wrong size on JournalQuestDetails_C_Get_Quest_Item_Def");
static_assert(offsetof(JournalQuestDetails_C_Get_Quest_Item_Def, AsFort_Quest_Item_Definition) == 0x000000, "Member 'JournalQuestDetails_C_Get_Quest_Item_Def::AsFort_Quest_Item_Definition' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_Get_Quest_Item_Def, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000008, "Member 'JournalQuestDetails_C_Get_Quest_Item_Def::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_Get_Quest_Item_Def, K2Node_DynamicCast_AsFort_Quest_Item_Definition) == 0x000010, "Member 'JournalQuestDetails_C_Get_Quest_Item_Def::K2Node_DynamicCast_AsFort_Quest_Item_Definition' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_Get_Quest_Item_Def, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'JournalQuestDetails_C_Get_Quest_Item_Def::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function JournalQuestDetails.JournalQuestDetails_C.Is Streaming Quest
// 0x0018 (0x0018 - 0x0000)
struct JournalQuestDetails_C_Is_Streaming_Quest final
{
public:
	bool                                          bStreamingQuest;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItemDefinition*               CallFunc_Get_Quest_Item_Def_AsFort_Quest_Item_Definition; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortQuestType                                CallFunc_GetQuestType_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(JournalQuestDetails_C_Is_Streaming_Quest) == 0x000008, "Wrong alignment on JournalQuestDetails_C_Is_Streaming_Quest");
static_assert(sizeof(JournalQuestDetails_C_Is_Streaming_Quest) == 0x000018, "Wrong size on JournalQuestDetails_C_Is_Streaming_Quest");
static_assert(offsetof(JournalQuestDetails_C_Is_Streaming_Quest, bStreamingQuest) == 0x000000, "Member 'JournalQuestDetails_C_Is_Streaming_Quest::bStreamingQuest' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_Is_Streaming_Quest, CallFunc_Get_Quest_Item_Def_AsFort_Quest_Item_Definition) == 0x000008, "Member 'JournalQuestDetails_C_Is_Streaming_Quest::CallFunc_Get_Quest_Item_Def_AsFort_Quest_Item_Definition' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_Is_Streaming_Quest, CallFunc_GetQuestType_ReturnValue) == 0x000010, "Member 'JournalQuestDetails_C_Is_Streaming_Quest::CallFunc_GetQuestType_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_Is_Streaming_Quest, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'JournalQuestDetails_C_Is_Streaming_Quest::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_Is_Streaming_Quest, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000012, "Member 'JournalQuestDetails_C_Is_Streaming_Quest::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_Is_Streaming_Quest, CallFunc_EqualEqual_ByteByte_ReturnValue3) == 0x000013, "Member 'JournalQuestDetails_C_Is_Streaming_Quest::CallFunc_EqualEqual_ByteByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_Is_Streaming_Quest, CallFunc_BooleanOR_ReturnValue) == 0x000014, "Member 'JournalQuestDetails_C_Is_Streaming_Quest::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_Is_Streaming_Quest, CallFunc_BooleanOR_ReturnValue2) == 0x000015, "Member 'JournalQuestDetails_C_Is_Streaming_Quest::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");

// Function JournalQuestDetails.JournalQuestDetails_C.Get Streaming Attached Quest Name
// 0x01B0 (0x01B0 - 0x0000)
struct JournalQuestDetails_C_Get_Streaming_Attached_Quest_Name final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	EFortQuestType                                Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable3;                               // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable4;                               // 0x0068(0x0018)()
	class FText                                   Temp_text_Variable5;                               // 0x0080(0x0018)()
	class FText                                   Temp_text_Variable6;                               // 0x0098(0x0018)()
	class FText                                   Temp_text_Variable7;                               // 0x00B0(0x0018)()
	class FText                                   Temp_text_Variable8;                               // 0x00C8(0x0018)()
	class FText                                   Temp_text_Variable9;                               // 0x00E0(0x0018)()
	class FText                                   Temp_text_Variable10;                              // 0x00F8(0x0018)()
	class FText                                   Temp_text_Variable11;                              // 0x0110(0x0018)()
	class FText                                   Temp_text_Variable12;                              // 0x0128(0x0018)()
	class FText                                   Temp_text_Variable13;                              // 0x0140(0x0018)()
	class FText                                   Temp_text_Variable14;                              // 0x0158(0x0018)()
	class FText                                   Temp_text_Variable15;                              // 0x0170(0x0018)()
	class UFortQuestItemDefinition*               CallFunc_Get_Quest_Item_Def_AsFort_Quest_Item_Definition; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortQuestType                                CallFunc_GetQuestType_ReturnValue;                 // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0198(0x0018)()
};
static_assert(alignof(JournalQuestDetails_C_Get_Streaming_Attached_Quest_Name) == 0x000008, "Wrong alignment on JournalQuestDetails_C_Get_Streaming_Attached_Quest_Name");
static_assert(sizeof(JournalQuestDetails_C_Get_Streaming_Attached_Quest_Name) == 0x0001B0, "Wrong size on JournalQuestDetails_C_Get_Streaming_Attached_Quest_Name");
static_assert(offsetof(JournalQuestDetails_C_Get_Streaming_Attached_Quest_Name, ReturnValue) == 0x000000, "Member 'JournalQuestDetails_C_Get_Streaming_Attached_Quest_Name::ReturnValue' has a wrong offset!");
static_assert(offsetof(JournalQuestDetails_C_Get_Streaming_Attached_Quest_Name, Temp_byte_Variable) == 0x000018, "Member 'JournalQuestDetails_C_Get_Streaming_Attached_Quest_Name::Temp_byte_Variable' has a wrong offset!");
