#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KeybindWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass KeybindWidget.KeybindWidget_C
// 0x0540 (0x07A8 - 0x0268)
class UKeybindWidget_C final : public UFortKeybindWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 _Image__Keybind;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 _Image__Shadow;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderFrame;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               HoldOverlay;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               KeyTextOverlay;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxBackplate;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextKeybind;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               TextSizeMinBox;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EFortBrushSize                                Brush_Size;                                        // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMultiSizeBrush                    Frame_MultiBrush;                                  // 0x02C8(0x02D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFortMultiSizeFont                     MultiFont;                                         // 0x0598(0x0210)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_KeybindWidget(int32 EntryPoint);
	void UpdateFrameSize();
	void PreConstruct(bool IsDesignTime);
	void Update();
	void Construct();
	void Get_Brush_Size(EFortBrushSize* Param_Brush_Size);
	void Set_Brush_Size(EFortBrushSize Param_Brush_Size);
	void Get_Bound_Action(class FName* Action);
	void ShowHoldBackPlate();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"KeybindWidget_C">();
	}
	static class UKeybindWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKeybindWidget_C>();
	}
};
static_assert(alignof(UKeybindWidget_C) == 0x000008, "Wrong alignment on UKeybindWidget_C");
static_assert(sizeof(UKeybindWidget_C) == 0x0007A8, "Wrong size on UKeybindWidget_C");
static_assert(offsetof(UKeybindWidget_C, UberGraphFrame) == 0x000268, "Member 'UKeybindWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UKeybindWidget_C, _Image__Keybind) == 0x000270, "Member 'UKeybindWidget_C::_Image__Keybind' has a wrong offset!");
static_assert(offsetof(UKeybindWidget_C, _Image__Shadow) == 0x000278, "Member 'UKeybindWidget_C::_Image__Shadow' has a wrong offset!");
static_assert(offsetof(UKeybindWidget_C, BorderFrame) == 0x000280, "Member 'UKeybindWidget_C::BorderFrame' has a wrong offset!");
static_assert(offsetof(UKeybindWidget_C, HoldOverlay) == 0x000288, "Member 'UKeybindWidget_C::HoldOverlay' has a wrong offset!");
static_assert(offsetof(UKeybindWidget_C, KeyTextOverlay) == 0x000290, "Member 'UKeybindWidget_C::KeyTextOverlay' has a wrong offset!");
static_assert(offsetof(UKeybindWidget_C, SizeBox_0) == 0x000298, "Member 'UKeybindWidget_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UKeybindWidget_C, SizeBoxBackplate) == 0x0002A0, "Member 'UKeybindWidget_C::SizeBoxBackplate' has a wrong offset!");
static_assert(offsetof(UKeybindWidget_C, Switcher) == 0x0002A8, "Member 'UKeybindWidget_C::Switcher' has a wrong offset!");
static_assert(offsetof(UKeybindWidget_C, TextKeybind) == 0x0002B0, "Member 'UKeybindWidget_C::TextKeybind' has a wrong offset!");
static_assert(offsetof(UKeybindWidget_C, TextSizeMinBox) == 0x0002B8, "Member 'UKeybindWidget_C::TextSizeMinBox' has a wrong offset!");
static_assert(offsetof(UKeybindWidget_C, Brush_Size) == 0x0002C0, "Member 'UKeybindWidget_C::Brush_Size' has a wrong offset!");
static_assert(offsetof(UKeybindWidget_C, Frame_MultiBrush) == 0x0002C8, "Member 'UKeybindWidget_C::Frame_MultiBrush' has a wrong offset!");
static_assert(offsetof(UKeybindWidget_C, MultiFont) == 0x000598, "Member 'UKeybindWidget_C::MultiFont' has a wrong offset!");

}

