#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LeaveButton

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function LeaveButton.LeaveButton_C.Update Visibility__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct LeaveButton_C_Update_Visibility__DelegateSignature final
{
public:
	bool                                          Param_Visibility;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LeaveButton_C_Update_Visibility__DelegateSignature) == 0x000001, "Wrong alignment on LeaveButton_C_Update_Visibility__DelegateSignature");
static_assert(sizeof(LeaveButton_C_Update_Visibility__DelegateSignature) == 0x000001, "Wrong size on LeaveButton_C_Update_Visibility__DelegateSignature");
static_assert(offsetof(LeaveButton_C_Update_Visibility__DelegateSignature, Param_Visibility) == 0x000000, "Member 'LeaveButton_C_Update_Visibility__DelegateSignature::Param_Visibility' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.ExecuteUbergraph_LeaveButton
// 0x05B8 (0x05B8 - 0x0000)
struct LeaveButton_C_ExecuteUbergraph_LeaveButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	EFortDialogResult                             K2Node_CustomEvent_Result3;                        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName3;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable2;                               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable2;                               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUITeamInfo*                        CallFunc_GetLocalPlayerTeam_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue2;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue3;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDialogResult                             K2Node_CustomEvent_Result2;                        // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName2;                    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable3;                               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable3;                               // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue4;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue5;                  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumPlayersInLocalParty_ReturnValue;    // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x00C0(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable2;                               // 0x00E0(0x0018)()
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate3;             // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   K2Node_Select_Default;                             // 0x0108(0x0018)()
	EFortDialogResult                             K2Node_CustomEvent_Result;                         // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName;                     // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable4;                               // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDialogResult                             Temp_byte_Variable4;                               // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue4;         // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_143[0x1];                                      // 0x0143(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_PlayerIndex;                    // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	EFortDialogResult                             K2Node_CustomEvent_Result4;                        // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName4;                    // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FFortTeamMemberInfo& NewTeamMemberInfo)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 PlayerIndex)>            K2Node_CreateDelegate_OutputDelegate7;             // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	struct FFortTeamMemberInfo                    K2Node_CustomEvent_NewTeamMemberInfo;              // 0x0198(0x01A8)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerControllerOutpost_C*          K2Node_DynamicCast_AsBP_Player_Controller_Outpost; // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate8;             // 0x0358(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsOutpostOwner_ReturnValue;               // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredInGame_InGame;                // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36A[0x6];                                      // 0x036A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue6;                  // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue7;                  // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable3;                               // 0x0380(0x0018)()
	int32                                         CallFunc_GetNumPlayersInLocalParty_ReturnValue2;   // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39D[0x3];                                      // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable4;                               // 0x03A0(0x0018)()
	class FText                                   Temp_text_Variable5;                               // 0x03B8(0x0018)()
	bool                                          CallFunc_HasUnsavedQuestProgress_HasUnsavedQuestProgress; // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasUnsavedQuestProgress_HasUnsavedQuestProgress2; // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x03D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D3[0x5];                                      // 0x03D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortOutpostContext*                    CallFunc_GetContext_ReturnValue8;                  // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select2_Default;                            // 0x03E0(0x0018)()
	class FText                                   Temp_text_Variable6;                               // 0x03F8(0x0018)()
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue9;                  // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInOutpostZone_ReturnValue;              // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue10;                 // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumPlayersInLocalParty_ReturnValue3;   // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue3;              // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue2;      // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue11;                 // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable7;                               // 0x0458(0x0018)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue2;             // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue3;             // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULeaveWarningInfo_C*                    CallFunc_Create_ReturnValue;                       // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULeaveWarningInfo_C*                    CallFunc_Create_ReturnValue2;                      // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue2; // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0499(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49A[0x6];                                      // 0x049A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x04A0(0x0018)()
	class FText                                   Temp_text_Variable8;                               // 0x04B8(0x0018)()
	bool                                          Temp_bool_Variable5;                               // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable6;                               // 0x04D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D2[0x6];                                      // 0x04D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select3_Default;                            // 0x04D8(0x0018)()
	class FText                                   K2Node_Select4_Default;                            // 0x04F0(0x0018)()
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue3;      // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable7;                               // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredInGame_InGame2;               // 0x0511(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInNeighborhood_bIsInNeighborhood;       // 0x0512(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_513[0x5];                                      // 0x0513(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue12;                 // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable9;                               // 0x0520(0x0018)()
	bool                                          CallFunc_IsInOutpostZone_ReturnValue2;             // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable10;                              // 0x0540(0x0018)()
	class FText                                   K2Node_Select5_Default;                            // 0x0558(0x0018)()
	class FText                                   K2Node_Select6_Default;                            // 0x0570(0x0018)()
	class FText                                   K2Node_Select7_Default;                            // 0x0588(0x0018)()
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue3; // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue4; // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x05B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LeaveButton_C_ExecuteUbergraph_LeaveButton) == 0x000008, "Wrong alignment on LeaveButton_C_ExecuteUbergraph_LeaveButton");
static_assert(sizeof(LeaveButton_C_ExecuteUbergraph_LeaveButton) == 0x0005B8, "Wrong size on LeaveButton_C_ExecuteUbergraph_LeaveButton");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, EntryPoint) == 0x000000, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_bool_Variable) == 0x000004, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_name_Variable) == 0x000008, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_byte_Variable) == 0x000010, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CustomEvent_Result3) == 0x000028, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CustomEvent_Result3' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CustomEvent_ResultName3) == 0x000030, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CustomEvent_ResultName3' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_name_Variable2) == 0x000038, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_byte_Variable2) == 0x000040, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000041, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetContext_ReturnValue) == 0x000048, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetLocalPlayerTeam_ReturnValue) == 0x000050, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetLocalPlayerTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetContext_ReturnValue2) == 0x000058, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_bool_Variable2) == 0x000060, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetContext_ReturnValue3) == 0x000068, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetSubGame_ReturnValue) == 0x000070, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CreateDelegate_OutputDelegate2) == 0x000078, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_SwitchEnum_CmpSuccess) == 0x000088, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CustomEvent_Result2) == 0x000089, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CustomEvent_Result2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CustomEvent_ResultName2) == 0x000090, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CustomEvent_ResultName2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_name_Variable3) == 0x000098, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_name_Variable3' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_byte_Variable3) == 0x0000A0, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_EqualEqual_ByteByte_ReturnValue3) == 0x0000A1, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_EqualEqual_ByteByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetContext_ReturnValue4) == 0x0000A8, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetContext_ReturnValue5) == 0x0000B0, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_bool_Variable3) == 0x0000B8, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetNumPlayersInLocalParty_ReturnValue) == 0x0000BC, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetNumPlayersInLocalParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_text_Variable) == 0x0000C0, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D8, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_text_Variable2) == 0x0000E0, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CreateDelegate_OutputDelegate3) == 0x0000F8, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_Select_Default) == 0x000108, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CustomEvent_Result) == 0x000120, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CustomEvent_ResultName) == 0x000128, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CustomEvent_ResultName' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue) == 0x000130, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_name_Variable4) == 0x000138, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_name_Variable4' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_IsValid_ReturnValue) == 0x000140, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_byte_Variable4) == 0x000141, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_EqualEqual_ByteByte_ReturnValue4) == 0x000142, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_EqualEqual_ByteByte_ReturnValue4' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CustomEvent_PlayerIndex) == 0x000144, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CustomEvent_PlayerIndex' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CreateDelegate_OutputDelegate4) == 0x000148, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CreateDelegate_OutputDelegate5) == 0x000158, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CustomEvent_Result4) == 0x000168, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CustomEvent_Result4' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CustomEvent_ResultName4) == 0x000170, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CustomEvent_ResultName4' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CreateDelegate_OutputDelegate6) == 0x000178, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CreateDelegate_OutputDelegate7) == 0x000188, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CustomEvent_NewTeamMemberInfo) == 0x000198, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CustomEvent_NewTeamMemberInfo' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetOwningPlayer_ReturnValue) == 0x000340, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_DynamicCast_AsBP_Player_Controller_Outpost) == 0x000348, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_DynamicCast_AsBP_Player_Controller_Outpost' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_DynamicCast_bSuccess) == 0x000350, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_CreateDelegate_OutputDelegate8) == 0x000358, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_IsOutpostOwner_ReturnValue) == 0x000368, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_IsOutpostOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_IsConsideredInGame_InGame) == 0x000369, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_IsConsideredInGame_InGame' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetContext_ReturnValue6) == 0x000370, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetContext_ReturnValue6' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetContext_ReturnValue7) == 0x000378, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetContext_ReturnValue7' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_text_Variable3) == 0x000380, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_text_Variable3' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetNumPlayersInLocalParty_ReturnValue2) == 0x000398, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetNumPlayersInLocalParty_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_Greater_IntInt_ReturnValue2) == 0x00039C, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_Greater_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_text_Variable4) == 0x0003A0, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_text_Variable4' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_text_Variable5) == 0x0003B8, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_text_Variable5' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_HasUnsavedQuestProgress_HasUnsavedQuestProgress) == 0x0003D0, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_HasUnsavedQuestProgress_HasUnsavedQuestProgress' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_HasUnsavedQuestProgress_HasUnsavedQuestProgress2) == 0x0003D1, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_HasUnsavedQuestProgress_HasUnsavedQuestProgress2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_bool_Variable4) == 0x0003D2, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetContext_ReturnValue8) == 0x0003D8, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetContext_ReturnValue8' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_Select2_Default) == 0x0003E0, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_text_Variable6) == 0x0003F8, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_text_Variable6' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetContext_ReturnValue9) == 0x000410, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetContext_ReturnValue9' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_IsInOutpostZone_ReturnValue) == 0x000418, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_IsInOutpostZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetContext_ReturnValue10) == 0x000420, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetContext_ReturnValue10' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetNumPlayersInLocalParty_ReturnValue3) == 0x000428, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetNumPlayersInLocalParty_ReturnValue3' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_ComponentBoundEvent_Button) == 0x000430, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_Greater_IntInt_ReturnValue3) == 0x000438, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_Greater_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetUINavigationManager_ReturnValue) == 0x000440, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetUINavigationManager_ReturnValue2) == 0x000448, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetUINavigationManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetContext_ReturnValue11) == 0x000450, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetContext_ReturnValue11' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_text_Variable7) == 0x000458, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_text_Variable7' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetOwningPlayer_ReturnValue2) == 0x000470, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetOwningPlayer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetOwningPlayer_ReturnValue3) == 0x000478, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetOwningPlayer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_Create_ReturnValue) == 0x000480, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_Create_ReturnValue2) == 0x000488, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_Create_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue2) == 0x000490, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_Event_IsDesignTime) == 0x000498, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_IsValid_ReturnValue2) == 0x000499, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_MakeLiteralText_ReturnValue) == 0x0004A0, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_text_Variable8) == 0x0004B8, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_text_Variable8' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_bool_Variable5) == 0x0004D0, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_bool_Variable6) == 0x0004D1, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_Select3_Default) == 0x0004D8, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_Select4_Default) == 0x0004F0, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetUINavigationManager_ReturnValue3) == 0x000508, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetUINavigationManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_bool_Variable7) == 0x000510, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_bool_Variable7' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_IsConsideredInGame_InGame2) == 0x000511, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_IsConsideredInGame_InGame2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_IsInNeighborhood_bIsInNeighborhood) == 0x000512, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_IsInNeighborhood_bIsInNeighborhood' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_GetContext_ReturnValue12) == 0x000518, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_GetContext_ReturnValue12' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_text_Variable9) == 0x000520, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_text_Variable9' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_IsInOutpostZone_ReturnValue2) == 0x000538, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_IsInOutpostZone_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, Temp_text_Variable10) == 0x000540, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::Temp_text_Variable10' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_Select5_Default) == 0x000558, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_Select5_Default' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_Select6_Default) == 0x000570, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_Select6_Default' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, K2Node_Select7_Default) == 0x000588, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::K2Node_Select7_Default' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue3) == 0x0005A0, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue3' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue4) == 0x0005A8, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue4' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_IsValid_ReturnValue3) == 0x0005B0, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_ExecuteUbergraph_LeaveButton, CallFunc_IsValid_ReturnValue4) == 0x0005B1, "Member 'LeaveButton_C_ExecuteUbergraph_LeaveButton::CallFunc_IsValid_ReturnValue4' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct LeaveButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LeaveButton_C_PreConstruct) == 0x000001, "Wrong alignment on LeaveButton_C_PreConstruct");
static_assert(sizeof(LeaveButton_C_PreConstruct) == 0x000001, "Wrong size on LeaveButton_C_PreConstruct");
static_assert(offsetof(LeaveButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'LeaveButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct LeaveButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LeaveButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on LeaveButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(LeaveButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on LeaveButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(LeaveButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'LeaveButton_C_BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.HandleTeamMemberAdded
// 0x01A8 (0x01A8 - 0x0000)
struct LeaveButton_C_HandleTeamMemberAdded final
{
public:
	struct FFortTeamMemberInfo                    NewTeamMemberInfo;                                 // 0x0000(0x01A8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(LeaveButton_C_HandleTeamMemberAdded) == 0x000008, "Wrong alignment on LeaveButton_C_HandleTeamMemberAdded");
static_assert(sizeof(LeaveButton_C_HandleTeamMemberAdded) == 0x0001A8, "Wrong size on LeaveButton_C_HandleTeamMemberAdded");
static_assert(offsetof(LeaveButton_C_HandleTeamMemberAdded, NewTeamMemberInfo) == 0x000000, "Member 'LeaveButton_C_HandleTeamMemberAdded::NewTeamMemberInfo' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.HandleTeamMemberRemoved
// 0x0004 (0x0004 - 0x0000)
struct LeaveButton_C_HandleTeamMemberRemoved final
{
public:
	int32                                         PlayerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LeaveButton_C_HandleTeamMemberRemoved) == 0x000004, "Wrong alignment on LeaveButton_C_HandleTeamMemberRemoved");
static_assert(sizeof(LeaveButton_C_HandleTeamMemberRemoved) == 0x000004, "Wrong size on LeaveButton_C_HandleTeamMemberRemoved");
static_assert(offsetof(LeaveButton_C_HandleTeamMemberRemoved, PlayerIndex) == 0x000000, "Member 'LeaveButton_C_HandleTeamMemberRemoved::PlayerIndex' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.DialogResult_A0D25F7F4E82D325BF226E811F1D79AF
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) LeaveButton_C_DialogResult_A0D25F7F4E82D325BF226E811F1D79AF final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LeaveButton_C_DialogResult_A0D25F7F4E82D325BF226E811F1D79AF) == 0x000008, "Wrong alignment on LeaveButton_C_DialogResult_A0D25F7F4E82D325BF226E811F1D79AF");
static_assert(sizeof(LeaveButton_C_DialogResult_A0D25F7F4E82D325BF226E811F1D79AF) == 0x000010, "Wrong size on LeaveButton_C_DialogResult_A0D25F7F4E82D325BF226E811F1D79AF");
static_assert(offsetof(LeaveButton_C_DialogResult_A0D25F7F4E82D325BF226E811F1D79AF, Result) == 0x000000, "Member 'LeaveButton_C_DialogResult_A0D25F7F4E82D325BF226E811F1D79AF::Result' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_DialogResult_A0D25F7F4E82D325BF226E811F1D79AF, ResultName) == 0x000008, "Member 'LeaveButton_C_DialogResult_A0D25F7F4E82D325BF226E811F1D79AF::ResultName' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.DialogResult_574CB01D47DE8AEDA0EB2F9CFB146A3B
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) LeaveButton_C_DialogResult_574CB01D47DE8AEDA0EB2F9CFB146A3B final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LeaveButton_C_DialogResult_574CB01D47DE8AEDA0EB2F9CFB146A3B) == 0x000008, "Wrong alignment on LeaveButton_C_DialogResult_574CB01D47DE8AEDA0EB2F9CFB146A3B");
static_assert(sizeof(LeaveButton_C_DialogResult_574CB01D47DE8AEDA0EB2F9CFB146A3B) == 0x000010, "Wrong size on LeaveButton_C_DialogResult_574CB01D47DE8AEDA0EB2F9CFB146A3B");
static_assert(offsetof(LeaveButton_C_DialogResult_574CB01D47DE8AEDA0EB2F9CFB146A3B, Result) == 0x000000, "Member 'LeaveButton_C_DialogResult_574CB01D47DE8AEDA0EB2F9CFB146A3B::Result' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_DialogResult_574CB01D47DE8AEDA0EB2F9CFB146A3B, ResultName) == 0x000008, "Member 'LeaveButton_C_DialogResult_574CB01D47DE8AEDA0EB2F9CFB146A3B::ResultName' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.DialogResult_F5AF58094777CFEEC0BF28BEA620800C
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) LeaveButton_C_DialogResult_F5AF58094777CFEEC0BF28BEA620800C final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LeaveButton_C_DialogResult_F5AF58094777CFEEC0BF28BEA620800C) == 0x000008, "Wrong alignment on LeaveButton_C_DialogResult_F5AF58094777CFEEC0BF28BEA620800C");
static_assert(sizeof(LeaveButton_C_DialogResult_F5AF58094777CFEEC0BF28BEA620800C) == 0x000010, "Wrong size on LeaveButton_C_DialogResult_F5AF58094777CFEEC0BF28BEA620800C");
static_assert(offsetof(LeaveButton_C_DialogResult_F5AF58094777CFEEC0BF28BEA620800C, Result) == 0x000000, "Member 'LeaveButton_C_DialogResult_F5AF58094777CFEEC0BF28BEA620800C::Result' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_DialogResult_F5AF58094777CFEEC0BF28BEA620800C, ResultName) == 0x000008, "Member 'LeaveButton_C_DialogResult_F5AF58094777CFEEC0BF28BEA620800C::ResultName' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.DialogResult_1E39F47546648367BB2F218F69311220
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) LeaveButton_C_DialogResult_1E39F47546648367BB2F218F69311220 final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LeaveButton_C_DialogResult_1E39F47546648367BB2F218F69311220) == 0x000008, "Wrong alignment on LeaveButton_C_DialogResult_1E39F47546648367BB2F218F69311220");
static_assert(sizeof(LeaveButton_C_DialogResult_1E39F47546648367BB2F218F69311220) == 0x000010, "Wrong size on LeaveButton_C_DialogResult_1E39F47546648367BB2F218F69311220");
static_assert(offsetof(LeaveButton_C_DialogResult_1E39F47546648367BB2F218F69311220, Result) == 0x000000, "Member 'LeaveButton_C_DialogResult_1E39F47546648367BB2F218F69311220::Result' has a wrong offset!");
static_assert(offsetof(LeaveButton_C_DialogResult_1E39F47546648367BB2F218F69311220, ResultName) == 0x000008, "Member 'LeaveButton_C_DialogResult_1E39F47546648367BB2F218F69311220::ResultName' has a wrong offset!");

// Function LeaveButton.LeaveButton_C.GetLeaveActionText
// 0x0130 (0x0130 - 0x0000)
struct LeaveButton_C_GetLeaveActionText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0030(0x0018)()
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInOutpostZone_ReturnValue;              // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable3;                               // 0x0058(0x0018)()
	class FText                                   Temp_text_Variable4;                               // 0x0070(0x0018)()
	bool                                          Temp_bool_Variable2;                               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable5;                               // 0x0090(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x00A8(0x0018)()
	bool                                          CallFunc_IsConsideredInGame_InGame;                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerControllerOutpost_C*          K2Node_DynamicCast_AsBP_Player_Controller_Outpost; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select2_Default;                            // 0x00E0(0x0018)()
	bool                                          CallFunc_IsOutpostOwner_ReturnValue;               // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsConsideredInGame_InGame2;               // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
