#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyGadgetButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LobbyGadgetButton.LobbyGadgetButton_C
// 0x0060 (0x0270 - 0x0210)
class ULobbyGadgetButton_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UPanelButton_C*                         Button;                                            // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EmptySlot;                                         // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 Item;                                              // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UFortWorldItemDefinition*>       DesignTestItemDefinitions;                         // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UFortWorldItem*                         GadgetItem;                                        // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnButtonClicked;                                   // 0x0248(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnButtonHovered;                                   // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bLocked;                                           // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void Focus();
	void GetLocked(bool* Param_bLocked);
	void SetLocked(bool Param_bLocked);
	void GetGadgetItem(class UFortWorldItem** Param_GadgetItem);
	void Refresh(class UFortWorldItem* WorldItem);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__Button_K2Node_ComponentBoundEvent_81_CommonButtonClicked__DelegateSignature(class UCommonButton* Param_Button);
	void BndEvt__Button_K2Node_ComponentBoundEvent_96_CommonButtonClicked__DelegateSignature(class UCommonButton* Param_Button);
	void ExecuteUbergraph_LobbyGadgetButton(int32 EntryPoint);
	void OnButtonHovered__DelegateSignature(class ULobbyGadgetButton_C* GadgetButton);
	void OnButtonClicked__DelegateSignature(class ULobbyGadgetButton_C* GadgetButton);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LobbyGadgetButton_C">();
	}
	static class ULobbyGadgetButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULobbyGadgetButton_C>();
	}
};
static_assert(alignof(ULobbyGadgetButton_C) == 0x000008, "Wrong alignment on ULobbyGadgetButton_C");
static_assert(sizeof(ULobbyGadgetButton_C) == 0x000270, "Wrong size on ULobbyGadgetButton_C");
static_assert(offsetof(ULobbyGadgetButton_C, UberGraphFrame) == 0x000210, "Member 'ULobbyGadgetButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULobbyGadgetButton_C, Button) == 0x000218, "Member 'ULobbyGadgetButton_C::Button' has a wrong offset!");
static_assert(offsetof(ULobbyGadgetButton_C, EmptySlot) == 0x000220, "Member 'ULobbyGadgetButton_C::EmptySlot' has a wrong offset!");
static_assert(offsetof(ULobbyGadgetButton_C, Item) == 0x000228, "Member 'ULobbyGadgetButton_C::Item' has a wrong offset!");
static_assert(offsetof(ULobbyGadgetButton_C, DesignTestItemDefinitions) == 0x000230, "Member 'ULobbyGadgetButton_C::DesignTestItemDefinitions' has a wrong offset!");
static_assert(offsetof(ULobbyGadgetButton_C, GadgetItem) == 0x000240, "Member 'ULobbyGadgetButton_C::GadgetItem' has a wrong offset!");
static_assert(offsetof(ULobbyGadgetButton_C, OnButtonClicked) == 0x000248, "Member 'ULobbyGadgetButton_C::OnButtonClicked' has a wrong offset!");
static_assert(offsetof(ULobbyGadgetButton_C, OnButtonHovered) == 0x000258, "Member 'ULobbyGadgetButton_C::OnButtonHovered' has a wrong offset!");
static_assert(offsetof(ULobbyGadgetButton_C, bLocked) == 0x000268, "Member 'ULobbyGadgetButton_C::bLocked' has a wrong offset!");

}

