#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LobbyPlayerAddPlayer

#include "Basic.hpp"


namespace SDK::Params
{

// Function LobbyPlayerAddPlayer.LobbyPlayerAddPlayer_C.BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_46_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct LobbyPlayerAddPlayer_C_BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_46_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbyPlayerAddPlayer_C_BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_46_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on LobbyPlayerAddPlayer_C_BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_46_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(LobbyPlayerAddPlayer_C_BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_46_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on LobbyPlayerAddPlayer_C_BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_46_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(LobbyPlayerAddPlayer_C_BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_46_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'LobbyPlayerAddPlayer_C_BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_46_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function LobbyPlayerAddPlayer.LobbyPlayerAddPlayer_C.BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_64_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct LobbyPlayerAddPlayer_C_BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_64_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbyPlayerAddPlayer_C_BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_64_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on LobbyPlayerAddPlayer_C_BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_64_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(LobbyPlayerAddPlayer_C_BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_64_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on LobbyPlayerAddPlayer_C_BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_64_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(LobbyPlayerAddPlayer_C_BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_64_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'LobbyPlayerAddPlayer_C_BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_64_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function LobbyPlayerAddPlayer.LobbyPlayerAddPlayer_C.BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct LobbyPlayerAddPlayer_C_BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbyPlayerAddPlayer_C_BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on LobbyPlayerAddPlayer_C_BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(LobbyPlayerAddPlayer_C_BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on LobbyPlayerAddPlayer_C_BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(LobbyPlayerAddPlayer_C_BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'LobbyPlayerAddPlayer_C_BndEvt__ButtonEmptySpot_K2Node_ComponentBoundEvent_76_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function LobbyPlayerAddPlayer.LobbyPlayerAddPlayer_C.ExecuteUbergraph_LobbyPlayerAddPlayer
// 0x0038 (0x0038 - 0x0000)
struct LobbyPlayerAddPlayer_C_ExecuteUbergraph_LobbyPlayerAddPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button3;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue3;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LobbyPlayerAddPlayer_C_ExecuteUbergraph_LobbyPlayerAddPlayer) == 0x000008, "Wrong alignment on LobbyPlayerAddPlayer_C_ExecuteUbergraph_LobbyPlayerAddPlayer");
static_assert(sizeof(LobbyPlayerAddPlayer_C_ExecuteUbergraph_LobbyPlayerAddPlayer) == 0x000038, "Wrong size on LobbyPlayerAddPlayer_C_ExecuteUbergraph_LobbyPlayerAddPlayer");
static_assert(offsetof(LobbyPlayerAddPlayer_C_ExecuteUbergraph_LobbyPlayerAddPlayer, EntryPoint) == 0x000000, "Member 'LobbyPlayerAddPlayer_C_ExecuteUbergraph_LobbyPlayerAddPlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(LobbyPlayerAddPlayer_C_ExecuteUbergraph_LobbyPlayerAddPlayer, K2Node_ComponentBoundEvent_Button3) == 0x000008, "Member 'LobbyPlayerAddPlayer_C_ExecuteUbergraph_LobbyPlayerAddPlayer::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(LobbyPlayerAddPlayer_C_ExecuteUbergraph_LobbyPlayerAddPlayer, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'LobbyPlayerAddPlayer_C_ExecuteUbergraph_LobbyPlayerAddPlayer::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(LobbyPlayerAddPlayer_C_ExecuteUbergraph_LobbyPlayerAddPlayer, CallFunc_GetContext_ReturnValue2) == 0x000018, "Member 'LobbyPlayerAddPlayer_C_ExecuteUbergraph_LobbyPlayerAddPlayer::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LobbyPlayerAddPlayer_C_ExecuteUbergraph_LobbyPlayerAddPlayer, CallFunc_GetContext_ReturnValue3) == 0x000020, "Member 'LobbyPlayerAddPlayer_C_ExecuteUbergraph_LobbyPlayerAddPlayer::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(LobbyPlayerAddPlayer_C_ExecuteUbergraph_LobbyPlayerAddPlayer, K2Node_ComponentBoundEvent_Button2) == 0x000028, "Member 'LobbyPlayerAddPlayer_C_ExecuteUbergraph_LobbyPlayerAddPlayer::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(LobbyPlayerAddPlayer_C_ExecuteUbergraph_LobbyPlayerAddPlayer, K2Node_ComponentBoundEvent_Button) == 0x000030, "Member 'LobbyPlayerAddPlayer_C_ExecuteUbergraph_LobbyPlayerAddPlayer::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

}

