#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoginScreen

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function LoginScreen.LoginScreen_C.ExecuteUbergraph_LoginScreen
// 0x0238 (0x0238 - 0x0000)
struct LoginScreen_C_ExecuteUbergraph_LoginScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartAutoLogin_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortUIState                                  K2Node_Event_PreviousUIState;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIState                                  K2Node_Event_NextUIState;                          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_LoginEmail;                     // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_LoginPassword;                  // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartManualLogin_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobileApp_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bProceed;                             // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Reason2;                              // 0x0058(0x0018)()
	class FText                                   K2Node_Event_EulaText;                             // 0x0070(0x0018)()
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue3;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Accepted;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowBenchmark_Return_Value;         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_StatusText;                     // 0x00B0(0x0018)()
	class FText                                   K2Node_CustomEvent_FailReason;                     // 0x00C8(0x0018)()
	bool                                          CallFunc_StartAutoLogin_ReturnValue2;              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFort_Entry_Music_Controller_BP_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x00E8(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Event_Widget;                               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FContentPushState                      K2Node_Event_State;                                // 0x0108(0x0003)(NoDestructor)
	EFortDialogResult                             Temp_byte_Variable;                                // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLoggingOut_ReturnValue;                 // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLoggedIn_ReturnValue;                   // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEulaText_ReturnValue;                  // 0x0128(0x0018)()
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue2;            // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bLinkedAccountNeedsPurchase;          // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckNetworkError_ReturnValue;            // 0x014E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckNetworkError_ReturnValue2;           // 0x014F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortLoginAccountType                         K2Node_CustomEvent_LoginAccountType;               // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             K2Node_CustomEvent_Result;                         // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName;                     // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFort_Entry_Music_Controller_BP_C*      CallFunc_Array_Get_Item;                           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_Reason;                               // 0x0170(0x0018)()
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bShow;                                // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_Tile;                                 // 0x01A0(0x0018)()
	class FText                                   K2Node_Event_Body;                                 // 0x01B8(0x0018)()
	class FString                                 K2Node_Event_Country;                              // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_ErrorText2;                           // 0x01E0(0x0018)()
	class FText                                   K2Node_Event_ErrorText;                            // 0x01F8(0x0018)(ConstParm)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue4;                  // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMOTD_C*                                CallFunc_Create_ReturnValue;                       // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLoggedIn_ReturnValue2;                  // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoginScreen_C_ExecuteUbergraph_LoginScreen) == 0x000008, "Wrong alignment on LoginScreen_C_ExecuteUbergraph_LoginScreen");
static_assert(sizeof(LoginScreen_C_ExecuteUbergraph_LoginScreen) == 0x000238, "Wrong size on LoginScreen_C_ExecuteUbergraph_LoginScreen");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, EntryPoint) == 0x000000, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_StartAutoLogin_ReturnValue) == 0x000020, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_StartAutoLogin_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_PreviousUIState) == 0x000021, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_PreviousUIState' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_NextUIState) == 0x000022, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_NextUIState' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_LoginEmail) == 0x000028, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_LoginEmail' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_LoginPassword) == 0x000038, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_LoginPassword' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetContext_ReturnValue2) == 0x000048, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_StartManualLogin_ReturnValue) == 0x000050, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_StartManualLogin_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_IsMobileApp_ReturnValue) == 0x000051, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_IsMobileApp_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_bProceed) == 0x000052, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_bProceed' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_Reason2) == 0x000058, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_Reason2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_EulaText) == 0x000070, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_EulaText' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetContext_ReturnValue3) == 0x000088, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_Accepted) == 0x000090, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_Accepted' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, Temp_int_Loop_Counter_Variable) == 0x000094, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_ShouldShowBenchmark_Return_Value) == 0x000098, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_ShouldShowBenchmark_Return_Value' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_Add_IntInt_ReturnValue) == 0x00009C, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue) == 0x0000A0, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_StatusText) == 0x0000B0, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_StatusText' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_FailReason) == 0x0000C8, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_FailReason' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_StartAutoLogin_ReturnValue2) == 0x0000E0, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_StartAutoLogin_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000E8, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_Array_Length_ReturnValue) == 0x0000F8, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_Less_IntInt_ReturnValue) == 0x0000FC, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_Widget) == 0x000100, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_Widget' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_State) == 0x000108, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, Temp_byte_Variable) == 0x00010B, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_IsLoggingOut_ReturnValue) == 0x00010C, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_IsLoggingOut_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_SwitchEnum_CmpSuccess) == 0x00010D, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, Temp_name_Variable) == 0x000110, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_ComponentBoundEvent_Button) == 0x000118, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_IsLoggedIn_ReturnValue) == 0x000120, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_IsLoggedIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetEulaText_ReturnValue) == 0x000128, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetEulaText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetChildrenCount_ReturnValue) == 0x000140, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_Greater_IntInt_ReturnValue) == 0x000144, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetChildrenCount_ReturnValue2) == 0x000148, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetChildrenCount_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_Greater_IntInt_ReturnValue2) == 0x00014C, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_Greater_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_bLinkedAccountNeedsPurchase) == 0x00014D, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_bLinkedAccountNeedsPurchase' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_CheckNetworkError_ReturnValue) == 0x00014E, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_CheckNetworkError_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_CheckNetworkError_ReturnValue2) == 0x00014F, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_CheckNetworkError_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_LoginAccountType) == 0x000150, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_LoginAccountType' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_Result) == 0x000151, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CustomEvent_ResultName) == 0x000158, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CustomEvent_ResultName' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000160, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, Temp_int_Array_Index_Variable) == 0x000164, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_Array_Get_Item) == 0x000168, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_Reason) == 0x000170, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_CreateDelegate_OutputDelegate2) == 0x000188, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_bShow) == 0x000198, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_bShow' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_Tile) == 0x0001A0, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_Tile' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_Body) == 0x0001B8, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_Body' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_Country) == 0x0001D0, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_Country' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_ErrorText2) == 0x0001E0, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_ErrorText2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, K2Node_Event_ErrorText) == 0x0001F8, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::K2Node_Event_ErrorText' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000210, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetContext_ReturnValue4) == 0x000218, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_GetOwningPlayer_ReturnValue) == 0x000220, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_Create_ReturnValue) == 0x000228, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ExecuteUbergraph_LoginScreen, CallFunc_IsLoggedIn_ReturnValue2) == 0x000230, "Member 'LoginScreen_C_ExecuteUbergraph_LoginScreen::CallFunc_IsLoggedIn_ReturnValue2' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.CustomEvent
// 0x0018 (0x0018 - 0x0000)
struct LoginScreen_C_CustomEvent final
{
public:
	class FText                                   ErrorText;                                         // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LoginScreen_C_CustomEvent) == 0x000008, "Wrong alignment on LoginScreen_C_CustomEvent");
static_assert(sizeof(LoginScreen_C_CustomEvent) == 0x000018, "Wrong size on LoginScreen_C_CustomEvent");
static_assert(offsetof(LoginScreen_C_CustomEvent, ErrorText) == 0x000000, "Member 'LoginScreen_C_CustomEvent::ErrorText' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnLoggedOutWithError
// 0x0018 (0x0018 - 0x0000)
struct LoginScreen_C_OnLoggedOutWithError final
{
public:
	class FText                                   ErrorText;                                         // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LoginScreen_C_OnLoggedOutWithError) == 0x000008, "Wrong alignment on LoginScreen_C_OnLoggedOutWithError");
static_assert(sizeof(LoginScreen_C_OnLoggedOutWithError) == 0x000018, "Wrong size on LoginScreen_C_OnLoggedOutWithError");
static_assert(offsetof(LoginScreen_C_OnLoggedOutWithError, ErrorText) == 0x000000, "Member 'LoginScreen_C_OnLoggedOutWithError::ErrorText' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnShowHealthWarning
// 0x0010 (0x0010 - 0x0000)
struct LoginScreen_C_OnShowHealthWarning final
{
public:
	class FString                                 Country;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginScreen_C_OnShowHealthWarning) == 0x000008, "Wrong alignment on LoginScreen_C_OnShowHealthWarning");
static_assert(sizeof(LoginScreen_C_OnShowHealthWarning) == 0x000010, "Wrong size on LoginScreen_C_OnShowHealthWarning");
static_assert(offsetof(LoginScreen_C_OnShowHealthWarning, Country) == 0x000000, "Member 'LoginScreen_C_OnShowHealthWarning::Country' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnShowLoginMessage
// 0x0038 (0x0038 - 0x0000)
struct LoginScreen_C_OnShowLoginMessage final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Tile;                                              // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Body;                                              // 0x0020(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LoginScreen_C_OnShowLoginMessage) == 0x000008, "Wrong alignment on LoginScreen_C_OnShowLoginMessage");
static_assert(sizeof(LoginScreen_C_OnShowLoginMessage) == 0x000038, "Wrong size on LoginScreen_C_OnShowLoginMessage");
static_assert(offsetof(LoginScreen_C_OnShowLoginMessage, bShow) == 0x000000, "Member 'LoginScreen_C_OnShowLoginMessage::bShow' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_OnShowLoginMessage, Tile) == 0x000008, "Member 'LoginScreen_C_OnShowLoginMessage::Tile' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_OnShowLoginMessage, Body) == 0x000020, "Member 'LoginScreen_C_OnShowLoginMessage::Body' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnPostLoginLogoutComplete
// 0x0018 (0x0018 - 0x0000)
struct LoginScreen_C_OnPostLoginLogoutComplete final
{
public:
	class FText                                   Reason;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LoginScreen_C_OnPostLoginLogoutComplete) == 0x000008, "Wrong alignment on LoginScreen_C_OnPostLoginLogoutComplete");
static_assert(sizeof(LoginScreen_C_OnPostLoginLogoutComplete) == 0x000018, "Wrong size on LoginScreen_C_OnPostLoginLogoutComplete");
static_assert(offsetof(LoginScreen_C_OnPostLoginLogoutComplete, Reason) == 0x000000, "Member 'LoginScreen_C_OnPostLoginLogoutComplete::Reason' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.HandleOnLoginAccountTypeSelected
// 0x0001 (0x0001 - 0x0000)
struct LoginScreen_C_HandleOnLoginAccountTypeSelected final
{
public:
	EFortLoginAccountType                         LoginAccountType;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginScreen_C_HandleOnLoginAccountTypeSelected) == 0x000001, "Wrong alignment on LoginScreen_C_HandleOnLoginAccountTypeSelected");
static_assert(sizeof(LoginScreen_C_HandleOnLoginAccountTypeSelected) == 0x000001, "Wrong size on LoginScreen_C_HandleOnLoginAccountTypeSelected");
static_assert(offsetof(LoginScreen_C_HandleOnLoginAccountTypeSelected, LoginAccountType) == 0x000000, "Member 'LoginScreen_C_HandleOnLoginAccountTypeSelected::LoginAccountType' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnNeedsPurchaseOrAccountLinking
// 0x0001 (0x0001 - 0x0000)
struct LoginScreen_C_OnNeedsPurchaseOrAccountLinking final
{
public:
	bool                                          bLinkedAccountNeedsPurchase;                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoginScreen_C_OnNeedsPurchaseOrAccountLinking) == 0x000001, "Wrong alignment on LoginScreen_C_OnNeedsPurchaseOrAccountLinking");
static_assert(sizeof(LoginScreen_C_OnNeedsPurchaseOrAccountLinking) == 0x000001, "Wrong size on LoginScreen_C_OnNeedsPurchaseOrAccountLinking");
static_assert(offsetof(LoginScreen_C_OnNeedsPurchaseOrAccountLinking, bLinkedAccountNeedsPurchase) == 0x000000, "Member 'LoginScreen_C_OnNeedsPurchaseOrAccountLinking::bLinkedAccountNeedsPurchase' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.BndEvt__IconTextButton_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct LoginScreen_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginScreen_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on LoginScreen_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(LoginScreen_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on LoginScreen_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(LoginScreen_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'LoginScreen_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_20_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.PushContentWidgetInternal
// 0x0010 (0x0010 - 0x0000)
struct LoginScreen_C_PushContentWidgetInternal final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FContentPushState                      State;                                             // 0x0008(0x0003)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(LoginScreen_C_PushContentWidgetInternal) == 0x000008, "Wrong alignment on LoginScreen_C_PushContentWidgetInternal");
static_assert(sizeof(LoginScreen_C_PushContentWidgetInternal) == 0x000010, "Wrong size on LoginScreen_C_PushContentWidgetInternal");
static_assert(offsetof(LoginScreen_C_PushContentWidgetInternal, Widget) == 0x000000, "Member 'LoginScreen_C_PushContentWidgetInternal::Widget' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_PushContentWidgetInternal, State) == 0x000008, "Member 'LoginScreen_C_PushContentWidgetInternal::State' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.AccountLinking_LinkingFailed
// 0x0018 (0x0018 - 0x0000)
struct LoginScreen_C_AccountLinking_LinkingFailed final
{
public:
	class FText                                   FailReason;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(LoginScreen_C_AccountLinking_LinkingFailed) == 0x000008, "Wrong alignment on LoginScreen_C_AccountLinking_LinkingFailed");
static_assert(sizeof(LoginScreen_C_AccountLinking_LinkingFailed) == 0x000018, "Wrong size on LoginScreen_C_AccountLinking_LinkingFailed");
static_assert(offsetof(LoginScreen_C_AccountLinking_LinkingFailed, FailReason) == 0x000000, "Member 'LoginScreen_C_AccountLinking_LinkingFailed::FailReason' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.AccountLinking_PushStatus
// 0x0018 (0x0018 - 0x0000)
struct LoginScreen_C_AccountLinking_PushStatus final
{
public:
	class FText                                   StatusText;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(LoginScreen_C_AccountLinking_PushStatus) == 0x000008, "Wrong alignment on LoginScreen_C_AccountLinking_PushStatus");
static_assert(sizeof(LoginScreen_C_AccountLinking_PushStatus) == 0x000018, "Wrong size on LoginScreen_C_AccountLinking_PushStatus");
static_assert(offsetof(LoginScreen_C_AccountLinking_PushStatus, StatusText) == 0x000000, "Member 'LoginScreen_C_AccountLinking_PushStatus::StatusText' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.HandleEulaResponse
// 0x0001 (0x0001 - 0x0000)
struct LoginScreen_C_HandleEulaResponse final
{
public:
	bool                                          Accepted;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoginScreen_C_HandleEulaResponse) == 0x000001, "Wrong alignment on LoginScreen_C_HandleEulaResponse");
static_assert(sizeof(LoginScreen_C_HandleEulaResponse) == 0x000001, "Wrong size on LoginScreen_C_HandleEulaResponse");
static_assert(offsetof(LoginScreen_C_HandleEulaResponse, Accepted) == 0x000000, "Member 'LoginScreen_C_HandleEulaResponse::Accepted' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnEulaAvailable
// 0x0018 (0x0018 - 0x0000)
struct LoginScreen_C_OnEulaAvailable final
{
public:
	class FText                                   EulaText;                                          // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LoginScreen_C_OnEulaAvailable) == 0x000008, "Wrong alignment on LoginScreen_C_OnEulaAvailable");
static_assert(sizeof(LoginScreen_C_OnEulaAvailable) == 0x000018, "Wrong size on LoginScreen_C_OnEulaAvailable");
static_assert(offsetof(LoginScreen_C_OnEulaAvailable, EulaText) == 0x000000, "Member 'LoginScreen_C_OnEulaAvailable::EulaText' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnLoginFailed
// 0x0018 (0x0018 - 0x0000)
struct LoginScreen_C_OnLoginFailed final
{
public:
	class FText                                   Reason;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(LoginScreen_C_OnLoginFailed) == 0x000008, "Wrong alignment on LoginScreen_C_OnLoginFailed");
static_assert(sizeof(LoginScreen_C_OnLoginFailed) == 0x000018, "Wrong size on LoginScreen_C_OnLoginFailed");
static_assert(offsetof(LoginScreen_C_OnLoginFailed, Reason) == 0x000000, "Member 'LoginScreen_C_OnLoginFailed::Reason' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnPatchingComplete
// 0x0001 (0x0001 - 0x0000)
struct LoginScreen_C_OnPatchingComplete final
{
public:
	bool                                          bProceed;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoginScreen_C_OnPatchingComplete) == 0x000001, "Wrong alignment on LoginScreen_C_OnPatchingComplete");
static_assert(sizeof(LoginScreen_C_OnPatchingComplete) == 0x000001, "Wrong size on LoginScreen_C_OnPatchingComplete");
static_assert(offsetof(LoginScreen_C_OnPatchingComplete, bProceed) == 0x000000, "Member 'LoginScreen_C_OnPatchingComplete::bProceed' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.HandleOnStartLogin
// 0x0020 (0x0020 - 0x0000)
struct LoginScreen_C_HandleOnStartLogin final
{
public:
	class FString                                 LoginEmail;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 LoginPassword;                                     // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginScreen_C_HandleOnStartLogin) == 0x000008, "Wrong alignment on LoginScreen_C_HandleOnStartLogin");
static_assert(sizeof(LoginScreen_C_HandleOnStartLogin) == 0x000020, "Wrong size on LoginScreen_C_HandleOnStartLogin");
static_assert(offsetof(LoginScreen_C_HandleOnStartLogin, LoginEmail) == 0x000000, "Member 'LoginScreen_C_HandleOnStartLogin::LoginEmail' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_HandleOnStartLogin, LoginPassword) == 0x000010, "Member 'LoginScreen_C_HandleOnStartLogin::LoginPassword' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnExitState
// 0x0001 (0x0001 - 0x0000)
struct LoginScreen_C_OnExitState final
{
public:
	EFortUIState                                  NextUIState;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginScreen_C_OnExitState) == 0x000001, "Wrong alignment on LoginScreen_C_OnExitState");
static_assert(sizeof(LoginScreen_C_OnExitState) == 0x000001, "Wrong size on LoginScreen_C_OnExitState");
static_assert(offsetof(LoginScreen_C_OnExitState, NextUIState) == 0x000000, "Member 'LoginScreen_C_OnExitState::NextUIState' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.OnEnterState
// 0x0001 (0x0001 - 0x0000)
struct LoginScreen_C_OnEnterState final
{
public:
	EFortUIState                                  PreviousUIState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginScreen_C_OnEnterState) == 0x000001, "Wrong alignment on LoginScreen_C_OnEnterState");
static_assert(sizeof(LoginScreen_C_OnEnterState) == 0x000001, "Wrong size on LoginScreen_C_OnEnterState");
static_assert(offsetof(LoginScreen_C_OnEnterState, PreviousUIState) == 0x000000, "Member 'LoginScreen_C_OnEnterState::PreviousUIState' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.DialogResult_B952A8754B3836D2151B4981F531542E
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) LoginScreen_C_DialogResult_B952A8754B3836D2151B4981F531542E final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginScreen_C_DialogResult_B952A8754B3836D2151B4981F531542E) == 0x000008, "Wrong alignment on LoginScreen_C_DialogResult_B952A8754B3836D2151B4981F531542E");
static_assert(sizeof(LoginScreen_C_DialogResult_B952A8754B3836D2151B4981F531542E) == 0x000010, "Wrong size on LoginScreen_C_DialogResult_B952A8754B3836D2151B4981F531542E");
static_assert(offsetof(LoginScreen_C_DialogResult_B952A8754B3836D2151B4981F531542E, Result) == 0x000000, "Member 'LoginScreen_C_DialogResult_B952A8754B3836D2151B4981F531542E::Result' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_DialogResult_B952A8754B3836D2151B4981F531542E, ResultName) == 0x000008, "Member 'LoginScreen_C_DialogResult_B952A8754B3836D2151B4981F531542E::ResultName' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.ShowSignInWindow
// 0x0030 (0x0030 - 0x0000)
struct LoginScreen_C_ShowSignInWindow final
{
public:
	bool                                          DirectSignIn;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& Email, const class FString& Password)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USignInWidget_C*                        CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoginScreen_C_ShowSignInWindow) == 0x000008, "Wrong alignment on LoginScreen_C_ShowSignInWindow");
static_assert(sizeof(LoginScreen_C_ShowSignInWindow) == 0x000030, "Wrong size on LoginScreen_C_ShowSignInWindow");
static_assert(offsetof(LoginScreen_C_ShowSignInWindow, DirectSignIn) == 0x000000, "Member 'LoginScreen_C_ShowSignInWindow::DirectSignIn' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowSignInWindow, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'LoginScreen_C_ShowSignInWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowSignInWindow, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'LoginScreen_C_ShowSignInWindow::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowSignInWindow, CallFunc_Create_ReturnValue) == 0x000020, "Member 'LoginScreen_C_ShowSignInWindow::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowSignInWindow, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'LoginScreen_C_ShowSignInWindow::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.ShowStatusWindow
// 0x0070 (0x0070 - 0x0000)
struct LoginScreen_C_ShowStatusWindow final
{
public:
	class FText                                   StatusText;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   LocalStatusText;                                   // 0x0018(0x0018)(Edit, BlueprintVisible)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStatusWidget_C*                        CallFunc_Create_ReturnValue;                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoginScreen_C_ShowStatusWindow) == 0x000008, "Wrong alignment on LoginScreen_C_ShowStatusWindow");
static_assert(sizeof(LoginScreen_C_ShowStatusWindow) == 0x000070, "Wrong size on LoginScreen_C_ShowStatusWindow");
static_assert(offsetof(LoginScreen_C_ShowStatusWindow, StatusText) == 0x000000, "Member 'LoginScreen_C_ShowStatusWindow::StatusText' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowStatusWindow, LocalStatusText) == 0x000018, "Member 'LoginScreen_C_ShowStatusWindow::LocalStatusText' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowStatusWindow, CallFunc_GetVisibility_ReturnValue) == 0x000030, "Member 'LoginScreen_C_ShowStatusWindow::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowStatusWindow, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000038, "Member 'LoginScreen_C_ShowStatusWindow::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowStatusWindow, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'LoginScreen_C_ShowStatusWindow::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowStatusWindow, CallFunc_GetOwningPlayer_ReturnValue) == 0x000058, "Member 'LoginScreen_C_ShowStatusWindow::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowStatusWindow, CallFunc_Create_ReturnValue) == 0x000060, "Member 'LoginScreen_C_ShowStatusWindow::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowStatusWindow, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'LoginScreen_C_ShowStatusWindow::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.ShowAccountLinkingWindow
// 0x00A0 (0x00A0 - 0x0000)
struct LoginScreen_C_ShowAccountLinkingWindow final
{
public:
	bool                                          InLinkedAccountNeedsPurchase;                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   CallFunc_GetPlatformDisplayName_ReturnValue;       // 0x0018(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FText FailReason)>       K2Node_CreateDelegate_OutputDelegate4;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FText StatusText)>       K2Node_CreateDelegate_OutputDelegate6;             // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAccountLinkingWindow_C*                CallFunc_Create_ReturnValue;                       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAccountLinkingWindow_C*                K2Node_DynamicCast_AsAccount_Linking_Window;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoginScreen_C_ShowAccountLinkingWindow) == 0x000008, "Wrong alignment on LoginScreen_C_ShowAccountLinkingWindow");
static_assert(sizeof(LoginScreen_C_ShowAccountLinkingWindow) == 0x0000A0, "Wrong size on LoginScreen_C_ShowAccountLinkingWindow");
static_assert(offsetof(LoginScreen_C_ShowAccountLinkingWindow, InLinkedAccountNeedsPurchase) == 0x000000, "Member 'LoginScreen_C_ShowAccountLinkingWindow::InLinkedAccountNeedsPurchase' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowAccountLinkingWindow, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'LoginScreen_C_ShowAccountLinkingWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowAccountLinkingWindow, CallFunc_GetPlatformDisplayName_ReturnValue) == 0x000018, "Member 'LoginScreen_C_ShowAccountLinkingWindow::CallFunc_GetPlatformDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowAccountLinkingWindow, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'LoginScreen_C_ShowAccountLinkingWindow::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowAccountLinkingWindow, K2Node_CreateDelegate_OutputDelegate3) == 0x000040, "Member 'LoginScreen_C_ShowAccountLinkingWindow::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowAccountLinkingWindow, K2Node_CreateDelegate_OutputDelegate4) == 0x000050, "Member 'LoginScreen_C_ShowAccountLinkingWindow::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowAccountLinkingWindow, K2Node_CreateDelegate_OutputDelegate5) == 0x000060, "Member 'LoginScreen_C_ShowAccountLinkingWindow::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowAccountLinkingWindow, K2Node_CreateDelegate_OutputDelegate6) == 0x000070, "Member 'LoginScreen_C_ShowAccountLinkingWindow::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowAccountLinkingWindow, CallFunc_GetOwningPlayer_ReturnValue) == 0x000080, "Member 'LoginScreen_C_ShowAccountLinkingWindow::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowAccountLinkingWindow, CallFunc_Create_ReturnValue) == 0x000088, "Member 'LoginScreen_C_ShowAccountLinkingWindow::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowAccountLinkingWindow, K2Node_DynamicCast_AsAccount_Linking_Window) == 0x000090, "Member 'LoginScreen_C_ShowAccountLinkingWindow::K2Node_DynamicCast_AsAccount_Linking_Window' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowAccountLinkingWindow, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'LoginScreen_C_ShowAccountLinkingWindow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ShowAccountLinkingWindow, CallFunc_IsValid_ReturnValue) == 0x000099, "Member 'LoginScreen_C_ShowAccountLinkingWindow::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.UpdateStatusTitle
// 0x0020 (0x0020 - 0x0000)
struct LoginScreen_C_UpdateStatusTitle final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LoginScreen_C_UpdateStatusTitle) == 0x000008, "Wrong alignment on LoginScreen_C_UpdateStatusTitle");
static_assert(sizeof(LoginScreen_C_UpdateStatusTitle) == 0x000020, "Wrong size on LoginScreen_C_UpdateStatusTitle");
static_assert(offsetof(LoginScreen_C_UpdateStatusTitle, Title) == 0x000000, "Member 'LoginScreen_C_UpdateStatusTitle::Title' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_UpdateStatusTitle, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'LoginScreen_C_UpdateStatusTitle::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.ToggleLoginMenu
// 0x0005 (0x0005 - 0x0000)
struct LoginScreen_C_ToggleLoginMenu final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LoginScreen_C_ToggleLoginMenu) == 0x000001, "Wrong alignment on LoginScreen_C_ToggleLoginMenu");
static_assert(sizeof(LoginScreen_C_ToggleLoginMenu) == 0x000005, "Wrong size on LoginScreen_C_ToggleLoginMenu");
static_assert(offsetof(LoginScreen_C_ToggleLoginMenu, Temp_bool_Variable) == 0x000000, "Member 'LoginScreen_C_ToggleLoginMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ToggleLoginMenu, Temp_byte_Variable) == 0x000001, "Member 'LoginScreen_C_ToggleLoginMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ToggleLoginMenu, Temp_byte_Variable2) == 0x000002, "Member 'LoginScreen_C_ToggleLoginMenu::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ToggleLoginMenu, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'LoginScreen_C_ToggleLoginMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LoginScreen_C_ToggleLoginMenu, K2Node_Select_Default) == 0x000004, "Member 'LoginScreen_C_ToggleLoginMenu::K2Node_Select_Default' has a wrong offset!");

// Function LoginScreen.LoginScreen_C.ShowResultWindow
// 0x0070 (0x0070 - 0x0000)
struct LoginScreen_C_ShowResultWindow final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Description;                                       // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          bShowError;                                        // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bLoggedOut;                                        // 0x0031(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
