#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Commando_Head_HW01_Skeleton_AnimBP

#include "Basic.hpp"


namespace SDK::Params
{

// Function M_MED_Commando_Head_HW01_Skeleton_AnimBP.M_MED_Commando_Head_HW01_Skeleton_AnimBP_C.ExecuteUbergraph_M_MED_Commando_Head_HW01_Skeleton_AnimBP
// 0x0020 (0x0020 - 0x0000)
struct M_MED_Commando_Head_HW01_Skeleton_AnimBP_C_ExecuteUbergraph_M_MED_Commando_Head_HW01_Skeleton_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_Commando_Head_HW01_Skeleton_AnimBP_C_ExecuteUbergraph_M_MED_Commando_Head_HW01_Skeleton_AnimBP) == 0x000008, "Wrong alignment on M_MED_Commando_Head_HW01_Skeleton_AnimBP_C_ExecuteUbergraph_M_MED_Commando_Head_HW01_Skeleton_AnimBP");
static_assert(sizeof(M_MED_Commando_Head_HW01_Skeleton_AnimBP_C_ExecuteUbergraph_M_MED_Commando_Head_HW01_Skeleton_AnimBP) == 0x000020, "Wrong size on M_MED_Commando_Head_HW01_Skeleton_AnimBP_C_ExecuteUbergraph_M_MED_Commando_Head_HW01_Skeleton_AnimBP");
static_assert(offsetof(M_MED_Commando_Head_HW01_Skeleton_AnimBP_C_ExecuteUbergraph_M_MED_Commando_Head_HW01_Skeleton_AnimBP, EntryPoint) == 0x000000, "Member 'M_MED_Commando_Head_HW01_Skeleton_AnimBP_C_ExecuteUbergraph_M_MED_Commando_Head_HW01_Skeleton_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(M_MED_Commando_Head_HW01_Skeleton_AnimBP_C_ExecuteUbergraph_M_MED_Commando_Head_HW01_Skeleton_AnimBP, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'M_MED_Commando_Head_HW01_Skeleton_AnimBP_C_ExecuteUbergraph_M_MED_Commando_Head_HW01_Skeleton_AnimBP::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Commando_Head_HW01_Skeleton_AnimBP_C_ExecuteUbergraph_M_MED_Commando_Head_HW01_Skeleton_AnimBP, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000010, "Member 'M_MED_Commando_Head_HW01_Skeleton_AnimBP_C_ExecuteUbergraph_M_MED_Commando_Head_HW01_Skeleton_AnimBP::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(M_MED_Commando_Head_HW01_Skeleton_AnimBP_C_ExecuteUbergraph_M_MED_Commando_Head_HW01_Skeleton_AnimBP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'M_MED_Commando_Head_HW01_Skeleton_AnimBP_C_ExecuteUbergraph_M_MED_Commando_Head_HW01_Skeleton_AnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(M_MED_Commando_Head_HW01_Skeleton_AnimBP_C_ExecuteUbergraph_M_MED_Commando_Head_HW01_Skeleton_AnimBP, K2Node_Event_DeltaTimeX) == 0x00001C, "Member 'M_MED_Commando_Head_HW01_Skeleton_AnimBP_C_ExecuteUbergraph_M_MED_Commando_Head_HW01_Skeleton_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");

// Function M_MED_Commando_Head_HW01_Skeleton_AnimBP.M_MED_Commando_Head_HW01_Skeleton_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct M_MED_Commando_Head_HW01_Skeleton_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_Commando_Head_HW01_Skeleton_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on M_MED_Commando_Head_HW01_Skeleton_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(M_MED_Commando_Head_HW01_Skeleton_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on M_MED_Commando_Head_HW01_Skeleton_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(M_MED_Commando_Head_HW01_Skeleton_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'M_MED_Commando_Head_HW01_Skeleton_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

