#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainTabsScreen

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "StoreOfferCosts_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MainTabsScreen.MainTabsScreen_C.ExecuteUbergraph_MainTabsScreen
// 0x00A0 (0x00A0 - 0x0000)
struct MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_TabId;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_TabButton;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_RemoveTab_ReturnValue;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHomeBaseContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFortQuestItem* Quest)>  K2Node_CreateDelegate_OutputDelegate2;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         K2Node_CustomEvent_Quest;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue3;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileApp_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHomeBaseContext*                       CallFunc_GetContext_ReturnValue4;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_Event_TabNameId2;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_TabNameID;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_Event_TabButton;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen) == 0x000008, "Wrong alignment on MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen");
static_assert(sizeof(MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen) == 0x0000A0, "Wrong size on MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen");
static_assert(offsetof(MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen, EntryPoint) == 0x000000, "Member 'MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen, K2Node_ComponentBoundEvent_TabId) == 0x000008, "Member 'MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen::K2Node_ComponentBoundEvent_TabId' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen, K2Node_ComponentBoundEvent_TabButton) == 0x000010, "Member 'MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen::K2Node_ComponentBoundEvent_TabButton' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen, CallFunc_RemoveTab_ReturnValue) == 0x000028, "Member 'MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen::CallFunc_RemoveTab_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen, CallFunc_GetContext_ReturnValue2) == 0x000038, "Member 'MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen, K2Node_CreateDelegate_OutputDelegate2) == 0x000040, "Member 'MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen, CallFunc_GetQuestManager_ReturnValue) == 0x000050, "Member 'MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen, K2Node_CustomEvent_Quest) == 0x000058, "Member 'MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen::K2Node_CustomEvent_Quest' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen, CallFunc_GetContext_ReturnValue3) == 0x000060, "Member 'MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen, CallFunc_IsMobileApp_ReturnValue) == 0x000068, "Member 'MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen::CallFunc_IsMobileApp_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen, CallFunc_GetContext_ReturnValue4) == 0x000070, "Member 'MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen, K2Node_CreateDelegate_OutputDelegate3) == 0x000078, "Member 'MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen, K2Node_Event_TabNameId2) == 0x000088, "Member 'MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen::K2Node_Event_TabNameId2' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen, K2Node_Event_TabNameID) == 0x000090, "Member 'MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen::K2Node_Event_TabNameID' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen, K2Node_Event_TabButton) == 0x000098, "Member 'MainTabsScreen_C_ExecuteUbergraph_MainTabsScreen::K2Node_Event_TabButton' has a wrong offset!");

// Function MainTabsScreen.MainTabsScreen_C.HandleMainTabCreated
// 0x0010 (0x0010 - 0x0000)
struct MainTabsScreen_C_HandleMainTabCreated final
{
public:
	class FName                                   TabNameID;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainTabsScreen_C_HandleMainTabCreated) == 0x000008, "Wrong alignment on MainTabsScreen_C_HandleMainTabCreated");
static_assert(sizeof(MainTabsScreen_C_HandleMainTabCreated) == 0x000010, "Wrong size on MainTabsScreen_C_HandleMainTabCreated");
static_assert(offsetof(MainTabsScreen_C_HandleMainTabCreated, TabNameID) == 0x000000, "Member 'MainTabsScreen_C_HandleMainTabCreated::TabNameID' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_HandleMainTabCreated, TabButton) == 0x000008, "Member 'MainTabsScreen_C_HandleMainTabCreated::TabButton' has a wrong offset!");

// Function MainTabsScreen.MainTabsScreen_C.HandleMainTabSelected
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) MainTabsScreen_C_HandleMainTabSelected final
{
public:
	class FName                                   TabNameID;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainTabsScreen_C_HandleMainTabSelected) == 0x000008, "Wrong alignment on MainTabsScreen_C_HandleMainTabSelected");
static_assert(sizeof(MainTabsScreen_C_HandleMainTabSelected) == 0x000008, "Wrong size on MainTabsScreen_C_HandleMainTabSelected");
static_assert(offsetof(MainTabsScreen_C_HandleMainTabSelected, TabNameID) == 0x000000, "Member 'MainTabsScreen_C_HandleMainTabSelected::TabNameID' has a wrong offset!");

// Function MainTabsScreen.MainTabsScreen_C.OnQuestSeen_Event_0
// 0x0008 (0x0008 - 0x0000)
struct MainTabsScreen_C_OnQuestSeen_Event_0 final
{
public:
	class UFortQuestItem*                         Quest;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainTabsScreen_C_OnQuestSeen_Event_0) == 0x000008, "Wrong alignment on MainTabsScreen_C_OnQuestSeen_Event_0");
static_assert(sizeof(MainTabsScreen_C_OnQuestSeen_Event_0) == 0x000008, "Wrong size on MainTabsScreen_C_OnQuestSeen_Event_0");
static_assert(offsetof(MainTabsScreen_C_OnQuestSeen_Event_0, Quest) == 0x000000, "Member 'MainTabsScreen_C_OnQuestSeen_Event_0::Quest' has a wrong offset!");

// Function MainTabsScreen.MainTabsScreen_C.CustomEvent
// 0x0010 (0x0010 - 0x0000)
struct MainTabsScreen_C_CustomEvent final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainTabsScreen_C_CustomEvent) == 0x000008, "Wrong alignment on MainTabsScreen_C_CustomEvent");
static_assert(sizeof(MainTabsScreen_C_CustomEvent) == 0x000010, "Wrong size on MainTabsScreen_C_CustomEvent");
static_assert(offsetof(MainTabsScreen_C_CustomEvent, TabId) == 0x000000, "Member 'MainTabsScreen_C_CustomEvent::TabId' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_CustomEvent, TabButton) == 0x000008, "Member 'MainTabsScreen_C_CustomEvent::TabButton' has a wrong offset!");

// Function MainTabsScreen.MainTabsScreen_C.HandleTabCreated
// 0x0060 (0x0060 - 0x0000)
struct MainTabsScreen_C_HandleTabCreated final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          LocalTab;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LocalTabId;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMainTabIconButton_C*                   K2Node_DynamicCast_AsMain_Tab_Icon_Button;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestsCountIconTabButton_C*            K2Node_DynamicCast_AsQuests_Count_Icon_Tab_Button; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0048(0x0018)()
};
static_assert(alignof(MainTabsScreen_C_HandleTabCreated) == 0x000008, "Wrong alignment on MainTabsScreen_C_HandleTabCreated");
static_assert(sizeof(MainTabsScreen_C_HandleTabCreated) == 0x000060, "Wrong size on MainTabsScreen_C_HandleTabCreated");
static_assert(offsetof(MainTabsScreen_C_HandleTabCreated, TabId) == 0x000000, "Member 'MainTabsScreen_C_HandleTabCreated::TabId' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_HandleTabCreated, TabButton) == 0x000008, "Member 'MainTabsScreen_C_HandleTabCreated::TabButton' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_HandleTabCreated, LocalTab) == 0x000010, "Member 'MainTabsScreen_C_HandleTabCreated::LocalTab' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_HandleTabCreated, LocalTabId) == 0x000018, "Member 'MainTabsScreen_C_HandleTabCreated::LocalTabId' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_HandleTabCreated, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000020, "Member 'MainTabsScreen_C_HandleTabCreated::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_HandleTabCreated, K2Node_DynamicCast_AsMain_Tab_Icon_Button) == 0x000028, "Member 'MainTabsScreen_C_HandleTabCreated::K2Node_DynamicCast_AsMain_Tab_Icon_Button' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_HandleTabCreated, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'MainTabsScreen_C_HandleTabCreated::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_HandleTabCreated, K2Node_DynamicCast_AsQuests_Count_Icon_Tab_Button) == 0x000038, "Member 'MainTabsScreen_C_HandleTabCreated::K2Node_DynamicCast_AsQuests_Count_Icon_Tab_Button' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_HandleTabCreated, K2Node_DynamicCast_bSuccess2) == 0x000040, "Member 'MainTabsScreen_C_HandleTabCreated::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_HandleTabCreated, CallFunc_TextToUpper_ReturnValue) == 0x000048, "Member 'MainTabsScreen_C_HandleTabCreated::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

// Function MainTabsScreen.MainTabsScreen_C.HandleTabSelected
// 0x0018 (0x0018 - 0x0000)
struct MainTabsScreen_C_HandleTabSelected final
{
public:
	class FName                                   TabName;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetActiveTab_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainTabsScreen_C_HandleTabSelected) == 0x000008, "Wrong alignment on MainTabsScreen_C_HandleTabSelected");
static_assert(sizeof(MainTabsScreen_C_HandleTabSelected) == 0x000018, "Wrong size on MainTabsScreen_C_HandleTabSelected");
static_assert(offsetof(MainTabsScreen_C_HandleTabSelected, TabName) == 0x000000, "Member 'MainTabsScreen_C_HandleTabSelected::TabName' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_HandleTabSelected, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'MainTabsScreen_C_HandleTabSelected::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_HandleTabSelected, CallFunc_GetActiveTab_ReturnValue) == 0x000010, "Member 'MainTabsScreen_C_HandleTabSelected::CallFunc_GetActiveTab_ReturnValue' has a wrong offset!");

// Function MainTabsScreen.MainTabsScreen_C.Update Squad Tab Button Bang
// 0x0080 (0x0080 - 0x0000)
struct MainTabsScreen_C_Update_Squad_Tab_Button_Bang final
{
public:
	class FName                                   Tab;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentTabId;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   EmptyTabId;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ExpeditionSquadUnseen;                             // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  FortPC;                                            // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DefenderSquadUnseen;                               // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          AttributeSquadUnseen;                              // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_TotalUnseenExpeditionsForTab_ReturnValue; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreAnyHomebaseNodeItemsUnseenForSquadType_ReturnValue; // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreAnyHomebaseNodeItemsUnseenForSquadType_ReturnValue2; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalTabList_C*                   K2Node_DynamicCast_AsHorizontal_Tab_List;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          CallFunc_Get_Tab_From_Id_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMainTabIconButton_C*                   K2Node_DynamicCast_AsMain_Tab_Icon_Button;         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainTabsScreen_C_Update_Squad_Tab_Button_Bang) == 0x000008, "Wrong alignment on MainTabsScreen_C_Update_Squad_Tab_Button_Bang");
static_assert(sizeof(MainTabsScreen_C_Update_Squad_Tab_Button_Bang) == 0x000080, "Wrong size on MainTabsScreen_C_Update_Squad_Tab_Button_Bang");
static_assert(offsetof(MainTabsScreen_C_Update_Squad_Tab_Button_Bang, Tab) == 0x000000, "Member 'MainTabsScreen_C_Update_Squad_Tab_Button_Bang::Tab' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Squad_Tab_Button_Bang, CurrentTabId) == 0x000008, "Member 'MainTabsScreen_C_Update_Squad_Tab_Button_Bang::CurrentTabId' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Squad_Tab_Button_Bang, EmptyTabId) == 0x000010, "Member 'MainTabsScreen_C_Update_Squad_Tab_Button_Bang::EmptyTabId' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Squad_Tab_Button_Bang, ExpeditionSquadUnseen) == 0x000018, "Member 'MainTabsScreen_C_Update_Squad_Tab_Button_Bang::ExpeditionSquadUnseen' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Squad_Tab_Button_Bang, FortPC) == 0x000020, "Member 'MainTabsScreen_C_Update_Squad_Tab_Button_Bang::FortPC' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Squad_Tab_Button_Bang, DefenderSquadUnseen) == 0x000028, "Member 'MainTabsScreen_C_Update_Squad_Tab_Button_Bang::DefenderSquadUnseen' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Squad_Tab_Button_Bang, AttributeSquadUnseen) == 0x000029, "Member 'MainTabsScreen_C_Update_Squad_Tab_Button_Bang::AttributeSquadUnseen' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Squad_Tab_Button_Bang, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00002A, "Member 'MainTabsScreen_C_Update_Squad_Tab_Button_Bang::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Squad_Tab_Button_Bang, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x00002B, "Member 'MainTabsScreen_C_Update_Squad_Tab_Button_Bang::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Squad_Tab_Button_Bang, CallFunc_BooleanOR_ReturnValue) == 0x00002C, "Member 'MainTabsScreen_C_Update_Squad_Tab_Button_Bang::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Squad_Tab_Button_Bang, CallFunc_TotalUnseenExpeditionsForTab_ReturnValue) == 0x000030, "Member 'MainTabsScreen_C_Update_Squad_Tab_Button_Bang::CallFunc_TotalUnseenExpeditionsForTab_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Squad_Tab_Button_Bang, CallFunc_AreAnyHomebaseNodeItemsUnseenForSquadType_ReturnValue) == 0x000034, "Member 'MainTabsScreen_C_Update_Squad_Tab_Button_Bang::CallFunc_AreAnyHomebaseNodeItemsUnseenForSquadType_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Squad_Tab_Button_Bang, CallFunc_Greater_IntInt_ReturnValue) == 0x000035, "Member 'MainTabsScreen_C_Update_Squad_Tab_Button_Bang::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Squad_Tab_Button_Bang, CallFunc_GetOwningPlayer_ReturnValue) == 0x000038, "Member 'MainTabsScreen_C_Update_Squad_Tab_Button_Bang::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Squad_Tab_Button_Bang, CallFunc_AreAnyHomebaseNodeItemsUnseenForSquadType_ReturnValue2) == 0x000040, "Member 'MainTabsScreen_C_Update_Squad_Tab_Button_Bang::CallFunc_AreAnyHomebaseNodeItemsUnseenForSquadType_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Squad_Tab_Button_Bang, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000048, "Member 'MainTabsScreen_C_Update_Squad_Tab_Button_Bang::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Squad_Tab_Button_Bang, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'MainTabsScreen_C_Update_Squad_Tab_Button_Bang::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Squad_Tab_Button_Bang, CallFunc_BooleanOR_ReturnValue2) == 0x000051, "Member 'MainTabsScreen_C_Update_Squad_Tab_Button_Bang::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Squad_Tab_Button_Bang, K2Node_DynamicCast_AsHorizontal_Tab_List) == 0x000058, "Member 'MainTabsScreen_C_Update_Squad_Tab_Button_Bang::K2Node_DynamicCast_AsHorizontal_Tab_List' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Squad_Tab_Button_Bang, K2Node_DynamicCast_bSuccess2) == 0x000060, "Member 'MainTabsScreen_C_Update_Squad_Tab_Button_Bang::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Squad_Tab_Button_Bang, CallFunc_BooleanOR_ReturnValue3) == 0x000061, "Member 'MainTabsScreen_C_Update_Squad_Tab_Button_Bang::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Squad_Tab_Button_Bang, CallFunc_Get_Tab_From_Id_ReturnValue) == 0x000068, "Member 'MainTabsScreen_C_Update_Squad_Tab_Button_Bang::CallFunc_Get_Tab_From_Id_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Squad_Tab_Button_Bang, K2Node_DynamicCast_AsMain_Tab_Icon_Button) == 0x000070, "Member 'MainTabsScreen_C_Update_Squad_Tab_Button_Bang::K2Node_DynamicCast_AsMain_Tab_Icon_Button' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Squad_Tab_Button_Bang, K2Node_DynamicCast_bSuccess3) == 0x000078, "Member 'MainTabsScreen_C_Update_Squad_Tab_Button_Bang::K2Node_DynamicCast_bSuccess3' has a wrong offset!");

// Function MainTabsScreen.MainTabsScreen_C.Update Hero Tab Button Bang
// 0x0068 (0x0068 - 0x0000)
struct MainTabsScreen_C_Update_Hero_Tab_Button_Bang final
{
public:
	class FName                                   Tab;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentTabId;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  FortPC;                                            // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CombatSquadUnseen;                                 // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AreAnyHomebaseNodeItemsUnseenForSquadType_ReturnValue; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalTabList_C*                   K2Node_DynamicCast_AsHorizontal_Tab_List;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          CallFunc_Get_Tab_From_Id_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMainTabIconButton_C*                   K2Node_DynamicCast_AsMain_Tab_Icon_Button;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainTabsScreen_C_Update_Hero_Tab_Button_Bang) == 0x000008, "Wrong alignment on MainTabsScreen_C_Update_Hero_Tab_Button_Bang");
static_assert(sizeof(MainTabsScreen_C_Update_Hero_Tab_Button_Bang) == 0x000068, "Wrong size on MainTabsScreen_C_Update_Hero_Tab_Button_Bang");
static_assert(offsetof(MainTabsScreen_C_Update_Hero_Tab_Button_Bang, Tab) == 0x000000, "Member 'MainTabsScreen_C_Update_Hero_Tab_Button_Bang::Tab' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Hero_Tab_Button_Bang, CurrentTabId) == 0x000008, "Member 'MainTabsScreen_C_Update_Hero_Tab_Button_Bang::CurrentTabId' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Hero_Tab_Button_Bang, FortPC) == 0x000010, "Member 'MainTabsScreen_C_Update_Hero_Tab_Button_Bang::FortPC' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Hero_Tab_Button_Bang, CombatSquadUnseen) == 0x000018, "Member 'MainTabsScreen_C_Update_Hero_Tab_Button_Bang::CombatSquadUnseen' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Hero_Tab_Button_Bang, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000019, "Member 'MainTabsScreen_C_Update_Hero_Tab_Button_Bang::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Hero_Tab_Button_Bang, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x00001A, "Member 'MainTabsScreen_C_Update_Hero_Tab_Button_Bang::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Hero_Tab_Button_Bang, CallFunc_BooleanOR_ReturnValue) == 0x00001B, "Member 'MainTabsScreen_C_Update_Hero_Tab_Button_Bang::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Hero_Tab_Button_Bang, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'MainTabsScreen_C_Update_Hero_Tab_Button_Bang::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Hero_Tab_Button_Bang, CallFunc_AreAnyHomebaseNodeItemsUnseenForSquadType_ReturnValue) == 0x000028, "Member 'MainTabsScreen_C_Update_Hero_Tab_Button_Bang::CallFunc_AreAnyHomebaseNodeItemsUnseenForSquadType_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Hero_Tab_Button_Bang, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000030, "Member 'MainTabsScreen_C_Update_Hero_Tab_Button_Bang::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Hero_Tab_Button_Bang, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'MainTabsScreen_C_Update_Hero_Tab_Button_Bang::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Hero_Tab_Button_Bang, K2Node_DynamicCast_AsHorizontal_Tab_List) == 0x000040, "Member 'MainTabsScreen_C_Update_Hero_Tab_Button_Bang::K2Node_DynamicCast_AsHorizontal_Tab_List' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Hero_Tab_Button_Bang, K2Node_DynamicCast_bSuccess2) == 0x000048, "Member 'MainTabsScreen_C_Update_Hero_Tab_Button_Bang::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Hero_Tab_Button_Bang, CallFunc_Get_Tab_From_Id_ReturnValue) == 0x000050, "Member 'MainTabsScreen_C_Update_Hero_Tab_Button_Bang::CallFunc_Get_Tab_From_Id_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Hero_Tab_Button_Bang, K2Node_DynamicCast_AsMain_Tab_Icon_Button) == 0x000058, "Member 'MainTabsScreen_C_Update_Hero_Tab_Button_Bang::K2Node_DynamicCast_AsMain_Tab_Icon_Button' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Hero_Tab_Button_Bang, K2Node_DynamicCast_bSuccess3) == 0x000060, "Member 'MainTabsScreen_C_Update_Hero_Tab_Button_Bang::K2Node_DynamicCast_bSuccess3' has a wrong offset!");

// Function MainTabsScreen.MainTabsScreen_C.Update Tab Button Bangs
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) MainTabsScreen_C_Update_Tab_Button_Bangs final
{
public:
	class FName                                   InTab;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainTabsScreen_C_Update_Tab_Button_Bangs) == 0x000008, "Wrong alignment on MainTabsScreen_C_Update_Tab_Button_Bangs");
static_assert(sizeof(MainTabsScreen_C_Update_Tab_Button_Bangs) == 0x000008, "Wrong size on MainTabsScreen_C_Update_Tab_Button_Bangs");
static_assert(offsetof(MainTabsScreen_C_Update_Tab_Button_Bangs, InTab) == 0x000000, "Member 'MainTabsScreen_C_Update_Tab_Button_Bangs::InTab' has a wrong offset!");

// Function MainTabsScreen.MainTabsScreen_C.Update Quest Tab Button Bang
// 0x00C0 (0x00C0 - 0x0000)
struct MainTabsScreen_C_Update_Quest_Tab_Button_Bang final
{
public:
	class FName                                   Tab;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsClaimedVisibleToUsers;                           // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsVisibleToUsers;                                  // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HasNotBeenSeen;                                    // 0x000E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsMainQuest;                                       // 0x000F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortQuestManager*                      QuestManager;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentTabId;                                      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  FortPC;                                            // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          QuestsUnseen;                                      // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortAccountItem*>               CallFunc_GetAccountItemsByType_Items;              // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	class UFortAccountItem*                       CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItem*                         K2Node_DynamicCast_AsFort_Quest_Item;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasBeenSeenLocally_ReturnValue;           // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMainQuest_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisibleToUser_ReturnValue;              // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalTabList_C*                   K2Node_DynamicCast_AsHorizontal_Tab_List;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          CallFunc_Get_Tab_From_Id_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuestsCountIconTabButton_C*            K2Node_DynamicCast_AsQuests_Count_Icon_Tab_Button; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang) == 0x000008, "Wrong alignment on MainTabsScreen_C_Update_Quest_Tab_Button_Bang");
static_assert(sizeof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang) == 0x0000C0, "Wrong size on MainTabsScreen_C_Update_Quest_Tab_Button_Bang");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, Tab) == 0x000000, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::Tab' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, Count) == 0x000008, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::Count' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, IsClaimedVisibleToUsers) == 0x00000C, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::IsClaimedVisibleToUsers' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, IsVisibleToUsers) == 0x00000D, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::IsVisibleToUsers' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, HasNotBeenSeen) == 0x00000E, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::HasNotBeenSeen' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, IsMainQuest) == 0x00000F, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::IsMainQuest' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, QuestManager) == 0x000010, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::QuestManager' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, CurrentTabId) == 0x000018, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::CurrentTabId' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, FortPC) == 0x000020, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::FortPC' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, QuestsUnseen) == 0x000028, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::QuestsUnseen' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000029, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x00002A, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, CallFunc_BooleanOR_ReturnValue) == 0x000030, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, CallFunc_Add_IntInt_ReturnValue2) == 0x00003C, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, CallFunc_BooleanOR_ReturnValue2) == 0x000040, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, CallFunc_GetContext_ReturnValue) == 0x000048, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, CallFunc_BooleanAND_ReturnValue) == 0x000050, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, CallFunc_GetAccountItemsByType_Items) == 0x000058, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::CallFunc_GetAccountItemsByType_Items' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, CallFunc_Array_Get_Item) == 0x000068, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, K2Node_DynamicCast_AsFort_Quest_Item) == 0x000078, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::K2Node_DynamicCast_AsFort_Quest_Item' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, CallFunc_Less_IntInt_ReturnValue) == 0x000081, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, CallFunc_HasBeenSeenLocally_ReturnValue) == 0x000082, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::CallFunc_HasBeenSeenLocally_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, CallFunc_Not_PreBool_ReturnValue) == 0x000083, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, CallFunc_IsMainQuest_ReturnValue) == 0x000084, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::CallFunc_IsMainQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, CallFunc_IsVisibleToUser_ReturnValue) == 0x000085, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::CallFunc_IsVisibleToUser_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, CallFunc_GetContext_ReturnValue2) == 0x000088, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, CallFunc_GetQuestManager_ReturnValue) == 0x000090, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, K2Node_DynamicCast_AsHorizontal_Tab_List) == 0x000098, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::K2Node_DynamicCast_AsHorizontal_Tab_List' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, K2Node_DynamicCast_bSuccess2) == 0x0000A0, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, CallFunc_Get_Tab_From_Id_ReturnValue) == 0x0000A8, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::CallFunc_Get_Tab_From_Id_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, K2Node_DynamicCast_AsQuests_Count_Icon_Tab_Button) == 0x0000B0, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::K2Node_DynamicCast_AsQuests_Count_Icon_Tab_Button' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Quest_Tab_Button_Bang, K2Node_DynamicCast_bSuccess3) == 0x0000B8, "Member 'MainTabsScreen_C_Update_Quest_Tab_Button_Bang::K2Node_DynamicCast_bSuccess3' has a wrong offset!");

// Function MainTabsScreen.MainTabsScreen_C.Update Armory Tab Button Bang
// 0x0048 (0x0048 - 0x0000)
struct MainTabsScreen_C_Update_Armory_Tab_Button_Bang final
{
public:
	class FName                                   Tab;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InventoryUnseen;                                   // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CurrentTabId;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TransformKeyUnseen;                                // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Are_Any_Inventory_Items_Unseen_Unseen;    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Are_Any_Transform_Keys_Unseen_Unseen;     // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalTabList_C*                   K2Node_DynamicCast_AsHorizontal_Tab_List;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          CallFunc_Get_Tab_From_Id_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMainTabIconButton_C*                   K2Node_DynamicCast_AsMain_Tab_Icon_Button;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainTabsScreen_C_Update_Armory_Tab_Button_Bang) == 0x000008, "Wrong alignment on MainTabsScreen_C_Update_Armory_Tab_Button_Bang");
static_assert(sizeof(MainTabsScreen_C_Update_Armory_Tab_Button_Bang) == 0x000048, "Wrong size on MainTabsScreen_C_Update_Armory_Tab_Button_Bang");
static_assert(offsetof(MainTabsScreen_C_Update_Armory_Tab_Button_Bang, Tab) == 0x000000, "Member 'MainTabsScreen_C_Update_Armory_Tab_Button_Bang::Tab' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Armory_Tab_Button_Bang, InventoryUnseen) == 0x000008, "Member 'MainTabsScreen_C_Update_Armory_Tab_Button_Bang::InventoryUnseen' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Armory_Tab_Button_Bang, CurrentTabId) == 0x000010, "Member 'MainTabsScreen_C_Update_Armory_Tab_Button_Bang::CurrentTabId' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Armory_Tab_Button_Bang, TransformKeyUnseen) == 0x000018, "Member 'MainTabsScreen_C_Update_Armory_Tab_Button_Bang::TransformKeyUnseen' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Armory_Tab_Button_Bang, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000019, "Member 'MainTabsScreen_C_Update_Armory_Tab_Button_Bang::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Armory_Tab_Button_Bang, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x00001A, "Member 'MainTabsScreen_C_Update_Armory_Tab_Button_Bang::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainTabsScreen_C_Update_Armory_Tab_Button_Bang, CallFunc_BooleanOR_ReturnValue) == 0x00001B, "Member 'MainTabsScreen_C_Update_Armory_Tab_Button_Bang::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
