#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "Party_structs.hpp"


namespace SDK::Params
{

// Function MainMenu.MainMenu_C.ExecuteUbergraph_MainMenu
// 0x0418 (0x0418 - 0x0000)
struct MainMenu_C_ExecuteUbergraph_MainMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButton* Button)>  K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue3;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue4;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue5;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputManager*                    CallFunc_GetInputManager_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue6;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue7;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetUITestingClass_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputManager*                    CallFunc_GetInputManager_ReturnValue2;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue8;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue9;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue10;                 // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue11;                 // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue12;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue13;                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCommonButton* Button)>  K2Node_CreateDelegate_OutputDelegate2;             // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCommonButton* Button)>  K2Node_CreateDelegate_OutputDelegate3;             // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue14;                 // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetAthenaCodeOfConductURL_ReturnValue;    // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShowWebURL_ReturnValue;                   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue15;                 // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button49;               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button48;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button47;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button46;               // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button45;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button44;               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0150(0x0018)()
	EFortDialogResult                             Temp_byte_Variable3;                               // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button43;               // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button42;               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button41;               // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button40;               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button39;               // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button38;               // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button37;               // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button36;               // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_CustomEvent_Button4;                        // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      CallFunc_GetButton_Leave;                          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_CustomEvent_Button3;                        // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      CallFunc_GetButton_Leave2;                         // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button35;               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button34;               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      CallFunc_GetButton_Leave3;                         // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button33;               // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button32;               // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button31;               // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue16;                 // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             K2Node_CustomEvent_Result;                         // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName;                     // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0220(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button30;               // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue2; // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button29;               // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button28;               // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button27;               // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue2;          // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button26;               // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetCachedWidget_ReturnValue;              // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue3;          // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button25;               // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button24;               // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button23;               // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button22;               // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button21;               // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue4;          // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button20;               // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue5;          // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button19;               // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable4;                               // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable2;                               // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue17;                 // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputManager*                    CallFunc_GetInputManager_ReturnValue3;             // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBoostsRoot_C*                          CallFunc_Create_ReturnValue;                       // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             K2Node_CustomEvent_Result2;                        // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName2;                    // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate5;             // 0x0310(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button18;               // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button17;               // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button16;               // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue18;                 // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortUIFeature ChangedFeature, EFortUIFeatureState NewState, EFortUIFeatureStateReason StateReason)> K2Node_CreateDelegate_OutputDelegate6;             // 0x0340(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsInZone_ReturnValue2;                    // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button15;               // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button14;               // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button13;               // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button12;               // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button11;               // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button10;               // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button9;                // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button8;                // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button7;                // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetEmptyText_ReturnValue2;                // 0x03A0(0x0018)()
	TDelegate<void(class UCommonButton* Button)>  K2Node_CreateDelegate_OutputDelegate7;             // 0x03B8(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button6;                // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button5;                // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_CustomEvent_Button2;                        // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_CustomEvent_Button;                         // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Visibility;             // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x03F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F2[0x6];                                      // 0x03F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button4;                // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button3;                // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_C_ExecuteUbergraph_MainMenu) == 0x000008, "Wrong alignment on MainMenu_C_ExecuteUbergraph_MainMenu");
static_assert(sizeof(MainMenu_C_ExecuteUbergraph_MainMenu) == 0x000418, "Wrong size on MainMenu_C_ExecuteUbergraph_MainMenu");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, EntryPoint) == 0x000000, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetContext_ReturnValue2) == 0x000020, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetContext_ReturnValue3) == 0x000028, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetContext_ReturnValue4) == 0x000030, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetContext_ReturnValue5) == 0x000038, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetInputManager_ReturnValue) == 0x000040, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetContext_ReturnValue6) == 0x000048, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetContext_ReturnValue6' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetContext_ReturnValue7) == 0x000050, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetContext_ReturnValue7' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetUITestingClass_ReturnValue) == 0x000058, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetUITestingClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetInputManager_ReturnValue2) == 0x000060, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetInputManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_IsValidClass_ReturnValue) == 0x000068, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetContext_ReturnValue8) == 0x000070, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetContext_ReturnValue8' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetContext_ReturnValue9) == 0x000078, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetContext_ReturnValue9' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetContext_ReturnValue10) == 0x000080, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetContext_ReturnValue10' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_IsInZone_ReturnValue) == 0x000088, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetContext_ReturnValue11) == 0x000090, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetContext_ReturnValue11' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetContext_ReturnValue12) == 0x000098, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetContext_ReturnValue12' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetContext_ReturnValue13) == 0x0000A0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetContext_ReturnValue13' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_IsUsingGamepad_ReturnValue) == 0x0000A8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_CreateDelegate_OutputDelegate2) == 0x0000B0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, Temp_bool_Variable) == 0x0000C0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_CreateDelegate_OutputDelegate3) == 0x0000C8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, Temp_byte_Variable) == 0x0000D8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, Temp_byte_Variable2) == 0x0000D9, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetContext_ReturnValue14) == 0x0000E0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetContext_ReturnValue14' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetAthenaCodeOfConductURL_ReturnValue) == 0x0000E8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetAthenaCodeOfConductURL_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_ShowWebURL_ReturnValue) == 0x0000F8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_ShowWebURL_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetContext_ReturnValue15) == 0x000100, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetContext_ReturnValue15' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue) == 0x000108, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button49) == 0x000110, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button49' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_IsValid_ReturnValue) == 0x000118, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000120, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button48) == 0x000128, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button48' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button47) == 0x000130, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button47' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button46) == 0x000138, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button46' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button45) == 0x000140, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button45' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button44) == 0x000148, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button44' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetEmptyText_ReturnValue) == 0x000150, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, Temp_byte_Variable3) == 0x000168, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_SwitchEnum_CmpSuccess) == 0x000169, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button43) == 0x000170, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button43' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button42) == 0x000178, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button42' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button41) == 0x000180, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button41' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button40) == 0x000188, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button40' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button39) == 0x000190, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button39' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button38) == 0x000198, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button38' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button37) == 0x0001A0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button37' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button36) == 0x0001A8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button36' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_CustomEvent_Button4) == 0x0001B0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_CustomEvent_Button4' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetButton_Leave) == 0x0001B8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetButton_Leave' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_CustomEvent_Button3) == 0x0001C0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_CustomEvent_Button3' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetButton_Leave2) == 0x0001C8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetButton_Leave2' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button35) == 0x0001D0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button35' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, Temp_name_Variable) == 0x0001D8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button34) == 0x0001E0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button34' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetButton_Leave3) == 0x0001E8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetButton_Leave3' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button33) == 0x0001F0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button33' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button32) == 0x0001F8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button32' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button31) == 0x000200, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button31' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetContext_ReturnValue16) == 0x000208, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetContext_ReturnValue16' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_CustomEvent_Result) == 0x000210, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_CustomEvent_ResultName) == 0x000218, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_CustomEvent_ResultName' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_CreateDelegate_OutputDelegate4) == 0x000220, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button30) == 0x000230, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button30' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue2) == 0x000238, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_IsValid_ReturnValue2) == 0x000240, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button29) == 0x000248, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button29' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button28) == 0x000250, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button28' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button27) == 0x000258, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button27' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetUIManagerWidget_ReturnValue2) == 0x000260, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetUIManagerWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button26) == 0x000268, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button26' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetCachedWidget_ReturnValue) == 0x000270, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetCachedWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetUIManagerWidget_ReturnValue3) == 0x000278, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetUIManagerWidget_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button25) == 0x000280, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button25' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button24) == 0x000288, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button24' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button23) == 0x000290, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button23' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button22) == 0x000298, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button22' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button21) == 0x0002A0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button21' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetUIManagerWidget_ReturnValue4) == 0x0002A8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetUIManagerWidget_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button20) == 0x0002B0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button20' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetUIManagerWidget_ReturnValue5) == 0x0002B8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetUIManagerWidget_ReturnValue5' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button19) == 0x0002C0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button19' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, Temp_byte_Variable4) == 0x0002C8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, Temp_name_Variable2) == 0x0002D0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_SwitchEnum2_CmpSuccess) == 0x0002D8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetContext_ReturnValue17) == 0x0002E0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetContext_ReturnValue17' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetOwningPlayer_ReturnValue) == 0x0002E8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetInputManager_ReturnValue3) == 0x0002F0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetInputManager_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_Create_ReturnValue) == 0x0002F8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_CustomEvent_Result2) == 0x000300, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_CustomEvent_Result2' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_CustomEvent_ResultName2) == 0x000308, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_CustomEvent_ResultName2' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_CreateDelegate_OutputDelegate5) == 0x000310, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button18) == 0x000320, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button18' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button17) == 0x000328, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button17' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button16) == 0x000330, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button16' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetContext_ReturnValue18) == 0x000338, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetContext_ReturnValue18' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_CreateDelegate_OutputDelegate6) == 0x000340, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_IsInZone_ReturnValue2) == 0x000350, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_IsInZone_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button15) == 0x000358, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button15' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button14) == 0x000360, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button14' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button13) == 0x000368, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button13' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button12) == 0x000370, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button12' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button11) == 0x000378, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button11' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button10) == 0x000380, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button10' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button9) == 0x000388, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button9' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button8) == 0x000390, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button8' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button7) == 0x000398, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button7' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetEmptyText_ReturnValue2) == 0x0003A0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetEmptyText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_CreateDelegate_OutputDelegate7) == 0x0003B8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button6) == 0x0003C8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button6' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button5) == 0x0003D0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button5' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_CustomEvent_Button2) == 0x0003D8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_CustomEvent_Button2' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_CustomEvent_Button) == 0x0003E0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, CallFunc_GetUINavigationManager_ReturnValue) == 0x0003E8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Visibility) == 0x0003F0, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Visibility' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_Select_Default) == 0x0003F1, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button4) == 0x0003F8, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button4' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button3) == 0x000400, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button2) == 0x000408, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(MainMenu_C_ExecuteUbergraph_MainMenu, K2Node_ComponentBoundEvent_Button) == 0x000410, "Member 'MainMenu_C_ExecuteUbergraph_MainMenu::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function MainMenu.MainMenu_C.BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_321_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MainMenu_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_321_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_321_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on MainMenu_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_321_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(MainMenu_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_321_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on MainMenu_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_321_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(MainMenu_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_321_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'MainMenu_C_BndEvt__IconTextButton_C_0_K2Node_ComponentBoundEvent_321_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function MainMenu.MainMenu_C.BndEvt__AthenaPartyPrivacyButton_K2Node_ComponentBoundEvent_600_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MainMenu_C_BndEvt__AthenaPartyPrivacyButton_K2Node_ComponentBoundEvent_600_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_C_BndEvt__AthenaPartyPrivacyButton_K2Node_ComponentBoundEvent_600_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on MainMenu_C_BndEvt__AthenaPartyPrivacyButton_K2Node_ComponentBoundEvent_600_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(MainMenu_C_BndEvt__AthenaPartyPrivacyButton_K2Node_ComponentBoundEvent_600_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on MainMenu_C_BndEvt__AthenaPartyPrivacyButton_K2Node_ComponentBoundEvent_600_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(MainMenu_C_BndEvt__AthenaPartyPrivacyButton_K2Node_ComponentBoundEvent_600_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'MainMenu_C_BndEvt__AthenaPartyPrivacyButton_K2Node_ComponentBoundEvent_600_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function MainMenu.MainMenu_C.BndEvt__AthenaPartyPrivacyButton_K2Node_ComponentBoundEvent_543_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MainMenu_C_BndEvt__AthenaPartyPrivacyButton_K2Node_ComponentBoundEvent_543_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_C_BndEvt__AthenaPartyPrivacyButton_K2Node_ComponentBoundEvent_543_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on MainMenu_C_BndEvt__AthenaPartyPrivacyButton_K2Node_ComponentBoundEvent_543_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(MainMenu_C_BndEvt__AthenaPartyPrivacyButton_K2Node_ComponentBoundEvent_543_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on MainMenu_C_BndEvt__AthenaPartyPrivacyButton_K2Node_ComponentBoundEvent_543_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(MainMenu_C_BndEvt__AthenaPartyPrivacyButton_K2Node_ComponentBoundEvent_543_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'MainMenu_C_BndEvt__AthenaPartyPrivacyButton_K2Node_ComponentBoundEvent_543_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function MainMenu.MainMenu_C.BndEvt__AthenaPartyPrivacyButton_K2Node_ComponentBoundEvent_481_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct MainMenu_C_BndEvt__AthenaPartyPrivacyButton_K2Node_ComponentBoundEvent_481_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_C_BndEvt__AthenaPartyPrivacyButton_K2Node_ComponentBoundEvent_481_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on MainMenu_C_BndEvt__AthenaPartyPrivacyButton_K2Node_ComponentBoundEvent_481_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(MainMenu_C_BndEvt__AthenaPartyPrivacyButton_K2Node_ComponentBoundEvent_481_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on MainMenu_C_BndEvt__AthenaPartyPrivacyButton_K2Node_ComponentBoundEvent_481_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(MainMenu_C_BndEvt__AthenaPartyPrivacyButton_K2Node_ComponentBoundEvent_481_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'MainMenu_C_BndEvt__AthenaPartyPrivacyButton_K2Node_ComponentBoundEvent_481_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function MainMenu.MainMenu_C.BndEvt__LeaveButton_K2Node_ComponentBoundEvent_144_Update Visibility__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct MainMenu_C_BndEvt__LeaveButton_K2Node_ComponentBoundEvent_144_Update_Visibility__DelegateSignature final
{
public:
	bool                                          Param_Visibility;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainMenu_C_BndEvt__LeaveButton_K2Node_ComponentBoundEvent_144_Update_Visibility__DelegateSignature) == 0x000001, "Wrong alignment on MainMenu_C_BndEvt__LeaveButton_K2Node_ComponentBoundEvent_144_Update_Visibility__DelegateSignature");
static_assert(sizeof(MainMenu_C_BndEvt__LeaveButton_K2Node_ComponentBoundEvent_144_Update_Visibility__DelegateSignature) == 0x000001, "Wrong size on MainMenu_C_BndEvt__LeaveButton_K2Node_ComponentBoundEvent_144_Update_Visibility__DelegateSignature");
static_assert(offsetof(MainMenu_C_BndEvt__LeaveButton_K2Node_ComponentBoundEvent_144_Update_Visibility__DelegateSignature, Param_Visibility) == 0x000000, "Member 'MainMenu_C_BndEvt__LeaveButton_K2Node_ComponentBoundEvent_144_Update_Visibility__DelegateSignature::Param_Visibility' has a wrong offset!");

// Function MainMenu.MainMenu_C.Handle Game Mode Hovered
// 0x0008 (0x0008 - 0x0000)
struct MainMenu_C_Handle_Game_Mode_Hovered final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_C_Handle_Game_Mode_Hovered) == 0x000008, "Wrong alignment on MainMenu_C_Handle_Game_Mode_Hovered");
static_assert(sizeof(MainMenu_C_Handle_Game_Mode_Hovered) == 0x000008, "Wrong size on MainMenu_C_Handle_Game_Mode_Hovered");
static_assert(offsetof(MainMenu_C_Handle_Game_Mode_Hovered, Button) == 0x000000, "Member 'MainMenu_C_Handle_Game_Mode_Hovered::Button' has a wrong offset!");

// Function MainMenu.MainMenu_C.Handle Game Mode Unhovered
// 0x0008 (0x0008 - 0x0000)
struct MainMenu_C_Handle_Game_Mode_Unhovered final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_C_Handle_Game_Mode_Unhovered) == 0x000008, "Wrong alignment on MainMenu_C_Handle_Game_Mode_Unhovered");
static_assert(sizeof(MainMenu_C_Handle_Game_Mode_Unhovered) == 0x000008, "Wrong size on MainMenu_C_Handle_Game_Mode_Unhovered");
static_assert(offsetof(MainMenu_C_Handle_Game_Mode_Unhovered, Button) == 0x000000, "Member 'MainMenu_C_Handle_Game_Mode_Unhovered::Button' has a wrong offset!");

// Function MainMenu.MainMenu_C.BndEvt__ButtonCredits_K2Node_ComponentBoundEvent_186_CommonButtonClicked__DelegateSignature
