#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MessageCenterWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MessageCenterWidget.MessageCenterWidget_C
// 0x0038 (0x0428 - 0x03F0)
class UMessageCenterWidget_C final : public UFortUIMessagesPageBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(Transient, DuplicateTransient)
	class UIconTextButton_C*                      ClearButton;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CloseButton;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DescriptionText;                                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      OpenButton;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_2;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MessageCenterWidget(int32 EntryPoint);
	void BndEvt__ClearButton_K2Node_ComponentBoundEvent_62_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__OpenButton_K2Node_ComponentBoundEvent_46_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__MessagesList_K2Node_ComponentBoundEvent_303_OnListViewItemSelected__DelegateSignature(class UObject* Item, bool bIsSelected);
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_41_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void HandleOutroEnded();
	void HandleIntroEnded();
	void OnBeginOutro();
	void OnBeginIntro();
	void Construct();
	void HandleMessageSelected(class UObject* Item, bool Selected);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MessageCenterWidget_C">();
	}
	static class UMessageCenterWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMessageCenterWidget_C>();
	}
};
static_assert(alignof(UMessageCenterWidget_C) == 0x000008, "Wrong alignment on UMessageCenterWidget_C");
static_assert(sizeof(UMessageCenterWidget_C) == 0x000428, "Wrong size on UMessageCenterWidget_C");
static_assert(offsetof(UMessageCenterWidget_C, UberGraphFrame) == 0x0003F0, "Member 'UMessageCenterWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMessageCenterWidget_C, ClearButton) == 0x0003F8, "Member 'UMessageCenterWidget_C::ClearButton' has a wrong offset!");
static_assert(offsetof(UMessageCenterWidget_C, CloseButton) == 0x000400, "Member 'UMessageCenterWidget_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UMessageCenterWidget_C, DescriptionText) == 0x000408, "Member 'UMessageCenterWidget_C::DescriptionText' has a wrong offset!");
static_assert(offsetof(UMessageCenterWidget_C, Lightbox) == 0x000410, "Member 'UMessageCenterWidget_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UMessageCenterWidget_C, OpenButton) == 0x000418, "Member 'UMessageCenterWidget_C::OpenButton' has a wrong offset!");
static_assert(offsetof(UMessageCenterWidget_C, SafeZone_2) == 0x000420, "Member 'UMessageCenterWidget_C::SafeZone_2' has a wrong offset!");

}

