#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MessageCenterListItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MessageCenterListItem.MessageCenterListItem_C
// 0x0030 (0x0240 - 0x0210)
class UMessageCenterListItem_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UCommonTextBlock*                       Description;                                       // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Selection;                                         // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortUINotification*                    MESSAGE;                                           // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MessageCenterListItem(int32 EntryPoint);
	void SetSelected(bool bSelected);
	void Construct();
	void SetData(class UObject* InData, class UCommonListView* OwningList);
	void Reset();
	void ToggleExpansion();
	void SetIndexInList(int32 InIndexInList);
	void SetExpanded(bool bExpanded);
	void RegisterOnClicked(const TDelegate<void(class UUserWidget* Widget)>& Callback);
	void Private_OnExpanderArrowShiftClicked();
	void OnReleaseToPool();
	void OnAcquireFromPool();
	void SetMessage(class UFortUINotification* Param_MESSAGE);
	void ShowText(const class FText& Text, class UCommonTextBlock* TextBlock);

	class UObject* GetData() const;
	bool IsItemExpanded() const;
	int32 DoesItemHaveChildren() const;
	int32 GetIndentLevel() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MessageCenterListItem_C">();
	}
	static class UMessageCenterListItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMessageCenterListItem_C>();
	}
};
static_assert(alignof(UMessageCenterListItem_C) == 0x000008, "Wrong alignment on UMessageCenterListItem_C");
static_assert(sizeof(UMessageCenterListItem_C) == 0x000240, "Wrong size on UMessageCenterListItem_C");
static_assert(offsetof(UMessageCenterListItem_C, UberGraphFrame) == 0x000210, "Member 'UMessageCenterListItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMessageCenterListItem_C, Description) == 0x000218, "Member 'UMessageCenterListItem_C::Description' has a wrong offset!");
static_assert(offsetof(UMessageCenterListItem_C, Image) == 0x000220, "Member 'UMessageCenterListItem_C::Image' has a wrong offset!");
static_assert(offsetof(UMessageCenterListItem_C, Selection) == 0x000228, "Member 'UMessageCenterListItem_C::Selection' has a wrong offset!");
static_assert(offsetof(UMessageCenterListItem_C, Title) == 0x000230, "Member 'UMessageCenterListItem_C::Title' has a wrong offset!");
static_assert(offsetof(UMessageCenterListItem_C, MESSAGE) == 0x000238, "Member 'UMessageCenterListItem_C::MESSAGE' has a wrong offset!");

}

