#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MiniItemCraftingIngredientsDetailWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function MiniItemCraftingIngredientsDetailWidget.MiniItemCraftingIngredientsDetailWidget_C.ExecuteUbergraph_MiniItemCraftingIngredientsDetailWidget
// 0x0028 (0x0028 - 0x0000)
struct MiniItemCraftingIngredientsDetailWidget_C_ExecuteUbergraph_MiniItemCraftingIngredientsDetailWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFortItemQuantityPair>          CallFunc_GetRecipeItemQuantityPairs_Pairs;         // 0x0008(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FFortItemQuantityPair>          CallFunc_GetRecipeItemQuantityPairs_Pairs2;        // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(MiniItemCraftingIngredientsDetailWidget_C_ExecuteUbergraph_MiniItemCraftingIngredientsDetailWidget) == 0x000008, "Wrong alignment on MiniItemCraftingIngredientsDetailWidget_C_ExecuteUbergraph_MiniItemCraftingIngredientsDetailWidget");
static_assert(sizeof(MiniItemCraftingIngredientsDetailWidget_C_ExecuteUbergraph_MiniItemCraftingIngredientsDetailWidget) == 0x000028, "Wrong size on MiniItemCraftingIngredientsDetailWidget_C_ExecuteUbergraph_MiniItemCraftingIngredientsDetailWidget");
static_assert(offsetof(MiniItemCraftingIngredientsDetailWidget_C_ExecuteUbergraph_MiniItemCraftingIngredientsDetailWidget, EntryPoint) == 0x000000, "Member 'MiniItemCraftingIngredientsDetailWidget_C_ExecuteUbergraph_MiniItemCraftingIngredientsDetailWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(MiniItemCraftingIngredientsDetailWidget_C_ExecuteUbergraph_MiniItemCraftingIngredientsDetailWidget, CallFunc_GetRecipeItemQuantityPairs_Pairs) == 0x000008, "Member 'MiniItemCraftingIngredientsDetailWidget_C_ExecuteUbergraph_MiniItemCraftingIngredientsDetailWidget::CallFunc_GetRecipeItemQuantityPairs_Pairs' has a wrong offset!");
static_assert(offsetof(MiniItemCraftingIngredientsDetailWidget_C_ExecuteUbergraph_MiniItemCraftingIngredientsDetailWidget, CallFunc_GetRecipeItemQuantityPairs_Pairs2) == 0x000018, "Member 'MiniItemCraftingIngredientsDetailWidget_C_ExecuteUbergraph_MiniItemCraftingIngredientsDetailWidget::CallFunc_GetRecipeItemQuantityPairs_Pairs2' has a wrong offset!");

// Function MiniItemCraftingIngredientsDetailWidget.MiniItemCraftingIngredientsDetailWidget_C.GetRecipeItemQuantityPairs
// 0x0120 (0x0120 - 0x0000)
struct MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs final
{
public:
	class UFortItem*                              Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFortItemQuantityPair>          Pairs;                                             // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor)
	TArray<struct FFortItemQuantityPair>          Results;                                           // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSchematicItem*                     K2Node_DynamicCast_AsFort_Schematic_Item;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRecipe                                CallFunc_GetSchematicRecipe_ReturnValue;           // 0x0040(0x0058)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortItemQuantityPair                  CallFunc_Array_Get_Item;                           // 0x00A8(0x0030)()
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemFromItemQuantityPair_ReturnValue;  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortItemQuantityPair                  CallFunc_MakeItemQuantityPair_ReturnValue;         // 0x00E8(0x0030)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs) == 0x000008, "Wrong alignment on MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs");
static_assert(sizeof(MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs) == 0x000120, "Wrong size on MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs");
static_assert(offsetof(MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs, Item) == 0x000000, "Member 'MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs::Item' has a wrong offset!");
static_assert(offsetof(MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs, Pairs) == 0x000008, "Member 'MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs::Pairs' has a wrong offset!");
static_assert(offsetof(MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs, Results) == 0x000018, "Member 'MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs::Results' has a wrong offset!");
static_assert(offsetof(MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs, K2Node_DynamicCast_AsFort_Schematic_Item) == 0x000030, "Member 'MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs::K2Node_DynamicCast_AsFort_Schematic_Item' has a wrong offset!");
static_assert(offsetof(MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs, CallFunc_GetSchematicRecipe_ReturnValue) == 0x000040, "Member 'MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs::CallFunc_GetSchematicRecipe_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs, Temp_int_Array_Index_Variable) == 0x00009C, "Member 'MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs, CallFunc_GetContext_ReturnValue) == 0x0000D8, "Member 'MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs, CallFunc_GetItemFromItemQuantityPair_ReturnValue) == 0x0000E0, "Member 'MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs::CallFunc_GetItemFromItemQuantityPair_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs, CallFunc_MakeItemQuantityPair_ReturnValue) == 0x0000E8, "Member 'MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs::CallFunc_MakeItemQuantityPair_ReturnValue' has a wrong offset!");
static_assert(offsetof(MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs, CallFunc_Array_Add_ReturnValue) == 0x000118, "Member 'MiniItemCraftingIngredientsDetailWidget_C_GetRecipeItemQuantityPairs::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

