#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MiscellaneousModeItemDetailsHostPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MiscellaneousModeItemDetailsHostPanel.MiscellaneousModeItemDetailsHostPanel_C
// 0x0038 (0x02C8 - 0x0290)
class UMiscellaneousModeItemDetailsHostPanel_C final : public UFortItemManagementItemDetailsPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(Transient, DuplicateTransient)
	class UItemDetailsHeader_C*                   HeaderWidget;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHeroSquadBonusesDetailWidget_C*        HeroSquadBonusesDetailWidget;                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemCraftingIngredientsDetailWidget_C* ItemCraftingIngredientsDetailWidget;               // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MarkedForMulchingBackgroundImage;                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeImage*                    MarkedForMulchingIndicatorImage;                   // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USurvivorTraitsDetailWidget_C*          SurvivorTraitsDetailWidget;                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MiscellaneousModeItemDetailsHostPanel(int32 EntryPoint);
	void HandleHasItemMarkedForMulchingChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MiscellaneousModeItemDetailsHostPanel_C">();
	}
	static class UMiscellaneousModeItemDetailsHostPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMiscellaneousModeItemDetailsHostPanel_C>();
	}
};
static_assert(alignof(UMiscellaneousModeItemDetailsHostPanel_C) == 0x000008, "Wrong alignment on UMiscellaneousModeItemDetailsHostPanel_C");
static_assert(sizeof(UMiscellaneousModeItemDetailsHostPanel_C) == 0x0002C8, "Wrong size on UMiscellaneousModeItemDetailsHostPanel_C");
static_assert(offsetof(UMiscellaneousModeItemDetailsHostPanel_C, UberGraphFrame) == 0x000290, "Member 'UMiscellaneousModeItemDetailsHostPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMiscellaneousModeItemDetailsHostPanel_C, HeaderWidget) == 0x000298, "Member 'UMiscellaneousModeItemDetailsHostPanel_C::HeaderWidget' has a wrong offset!");
static_assert(offsetof(UMiscellaneousModeItemDetailsHostPanel_C, HeroSquadBonusesDetailWidget) == 0x0002A0, "Member 'UMiscellaneousModeItemDetailsHostPanel_C::HeroSquadBonusesDetailWidget' has a wrong offset!");
static_assert(offsetof(UMiscellaneousModeItemDetailsHostPanel_C, ItemCraftingIngredientsDetailWidget) == 0x0002A8, "Member 'UMiscellaneousModeItemDetailsHostPanel_C::ItemCraftingIngredientsDetailWidget' has a wrong offset!");
static_assert(offsetof(UMiscellaneousModeItemDetailsHostPanel_C, MarkedForMulchingBackgroundImage) == 0x0002B0, "Member 'UMiscellaneousModeItemDetailsHostPanel_C::MarkedForMulchingBackgroundImage' has a wrong offset!");
static_assert(offsetof(UMiscellaneousModeItemDetailsHostPanel_C, MarkedForMulchingIndicatorImage) == 0x0002B8, "Member 'UMiscellaneousModeItemDetailsHostPanel_C::MarkedForMulchingIndicatorImage' has a wrong offset!");
static_assert(offsetof(UMiscellaneousModeItemDetailsHostPanel_C, SurvivorTraitsDetailWidget) == 0x0002C0, "Member 'UMiscellaneousModeItemDetailsHostPanel_C::SurvivorTraitsDetailWidget' has a wrong offset!");

}

