#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissionObjectiveProgress

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function MissionObjectiveProgress.MissionObjectiveProgress_C.Update
// 0x0040 (0x0040 - 0x0000)
struct MissionObjectiveProgress_C_Update final
{
public:
	class AFortObjectiveBase*                     Objective;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BarIndex;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_BlueprintGetProgressBarColor_ReturnValue; // 0x000C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BlueprintGetProgressBarPercentage_ReturnValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_BlueprintGetProgressBarText_ReturnValue;  // 0x0020(0x0018)()
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionObjectiveProgress_C_Update) == 0x000008, "Wrong alignment on MissionObjectiveProgress_C_Update");
static_assert(sizeof(MissionObjectiveProgress_C_Update) == 0x000040, "Wrong size on MissionObjectiveProgress_C_Update");
static_assert(offsetof(MissionObjectiveProgress_C_Update, Objective) == 0x000000, "Member 'MissionObjectiveProgress_C_Update::Objective' has a wrong offset!");
static_assert(offsetof(MissionObjectiveProgress_C_Update, BarIndex) == 0x000008, "Member 'MissionObjectiveProgress_C_Update::BarIndex' has a wrong offset!");
static_assert(offsetof(MissionObjectiveProgress_C_Update, CallFunc_BlueprintGetProgressBarColor_ReturnValue) == 0x00000C, "Member 'MissionObjectiveProgress_C_Update::CallFunc_BlueprintGetProgressBarColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionObjectiveProgress_C_Update, CallFunc_BlueprintGetProgressBarPercentage_ReturnValue) == 0x00001C, "Member 'MissionObjectiveProgress_C_Update::CallFunc_BlueprintGetProgressBarPercentage_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionObjectiveProgress_C_Update, CallFunc_BlueprintGetProgressBarText_ReturnValue) == 0x000020, "Member 'MissionObjectiveProgress_C_Update::CallFunc_BlueprintGetProgressBarText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionObjectiveProgress_C_Update, Temp_byte_Variable) == 0x000038, "Member 'MissionObjectiveProgress_C_Update::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MissionObjectiveProgress_C_Update, CallFunc_TextIsEmpty_ReturnValue) == 0x000039, "Member 'MissionObjectiveProgress_C_Update::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionObjectiveProgress_C_Update, Temp_byte_Variable2) == 0x00003A, "Member 'MissionObjectiveProgress_C_Update::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(MissionObjectiveProgress_C_Update, Temp_bool_Variable) == 0x00003B, "Member 'MissionObjectiveProgress_C_Update::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MissionObjectiveProgress_C_Update, K2Node_Select_Default) == 0x00003C, "Member 'MissionObjectiveProgress_C_Update::K2Node_Select_Default' has a wrong offset!");

// Function MissionObjectiveProgress.MissionObjectiveProgress_C.GetHeightEstimate
// 0x0030 (0x0030 - 0x0000)
struct MissionObjectiveProgress_C_GetHeightEstimate final
{
public:
	float                                         Height;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HeightEstimate;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0010(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MissionObjectiveProgress_C_GetHeightEstimate) == 0x000008, "Wrong alignment on MissionObjectiveProgress_C_GetHeightEstimate");
static_assert(sizeof(MissionObjectiveProgress_C_GetHeightEstimate) == 0x000030, "Wrong size on MissionObjectiveProgress_C_GetHeightEstimate");
static_assert(offsetof(MissionObjectiveProgress_C_GetHeightEstimate, Height) == 0x000000, "Member 'MissionObjectiveProgress_C_GetHeightEstimate::Height' has a wrong offset!");
static_assert(offsetof(MissionObjectiveProgress_C_GetHeightEstimate, HeightEstimate) == 0x000004, "Member 'MissionObjectiveProgress_C_GetHeightEstimate::HeightEstimate' has a wrong offset!");
static_assert(offsetof(MissionObjectiveProgress_C_GetHeightEstimate, CallFunc_Add_FloatFloat_ReturnValue) == 0x000008, "Member 'MissionObjectiveProgress_C_GetHeightEstimate::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionObjectiveProgress_C_GetHeightEstimate, CallFunc_Add_FloatFloat_ReturnValue2) == 0x00000C, "Member 'MissionObjectiveProgress_C_GetHeightEstimate::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MissionObjectiveProgress_C_GetHeightEstimate, CallFunc_GetText_ReturnValue) == 0x000010, "Member 'MissionObjectiveProgress_C_GetHeightEstimate::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MissionObjectiveProgress_C_GetHeightEstimate, CallFunc_TextIsEmpty_ReturnValue) == 0x000028, "Member 'MissionObjectiveProgress_C_GetHeightEstimate::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");

}

