#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MissionObjectiveWidgetProviderInterface

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function MissionObjectiveWidgetProviderInterface.MissionObjectiveWidgetProviderInterface_C.GetObjectiveContentWidgetClass
// 0x0008 (0x0008 - 0x0000)
struct MissionObjectiveWidgetProviderInterface_C_GetObjectiveContentWidgetClass final
{
public:
	class UClass*                                 Objective_WIdget_Class;                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MissionObjectiveWidgetProviderInterface_C_GetObjectiveContentWidgetClass) == 0x000008, "Wrong alignment on MissionObjectiveWidgetProviderInterface_C_GetObjectiveContentWidgetClass");
static_assert(sizeof(MissionObjectiveWidgetProviderInterface_C_GetObjectiveContentWidgetClass) == 0x000008, "Wrong size on MissionObjectiveWidgetProviderInterface_C_GetObjectiveContentWidgetClass");
static_assert(offsetof(MissionObjectiveWidgetProviderInterface_C_GetObjectiveContentWidgetClass, Objective_WIdget_Class) == 0x000000, "Member 'MissionObjectiveWidgetProviderInterface_C_GetObjectiveContentWidgetClass::Objective_WIdget_Class' has a wrong offset!");

// Function MissionObjectiveWidgetProviderInterface.MissionObjectiveWidgetProviderInterface_C.GetObjectiveBulletIcon
// 0x0078 (0x0078 - 0x0000)
struct MissionObjectiveWidgetProviderInterface_C_GetObjectiveBulletIcon final
{
public:
	struct FSlateBrush                            BulletIcon;                                        // 0x0000(0x0078)(Parm, OutParm)
};
static_assert(alignof(MissionObjectiveWidgetProviderInterface_C_GetObjectiveBulletIcon) == 0x000008, "Wrong alignment on MissionObjectiveWidgetProviderInterface_C_GetObjectiveBulletIcon");
static_assert(sizeof(MissionObjectiveWidgetProviderInterface_C_GetObjectiveBulletIcon) == 0x000078, "Wrong size on MissionObjectiveWidgetProviderInterface_C_GetObjectiveBulletIcon");
static_assert(offsetof(MissionObjectiveWidgetProviderInterface_C_GetObjectiveBulletIcon, BulletIcon) == 0x000000, "Member 'MissionObjectiveWidgetProviderInterface_C_GetObjectiveBulletIcon::BulletIcon' has a wrong offset!");

}

