#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MonolithicItemDetailsHostPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MonolithicItemDetailsHostPanel.MonolithicItemDetailsHostPanel_C
// 0x0058 (0x02E8 - 0x0290)
class UMonolithicItemDetailsHostPanel_C final : public UFortItemManagementItemDetailsPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(Transient, DuplicateTransient)
	class UItemDetailsHeader_C*                   HeaderWidget;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemAlterationsListDetailWidget_C*     ItemAlterationsListDetailWidget;                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemAttributesDetailWidget_C*          ItemAttributesDetailWidget;                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemCalledOutAttributesDetailWidget_C* ItemCalledOutAttributesDetailWidget;               // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemDescriptionDetailWidget_C*         ItemDescriptionDetailWidget;                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemPerksListDetailWidget_C*           ItemPerksListDetailWidget;                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MarkedForMulchingBackgroundImage;                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeImage*                    MarkedForMulchingIndicatorImage;                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMiniItemCraftingIngredientsDetailWidget_C* MiniItemCraftingIngredientsDetailWidget_9;         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ShouldShowCraftingIngredients;                     // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_MonolithicItemDetailsHostPanel(int32 EntryPoint);
	void Construct();
	void HandleHasItemMarkedForMulchingChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MonolithicItemDetailsHostPanel_C">();
	}
	static class UMonolithicItemDetailsHostPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMonolithicItemDetailsHostPanel_C>();
	}
};
static_assert(alignof(UMonolithicItemDetailsHostPanel_C) == 0x000008, "Wrong alignment on UMonolithicItemDetailsHostPanel_C");
static_assert(sizeof(UMonolithicItemDetailsHostPanel_C) == 0x0002E8, "Wrong size on UMonolithicItemDetailsHostPanel_C");
static_assert(offsetof(UMonolithicItemDetailsHostPanel_C, UberGraphFrame) == 0x000290, "Member 'UMonolithicItemDetailsHostPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMonolithicItemDetailsHostPanel_C, HeaderWidget) == 0x000298, "Member 'UMonolithicItemDetailsHostPanel_C::HeaderWidget' has a wrong offset!");
static_assert(offsetof(UMonolithicItemDetailsHostPanel_C, ItemAlterationsListDetailWidget) == 0x0002A0, "Member 'UMonolithicItemDetailsHostPanel_C::ItemAlterationsListDetailWidget' has a wrong offset!");
static_assert(offsetof(UMonolithicItemDetailsHostPanel_C, ItemAttributesDetailWidget) == 0x0002A8, "Member 'UMonolithicItemDetailsHostPanel_C::ItemAttributesDetailWidget' has a wrong offset!");
static_assert(offsetof(UMonolithicItemDetailsHostPanel_C, ItemCalledOutAttributesDetailWidget) == 0x0002B0, "Member 'UMonolithicItemDetailsHostPanel_C::ItemCalledOutAttributesDetailWidget' has a wrong offset!");
static_assert(offsetof(UMonolithicItemDetailsHostPanel_C, ItemDescriptionDetailWidget) == 0x0002B8, "Member 'UMonolithicItemDetailsHostPanel_C::ItemDescriptionDetailWidget' has a wrong offset!");
static_assert(offsetof(UMonolithicItemDetailsHostPanel_C, ItemPerksListDetailWidget) == 0x0002C0, "Member 'UMonolithicItemDetailsHostPanel_C::ItemPerksListDetailWidget' has a wrong offset!");
static_assert(offsetof(UMonolithicItemDetailsHostPanel_C, MarkedForMulchingBackgroundImage) == 0x0002C8, "Member 'UMonolithicItemDetailsHostPanel_C::MarkedForMulchingBackgroundImage' has a wrong offset!");
static_assert(offsetof(UMonolithicItemDetailsHostPanel_C, MarkedForMulchingIndicatorImage) == 0x0002D0, "Member 'UMonolithicItemDetailsHostPanel_C::MarkedForMulchingIndicatorImage' has a wrong offset!");
static_assert(offsetof(UMonolithicItemDetailsHostPanel_C, MiniItemCraftingIngredientsDetailWidget_9) == 0x0002D8, "Member 'UMonolithicItemDetailsHostPanel_C::MiniItemCraftingIngredientsDetailWidget_9' has a wrong offset!");
static_assert(offsetof(UMonolithicItemDetailsHostPanel_C, ShouldShowCraftingIngredients) == 0x0002E0, "Member 'UMonolithicItemDetailsHostPanel_C::ShouldShowCraftingIngredients' has a wrong offset!");

}

