#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MusicManager

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MusicManager.MusicManager_C.ExecuteUbergraph_MusicManager
// 0x01D0 (0x01D0 - 0x0000)
struct MusicManager_C_ExecuteUbergraph_MusicManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue2;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMusicFadeStyles                              K2Node_Select_Default;                             // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue3;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue4;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue3;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue2;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue3;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue2;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue5;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue6;        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue4;         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue4;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue7;        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue5;         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue8;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue5;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue9;        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue6;         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue6;          // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue3;             // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue3;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue3;              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue10;       // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue7;         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select2_Default;                            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue11;       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue12;       // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue8;         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue7;          // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable2;                             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue8;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable5;                               // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable6;                               // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable3;                             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select3_Default;                            // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable7;                               // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortDayPhase                                 K2Node_Event_CurrentDayPhase;                      // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 K2Node_Event_PreviousDayPhase;                     // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAtCreation;                          // 0x00BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue3;         // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue4;         // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue5;         // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue6;         // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue4;             // 0x00C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTimeOfDaySpeed_ReturnValue;            // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable4;                             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEventHeatPercent_ReturnValue;          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEventHeatPercent_ReturnValue2;         // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEventHeatPercent_ReturnValue3;         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEventHeatPercent_ReturnValue4;         // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select4_Default;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 Temp_byte_Variable;                                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select5_Default;                            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select6_Default;                            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 Temp_byte_Variable2;                               // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue4;              // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select7_Default;                            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue4;              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNearActiveEncounters_ReturnValue;       // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select8_Default;                            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEventHeatPercent_ReturnValue5;         // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEventHeatPercent_ReturnValue6;         // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable8;                               // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMusicFadeStyles                              K2Node_Select9_Default;                            // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue9;          // 0x013E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable9;                               // 0x013F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetEventHeatPercent_ReturnValue7;         // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMusicFadeStyles                              K2Node_Select10_Default;                           // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue3;              // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue2;             // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue10;         // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14E[0x2];                                      // 0x014E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEventHeatPercent_ReturnValue8;         // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEventHeatPercent_ReturnValue9;         // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue4;              // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue5;              // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue3;             // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue4;             // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue11;         // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue12;         // 0x0163(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable10;                              // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable5;                             // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select11_Default;                           // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable11;                              // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable6;                             // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select12_Default;                           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable12;                              // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable13;                              // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select13_Default;                           // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable14;                              // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select14_Default;                           // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable7;                             // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMusicFadeStyles                              K2Node_Select15_Default;                           // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select16_Default;                           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01C8(0x0008)(NoDestructor)
};
static_assert(alignof(MusicManager_C_ExecuteUbergraph_MusicManager) == 0x000008, "Wrong alignment on MusicManager_C_ExecuteUbergraph_MusicManager");
static_assert(sizeof(MusicManager_C_ExecuteUbergraph_MusicManager) == 0x0001D0, "Wrong size on MusicManager_C_ExecuteUbergraph_MusicManager");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, EntryPoint) == 0x000000, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, Temp_bool_Variable) == 0x000004, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000005, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000008, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_GetGameTimeInSeconds_ReturnValue2) == 0x000010, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_GetGameTimeInSeconds_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000014, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_MakeLiteralInt_ReturnValue) == 0x000018, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, Temp_bool_Variable2) == 0x00001C, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Greater_IntInt_ReturnValue) == 0x00001D, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, K2Node_Select_Default) == 0x00001E, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_BooleanAND_ReturnValue) == 0x00001F, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_GetGameTimeInSeconds_ReturnValue3) == 0x000020, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_GetGameTimeInSeconds_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x000024, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_GetGameTimeInSeconds_ReturnValue4) == 0x000028, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_GetGameTimeInSeconds_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Greater_FloatFloat_ReturnValue2) == 0x00002C, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Greater_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Subtract_FloatFloat_ReturnValue3) == 0x000030, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Subtract_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_MakeLiteralInt_ReturnValue2) == 0x000034, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_MakeLiteralInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Greater_FloatFloat_ReturnValue3) == 0x000038, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Greater_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_NotEqual_IntInt_ReturnValue2) == 0x000039, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_NotEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Greater_IntInt_ReturnValue2) == 0x00003A, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Greater_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_BooleanAND_ReturnValue2) == 0x00003B, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_GetGameTimeInSeconds_ReturnValue5) == 0x00003C, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_GetGameTimeInSeconds_ReturnValue5' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_GetGameTimeInSeconds_ReturnValue6) == 0x000040, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_GetGameTimeInSeconds_ReturnValue6' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Subtract_FloatFloat_ReturnValue4) == 0x000044, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Subtract_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Greater_FloatFloat_ReturnValue4) == 0x000048, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Greater_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_GetGameTimeInSeconds_ReturnValue7) == 0x00004C, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_GetGameTimeInSeconds_ReturnValue7' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Subtract_FloatFloat_ReturnValue5) == 0x000050, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Subtract_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_GetGameTimeInSeconds_ReturnValue8) == 0x000054, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_GetGameTimeInSeconds_ReturnValue8' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Greater_FloatFloat_ReturnValue5) == 0x000058, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Greater_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_GetGameTimeInSeconds_ReturnValue9) == 0x00005C, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_GetGameTimeInSeconds_ReturnValue9' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Subtract_FloatFloat_ReturnValue6) == 0x000060, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Subtract_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Greater_FloatFloat_ReturnValue6) == 0x000064, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Greater_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_NotEqual_IntInt_ReturnValue3) == 0x000065, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_NotEqual_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_MakeLiteralInt_ReturnValue3) == 0x000068, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_MakeLiteralInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, Temp_object_Variable) == 0x000070, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Greater_IntInt_ReturnValue3) == 0x000078, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Greater_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_GetGameTimeInSeconds_ReturnValue10) == 0x00007C, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_GetGameTimeInSeconds_ReturnValue10' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_BooleanAND_ReturnValue3) == 0x000080, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Subtract_FloatFloat_ReturnValue7) == 0x000084, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Subtract_FloatFloat_ReturnValue7' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, Temp_bool_Variable3) == 0x000088, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, Temp_bool_Variable4) == 0x000089, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, K2Node_Select2_Default) == 0x00008C, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_GetGameTimeInSeconds_ReturnValue11) == 0x000090, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_GetGameTimeInSeconds_ReturnValue11' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_GetGameTimeInSeconds_ReturnValue12) == 0x000094, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_GetGameTimeInSeconds_ReturnValue12' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Subtract_FloatFloat_ReturnValue8) == 0x000098, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Subtract_FloatFloat_ReturnValue8' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Greater_FloatFloat_ReturnValue7) == 0x00009C, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Greater_FloatFloat_ReturnValue7' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, Temp_object_Variable2) == 0x0000A0, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Greater_FloatFloat_ReturnValue8) == 0x0000A8, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Greater_FloatFloat_ReturnValue8' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, Temp_bool_Variable5) == 0x0000A9, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, Temp_bool_Variable6) == 0x0000AA, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, Temp_object_Variable3) == 0x0000B0, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, K2Node_Select3_Default) == 0x0000B8, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, Temp_bool_Variable7) == 0x0000BC, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::Temp_bool_Variable7' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, K2Node_Event_CurrentDayPhase) == 0x0000BD, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::K2Node_Event_CurrentDayPhase' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, K2Node_Event_PreviousDayPhase) == 0x0000BE, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::K2Node_Event_PreviousDayPhase' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, K2Node_Event_bAtCreation) == 0x0000BF, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::K2Node_Event_bAtCreation' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Not_PreBool_ReturnValue) == 0x0000C0, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000C1, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_EqualEqual_NameName_ReturnValue2) == 0x0000C2, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_EqualEqual_NameName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_EqualEqual_NameName_ReturnValue3) == 0x0000C3, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_EqualEqual_NameName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_EqualEqual_NameName_ReturnValue4) == 0x0000C4, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_EqualEqual_NameName_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_EqualEqual_NameName_ReturnValue5) == 0x0000C5, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_EqualEqual_NameName_ReturnValue5' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_EqualEqual_NameName_ReturnValue6) == 0x0000C6, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_EqualEqual_NameName_ReturnValue6' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_NotEqual_IntInt_ReturnValue4) == 0x0000C7, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_NotEqual_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_GetTimeOfDaySpeed_ReturnValue) == 0x0000C8, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_GetTimeOfDaySpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x0000CC, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, Temp_object_Variable4) == 0x0000D0, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_GetEventHeatPercent_ReturnValue) == 0x0000D8, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_GetEventHeatPercent_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_GetEventHeatPercent_ReturnValue2) == 0x0000DC, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_GetEventHeatPercent_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_GetEventHeatPercent_ReturnValue3) == 0x0000E0, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_GetEventHeatPercent_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_GetEventHeatPercent_ReturnValue4) == 0x0000E4, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_GetEventHeatPercent_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, K2Node_Select4_Default) == 0x0000E8, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, Temp_byte_Variable) == 0x0000F0, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, K2Node_Select5_Default) == 0x0000F8, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::K2Node_Select5_Default' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, K2Node_Select6_Default) == 0x000100, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::K2Node_Select6_Default' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, Temp_byte_Variable2) == 0x000108, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_MakeLiteralInt_ReturnValue4) == 0x00010C, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_MakeLiteralInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, K2Node_Select7_Default) == 0x000110, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::K2Node_Select7_Default' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Greater_IntInt_ReturnValue4) == 0x000118, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Greater_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_BooleanAND_ReturnValue4) == 0x000119, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_IsNearActiveEncounters_ReturnValue) == 0x00011A, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_IsNearActiveEncounters_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Not_PreBool_ReturnValue2) == 0x00011B, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, K2Node_Select8_Default) == 0x000120, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::K2Node_Select8_Default' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_GetEventHeatPercent_ReturnValue5) == 0x000128, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_GetEventHeatPercent_ReturnValue5' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_GetEventHeatPercent_ReturnValue6) == 0x00012C, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_GetEventHeatPercent_ReturnValue6' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Add_FloatFloat_ReturnValue) == 0x000130, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, Temp_bool_Variable8) == 0x000134, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::Temp_bool_Variable8' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Add_FloatFloat_ReturnValue2) == 0x000138, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Less_FloatFloat_ReturnValue) == 0x00013C, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, K2Node_Select9_Default) == 0x00013D, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::K2Node_Select9_Default' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Greater_FloatFloat_ReturnValue9) == 0x00013E, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Greater_FloatFloat_ReturnValue9' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, Temp_bool_Variable9) == 0x00013F, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::Temp_bool_Variable9' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_GetEventHeatPercent_ReturnValue7) == 0x000140, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_GetEventHeatPercent_ReturnValue7' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, K2Node_Select10_Default) == 0x000144, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::K2Node_Select10_Default' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Add_FloatFloat_ReturnValue3) == 0x000148, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Add_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Less_FloatFloat_ReturnValue2) == 0x00014C, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Less_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Greater_FloatFloat_ReturnValue10) == 0x00014D, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Greater_FloatFloat_ReturnValue10' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_GetEventHeatPercent_ReturnValue8) == 0x000150, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_GetEventHeatPercent_ReturnValue8' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_GetEventHeatPercent_ReturnValue9) == 0x000154, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_GetEventHeatPercent_ReturnValue9' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Add_FloatFloat_ReturnValue4) == 0x000158, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Add_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Add_FloatFloat_ReturnValue5) == 0x00015C, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Add_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Less_FloatFloat_ReturnValue3) == 0x000160, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Less_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Less_FloatFloat_ReturnValue4) == 0x000161, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Less_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Greater_FloatFloat_ReturnValue11) == 0x000162, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Greater_FloatFloat_ReturnValue11' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_Greater_FloatFloat_ReturnValue12) == 0x000163, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_Greater_FloatFloat_ReturnValue12' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, Temp_bool_Variable10) == 0x000164, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::Temp_bool_Variable10' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, Temp_object_Variable5) == 0x000168, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::Temp_object_Variable5' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, K2Node_Select11_Default) == 0x000170, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::K2Node_Select11_Default' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, Temp_bool_Variable11) == 0x000174, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::Temp_bool_Variable11' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, Temp_object_Variable6) == 0x000178, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::Temp_object_Variable6' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, K2Node_Select12_Default) == 0x000180, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::K2Node_Select12_Default' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, Temp_bool_Variable12) == 0x000188, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::Temp_bool_Variable12' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, Temp_bool_Variable13) == 0x000189, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::Temp_bool_Variable13' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, K2Node_Select13_Default) == 0x000190, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::K2Node_Select13_Default' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, Temp_bool_Variable14) == 0x000198, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::Temp_bool_Variable14' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, K2Node_Select14_Default) == 0x00019C, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::K2Node_Select14_Default' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, Temp_object_Variable7) == 0x0001A0, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::Temp_object_Variable7' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, K2Node_Select15_Default) == 0x0001A8, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::K2Node_Select15_Default' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, K2Node_Select16_Default) == 0x0001B0, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::K2Node_Select16_Default' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, K2Node_CreateDelegate_OutputDelegate) == 0x0001B8, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MusicManager_C_ExecuteUbergraph_MusicManager, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001C8, "Member 'MusicManager_C_ExecuteUbergraph_MusicManager::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function MusicManager.MusicManager_C.OnDayPhaseChanged
// 0x0003 (0x0003 - 0x0000)
struct MusicManager_C_OnDayPhaseChanged final
{
public:
	EFortDayPhase                                 Param_CurrentDayPhase;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDayPhase                                 PreviousDayPhase;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAtCreation;                                       // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MusicManager_C_OnDayPhaseChanged) == 0x000001, "Wrong alignment on MusicManager_C_OnDayPhaseChanged");
static_assert(sizeof(MusicManager_C_OnDayPhaseChanged) == 0x000003, "Wrong size on MusicManager_C_OnDayPhaseChanged");
static_assert(offsetof(MusicManager_C_OnDayPhaseChanged, Param_CurrentDayPhase) == 0x000000, "Member 'MusicManager_C_OnDayPhaseChanged::Param_CurrentDayPhase' has a wrong offset!");
static_assert(offsetof(MusicManager_C_OnDayPhaseChanged, PreviousDayPhase) == 0x000001, "Member 'MusicManager_C_OnDayPhaseChanged::PreviousDayPhase' has a wrong offset!");
static_assert(offsetof(MusicManager_C_OnDayPhaseChanged, bAtCreation) == 0x000002, "Member 'MusicManager_C_OnDayPhaseChanged::bAtCreation' has a wrong offset!");

// Function MusicManager.MusicManager_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct MusicManager_C_UserConstructionScript final
{
public:
	class AFortPlayerControllerFrontEnd*          K2Node_DynamicCast_AsFort_Player_Controller_Front_End; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerFrontEnd*          K2Node_DynamicCast_AsFort_Player_Controller_Front_End2; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MusicManager_C_UserConstructionScript) == 0x000008, "Wrong alignment on MusicManager_C_UserConstructionScript");
static_assert(sizeof(MusicManager_C_UserConstructionScript) == 0x000020, "Wrong size on MusicManager_C_UserConstructionScript");
static_assert(offsetof(MusicManager_C_UserConstructionScript, K2Node_DynamicCast_AsFort_Player_Controller_Front_End) == 0x000000, "Member 'MusicManager_C_UserConstructionScript::K2Node_DynamicCast_AsFort_Player_Controller_Front_End' has a wrong offset!");
static_assert(offsetof(MusicManager_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'MusicManager_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
