#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionsMenuRowSelector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OptionsMenuRowSelector.OptionsMenuRowSelector_C
// 0x0058 (0x0260 - 0x0208)
class UOptionsMenuRowSelector_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UCommonTextBlock*                       RowSelectorText;                                   // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SelectorButtonsBox;                                // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   Selector_Button_Selected;                          // 0x0220(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class FText>                           Hover_Texts;                                       // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UCommonButtonGroup*                     Selector_Buttons;                                  // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Common_Button_Group_Type;                          // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       Tab_Tooltip_Text;                                  // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ButtonStyle;                                       // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Selector_Button_Selected__DelegateSignature(int32 Tab_Id);
	void ExecuteUbergraph_OptionsMenuRowSelector(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Destruct();
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnSelectedButtonChanged_Event_0(class UCommonButton* AssociatedButton, int32 ButtonIndex);
	void Construct();
	void Initialize_Row_Selector(const class FText& Row_Text, TArray<class FText>& Buttons, TArray<class FText>& Param_Hover_Texts, bool Require_Selection, class UCommonTextBlock* Tab_Tooltip);
	void Update_Row_Selector(int32 Tab_Number);
	void Deselect_All_Rows();
	void Button_Hovered(class UCommonButton* Param_Button_Hovered);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OptionsMenuRowSelector_C">();
	}
	static class UOptionsMenuRowSelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOptionsMenuRowSelector_C>();
	}
};
static_assert(alignof(UOptionsMenuRowSelector_C) == 0x000008, "Wrong alignment on UOptionsMenuRowSelector_C");
static_assert(sizeof(UOptionsMenuRowSelector_C) == 0x000260, "Wrong size on UOptionsMenuRowSelector_C");
static_assert(offsetof(UOptionsMenuRowSelector_C, UberGraphFrame) == 0x000208, "Member 'UOptionsMenuRowSelector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOptionsMenuRowSelector_C, RowSelectorText) == 0x000210, "Member 'UOptionsMenuRowSelector_C::RowSelectorText' has a wrong offset!");
static_assert(offsetof(UOptionsMenuRowSelector_C, SelectorButtonsBox) == 0x000218, "Member 'UOptionsMenuRowSelector_C::SelectorButtonsBox' has a wrong offset!");
static_assert(offsetof(UOptionsMenuRowSelector_C, Selector_Button_Selected) == 0x000220, "Member 'UOptionsMenuRowSelector_C::Selector_Button_Selected' has a wrong offset!");
static_assert(offsetof(UOptionsMenuRowSelector_C, Hover_Texts) == 0x000230, "Member 'UOptionsMenuRowSelector_C::Hover_Texts' has a wrong offset!");
static_assert(offsetof(UOptionsMenuRowSelector_C, Selector_Buttons) == 0x000240, "Member 'UOptionsMenuRowSelector_C::Selector_Buttons' has a wrong offset!");
static_assert(offsetof(UOptionsMenuRowSelector_C, Common_Button_Group_Type) == 0x000248, "Member 'UOptionsMenuRowSelector_C::Common_Button_Group_Type' has a wrong offset!");
static_assert(offsetof(UOptionsMenuRowSelector_C, Tab_Tooltip_Text) == 0x000250, "Member 'UOptionsMenuRowSelector_C::Tab_Tooltip_Text' has a wrong offset!");
static_assert(offsetof(UOptionsMenuRowSelector_C, ButtonStyle) == 0x000258, "Member 'UOptionsMenuRowSelector_C::ButtonStyle' has a wrong offset!");

}

