#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OutpostScreenStormShield

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function OutpostScreenStormShield.OutpostScreenStormShield_C.ExecuteUbergraph_OutpostScreenStormShield
// 0x0080 (0x0080 - 0x0000)
struct OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_TabId2;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetWidgetAtIndex_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetWidgetAtIndex_ReturnValue2;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOutpostScreenStormShieldPermissions_C* K2Node_DynamicCast_AsOutpost_Screen_Storm_Shield_Permissions; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOutpostScreenStormShieldContent_C*     K2Node_DynamicCast_AsOutpost_Screen_Storm_Shield_Content; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_TabId;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_TabButton;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIconTabButton_C*                       K2Node_DynamicCast_AsIcon_Tab_Button;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield) == 0x000008, "Wrong alignment on OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield");
static_assert(sizeof(OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield) == 0x000080, "Wrong size on OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield");
static_assert(offsetof(OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield, EntryPoint) == 0x000000, "Member 'OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield::EntryPoint' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield, K2Node_ComponentBoundEvent_TabId2) == 0x000008, "Member 'OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield::K2Node_ComponentBoundEvent_TabId2' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield, CallFunc_Conv_NameToString_ReturnValue) == 0x000010, "Member 'OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield, K2Node_SwitchString_CmpSuccess) == 0x000020, "Member 'OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield, CallFunc_GetWidgetAtIndex_ReturnValue) == 0x000028, "Member 'OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield::CallFunc_GetWidgetAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield, CallFunc_GetWidgetAtIndex_ReturnValue2) == 0x000030, "Member 'OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield::CallFunc_GetWidgetAtIndex_ReturnValue2' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield, K2Node_DynamicCast_AsOutpost_Screen_Storm_Shield_Permissions) == 0x000038, "Member 'OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield::K2Node_DynamicCast_AsOutpost_Screen_Storm_Shield_Permissions' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield, K2Node_DynamicCast_AsOutpost_Screen_Storm_Shield_Content) == 0x000048, "Member 'OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield::K2Node_DynamicCast_AsOutpost_Screen_Storm_Shield_Content' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield, K2Node_DynamicCast_bSuccess2) == 0x000050, "Member 'OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield, K2Node_ComponentBoundEvent_TabId) == 0x000058, "Member 'OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield::K2Node_ComponentBoundEvent_TabId' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield, K2Node_ComponentBoundEvent_TabButton) == 0x000060, "Member 'OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield::K2Node_ComponentBoundEvent_TabButton' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield, K2Node_DynamicCast_AsIcon_Tab_Button) == 0x000068, "Member 'OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield::K2Node_DynamicCast_AsIcon_Tab_Button' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield, K2Node_DynamicCast_bSuccess3) == 0x000070, "Member 'OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield, CallFunc_GetUINavigationManager_ReturnValue) == 0x000078, "Member 'OutpostScreenStormShield_C_ExecuteUbergraph_OutpostScreenStormShield::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

// Function OutpostScreenStormShield.OutpostScreenStormShield_C.BndEvt__ContentOrPermissionsTab_K2Node_ComponentBoundEvent_36_OnTabButtonCreated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct OutpostScreenStormShield_C_BndEvt__ContentOrPermissionsTab_K2Node_ComponentBoundEvent_36_OnTabButtonCreated__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OutpostScreenStormShield_C_BndEvt__ContentOrPermissionsTab_K2Node_ComponentBoundEvent_36_OnTabButtonCreated__DelegateSignature) == 0x000008, "Wrong alignment on OutpostScreenStormShield_C_BndEvt__ContentOrPermissionsTab_K2Node_ComponentBoundEvent_36_OnTabButtonCreated__DelegateSignature");
static_assert(sizeof(OutpostScreenStormShield_C_BndEvt__ContentOrPermissionsTab_K2Node_ComponentBoundEvent_36_OnTabButtonCreated__DelegateSignature) == 0x000010, "Wrong size on OutpostScreenStormShield_C_BndEvt__ContentOrPermissionsTab_K2Node_ComponentBoundEvent_36_OnTabButtonCreated__DelegateSignature");
static_assert(offsetof(OutpostScreenStormShield_C_BndEvt__ContentOrPermissionsTab_K2Node_ComponentBoundEvent_36_OnTabButtonCreated__DelegateSignature, TabId) == 0x000000, "Member 'OutpostScreenStormShield_C_BndEvt__ContentOrPermissionsTab_K2Node_ComponentBoundEvent_36_OnTabButtonCreated__DelegateSignature::TabId' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShield_C_BndEvt__ContentOrPermissionsTab_K2Node_ComponentBoundEvent_36_OnTabButtonCreated__DelegateSignature, TabButton) == 0x000008, "Member 'OutpostScreenStormShield_C_BndEvt__ContentOrPermissionsTab_K2Node_ComponentBoundEvent_36_OnTabButtonCreated__DelegateSignature::TabButton' has a wrong offset!");

// Function OutpostScreenStormShield.OutpostScreenStormShield_C.BndEvt__ContentOrPermissionsTab_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) OutpostScreenStormShield_C_BndEvt__ContentOrPermissionsTab_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OutpostScreenStormShield_C_BndEvt__ContentOrPermissionsTab_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature) == 0x000008, "Wrong alignment on OutpostScreenStormShield_C_BndEvt__ContentOrPermissionsTab_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature");
static_assert(sizeof(OutpostScreenStormShield_C_BndEvt__ContentOrPermissionsTab_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature) == 0x000008, "Wrong size on OutpostScreenStormShield_C_BndEvt__ContentOrPermissionsTab_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature");
static_assert(offsetof(OutpostScreenStormShield_C_BndEvt__ContentOrPermissionsTab_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature, TabId) == 0x000000, "Member 'OutpostScreenStormShield_C_BndEvt__ContentOrPermissionsTab_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature::TabId' has a wrong offset!");

// Function OutpostScreenStormShield.OutpostScreenStormShield_C.SetCoreBuilding
// 0x0038 (0x0038 - 0x0000)
struct OutpostScreenStormShield_C_SetCoreBuilding final
{
public:
	class AFortOutpostBuilding*                   NewCoreBuilding;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetWidgetAtIndex_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetWidgetAtIndex_ReturnValue2;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOutpostScreenStormShieldContent_C*     K2Node_DynamicCast_AsOutpost_Screen_Storm_Shield_Content; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOutpostScreenStormShieldPermissions_C* K2Node_DynamicCast_AsOutpost_Screen_Storm_Shield_Permissions; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OutpostScreenStormShield_C_SetCoreBuilding) == 0x000008, "Wrong alignment on OutpostScreenStormShield_C_SetCoreBuilding");
static_assert(sizeof(OutpostScreenStormShield_C_SetCoreBuilding) == 0x000038, "Wrong size on OutpostScreenStormShield_C_SetCoreBuilding");
static_assert(offsetof(OutpostScreenStormShield_C_SetCoreBuilding, NewCoreBuilding) == 0x000000, "Member 'OutpostScreenStormShield_C_SetCoreBuilding::NewCoreBuilding' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShield_C_SetCoreBuilding, CallFunc_GetWidgetAtIndex_ReturnValue) == 0x000008, "Member 'OutpostScreenStormShield_C_SetCoreBuilding::CallFunc_GetWidgetAtIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShield_C_SetCoreBuilding, CallFunc_GetWidgetAtIndex_ReturnValue2) == 0x000010, "Member 'OutpostScreenStormShield_C_SetCoreBuilding::CallFunc_GetWidgetAtIndex_ReturnValue2' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShield_C_SetCoreBuilding, K2Node_DynamicCast_AsOutpost_Screen_Storm_Shield_Content) == 0x000018, "Member 'OutpostScreenStormShield_C_SetCoreBuilding::K2Node_DynamicCast_AsOutpost_Screen_Storm_Shield_Content' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShield_C_SetCoreBuilding, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'OutpostScreenStormShield_C_SetCoreBuilding::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShield_C_SetCoreBuilding, K2Node_DynamicCast_AsOutpost_Screen_Storm_Shield_Permissions) == 0x000028, "Member 'OutpostScreenStormShield_C_SetCoreBuilding::K2Node_DynamicCast_AsOutpost_Screen_Storm_Shield_Permissions' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShield_C_SetCoreBuilding, K2Node_DynamicCast_bSuccess2) == 0x000030, "Member 'OutpostScreenStormShield_C_SetCoreBuilding::K2Node_DynamicCast_bSuccess2' has a wrong offset!");

// Function OutpostScreenStormShield.OutpostScreenStormShield_C.AddInputHandlers
// 0x0020 (0x0020 - 0x0000)
struct OutpostScreenStormShield_C_AddInputHandlers final
{
public:
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0010(0x0010)(NoDestructor)
};
static_assert(alignof(OutpostScreenStormShield_C_AddInputHandlers) == 0x000008, "Wrong alignment on OutpostScreenStormShield_C_AddInputHandlers");
static_assert(sizeof(OutpostScreenStormShield_C_AddInputHandlers) == 0x000020, "Wrong size on OutpostScreenStormShield_C_AddInputHandlers");
static_assert(offsetof(OutpostScreenStormShield_C_AddInputHandlers, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'OutpostScreenStormShield_C_AddInputHandlers::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShield_C_AddInputHandlers, K2Node_MakeStruct_DataTableRowHandle) == 0x000010, "Member 'OutpostScreenStormShield_C_AddInputHandlers::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");

// Function OutpostScreenStormShield.OutpostScreenStormShield_C.HandleBack
// 0x0010 (0x0010 - 0x0000)
struct OutpostScreenStormShield_C_HandleBack final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OutpostScreenStormShield_C_HandleBack) == 0x000008, "Wrong alignment on OutpostScreenStormShield_C_HandleBack");
static_assert(sizeof(OutpostScreenStormShield_C_HandleBack) == 0x000010, "Wrong size on OutpostScreenStormShield_C_HandleBack");
static_assert(offsetof(OutpostScreenStormShield_C_HandleBack, Passthrough) == 0x000000, "Member 'OutpostScreenStormShield_C_HandleBack::Passthrough' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShield_C_HandleBack, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'OutpostScreenStormShield_C_HandleBack::CallFunc_GetContext_ReturnValue' has a wrong offset!");

}

