#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OutpostScreenStormShield

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OutpostScreenStormShield.OutpostScreenStormShield_C
// 0x0040 (0x0400 - 0x03C0)
class UOutpostScreenStormShield_C final : public UCommonActivatablePanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(Transient, DuplicateTransient)
	class UHorizontalTabList_C*                   ContentOrPermissionsTab;                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  ShieldToContentSwitcher;                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AFortOutpostBuilding*                   OutpostCoreBuilding;                               // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   CloseOutpostScreen;                                // 0x03E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UOutpostScreenStormShieldContent_C*     StormShieldWidgetReference;                        // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOutpostScreenStormShieldPermissions_C* PermissionsWidgetReference;                        // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CloseOutpostScreen__DelegateSignature();
	void ExecuteUbergraph_OutpostScreenStormShield(int32 EntryPoint);
	void BndEvt__ContentOrPermissionsTab_K2Node_ComponentBoundEvent_36_OnTabButtonCreated__DelegateSignature(class FName TabId, class UCommonButton* TabButton);
	void BndEvt__ContentOrPermissionsTab_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature(class FName TabId);
	void Construct();
	void SetCoreBuilding(class AFortOutpostBuilding* NewCoreBuilding);
	void AddInputHandlers();
	void HandleBack(bool* Passthrough);
	void CenterPermissionsWidget();
	void CenterStormShieldWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OutpostScreenStormShield_C">();
	}
	static class UOutpostScreenStormShield_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOutpostScreenStormShield_C>();
	}
};
static_assert(alignof(UOutpostScreenStormShield_C) == 0x000008, "Wrong alignment on UOutpostScreenStormShield_C");
static_assert(sizeof(UOutpostScreenStormShield_C) == 0x000400, "Wrong size on UOutpostScreenStormShield_C");
static_assert(offsetof(UOutpostScreenStormShield_C, UberGraphFrame) == 0x0003C0, "Member 'UOutpostScreenStormShield_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOutpostScreenStormShield_C, ContentOrPermissionsTab) == 0x0003C8, "Member 'UOutpostScreenStormShield_C::ContentOrPermissionsTab' has a wrong offset!");
static_assert(offsetof(UOutpostScreenStormShield_C, ShieldToContentSwitcher) == 0x0003D0, "Member 'UOutpostScreenStormShield_C::ShieldToContentSwitcher' has a wrong offset!");
static_assert(offsetof(UOutpostScreenStormShield_C, OutpostCoreBuilding) == 0x0003D8, "Member 'UOutpostScreenStormShield_C::OutpostCoreBuilding' has a wrong offset!");
static_assert(offsetof(UOutpostScreenStormShield_C, CloseOutpostScreen) == 0x0003E0, "Member 'UOutpostScreenStormShield_C::CloseOutpostScreen' has a wrong offset!");
static_assert(offsetof(UOutpostScreenStormShield_C, StormShieldWidgetReference) == 0x0003F0, "Member 'UOutpostScreenStormShield_C::StormShieldWidgetReference' has a wrong offset!");
static_assert(offsetof(UOutpostScreenStormShield_C, PermissionsWidgetReference) == 0x0003F8, "Member 'UOutpostScreenStormShield_C::PermissionsWidgetReference' has a wrong offset!");

}

