#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OutpostScreenStormShieldContent

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Party_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function OutpostScreenStormShieldContent.OutpostScreenStormShieldContent_C.ExecuteUbergraph_OutpostScreenStormShieldContent
// 0x00D8 (0x00D8 - 0x0000)
struct OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortOutpostContext*                    CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetOutpostCoreLevel_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerControllerOutpost_C*          K2Node_DynamicCast_AsBP_Player_Controller_Outpost; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue2;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerControllerOutpost_C*          K2Node_DynamicCast_AsBP_Player_Controller_Outpost2; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOwningPlayerOutpostOwner_ReturnValue;   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_StormShieldInterface_C> K2Node_DynamicCast_AsBPI_Storm_Shield_Interface;   // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetOutpostReadyState_ReadyToExpand;       // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetOutpostReadyState_ReadyToInstallAmplifier; // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0080(0x0008)(NoDestructor)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0090(0x0018)()
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Selected;               // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue2;                  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue3;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerControllerOutpost_C*          K2Node_DynamicCast_AsBP_Player_Controller_Outpost3; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent) == 0x000008, "Wrong alignment on OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent");
static_assert(sizeof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent) == 0x0000D8, "Wrong size on OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, EntryPoint) == 0x000000, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::EntryPoint' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, CallFunc_GetOutpostCoreLevel_ReturnValue) == 0x000018, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::CallFunc_GetOutpostCoreLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, K2Node_DynamicCast_AsBP_Player_Controller_Outpost) == 0x000020, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::K2Node_DynamicCast_AsBP_Player_Controller_Outpost' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, K2Node_SwitchInteger_CmpSuccess) == 0x000029, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, CallFunc_GetOwningPlayer_ReturnValue2) == 0x000040, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::CallFunc_GetOwningPlayer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, K2Node_DynamicCast_AsBP_Player_Controller_Outpost2) == 0x000048, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::K2Node_DynamicCast_AsBP_Player_Controller_Outpost2' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, K2Node_DynamicCast_bSuccess2) == 0x000050, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, CallFunc_IsOwningPlayerOutpostOwner_ReturnValue) == 0x000051, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::CallFunc_IsOwningPlayerOutpostOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, K2Node_DynamicCast_AsBPI_Storm_Shield_Interface) == 0x000058, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::K2Node_DynamicCast_AsBPI_Storm_Shield_Interface' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, K2Node_DynamicCast_bSuccess3) == 0x000068, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, CallFunc_GetOutpostReadyState_ReadyToExpand) == 0x000069, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::CallFunc_GetOutpostReadyState_ReadyToExpand' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, CallFunc_GetOutpostReadyState_ReadyToInstallAmplifier) == 0x00006A, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::CallFunc_GetOutpostReadyState_ReadyToInstallAmplifier' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, CallFunc_BooleanAND_ReturnValue) == 0x00006B, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, K2Node_CreateDelegate_OutputDelegate2) == 0x000070, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000080, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, K2Node_ComponentBoundEvent_Button2) == 0x000088, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, CallFunc_GetEmptyText_ReturnValue) == 0x000090, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, K2Node_ComponentBoundEvent_Button) == 0x0000A8, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, K2Node_ComponentBoundEvent_Selected) == 0x0000B0, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::K2Node_ComponentBoundEvent_Selected' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, CallFunc_GetContext_ReturnValue2) == 0x0000B8, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, CallFunc_GetOwningPlayer_ReturnValue3) == 0x0000C0, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::CallFunc_GetOwningPlayer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, K2Node_DynamicCast_AsBP_Player_Controller_Outpost3) == 0x0000C8, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::K2Node_DynamicCast_AsBP_Player_Controller_Outpost3' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent, K2Node_DynamicCast_bSuccess4) == 0x0000D0, "Member 'OutpostScreenStormShieldContent_C_ExecuteUbergraph_OutpostScreenStormShieldContent::K2Node_DynamicCast_bSuccess4' has a wrong offset!");

// Function OutpostScreenStormShieldContent.OutpostScreenStormShieldContent_C.BndEvt__AllowFriendsOfFriendsButton_K2Node_ComponentBoundEvent_243_CommonSelectedStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct OutpostScreenStormShieldContent_C_BndEvt__AllowFriendsOfFriendsButton_K2Node_ComponentBoundEvent_243_CommonSelectedStateChanged__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OutpostScreenStormShieldContent_C_BndEvt__AllowFriendsOfFriendsButton_K2Node_ComponentBoundEvent_243_CommonSelectedStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on OutpostScreenStormShieldContent_C_BndEvt__AllowFriendsOfFriendsButton_K2Node_ComponentBoundEvent_243_CommonSelectedStateChanged__DelegateSignature");
static_assert(sizeof(OutpostScreenStormShieldContent_C_BndEvt__AllowFriendsOfFriendsButton_K2Node_ComponentBoundEvent_243_CommonSelectedStateChanged__DelegateSignature) == 0x000010, "Wrong size on OutpostScreenStormShieldContent_C_BndEvt__AllowFriendsOfFriendsButton_K2Node_ComponentBoundEvent_243_CommonSelectedStateChanged__DelegateSignature");
static_assert(offsetof(OutpostScreenStormShieldContent_C_BndEvt__AllowFriendsOfFriendsButton_K2Node_ComponentBoundEvent_243_CommonSelectedStateChanged__DelegateSignature, Button) == 0x000000, "Member 'OutpostScreenStormShieldContent_C_BndEvt__AllowFriendsOfFriendsButton_K2Node_ComponentBoundEvent_243_CommonSelectedStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_BndEvt__AllowFriendsOfFriendsButton_K2Node_ComponentBoundEvent_243_CommonSelectedStateChanged__DelegateSignature, Selected) == 0x000008, "Member 'OutpostScreenStormShieldContent_C_BndEvt__AllowFriendsOfFriendsButton_K2Node_ComponentBoundEvent_243_CommonSelectedStateChanged__DelegateSignature::Selected' has a wrong offset!");

// Function OutpostScreenStormShieldContent.OutpostScreenStormShieldContent_C.BndEvt__Upgrade_Button_K2Node_ComponentBoundEvent_158_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct OutpostScreenStormShieldContent_C_BndEvt__Upgrade_Button_K2Node_ComponentBoundEvent_158_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OutpostScreenStormShieldContent_C_BndEvt__Upgrade_Button_K2Node_ComponentBoundEvent_158_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on OutpostScreenStormShieldContent_C_BndEvt__Upgrade_Button_K2Node_ComponentBoundEvent_158_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(OutpostScreenStormShieldContent_C_BndEvt__Upgrade_Button_K2Node_ComponentBoundEvent_158_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on OutpostScreenStormShieldContent_C_BndEvt__Upgrade_Button_K2Node_ComponentBoundEvent_158_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(OutpostScreenStormShieldContent_C_BndEvt__Upgrade_Button_K2Node_ComponentBoundEvent_158_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'OutpostScreenStormShieldContent_C_BndEvt__Upgrade_Button_K2Node_ComponentBoundEvent_158_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function OutpostScreenStormShieldContent.OutpostScreenStormShieldContent_C.GetPercent_0
// 0x0018 (0x0018 - 0x0000)
struct OutpostScreenStormShieldContent_C_GetPercent_0 final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetResourceCount_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OutpostScreenStormShieldContent_C_GetPercent_0) == 0x000008, "Wrong alignment on OutpostScreenStormShieldContent_C_GetPercent_0");
static_assert(sizeof(OutpostScreenStormShieldContent_C_GetPercent_0) == 0x000018, "Wrong size on OutpostScreenStormShieldContent_C_GetPercent_0");
static_assert(offsetof(OutpostScreenStormShieldContent_C_GetPercent_0, ReturnValue) == 0x000000, "Member 'OutpostScreenStormShieldContent_C_GetPercent_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_GetPercent_0, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'OutpostScreenStormShieldContent_C_GetPercent_0::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_GetPercent_0, CallFunc_GetResourceCount_ReturnValue) == 0x000010, "Member 'OutpostScreenStormShieldContent_C_GetPercent_0::CallFunc_GetResourceCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_GetPercent_0, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000014, "Member 'OutpostScreenStormShieldContent_C_GetPercent_0::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");

// Function OutpostScreenStormShieldContent.OutpostScreenStormShieldContent_C.GetPercent_1
// 0x0018 (0x0018 - 0x0000)
struct OutpostScreenStormShieldContent_C_GetPercent_1 final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetResourceCount_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OutpostScreenStormShieldContent_C_GetPercent_1) == 0x000008, "Wrong alignment on OutpostScreenStormShieldContent_C_GetPercent_1");
static_assert(sizeof(OutpostScreenStormShieldContent_C_GetPercent_1) == 0x000018, "Wrong size on OutpostScreenStormShieldContent_C_GetPercent_1");
static_assert(offsetof(OutpostScreenStormShieldContent_C_GetPercent_1, ReturnValue) == 0x000000, "Member 'OutpostScreenStormShieldContent_C_GetPercent_1::ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_GetPercent_1, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'OutpostScreenStormShieldContent_C_GetPercent_1::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_GetPercent_1, CallFunc_GetResourceCount_ReturnValue) == 0x000010, "Member 'OutpostScreenStormShieldContent_C_GetPercent_1::CallFunc_GetResourceCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_GetPercent_1, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000014, "Member 'OutpostScreenStormShieldContent_C_GetPercent_1::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");

// Function OutpostScreenStormShieldContent.OutpostScreenStormShieldContent_C.GetPercent_2
// 0x0018 (0x0018 - 0x0000)
struct OutpostScreenStormShieldContent_C_GetPercent_2 final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetResourceCount_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OutpostScreenStormShieldContent_C_GetPercent_2) == 0x000008, "Wrong alignment on OutpostScreenStormShieldContent_C_GetPercent_2");
static_assert(sizeof(OutpostScreenStormShieldContent_C_GetPercent_2) == 0x000018, "Wrong size on OutpostScreenStormShieldContent_C_GetPercent_2");
static_assert(offsetof(OutpostScreenStormShieldContent_C_GetPercent_2, ReturnValue) == 0x000000, "Member 'OutpostScreenStormShieldContent_C_GetPercent_2::ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_GetPercent_2, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'OutpostScreenStormShieldContent_C_GetPercent_2::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_GetPercent_2, CallFunc_GetResourceCount_ReturnValue) == 0x000010, "Member 'OutpostScreenStormShieldContent_C_GetPercent_2::CallFunc_GetResourceCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_GetPercent_2, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000014, "Member 'OutpostScreenStormShieldContent_C_GetPercent_2::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");

// Function OutpostScreenStormShieldContent.OutpostScreenStormShieldContent_C.ResrouceProgress_Wood
// 0x0008 (0x0008 - 0x0000)
struct OutpostScreenStormShieldContent_C_ResrouceProgress_Wood final
{
public:
	int32                                         NewParam;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewParam1;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OutpostScreenStormShieldContent_C_ResrouceProgress_Wood) == 0x000004, "Wrong alignment on OutpostScreenStormShieldContent_C_ResrouceProgress_Wood");
static_assert(sizeof(OutpostScreenStormShieldContent_C_ResrouceProgress_Wood) == 0x000008, "Wrong size on OutpostScreenStormShieldContent_C_ResrouceProgress_Wood");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ResrouceProgress_Wood, NewParam) == 0x000000, "Member 'OutpostScreenStormShieldContent_C_ResrouceProgress_Wood::NewParam' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_ResrouceProgress_Wood, NewParam1) == 0x000004, "Member 'OutpostScreenStormShieldContent_C_ResrouceProgress_Wood::NewParam1' has a wrong offset!");

// Function OutpostScreenStormShieldContent.OutpostScreenStormShieldContent_C.isPlayerAlone
// 0x0030 (0x0030 - 0x0000)
struct OutpostScreenStormShieldContent_C_IsPlayerAlone final
{
public:
	bool                                          IsAlone;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUITeamInfo*                        CallFunc_GetLocalPlayerTeam_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFortTeamMemberInfo>            CallFunc_GetTeamMembers_TeamMembers;               // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OutpostScreenStormShieldContent_C_IsPlayerAlone) == 0x000008, "Wrong alignment on OutpostScreenStormShieldContent_C_IsPlayerAlone");
static_assert(sizeof(OutpostScreenStormShieldContent_C_IsPlayerAlone) == 0x000030, "Wrong size on OutpostScreenStormShieldContent_C_IsPlayerAlone");
static_assert(offsetof(OutpostScreenStormShieldContent_C_IsPlayerAlone, IsAlone) == 0x000000, "Member 'OutpostScreenStormShieldContent_C_IsPlayerAlone::IsAlone' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_IsPlayerAlone, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'OutpostScreenStormShieldContent_C_IsPlayerAlone::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_IsPlayerAlone, CallFunc_GetLocalPlayerTeam_ReturnValue) == 0x000010, "Member 'OutpostScreenStormShieldContent_C_IsPlayerAlone::CallFunc_GetLocalPlayerTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_IsPlayerAlone, CallFunc_GetTeamMembers_TeamMembers) == 0x000018, "Member 'OutpostScreenStormShieldContent_C_IsPlayerAlone::CallFunc_GetTeamMembers_TeamMembers' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_IsPlayerAlone, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'OutpostScreenStormShieldContent_C_IsPlayerAlone::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_IsPlayerAlone, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00002C, "Member 'OutpostScreenStormShieldContent_C_IsPlayerAlone::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function OutpostScreenStormShieldContent.OutpostScreenStormShieldContent_C.Update_Upgrade_ButtonEnabled
// 0x0020 (0x0020 - 0x0000)
struct OutpostScreenStormShieldContent_C_Update_Upgrade_ButtonEnabled final
{
public:
	bool                                          CallFunc_IsOwningPlayerOutpostOwner_ReturnValue;   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_StormShieldInterface_C> K2Node_DynamicCast_AsBPI_Storm_Shield_Interface;   // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetOutpostReadyState_ReadyToExpand;       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetOutpostReadyState_ReadyToInstallAmplifier; // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OutpostScreenStormShieldContent_C_Update_Upgrade_ButtonEnabled) == 0x000008, "Wrong alignment on OutpostScreenStormShieldContent_C_Update_Upgrade_ButtonEnabled");
static_assert(sizeof(OutpostScreenStormShieldContent_C_Update_Upgrade_ButtonEnabled) == 0x000020, "Wrong size on OutpostScreenStormShieldContent_C_Update_Upgrade_ButtonEnabled");
static_assert(offsetof(OutpostScreenStormShieldContent_C_Update_Upgrade_ButtonEnabled, CallFunc_IsOwningPlayerOutpostOwner_ReturnValue) == 0x000000, "Member 'OutpostScreenStormShieldContent_C_Update_Upgrade_ButtonEnabled::CallFunc_IsOwningPlayerOutpostOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_Update_Upgrade_ButtonEnabled, CallFunc_BooleanAND_ReturnValue) == 0x000001, "Member 'OutpostScreenStormShieldContent_C_Update_Upgrade_ButtonEnabled::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_Update_Upgrade_ButtonEnabled, K2Node_DynamicCast_AsBPI_Storm_Shield_Interface) == 0x000008, "Member 'OutpostScreenStormShieldContent_C_Update_Upgrade_ButtonEnabled::K2Node_DynamicCast_AsBPI_Storm_Shield_Interface' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_Update_Upgrade_ButtonEnabled, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'OutpostScreenStormShieldContent_C_Update_Upgrade_ButtonEnabled::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_Update_Upgrade_ButtonEnabled, CallFunc_GetOutpostReadyState_ReadyToExpand) == 0x000019, "Member 'OutpostScreenStormShieldContent_C_Update_Upgrade_ButtonEnabled::CallFunc_GetOutpostReadyState_ReadyToExpand' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_Update_Upgrade_ButtonEnabled, CallFunc_GetOutpostReadyState_ReadyToInstallAmplifier) == 0x00001A, "Member 'OutpostScreenStormShieldContent_C_Update_Upgrade_ButtonEnabled::CallFunc_GetOutpostReadyState_ReadyToInstallAmplifier' has a wrong offset!");

// Function OutpostScreenStormShieldContent.OutpostScreenStormShieldContent_C.IsOwningPlayerOutpostOwner
// 0x0020 (0x0020 - 0x0000)
struct OutpostScreenStormShieldContent_C_IsOwningPlayerOutpostOwner final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerOutpost*           K2Node_DynamicCast_AsFort_Player_Controller_Outpost; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOutpostOwner_ReturnValue;               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OutpostScreenStormShieldContent_C_IsOwningPlayerOutpostOwner) == 0x000008, "Wrong alignment on OutpostScreenStormShieldContent_C_IsOwningPlayerOutpostOwner");
static_assert(sizeof(OutpostScreenStormShieldContent_C_IsOwningPlayerOutpostOwner) == 0x000020, "Wrong size on OutpostScreenStormShieldContent_C_IsOwningPlayerOutpostOwner");
static_assert(offsetof(OutpostScreenStormShieldContent_C_IsOwningPlayerOutpostOwner, ReturnValue) == 0x000000, "Member 'OutpostScreenStormShieldContent_C_IsOwningPlayerOutpostOwner::ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_IsOwningPlayerOutpostOwner, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'OutpostScreenStormShieldContent_C_IsOwningPlayerOutpostOwner::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_IsOwningPlayerOutpostOwner, K2Node_DynamicCast_AsFort_Player_Controller_Outpost) == 0x000010, "Member 'OutpostScreenStormShieldContent_C_IsOwningPlayerOutpostOwner::K2Node_DynamicCast_AsFort_Player_Controller_Outpost' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_IsOwningPlayerOutpostOwner, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'OutpostScreenStormShieldContent_C_IsOwningPlayerOutpostOwner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_IsOwningPlayerOutpostOwner, CallFunc_IsOutpostOwner_ReturnValue) == 0x000019, "Member 'OutpostScreenStormShieldContent_C_IsOwningPlayerOutpostOwner::CallFunc_IsOutpostOwner_ReturnValue' has a wrong offset!");

// Function OutpostScreenStormShieldContent.OutpostScreenStormShieldContent_C.Get_LeaveOutpost_Button_ToolTipWidget
// 0x0010 (0x0010 - 0x0000)
struct OutpostScreenStormShieldContent_C_Get_LeaveOutpost_Button_ToolTipWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_Basic_Tooltip_Output;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OutpostScreenStormShieldContent_C_Get_LeaveOutpost_Button_ToolTipWidget) == 0x000008, "Wrong alignment on OutpostScreenStormShieldContent_C_Get_LeaveOutpost_Button_ToolTipWidget");
static_assert(sizeof(OutpostScreenStormShieldContent_C_Get_LeaveOutpost_Button_ToolTipWidget) == 0x000010, "Wrong size on OutpostScreenStormShieldContent_C_Get_LeaveOutpost_Button_ToolTipWidget");
static_assert(offsetof(OutpostScreenStormShieldContent_C_Get_LeaveOutpost_Button_ToolTipWidget, ReturnValue) == 0x000000, "Member 'OutpostScreenStormShieldContent_C_Get_LeaveOutpost_Button_ToolTipWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_Get_LeaveOutpost_Button_ToolTipWidget, CallFunc_Create_Basic_Tooltip_Output) == 0x000008, "Member 'OutpostScreenStormShieldContent_C_Get_LeaveOutpost_Button_ToolTipWidget::CallFunc_Create_Basic_Tooltip_Output' has a wrong offset!");

// Function OutpostScreenStormShieldContent.OutpostScreenStormShieldContent_C.Update_LeaveOutpost_ButtonEnabled
// 0x0030 (0x0030 - 0x0000)
struct OutpostScreenStormShieldContent_C_Update_LeaveOutpost_ButtonEnabled final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerOutpost*           K2Node_DynamicCast_AsFort_Player_Controller_Outpost; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_StormShieldInterface_C> K2Node_DynamicCast_AsBPI_Storm_Shield_Interface;   // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOutpostOwner_ReturnValue;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanLeaveOutpost_AllowedToLeave;           // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OutpostScreenStormShieldContent_C_Update_LeaveOutpost_ButtonEnabled) == 0x000008, "Wrong alignment on OutpostScreenStormShieldContent_C_Update_LeaveOutpost_ButtonEnabled");
static_assert(sizeof(OutpostScreenStormShieldContent_C_Update_LeaveOutpost_ButtonEnabled) == 0x000030, "Wrong size on OutpostScreenStormShieldContent_C_Update_LeaveOutpost_ButtonEnabled");
static_assert(offsetof(OutpostScreenStormShieldContent_C_Update_LeaveOutpost_ButtonEnabled, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'OutpostScreenStormShieldContent_C_Update_LeaveOutpost_ButtonEnabled::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_Update_LeaveOutpost_ButtonEnabled, K2Node_DynamicCast_AsFort_Player_Controller_Outpost) == 0x000008, "Member 'OutpostScreenStormShieldContent_C_Update_LeaveOutpost_ButtonEnabled::K2Node_DynamicCast_AsFort_Player_Controller_Outpost' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_Update_LeaveOutpost_ButtonEnabled, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'OutpostScreenStormShieldContent_C_Update_LeaveOutpost_ButtonEnabled::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_Update_LeaveOutpost_ButtonEnabled, K2Node_DynamicCast_AsBPI_Storm_Shield_Interface) == 0x000018, "Member 'OutpostScreenStormShieldContent_C_Update_LeaveOutpost_ButtonEnabled::K2Node_DynamicCast_AsBPI_Storm_Shield_Interface' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_Update_LeaveOutpost_ButtonEnabled, K2Node_DynamicCast_bSuccess2) == 0x000028, "Member 'OutpostScreenStormShieldContent_C_Update_LeaveOutpost_ButtonEnabled::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_Update_LeaveOutpost_ButtonEnabled, CallFunc_IsOutpostOwner_ReturnValue) == 0x000029, "Member 'OutpostScreenStormShieldContent_C_Update_LeaveOutpost_ButtonEnabled::CallFunc_IsOutpostOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_Update_LeaveOutpost_ButtonEnabled, CallFunc_CanLeaveOutpost_AllowedToLeave) == 0x00002A, "Member 'OutpostScreenStormShieldContent_C_Update_LeaveOutpost_ButtonEnabled::CallFunc_CanLeaveOutpost_AllowedToLeave' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_Update_LeaveOutpost_ButtonEnabled, CallFunc_BooleanAND_ReturnValue) == 0x00002B, "Member 'OutpostScreenStormShieldContent_C_Update_LeaveOutpost_ButtonEnabled::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function OutpostScreenStormShieldContent.OutpostScreenStormShieldContent_C.SetCoreBuilding
// 0x0010 (0x0010 - 0x0000)
struct OutpostScreenStormShieldContent_C_SetCoreBuilding final
{
public:
	class AFortOutpostBuilding*                   NewCoreBuilding;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOutpostScreenStormShield_C*            Parent_Widget;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OutpostScreenStormShieldContent_C_SetCoreBuilding) == 0x000008, "Wrong alignment on OutpostScreenStormShieldContent_C_SetCoreBuilding");
static_assert(sizeof(OutpostScreenStormShieldContent_C_SetCoreBuilding) == 0x000010, "Wrong size on OutpostScreenStormShieldContent_C_SetCoreBuilding");
static_assert(offsetof(OutpostScreenStormShieldContent_C_SetCoreBuilding, NewCoreBuilding) == 0x000000, "Member 'OutpostScreenStormShieldContent_C_SetCoreBuilding::NewCoreBuilding' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_SetCoreBuilding, Parent_Widget) == 0x000008, "Member 'OutpostScreenStormShieldContent_C_SetCoreBuilding::Parent_Widget' has a wrong offset!");

// Function OutpostScreenStormShieldContent.OutpostScreenStormShieldContent_C.Update_ExpandShieldText
// 0x0010 (0x0010 - 0x0000)
struct OutpostScreenStormShieldContent_C_Update_ExpandShieldText final
{
public:
	class UFortOutpostContext*                    CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetOutpostCoreLevel_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OutpostScreenStormShieldContent_C_Update_ExpandShieldText) == 0x000008, "Wrong alignment on OutpostScreenStormShieldContent_C_Update_ExpandShieldText");
static_assert(sizeof(OutpostScreenStormShieldContent_C_Update_ExpandShieldText) == 0x000010, "Wrong size on OutpostScreenStormShieldContent_C_Update_ExpandShieldText");
static_assert(offsetof(OutpostScreenStormShieldContent_C_Update_ExpandShieldText, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'OutpostScreenStormShieldContent_C_Update_ExpandShieldText::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_Update_ExpandShieldText, CallFunc_GetOutpostCoreLevel_ReturnValue) == 0x000008, "Member 'OutpostScreenStormShieldContent_C_Update_ExpandShieldText::CallFunc_GetOutpostCoreLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_Update_ExpandShieldText, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000C, "Member 'OutpostScreenStormShieldContent_C_Update_ExpandShieldText::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function OutpostScreenStormShieldContent.OutpostScreenStormShieldContent_C.SetExpandShieldText
// 0x0038 (0x0038 - 0x0000)
struct OutpostScreenStormShieldContent_C_SetExpandShieldText final
{
public:
	class FText                                   NewExpandText;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0018(0x0018)()
	bool                                          CallFunc_NotEqual_TextText_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OutpostScreenStormShieldContent_C_SetExpandShieldText) == 0x000008, "Wrong alignment on OutpostScreenStormShieldContent_C_SetExpandShieldText");
static_assert(sizeof(OutpostScreenStormShieldContent_C_SetExpandShieldText) == 0x000038, "Wrong size on OutpostScreenStormShieldContent_C_SetExpandShieldText");
static_assert(offsetof(OutpostScreenStormShieldContent_C_SetExpandShieldText, NewExpandText) == 0x000000, "Member 'OutpostScreenStormShieldContent_C_SetExpandShieldText::NewExpandText' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_SetExpandShieldText, CallFunc_GetText_ReturnValue) == 0x000018, "Member 'OutpostScreenStormShieldContent_C_SetExpandShieldText::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_SetExpandShieldText, CallFunc_NotEqual_TextText_ReturnValue) == 0x000030, "Member 'OutpostScreenStormShieldContent_C_SetExpandShieldText::CallFunc_NotEqual_TextText_ReturnValue' has a wrong offset!");

// Function OutpostScreenStormShieldContent.OutpostScreenStormShieldContent_C.UpdateGetHelpButton
// 0x0070 (0x0070 - 0x0000)
struct OutpostScreenStormShieldContent_C_UpdateGetHelpButton final
{
public:
	class AFortPlayerControllerOutpost*           OutpostControllerReference;                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOutpostOwner_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCompletedQuest_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPartyType                                    CallFunc_GetPartyPrivacySetting_OutPartyType;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPartyPrivacySetting_OutLeaderFriendsOnly; // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetPartyPrivacySetting_OutLeaderInvitesOnly; // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetPartyPrivacySetting_ReturnValue;       // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetNumPlayersInLocalParty_ReturnValue;    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerOutpost*           K2Node_DynamicCast_AsFort_Player_Controller_Outpost; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue2;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerControllerOutpost_C*          K2Node_DynamicCast_AsBP_Player_Controller_Outpost; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OutpostScreenStormShieldContent_C_UpdateGetHelpButton) == 0x000008, "Wrong alignment on OutpostScreenStormShieldContent_C_UpdateGetHelpButton");
static_assert(sizeof(OutpostScreenStormShieldContent_C_UpdateGetHelpButton) == 0x000070, "Wrong size on OutpostScreenStormShieldContent_C_UpdateGetHelpButton");
static_assert(offsetof(OutpostScreenStormShieldContent_C_UpdateGetHelpButton, OutpostControllerReference) == 0x000000, "Member 'OutpostScreenStormShieldContent_C_UpdateGetHelpButton::OutpostControllerReference' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_UpdateGetHelpButton, CallFunc_IsOutpostOwner_ReturnValue) == 0x000008, "Member 'OutpostScreenStormShieldContent_C_UpdateGetHelpButton::CallFunc_IsOutpostOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_UpdateGetHelpButton, CallFunc_GetQuestManager_ReturnValue) == 0x000010, "Member 'OutpostScreenStormShieldContent_C_UpdateGetHelpButton::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_UpdateGetHelpButton, CallFunc_HasCompletedQuest_ReturnValue) == 0x000018, "Member 'OutpostScreenStormShieldContent_C_UpdateGetHelpButton::CallFunc_HasCompletedQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_UpdateGetHelpButton, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'OutpostScreenStormShieldContent_C_UpdateGetHelpButton::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_UpdateGetHelpButton, CallFunc_GetPartyPrivacySetting_OutPartyType) == 0x000028, "Member 'OutpostScreenStormShieldContent_C_UpdateGetHelpButton::CallFunc_GetPartyPrivacySetting_OutPartyType' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_UpdateGetHelpButton, CallFunc_GetPartyPrivacySetting_OutLeaderFriendsOnly) == 0x000029, "Member 'OutpostScreenStormShieldContent_C_UpdateGetHelpButton::CallFunc_GetPartyPrivacySetting_OutLeaderFriendsOnly' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_UpdateGetHelpButton, CallFunc_GetPartyPrivacySetting_OutLeaderInvitesOnly) == 0x00002A, "Member 'OutpostScreenStormShieldContent_C_UpdateGetHelpButton::CallFunc_GetPartyPrivacySetting_OutLeaderInvitesOnly' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_UpdateGetHelpButton, CallFunc_GetPartyPrivacySetting_ReturnValue) == 0x00002B, "Member 'OutpostScreenStormShieldContent_C_UpdateGetHelpButton::CallFunc_GetPartyPrivacySetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_UpdateGetHelpButton, CallFunc_GetNumPlayersInLocalParty_ReturnValue) == 0x00002C, "Member 'OutpostScreenStormShieldContent_C_UpdateGetHelpButton::CallFunc_GetNumPlayersInLocalParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_UpdateGetHelpButton, K2Node_SwitchEnum_CmpSuccess) == 0x000030, "Member 'OutpostScreenStormShieldContent_C_UpdateGetHelpButton::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_UpdateGetHelpButton, CallFunc_Less_IntInt_ReturnValue) == 0x000031, "Member 'OutpostScreenStormShieldContent_C_UpdateGetHelpButton::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_UpdateGetHelpButton, CallFunc_GetOwningPlayer_ReturnValue) == 0x000038, "Member 'OutpostScreenStormShieldContent_C_UpdateGetHelpButton::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_UpdateGetHelpButton, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'OutpostScreenStormShieldContent_C_UpdateGetHelpButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_UpdateGetHelpButton, K2Node_DynamicCast_AsFort_Player_Controller_Outpost) == 0x000048, "Member 'OutpostScreenStormShieldContent_C_UpdateGetHelpButton::K2Node_DynamicCast_AsFort_Player_Controller_Outpost' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_UpdateGetHelpButton, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'OutpostScreenStormShieldContent_C_UpdateGetHelpButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_UpdateGetHelpButton, CallFunc_GetOwningPlayer_ReturnValue2) == 0x000058, "Member 'OutpostScreenStormShieldContent_C_UpdateGetHelpButton::CallFunc_GetOwningPlayer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_UpdateGetHelpButton, K2Node_DynamicCast_AsBP_Player_Controller_Outpost) == 0x000060, "Member 'OutpostScreenStormShieldContent_C_UpdateGetHelpButton::K2Node_DynamicCast_AsBP_Player_Controller_Outpost' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_UpdateGetHelpButton, K2Node_DynamicCast_bSuccess2) == 0x000068, "Member 'OutpostScreenStormShieldContent_C_UpdateGetHelpButton::K2Node_DynamicCast_bSuccess2' has a wrong offset!");

// Function OutpostScreenStormShieldContent.OutpostScreenStormShieldContent_C.Get_GetHelpButton_ToolTipWidget_0
// 0x0010 (0x0010 - 0x0000)
struct OutpostScreenStormShieldContent_C_Get_GetHelpButton_ToolTipWidget_0 final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_Basic_Tooltip_Output;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OutpostScreenStormShieldContent_C_Get_GetHelpButton_ToolTipWidget_0) == 0x000008, "Wrong alignment on OutpostScreenStormShieldContent_C_Get_GetHelpButton_ToolTipWidget_0");
static_assert(sizeof(OutpostScreenStormShieldContent_C_Get_GetHelpButton_ToolTipWidget_0) == 0x000010, "Wrong size on OutpostScreenStormShieldContent_C_Get_GetHelpButton_ToolTipWidget_0");
static_assert(offsetof(OutpostScreenStormShieldContent_C_Get_GetHelpButton_ToolTipWidget_0, ReturnValue) == 0x000000, "Member 'OutpostScreenStormShieldContent_C_Get_GetHelpButton_ToolTipWidget_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(OutpostScreenStormShieldContent_C_Get_GetHelpButton_ToolTipWidget_0, CallFunc_Create_Basic_Tooltip_Output) == 0x000008, "Member 'OutpostScreenStormShieldContent_C_Get_GetHelpButton_ToolTipWidget_0::CallFunc_Create_Basic_Tooltip_Output' has a wrong offset!");

// Function OutpostScreenStormShieldContent.OutpostScreenStormShieldContent_C.SetButtonState
// 0x0001 (0x0001 - 0x0000)
struct OutpostScreenStormShieldContent_C_SetButtonState final
{
public:
	bool                                          Enabled_;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(OutpostScreenStormShieldContent_C_SetButtonState) == 0x000001, "Wrong alignment on OutpostScreenStormShieldContent_C_SetButtonState");
static_assert(sizeof(OutpostScreenStormShieldContent_C_SetButtonState) == 0x000001, "Wrong size on OutpostScreenStormShieldContent_C_SetButtonState");
static_assert(offsetof(OutpostScreenStormShieldContent_C_SetButtonState, Enabled_) == 0x000000, "Member 'OutpostScreenStormShieldContent_C_SetButtonState::Enabled_' has a wrong offset!");

// Function OutpostScreenStormShieldContent.OutpostScreenStormShieldContent_C.AddInputHandlers
// 0x0020 (0x0020 - 0x0000)
struct OutpostScreenStormShieldContent_C_AddInputHandlers final
{
public:
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
