#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OutpostScreenStormShieldPermissions

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OutpostScreenStormShieldPermissions.OutpostScreenStormShieldPermissions_C
// 0x0030 (0x03F0 - 0x03C0)
class UOutpostScreenStormShieldPermissions_C final : public UCommonActivatablePanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(Transient, DuplicateTransient)
	class UOutpostScreenCanEditPanel_C*           OutpostScreenCanEditPanel;                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          GetHelp;                                           // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   CloseOutpostScreen;                                // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UOutpostScreenStormShield_C*            ParentReference;                                   // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CloseOutpostScreen__DelegateSignature();
	void ExecuteUbergraph_OutpostScreenStormShieldPermissions(int32 EntryPoint);
	void OnActivated();
	void UpdatePrivilagesEvent_1(int32 PlayerIndex);
	void UpdatePrivilagesEvent_0(const struct FFortTeamMemberInfo& NewTeamMemberInfo);
	void Construct();
	void IsPlayerAlone(bool* IsAlone);
	void UpdatePrivilages();
	bool IsOwningPlayerOutpostOwner();
	void AddInputHandlers();
	void HandleBack(bool* Passthrough);
	void CenterWidget();
	void SetParent(class UOutpostScreenStormShield_C* ParentWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OutpostScreenStormShieldPermissions_C">();
	}
	static class UOutpostScreenStormShieldPermissions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOutpostScreenStormShieldPermissions_C>();
	}
};
static_assert(alignof(UOutpostScreenStormShieldPermissions_C) == 0x000008, "Wrong alignment on UOutpostScreenStormShieldPermissions_C");
static_assert(sizeof(UOutpostScreenStormShieldPermissions_C) == 0x0003F0, "Wrong size on UOutpostScreenStormShieldPermissions_C");
static_assert(offsetof(UOutpostScreenStormShieldPermissions_C, UberGraphFrame) == 0x0003C0, "Member 'UOutpostScreenStormShieldPermissions_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UOutpostScreenStormShieldPermissions_C, OutpostScreenCanEditPanel) == 0x0003C8, "Member 'UOutpostScreenStormShieldPermissions_C::OutpostScreenCanEditPanel' has a wrong offset!");
static_assert(offsetof(UOutpostScreenStormShieldPermissions_C, GetHelp) == 0x0003D0, "Member 'UOutpostScreenStormShieldPermissions_C::GetHelp' has a wrong offset!");
static_assert(offsetof(UOutpostScreenStormShieldPermissions_C, CloseOutpostScreen) == 0x0003D8, "Member 'UOutpostScreenStormShieldPermissions_C::CloseOutpostScreen' has a wrong offset!");
static_assert(offsetof(UOutpostScreenStormShieldPermissions_C, ParentReference) == 0x0003E8, "Member 'UOutpostScreenStormShieldPermissions_C::ParentReference' has a wrong offset!");

}

