#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PackResource

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PackResource.PackResource_C
// 0x0028 (0x0238 - 0x0210)
class UPackResource_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UCommonBorder*                          CommonBorder_0;                                    // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageResourceIcon;                                 // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                NumericTextCount;                                  // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EFortResourceType                             ResourceType;                                      // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PackResource(int32 EntryPoint);
	void Construct();
	void UpdateCount();
	void UpdateType(EFortResourceType Param_ResourceType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PackResource_C">();
	}
	static class UPackResource_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPackResource_C>();
	}
};
static_assert(alignof(UPackResource_C) == 0x000008, "Wrong alignment on UPackResource_C");
static_assert(sizeof(UPackResource_C) == 0x000238, "Wrong size on UPackResource_C");
static_assert(offsetof(UPackResource_C, UberGraphFrame) == 0x000210, "Member 'UPackResource_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPackResource_C, CommonBorder_0) == 0x000218, "Member 'UPackResource_C::CommonBorder_0' has a wrong offset!");
static_assert(offsetof(UPackResource_C, ImageResourceIcon) == 0x000220, "Member 'UPackResource_C::ImageResourceIcon' has a wrong offset!");
static_assert(offsetof(UPackResource_C, NumericTextCount) == 0x000228, "Member 'UPackResource_C::NumericTextCount' has a wrong offset!");
static_assert(offsetof(UPackResource_C, ResourceType) == 0x000230, "Member 'UPackResource_C::ResourceType' has a wrong offset!");

}

