#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PanelButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PanelButton.PanelButton_C
// 0x0030 (0x07B0 - 0x0780)
class UPanelButton_C : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0780(0x0008)(Transient, DuplicateTransient)
	class UNamedSlot*                             ContentSlot;                                       // 0x0788(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 ControllerInputStyle;                              // 0x0790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UClass*                                 MouseKeyboardStyle;                                // 0x0798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    ButtonClickAction;                                 // 0x07A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_PanelButton(int32 EntryPoint);
	void OnUnhovered();
	void OnHovered();
	void Construct();
	void OnActionComplete();
	void OnActionProgress(float HeldPercent);
	void OnTriggeredInputActionChanged(const struct FDataTableRowHandle& NewTriggeredAction);
	void BndEvt__CommonActionWidgetAction_K2Node_ComponentBoundEvent_0_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad);
	void PreConstruct(bool IsDesignTime);
	void UpdateTextAndStyle();
	void InitializeButton();
	void UpdateStyle(bool bUsingGamepad);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PanelButton_C">();
	}
	static class UPanelButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPanelButton_C>();
	}
};
static_assert(alignof(UPanelButton_C) == 0x000008, "Wrong alignment on UPanelButton_C");
static_assert(sizeof(UPanelButton_C) == 0x0007B0, "Wrong size on UPanelButton_C");
static_assert(offsetof(UPanelButton_C, UberGraphFrame) == 0x000780, "Member 'UPanelButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPanelButton_C, ContentSlot) == 0x000788, "Member 'UPanelButton_C::ContentSlot' has a wrong offset!");
static_assert(offsetof(UPanelButton_C, ControllerInputStyle) == 0x000790, "Member 'UPanelButton_C::ControllerInputStyle' has a wrong offset!");
static_assert(offsetof(UPanelButton_C, MouseKeyboardStyle) == 0x000798, "Member 'UPanelButton_C::MouseKeyboardStyle' has a wrong offset!");
static_assert(offsetof(UPanelButton_C, ButtonClickAction) == 0x0007A0, "Member 'UPanelButton_C::ButtonClickAction' has a wrong offset!");

}

