#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PartyDisplayManagerBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.ExecuteUbergraph_PartyDisplayManagerBP
// 0x03A0 (0x03A0 - 0x0000)
struct PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              K2Node_Event_ItemToView;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetWeaponPlacementTransform_ReturnValue;  // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0040(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x004C(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0058(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0068(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult2;      // 0x00E8(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0168(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              K2Node_Event_ItemWhoseAssetsWereLoaded;            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        K2Node_Event_LoadedAssets;                         // 0x0180(0x0010)(ZeroConstructor, ReferenceParm)
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionToShow_ItemDefinition;   // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19B[0x5];                                      // 0x019B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionToShow_ItemDefinition2;  // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_GetPreviewPrefabAsset_Asset;              // 0x01A8(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_GetPreviewPrefabAsset_ReturnValue;        // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UStaticMesh>             CallFunc_GetPreviewStaticMeshAsset_Asset;          // 0x01D8(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_GetPreviewStaticMeshAsset_ReturnValue;    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Conv_SoftClassReferenceToClass_ReturnValue; // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh;                  // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsActor;                   // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USkeletalMesh>           CallFunc_GetPreviewSkeletalMeshAsset_Asset;        // 0x0238(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_GetPreviewSkeletalMeshAsset_ReturnValue;  // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortRarity                                   CallFunc_GetRarity_ReturnValue;                    // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_262[0x6];                                      // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetLargePreviewImage_ReturnValue;         // 0x0268(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue2; // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue3; // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          K2Node_DynamicCast_AsSkeletal_Mesh;                // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BA[0x6];                                      // 0x02BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetSchematicCraftingResultBP_ReturnValue; // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x02C8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue2;          // 0x02D8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionToShow_ItemDefinition3;  // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue2;           // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x02F8(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<TSoftObjectPtr<class UObject>>         CallFunc_GetPreviewAssets_ReturnValue;             // 0x0378(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue2;        // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP) == 0x000010, "Wrong alignment on PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP");
static_assert(sizeof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP) == 0x0003A0, "Wrong size on PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, EntryPoint) == 0x000000, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, K2Node_Event_ItemToView) == 0x000008, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::K2Node_Event_ItemToView' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_GetWeaponPlacementTransform_ReturnValue) == 0x000010, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_GetWeaponPlacementTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_BreakTransform_Location) == 0x000040, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_BreakTransform_Rotation) == 0x00004C, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_BreakTransform_Scale) == 0x000058, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_IsDedicatedServer_ReturnValue) == 0x000064, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000068, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_K2_SetWorldLocation_SweepHitResult2) == 0x0000E8, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_K2_SetWorldLocation_SweepHitResult2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000168, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, K2Node_Event_ItemWhoseAssetsWereLoaded) == 0x000178, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::K2Node_Event_ItemWhoseAssetsWereLoaded' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, K2Node_Event_LoadedAssets) == 0x000180, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::K2Node_Event_LoadedAssets' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_GetItemDefinitionToShow_ItemDefinition) == 0x000190, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_GetItemDefinitionToShow_ItemDefinition' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_IsValid_ReturnValue) == 0x000198, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_IsValid_ReturnValue2) == 0x000199, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_Not_PreBool_ReturnValue) == 0x00019A, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_GetItemDefinitionToShow_ItemDefinition2) == 0x0001A0, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_GetItemDefinitionToShow_ItemDefinition2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_GetPreviewPrefabAsset_Asset) == 0x0001A8, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_GetPreviewPrefabAsset_Asset' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_GetPreviewPrefabAsset_ReturnValue) == 0x0001D0, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_GetPreviewPrefabAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_GetPreviewStaticMeshAsset_Asset) == 0x0001D8, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_GetPreviewStaticMeshAsset_Asset' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_GetPreviewStaticMeshAsset_ReturnValue) == 0x000200, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_GetPreviewStaticMeshAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000208, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_Conv_SoftClassReferenceToClass_ReturnValue) == 0x000210, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_Conv_SoftClassReferenceToClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, K2Node_DynamicCast_AsStatic_Mesh) == 0x000218, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::K2Node_DynamicCast_AsStatic_Mesh' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, K2Node_DynamicCast_bSuccess) == 0x000220, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, K2Node_ClassDynamicCast_AsActor) == 0x000228, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::K2Node_ClassDynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, K2Node_ClassDynamicCast_bSuccess) == 0x000230, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_GetPreviewSkeletalMeshAsset_Asset) == 0x000238, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_GetPreviewSkeletalMeshAsset_Asset' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_GetPreviewSkeletalMeshAsset_ReturnValue) == 0x000260, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_GetPreviewSkeletalMeshAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_GetRarity_ReturnValue) == 0x000261, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_GetLargePreviewImage_ReturnValue) == 0x000268, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_GetLargePreviewImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue2) == 0x000290, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue3) == 0x000298, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue3' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, K2Node_DynamicCast_AsSkeletal_Mesh) == 0x0002A0, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::K2Node_DynamicCast_AsSkeletal_Mesh' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, K2Node_DynamicCast_bSuccess2) == 0x0002A8, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, K2Node_DynamicCast_AsTexture_2D) == 0x0002B0, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, K2Node_DynamicCast_bSuccess3) == 0x0002B8, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0002B9, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_GetSchematicCraftingResultBP_ReturnValue) == 0x0002C0, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_GetSchematicCraftingResultBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_Conv_FloatToVector_ReturnValue) == 0x0002C8, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_IsValid_ReturnValue3) == 0x0002D4, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_Conv_FloatToVector_ReturnValue2) == 0x0002D8, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_Conv_FloatToVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_GetItemDefinitionToShow_ItemDefinition3) == 0x0002E8, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_GetItemDefinitionToShow_ItemDefinition3' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, K2Node_Event_DeltaSeconds) == 0x0002F0, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_IsDedicatedServer_ReturnValue2) == 0x0002F4, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_IsDedicatedServer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0002F8, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_GetPreviewAssets_ReturnValue) == 0x000378, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_GetPreviewAssets_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x000388, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000390, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP, CallFunc_SpawnEmitterAttached_ReturnValue2) == 0x000398, "Member 'PartyDisplayManagerBP_C_ExecuteUbergraph_PartyDisplayManagerBP::CallFunc_SpawnEmitterAttached_ReturnValue2' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct PartyDisplayManagerBP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyDisplayManagerBP_C_ReceiveTick) == 0x000004, "Wrong alignment on PartyDisplayManagerBP_C_ReceiveTick");
static_assert(sizeof(PartyDisplayManagerBP_C_ReceiveTick) == 0x000004, "Wrong size on PartyDisplayManagerBP_C_ReceiveTick");
static_assert(offsetof(PartyDisplayManagerBP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'PartyDisplayManagerBP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.HandleLoadingAssetsForItemCompleted
// 0x0018 (0x0018 - 0x0000)
struct PartyDisplayManagerBP_C_HandleLoadingAssetsForItemCompleted final
{
public:
	class UFortItem*                              ItemWhoseAssetsWereLoaded;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        LoadedAssets;                                      // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(PartyDisplayManagerBP_C_HandleLoadingAssetsForItemCompleted) == 0x000008, "Wrong alignment on PartyDisplayManagerBP_C_HandleLoadingAssetsForItemCompleted");
static_assert(sizeof(PartyDisplayManagerBP_C_HandleLoadingAssetsForItemCompleted) == 0x000018, "Wrong size on PartyDisplayManagerBP_C_HandleLoadingAssetsForItemCompleted");
static_assert(offsetof(PartyDisplayManagerBP_C_HandleLoadingAssetsForItemCompleted, ItemWhoseAssetsWereLoaded) == 0x000000, "Member 'PartyDisplayManagerBP_C_HandleLoadingAssetsForItemCompleted::ItemWhoseAssetsWereLoaded' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_HandleLoadingAssetsForItemCompleted, LoadedAssets) == 0x000008, "Member 'PartyDisplayManagerBP_C_HandleLoadingAssetsForItemCompleted::LoadedAssets' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.ShowItem
// 0x0008 (0x0008 - 0x0000)
struct PartyDisplayManagerBP_C_ShowItem final
{
public:
	class UFortItem*                              ItemToView;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyDisplayManagerBP_C_ShowItem) == 0x000008, "Wrong alignment on PartyDisplayManagerBP_C_ShowItem");
static_assert(sizeof(PartyDisplayManagerBP_C_ShowItem) == 0x000008, "Wrong size on PartyDisplayManagerBP_C_ShowItem");
static_assert(offsetof(PartyDisplayManagerBP_C_ShowItem, ItemToView) == 0x000000, "Member 'PartyDisplayManagerBP_C_ShowItem::ItemToView' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.ResetVisuals
// 0x0001 (0x0001 - 0x0000)
struct PartyDisplayManagerBP_C_ResetVisuals final
{
public:
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyDisplayManagerBP_C_ResetVisuals) == 0x000001, "Wrong alignment on PartyDisplayManagerBP_C_ResetVisuals");
static_assert(sizeof(PartyDisplayManagerBP_C_ResetVisuals) == 0x000001, "Wrong size on PartyDisplayManagerBP_C_ResetVisuals");
static_assert(offsetof(PartyDisplayManagerBP_C_ResetVisuals, CallFunc_SetStaticMesh_ReturnValue) == 0x000000, "Member 'PartyDisplayManagerBP_C_ResetVisuals::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.SetupSkeletalMeshVisuals
// 0x00C0 (0x00C0 - 0x0000)
struct PartyDisplayManagerBP_C_SetupSkeletalMeshVisuals final
{
public:
	class USkeletalMesh*                          NewMesh;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionToShow_ItemDefinition;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0040(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PartyDisplayManagerBP_C_SetupSkeletalMeshVisuals) == 0x000010, "Wrong alignment on PartyDisplayManagerBP_C_SetupSkeletalMeshVisuals");
static_assert(sizeof(PartyDisplayManagerBP_C_SetupSkeletalMeshVisuals) == 0x0000C0, "Wrong size on PartyDisplayManagerBP_C_SetupSkeletalMeshVisuals");
static_assert(offsetof(PartyDisplayManagerBP_C_SetupSkeletalMeshVisuals, NewMesh) == 0x000000, "Member 'PartyDisplayManagerBP_C_SetupSkeletalMeshVisuals::NewMesh' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetupSkeletalMeshVisuals, CallFunc_GetItemDefinitionToShow_ItemDefinition) == 0x000008, "Member 'PartyDisplayManagerBP_C_SetupSkeletalMeshVisuals::CallFunc_GetItemDefinitionToShow_ItemDefinition' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetupSkeletalMeshVisuals, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'PartyDisplayManagerBP_C_SetupSkeletalMeshVisuals::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetupSkeletalMeshVisuals, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000040, "Member 'PartyDisplayManagerBP_C_SetupSkeletalMeshVisuals::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.SetupStaticMeshVisuals
// 0x00D0 (0x00D0 - 0x0000)
struct PartyDisplayManagerBP_C_SetupStaticMeshVisuals final
{
public:
	class UStaticMesh*                            NewMesh;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionToShow_ItemDefinition;   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0040(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyDisplayManagerBP_C_SetupStaticMeshVisuals) == 0x000010, "Wrong alignment on PartyDisplayManagerBP_C_SetupStaticMeshVisuals");
static_assert(sizeof(PartyDisplayManagerBP_C_SetupStaticMeshVisuals) == 0x0000D0, "Wrong size on PartyDisplayManagerBP_C_SetupStaticMeshVisuals");
static_assert(offsetof(PartyDisplayManagerBP_C_SetupStaticMeshVisuals, NewMesh) == 0x000000, "Member 'PartyDisplayManagerBP_C_SetupStaticMeshVisuals::NewMesh' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetupStaticMeshVisuals, CallFunc_GetItemDefinitionToShow_ItemDefinition) == 0x000008, "Member 'PartyDisplayManagerBP_C_SetupStaticMeshVisuals::CallFunc_GetItemDefinitionToShow_ItemDefinition' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetupStaticMeshVisuals, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'PartyDisplayManagerBP_C_SetupStaticMeshVisuals::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetupStaticMeshVisuals, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000040, "Member 'PartyDisplayManagerBP_C_SetupStaticMeshVisuals::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetupStaticMeshVisuals, CallFunc_SetStaticMesh_ReturnValue) == 0x0000C0, "Member 'PartyDisplayManagerBP_C_SetupStaticMeshVisuals::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.GetPreviewMeshWorldTransform
// 0x0150 (0x0150 - 0x0000)
struct PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
	float                                         Temp_float_Variable;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionToShow_ItemDefinition;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0xF];                                       // 0x0041(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetItemPreviewOffset_ReturnValue;         // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetWeaponPlacementTransform_ReturnValue;  // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Select_Default;                             // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00B4(0x000C)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x00F0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue2;           // 0x0120(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform) == 0x000010, "Wrong alignment on PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform");
static_assert(sizeof(PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform) == 0x000150, "Wrong size on PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform");
static_assert(offsetof(PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform, ReturnValue) == 0x000000, "Member 'PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform::ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform, Temp_float_Variable) == 0x000030, "Member 'PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform, Temp_bool_Variable) == 0x000034, "Member 'PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform, CallFunc_GetItemDefinitionToShow_ItemDefinition) == 0x000038, "Member 'PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform::CallFunc_GetItemDefinitionToShow_ItemDefinition' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform, CallFunc_GetItemPreviewOffset_ReturnValue) == 0x000050, "Member 'PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform::CallFunc_GetItemPreviewOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform, CallFunc_GetWeaponPlacementTransform_ReturnValue) == 0x000080, "Member 'PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform::CallFunc_GetWeaponPlacementTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform, K2Node_Select_Default) == 0x0000B0, "Member 'PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform, CallFunc_MakeRotator_ReturnValue) == 0x0000B4, "Member 'PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform, CallFunc_MakeTransform_ReturnValue) == 0x0000C0, "Member 'PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform, CallFunc_ComposeTransforms_ReturnValue) == 0x0000F0, "Member 'PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform, CallFunc_ComposeTransforms_ReturnValue2) == 0x000120, "Member 'PartyDisplayManagerBP_C_GetPreviewMeshWorldTransform::CallFunc_ComposeTransforms_ReturnValue2' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.GetItemPreviewOffset
// 0x01D0 (0x01D0 - 0x0000)
struct PartyDisplayManagerBP_C_GetItemPreviewOffset final
{
public:
	class UFortItemDefinition*                    ItemDefinition;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x0010(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0xF];                                       // 0x0041(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetPreviewMeshOffset_ReturnValue;         // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00B0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00BC(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00C8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue2;     // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_RotatorRotator_ReturnValue;    // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Select_Default;                             // 0x00E0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location2;                 // 0x0110(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation2;                 // 0x011C(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale2;                    // 0x0128(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0xC];                                      // 0x0134(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue2;               // 0x0140(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue3;               // 0x0170(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x01A0(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyDisplayManagerBP_C_GetItemPreviewOffset) == 0x000010, "Wrong alignment on PartyDisplayManagerBP_C_GetItemPreviewOffset");
static_assert(sizeof(PartyDisplayManagerBP_C_GetItemPreviewOffset) == 0x0001D0, "Wrong size on PartyDisplayManagerBP_C_GetItemPreviewOffset");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemPreviewOffset, ItemDefinition) == 0x000000, "Member 'PartyDisplayManagerBP_C_GetItemPreviewOffset::ItemDefinition' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemPreviewOffset, ReturnValue) == 0x000010, "Member 'PartyDisplayManagerBP_C_GetItemPreviewOffset::ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemPreviewOffset, Temp_bool_Variable) == 0x000040, "Member 'PartyDisplayManagerBP_C_GetItemPreviewOffset::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemPreviewOffset, CallFunc_GetPreviewMeshOffset_ReturnValue) == 0x000050, "Member 'PartyDisplayManagerBP_C_GetItemPreviewOffset::CallFunc_GetPreviewMeshOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemPreviewOffset, CallFunc_MakeTransform_ReturnValue) == 0x000080, "Member 'PartyDisplayManagerBP_C_GetItemPreviewOffset::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemPreviewOffset, CallFunc_BreakTransform_Location) == 0x0000B0, "Member 'PartyDisplayManagerBP_C_GetItemPreviewOffset::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemPreviewOffset, CallFunc_BreakTransform_Rotation) == 0x0000BC, "Member 'PartyDisplayManagerBP_C_GetItemPreviewOffset::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemPreviewOffset, CallFunc_BreakTransform_Scale) == 0x0000C8, "Member 'PartyDisplayManagerBP_C_GetItemPreviewOffset::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemPreviewOffset, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x0000D4, "Member 'PartyDisplayManagerBP_C_GetItemPreviewOffset::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemPreviewOffset, CallFunc_EqualEqual_VectorVector_ReturnValue2) == 0x0000D5, "Member 'PartyDisplayManagerBP_C_GetItemPreviewOffset::CallFunc_EqualEqual_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemPreviewOffset, CallFunc_EqualEqual_RotatorRotator_ReturnValue) == 0x0000D6, "Member 'PartyDisplayManagerBP_C_GetItemPreviewOffset::CallFunc_EqualEqual_RotatorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemPreviewOffset, CallFunc_BooleanAND_ReturnValue) == 0x0000D7, "Member 'PartyDisplayManagerBP_C_GetItemPreviewOffset::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemPreviewOffset, CallFunc_BooleanAND_ReturnValue2) == 0x0000D8, "Member 'PartyDisplayManagerBP_C_GetItemPreviewOffset::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemPreviewOffset, K2Node_Select_Default) == 0x0000E0, "Member 'PartyDisplayManagerBP_C_GetItemPreviewOffset::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemPreviewOffset, CallFunc_BreakTransform_Location2) == 0x000110, "Member 'PartyDisplayManagerBP_C_GetItemPreviewOffset::CallFunc_BreakTransform_Location2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemPreviewOffset, CallFunc_BreakTransform_Rotation2) == 0x00011C, "Member 'PartyDisplayManagerBP_C_GetItemPreviewOffset::CallFunc_BreakTransform_Rotation2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemPreviewOffset, CallFunc_BreakTransform_Scale2) == 0x000128, "Member 'PartyDisplayManagerBP_C_GetItemPreviewOffset::CallFunc_BreakTransform_Scale2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemPreviewOffset, CallFunc_MakeTransform_ReturnValue2) == 0x000140, "Member 'PartyDisplayManagerBP_C_GetItemPreviewOffset::CallFunc_MakeTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemPreviewOffset, CallFunc_MakeTransform_ReturnValue3) == 0x000170, "Member 'PartyDisplayManagerBP_C_GetItemPreviewOffset::CallFunc_MakeTransform_ReturnValue3' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetItemPreviewOffset, CallFunc_ComposeTransforms_ReturnValue) == 0x0001A0, "Member 'PartyDisplayManagerBP_C_GetItemPreviewOffset::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.UpdatePreviewMeshTransforms
// 0x00C0 (0x00C0 - 0x0000)
struct PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms final
{
public:
	struct FTransform                             CallFunc_GetPreviewMeshWorldTransform_ReturnValue; // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0030(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Percent_FloatFloat_ReturnValue;           // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms) == 0x000010, "Wrong alignment on PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms");
static_assert(sizeof(PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms) == 0x0000C0, "Wrong size on PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms");
static_assert(offsetof(PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms, CallFunc_GetPreviewMeshWorldTransform_ReturnValue) == 0x000000, "Member 'PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms::CallFunc_GetPreviewMeshWorldTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000030, "Member 'PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000B0, "Member 'PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms, CallFunc_Percent_FloatFloat_ReturnValue) == 0x0000B4, "Member 'PartyDisplayManagerBP_C_UpdatePreviewMeshTransforms::CallFunc_Percent_FloatFloat_ReturnValue' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.GetWeaponPlacementTransform
// 0x0100 (0x0100 - 0x0000)
struct PartyDisplayManagerBP_C_GetWeaponPlacementTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0xF];                                       // 0x0091(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue2;                // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_ComposeTransforms_ReturnValue;            // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyDisplayManagerBP_C_GetWeaponPlacementTransform) == 0x000010, "Wrong alignment on PartyDisplayManagerBP_C_GetWeaponPlacementTransform");
static_assert(sizeof(PartyDisplayManagerBP_C_GetWeaponPlacementTransform) == 0x000100, "Wrong size on PartyDisplayManagerBP_C_GetWeaponPlacementTransform");
static_assert(offsetof(PartyDisplayManagerBP_C_GetWeaponPlacementTransform, ReturnValue) == 0x000000, "Member 'PartyDisplayManagerBP_C_GetWeaponPlacementTransform::ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetWeaponPlacementTransform, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'PartyDisplayManagerBP_C_GetWeaponPlacementTransform::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetWeaponPlacementTransform, CallFunc_GetTransform_ReturnValue) == 0x000060, "Member 'PartyDisplayManagerBP_C_GetWeaponPlacementTransform::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetWeaponPlacementTransform, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'PartyDisplayManagerBP_C_GetWeaponPlacementTransform::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetWeaponPlacementTransform, CallFunc_GetTransform_ReturnValue2) == 0x0000A0, "Member 'PartyDisplayManagerBP_C_GetWeaponPlacementTransform::CallFunc_GetTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_GetWeaponPlacementTransform, CallFunc_ComposeTransforms_ReturnValue) == 0x0000D0, "Member 'PartyDisplayManagerBP_C_GetWeaponPlacementTransform::CallFunc_ComposeTransforms_ReturnValue' has a wrong offset!");

// Function PartyDisplayManagerBP.PartyDisplayManagerBP_C.SetUIOverrideVisuals
// 0x00D0 (0x00D0 - 0x0000)
struct PartyDisplayManagerBP_C_SetUIOverrideVisuals final
{
public:
	class UTexture2D*                             Large_Texture;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    Item;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   Rarity;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x0018(0x0080)()
	class FString                                 CallFunc_GetPersistentName_ReturnValue;            // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue;                // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindSubstring_ReturnValue2;               // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindSubstring_ReturnValue3;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue2;              // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue3;              // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FindSubstring_ReturnValue4;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue4;              // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyDisplayManagerBP_C_SetUIOverrideVisuals) == 0x000008, "Wrong alignment on PartyDisplayManagerBP_C_SetUIOverrideVisuals");
static_assert(sizeof(PartyDisplayManagerBP_C_SetUIOverrideVisuals) == 0x0000D0, "Wrong size on PartyDisplayManagerBP_C_SetUIOverrideVisuals");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, Large_Texture) == 0x000000, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::Large_Texture' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, Item) == 0x000008, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::Item' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, Rarity) == 0x000010, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::Rarity' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_BPGetRarityData_ReturnValue) == 0x000018, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_GetPersistentName_ReturnValue) == 0x000098, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_GetPersistentName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_FindSubstring_ReturnValue) == 0x0000A8, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_FindSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0000B0, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_Conv_IntToBool_ReturnValue) == 0x0000B8, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_FindSubstring_ReturnValue2) == 0x0000BC, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_FindSubstring_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PartyDisplayManagerBP_C_SetUIOverrideVisuals, CallFunc_FindSubstring_ReturnValue3) == 0x0000C0, "Member 'PartyDisplayManagerBP_C_SetUIOverrideVisuals::CallFunc_FindSubstring_ReturnValue3' has a wrong offset!");
