#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PartyFinder

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Party_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function PartyFinder.PartyFinder_C.ExecuteUbergraph_PartyFinder
// 0x01B0 (0x01B0 - 0x0000)
struct PartyFinder_C_ExecuteUbergraph_PartyFinder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button5;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPartyState                            K2Node_CustomEvent_PartyData;                      // 0x0028(0x0010)(ConstParm)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue2;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button4;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button3;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue3;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue4;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortSocialItem*>                CallFunc_GetSocialItemCategories_OutSocialCategoryItems; // 0x0080(0x0010)(ZeroConstructor, ReferenceParm)
	EFortDialogResult                             K2Node_CustomEvent_Result;                         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName;                     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate2;             // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected;            // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetSelectedItem_ReturnValue;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSocialItem*                        K2Node_DynamicCast_AsFort_Social_Item;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSocialItem*                        K2Node_DynamicCast_AsFort_Social_Item2;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetSelectedItem_ReturnValue2;             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetSelectedItem_ReturnValue3;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSocialItem*                        K2Node_DynamicCast_AsFort_Social_Item3;            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_123[0x5];                                      // 0x0123(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortSocialItem*>                K2Node_CustomEvent_SocialItems;                    // 0x0128(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetSelectedItem_ReturnValue4;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSocialItem*                        K2Node_DynamicCast_AsFort_Social_Item4;            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetUniquePlayerId_ReturnValue;            // 0x0168(0x0028)(HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue2;          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_ComponentBoundEvent_Widget;                 // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue5;                  // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumPlayersInLocalParty_ReturnValue;    // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyFinder_C_ExecuteUbergraph_PartyFinder) == 0x000008, "Wrong alignment on PartyFinder_C_ExecuteUbergraph_PartyFinder");
static_assert(sizeof(PartyFinder_C_ExecuteUbergraph_PartyFinder) == 0x0001B0, "Wrong size on PartyFinder_C_ExecuteUbergraph_PartyFinder");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, EntryPoint) == 0x000000, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::EntryPoint' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, K2Node_ComponentBoundEvent_Button5) == 0x000020, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::K2Node_ComponentBoundEvent_Button5' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, K2Node_CustomEvent_PartyData) == 0x000028, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::K2Node_CustomEvent_PartyData' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, CallFunc_GetContext_ReturnValue) == 0x000038, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, CallFunc_GetContext_ReturnValue2) == 0x000040, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, K2Node_ComponentBoundEvent_Button4) == 0x000048, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::K2Node_ComponentBoundEvent_Button4' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, K2Node_ComponentBoundEvent_Button3) == 0x000050, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::K2Node_ComponentBoundEvent_Button3' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, CallFunc_GetContext_ReturnValue3) == 0x000058, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, Temp_byte_Variable) == 0x000060, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, Temp_name_Variable) == 0x000068, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, K2Node_SwitchEnum_CmpSuccess) == 0x000070, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, CallFunc_GetContext_ReturnValue4) == 0x000078, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, CallFunc_GetSocialItemCategories_OutSocialCategoryItems) == 0x000080, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::CallFunc_GetSocialItemCategories_OutSocialCategoryItems' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, K2Node_CustomEvent_Result) == 0x000090, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, K2Node_CustomEvent_ResultName) == 0x000098, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::K2Node_CustomEvent_ResultName' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue) == 0x0000A0, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::CallFunc_ShowSimpleConfirmationDialog_NUI_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, K2Node_ComponentBoundEvent_Button2) == 0x0000B0, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, K2Node_CreateDelegate_OutputDelegate2) == 0x0000B8, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, CallFunc_GetUINavigationManager_ReturnValue) == 0x0000C8, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, K2Node_ComponentBoundEvent_Item) == 0x0000D0, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, K2Node_ComponentBoundEvent_bIsSelected) == 0x0000D8, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::K2Node_ComponentBoundEvent_bIsSelected' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, CallFunc_GetSelectedItem_ReturnValue) == 0x0000E0, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::CallFunc_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, K2Node_DynamicCast_AsFort_Social_Item) == 0x0000E8, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::K2Node_DynamicCast_AsFort_Social_Item' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, K2Node_DynamicCast_AsFort_Social_Item2) == 0x0000F8, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::K2Node_DynamicCast_AsFort_Social_Item2' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, K2Node_DynamicCast_bSuccess2) == 0x000100, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, CallFunc_GetSelectedItem_ReturnValue2) == 0x000108, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::CallFunc_GetSelectedItem_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, CallFunc_GetSelectedItem_ReturnValue3) == 0x000110, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::CallFunc_GetSelectedItem_ReturnValue3' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, K2Node_DynamicCast_AsFort_Social_Item3) == 0x000118, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::K2Node_DynamicCast_AsFort_Social_Item3' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, K2Node_DynamicCast_bSuccess3) == 0x000120, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000121, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000122, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, K2Node_CustomEvent_SocialItems) == 0x000128, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::K2Node_CustomEvent_SocialItems' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, CallFunc_BooleanOR_ReturnValue) == 0x000138, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, K2Node_ComponentBoundEvent_Button) == 0x000140, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, CallFunc_GetSelectedItem_ReturnValue4) == 0x000148, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::CallFunc_GetSelectedItem_ReturnValue4' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, K2Node_DynamicCast_AsFort_Social_Item4) == 0x000150, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::K2Node_DynamicCast_AsFort_Social_Item4' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, K2Node_DynamicCast_bSuccess4) == 0x000158, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000160, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, CallFunc_GetUniquePlayerId_ReturnValue) == 0x000168, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::CallFunc_GetUniquePlayerId_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, CallFunc_GetUIManagerWidget_ReturnValue2) == 0x000190, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::CallFunc_GetUIManagerWidget_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, K2Node_ComponentBoundEvent_Widget) == 0x000198, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, CallFunc_GetContext_ReturnValue5) == 0x0001A0, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::CallFunc_GetContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, CallFunc_GetNumPlayersInLocalParty_ReturnValue) == 0x0001A8, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::CallFunc_GetNumPlayersInLocalParty_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_ExecuteUbergraph_PartyFinder, CallFunc_Greater_IntInt_ReturnValue) == 0x0001AC, "Member 'PartyFinder_C_ExecuteUbergraph_PartyFinder::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function PartyFinder.PartyFinder_C.BndEvt__SocialTreeView_K2Node_ComponentBoundEvent_0_OnListViewItemWidgetCreated__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PartyFinder_C_BndEvt__SocialTreeView_K2Node_ComponentBoundEvent_0_OnListViewItemWidgetCreated__DelegateSignature final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyFinder_C_BndEvt__SocialTreeView_K2Node_ComponentBoundEvent_0_OnListViewItemWidgetCreated__DelegateSignature) == 0x000008, "Wrong alignment on PartyFinder_C_BndEvt__SocialTreeView_K2Node_ComponentBoundEvent_0_OnListViewItemWidgetCreated__DelegateSignature");
static_assert(sizeof(PartyFinder_C_BndEvt__SocialTreeView_K2Node_ComponentBoundEvent_0_OnListViewItemWidgetCreated__DelegateSignature) == 0x000008, "Wrong size on PartyFinder_C_BndEvt__SocialTreeView_K2Node_ComponentBoundEvent_0_OnListViewItemWidgetCreated__DelegateSignature");
static_assert(offsetof(PartyFinder_C_BndEvt__SocialTreeView_K2Node_ComponentBoundEvent_0_OnListViewItemWidgetCreated__DelegateSignature, Widget) == 0x000000, "Member 'PartyFinder_C_BndEvt__SocialTreeView_K2Node_ComponentBoundEvent_0_OnListViewItemWidgetCreated__DelegateSignature::Widget' has a wrong offset!");

// Function PartyFinder.PartyFinder_C.BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PartyFinder_C_BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyFinder_C_BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on PartyFinder_C_BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(PartyFinder_C_BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on PartyFinder_C_BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(PartyFinder_C_BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'PartyFinder_C_BndEvt__ViewProfileButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function PartyFinder.PartyFinder_C.OnSocialListChanged
// 0x0010 (0x0010 - 0x0000)
struct PartyFinder_C_OnSocialListChanged final
{
public:
	TArray<class UFortSocialItem*>                SocialItems;                                       // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(PartyFinder_C_OnSocialListChanged) == 0x000008, "Wrong alignment on PartyFinder_C_OnSocialListChanged");
static_assert(sizeof(PartyFinder_C_OnSocialListChanged) == 0x000010, "Wrong size on PartyFinder_C_OnSocialListChanged");
static_assert(offsetof(PartyFinder_C_OnSocialListChanged, SocialItems) == 0x000000, "Member 'PartyFinder_C_OnSocialListChanged::SocialItems' has a wrong offset!");

// Function PartyFinder.PartyFinder_C.BndEvt__SocialTreeView_K2Node_ComponentBoundEvent_256_OnListViewItemSelected__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct PartyFinder_C_BndEvt__SocialTreeView_K2Node_ComponentBoundEvent_256_OnListViewItemSelected__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyFinder_C_BndEvt__SocialTreeView_K2Node_ComponentBoundEvent_256_OnListViewItemSelected__DelegateSignature) == 0x000008, "Wrong alignment on PartyFinder_C_BndEvt__SocialTreeView_K2Node_ComponentBoundEvent_256_OnListViewItemSelected__DelegateSignature");
static_assert(sizeof(PartyFinder_C_BndEvt__SocialTreeView_K2Node_ComponentBoundEvent_256_OnListViewItemSelected__DelegateSignature) == 0x000010, "Wrong size on PartyFinder_C_BndEvt__SocialTreeView_K2Node_ComponentBoundEvent_256_OnListViewItemSelected__DelegateSignature");
static_assert(offsetof(PartyFinder_C_BndEvt__SocialTreeView_K2Node_ComponentBoundEvent_256_OnListViewItemSelected__DelegateSignature, Item) == 0x000000, "Member 'PartyFinder_C_BndEvt__SocialTreeView_K2Node_ComponentBoundEvent_256_OnListViewItemSelected__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_BndEvt__SocialTreeView_K2Node_ComponentBoundEvent_256_OnListViewItemSelected__DelegateSignature, bIsSelected) == 0x000008, "Member 'PartyFinder_C_BndEvt__SocialTreeView_K2Node_ComponentBoundEvent_256_OnListViewItemSelected__DelegateSignature::bIsSelected' has a wrong offset!");

// Function PartyFinder.PartyFinder_C.BndEvt__IconTextButton_K2Node_ComponentBoundEvent_99_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PartyFinder_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_99_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyFinder_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_99_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on PartyFinder_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_99_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(PartyFinder_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_99_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on PartyFinder_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_99_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(PartyFinder_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_99_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'PartyFinder_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_99_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function PartyFinder.PartyFinder_C.BndEvt__IgnoreButton_K2Node_ComponentBoundEvent_31_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PartyFinder_C_BndEvt__IgnoreButton_K2Node_ComponentBoundEvent_31_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyFinder_C_BndEvt__IgnoreButton_K2Node_ComponentBoundEvent_31_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on PartyFinder_C_BndEvt__IgnoreButton_K2Node_ComponentBoundEvent_31_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(PartyFinder_C_BndEvt__IgnoreButton_K2Node_ComponentBoundEvent_31_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on PartyFinder_C_BndEvt__IgnoreButton_K2Node_ComponentBoundEvent_31_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(PartyFinder_C_BndEvt__IgnoreButton_K2Node_ComponentBoundEvent_31_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'PartyFinder_C_BndEvt__IgnoreButton_K2Node_ComponentBoundEvent_31_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function PartyFinder.PartyFinder_C.BndEvt__InviteButton_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PartyFinder_C_BndEvt__InviteButton_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyFinder_C_BndEvt__InviteButton_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on PartyFinder_C_BndEvt__InviteButton_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(PartyFinder_C_BndEvt__InviteButton_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on PartyFinder_C_BndEvt__InviteButton_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(PartyFinder_C_BndEvt__InviteButton_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'PartyFinder_C_BndEvt__InviteButton_K2Node_ComponentBoundEvent_15_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function PartyFinder.PartyFinder_C.HandlePartyDataChanged
// 0x0010 (0x0010 - 0x0000)
struct PartyFinder_C_HandlePartyDataChanged final
{
public:
	struct FPartyState                            PartyData;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PartyFinder_C_HandlePartyDataChanged) == 0x000008, "Wrong alignment on PartyFinder_C_HandlePartyDataChanged");
static_assert(sizeof(PartyFinder_C_HandlePartyDataChanged) == 0x000010, "Wrong size on PartyFinder_C_HandlePartyDataChanged");
static_assert(offsetof(PartyFinder_C_HandlePartyDataChanged, PartyData) == 0x000000, "Member 'PartyFinder_C_HandlePartyDataChanged::PartyData' has a wrong offset!");

// Function PartyFinder.PartyFinder_C.BndEvt__IconTextButton_1_K2Node_ComponentBoundEvent_49_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PartyFinder_C_BndEvt__IconTextButton_1_K2Node_ComponentBoundEvent_49_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyFinder_C_BndEvt__IconTextButton_1_K2Node_ComponentBoundEvent_49_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on PartyFinder_C_BndEvt__IconTextButton_1_K2Node_ComponentBoundEvent_49_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(PartyFinder_C_BndEvt__IconTextButton_1_K2Node_ComponentBoundEvent_49_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on PartyFinder_C_BndEvt__IconTextButton_1_K2Node_ComponentBoundEvent_49_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(PartyFinder_C_BndEvt__IconTextButton_1_K2Node_ComponentBoundEvent_49_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'PartyFinder_C_BndEvt__IconTextButton_1_K2Node_ComponentBoundEvent_49_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function PartyFinder.PartyFinder_C.DialogResult_9763B6F5495998E5B2E944A5F646709C
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) PartyFinder_C_DialogResult_9763B6F5495998E5B2E944A5F646709C final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyFinder_C_DialogResult_9763B6F5495998E5B2E944A5F646709C) == 0x000008, "Wrong alignment on PartyFinder_C_DialogResult_9763B6F5495998E5B2E944A5F646709C");
static_assert(sizeof(PartyFinder_C_DialogResult_9763B6F5495998E5B2E944A5F646709C) == 0x000010, "Wrong size on PartyFinder_C_DialogResult_9763B6F5495998E5B2E944A5F646709C");
static_assert(offsetof(PartyFinder_C_DialogResult_9763B6F5495998E5B2E944A5F646709C, Result) == 0x000000, "Member 'PartyFinder_C_DialogResult_9763B6F5495998E5B2E944A5F646709C::Result' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_DialogResult_9763B6F5495998E5B2E944A5F646709C, ResultName) == 0x000008, "Member 'PartyFinder_C_DialogResult_9763B6F5495998E5B2E944A5F646709C::ResultName' has a wrong offset!");

// Function PartyFinder.PartyFinder_C.BindDelegates
// 0x0048 (0x0048 - 0x0000)
struct PartyFinder_C_BindDelegates final
{
public:
	TDelegate<void(struct FPartyState& PartyData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(struct FUniqueNetIdRepl& FriendId)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EFortPartyTransition PartyTransition)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(TArray<class UFortSocialItem*>& SocialItems)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyFinder_C_BindDelegates) == 0x000008, "Wrong alignment on PartyFinder_C_BindDelegates");
static_assert(sizeof(PartyFinder_C_BindDelegates) == 0x000048, "Wrong size on PartyFinder_C_BindDelegates");
static_assert(offsetof(PartyFinder_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'PartyFinder_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate2) == 0x000010, "Member 'PartyFinder_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate3) == 0x000020, "Member 'PartyFinder_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_BindDelegates, K2Node_CreateDelegate_OutputDelegate4) == 0x000030, "Member 'PartyFinder_C_BindDelegates::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_BindDelegates, CallFunc_GetContext_ReturnValue) == 0x000040, "Member 'PartyFinder_C_BindDelegates::CallFunc_GetContext_ReturnValue' has a wrong offset!");

// Function PartyFinder.PartyFinder_C.HandlePartyTransitionStarted
// 0x0002 (0x0002 - 0x0000)
struct PartyFinder_C_HandlePartyTransitionStarted final
{
public:
	EFortPartyTransition                          Transition;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyFinder_C_HandlePartyTransitionStarted) == 0x000001, "Wrong alignment on PartyFinder_C_HandlePartyTransitionStarted");
static_assert(sizeof(PartyFinder_C_HandlePartyTransitionStarted) == 0x000002, "Wrong size on PartyFinder_C_HandlePartyTransitionStarted");
static_assert(offsetof(PartyFinder_C_HandlePartyTransitionStarted, Transition) == 0x000000, "Member 'PartyFinder_C_HandlePartyTransitionStarted::Transition' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_HandlePartyTransitionStarted, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'PartyFinder_C_HandlePartyTransitionStarted::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function PartyFinder.PartyFinder_C.HandleSocialListChanged
// 0x0040 (0x0040 - 0x0000)
struct PartyFinder_C_HandleSocialListChanged final
{
public:
	TArray<class UFortSocialItem*>                SocialItems;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          bExpandAll;                                        // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSocialItem*                        CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSocialItem*                        CallFunc_Array_Get_Item2;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyFinder_C_HandleSocialListChanged) == 0x000008, "Wrong alignment on PartyFinder_C_HandleSocialListChanged");
static_assert(sizeof(PartyFinder_C_HandleSocialListChanged) == 0x000040, "Wrong size on PartyFinder_C_HandleSocialListChanged");
static_assert(offsetof(PartyFinder_C_HandleSocialListChanged, SocialItems) == 0x000000, "Member 'PartyFinder_C_HandleSocialListChanged::SocialItems' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_HandleSocialListChanged, bExpandAll) == 0x000010, "Member 'PartyFinder_C_HandleSocialListChanged::bExpandAll' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_HandleSocialListChanged, Temp_int_Array_Index_Variable) == 0x000014, "Member 'PartyFinder_C_HandleSocialListChanged::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_HandleSocialListChanged, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'PartyFinder_C_HandleSocialListChanged::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_HandleSocialListChanged, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'PartyFinder_C_HandleSocialListChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_HandleSocialListChanged, CallFunc_Array_Get_Item) == 0x000020, "Member 'PartyFinder_C_HandleSocialListChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_HandleSocialListChanged, CallFunc_Array_Get_Item2) == 0x000028, "Member 'PartyFinder_C_HandleSocialListChanged::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_HandleSocialListChanged, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'PartyFinder_C_HandleSocialListChanged::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_HandleSocialListChanged, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'PartyFinder_C_HandleSocialListChanged::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_HandleSocialListChanged, CallFunc_Array_Length_ReturnValue2) == 0x000038, "Member 'PartyFinder_C_HandleSocialListChanged::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_HandleSocialListChanged, CallFunc_Greater_IntInt_ReturnValue) == 0x00003C, "Member 'PartyFinder_C_HandleSocialListChanged::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function PartyFinder.PartyFinder_C.UpdateDetails
// 0x0058 (0x0058 - 0x0000)
struct PartyFinder_C_UpdateDetails final
{
public:
	class UFortSocialItem*                        PartyFinderItem;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortSocialItemType                           SocialItemType;                                    // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSocialItem*                        LocalPartyFinderItem;                              // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortSocialItemType                           Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortSocialItemType                           Temp_byte_Variable2;                               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetFinderItemVisibility_ReturnValue;      // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue2;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetFinderItemVisibility_ReturnValue2;     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortPartyRestriction                         CallFunc_CanBeJoined_FailReason;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBeJoined_ReturnValue;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortPartyRestriction                         CallFunc_CanBeInvited_FailReason;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanBeInvited_ReturnValue;                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyFinder_C_UpdateDetails) == 0x000008, "Wrong alignment on PartyFinder_C_UpdateDetails");
static_assert(sizeof(PartyFinder_C_UpdateDetails) == 0x000058, "Wrong size on PartyFinder_C_UpdateDetails");
static_assert(offsetof(PartyFinder_C_UpdateDetails, PartyFinderItem) == 0x000000, "Member 'PartyFinder_C_UpdateDetails::PartyFinderItem' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_UpdateDetails, SocialItemType) == 0x000008, "Member 'PartyFinder_C_UpdateDetails::SocialItemType' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_UpdateDetails, LocalPartyFinderItem) == 0x000010, "Member 'PartyFinder_C_UpdateDetails::LocalPartyFinderItem' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_UpdateDetails, Temp_byte_Variable) == 0x000018, "Member 'PartyFinder_C_UpdateDetails::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_UpdateDetails, Temp_object_Variable) == 0x000020, "Member 'PartyFinder_C_UpdateDetails::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_UpdateDetails, CallFunc_GetContext_ReturnValue) == 0x000028, "Member 'PartyFinder_C_UpdateDetails::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_UpdateDetails, Temp_byte_Variable2) == 0x000030, "Member 'PartyFinder_C_UpdateDetails::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_UpdateDetails, Temp_byte_Variable3) == 0x000031, "Member 'PartyFinder_C_UpdateDetails::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_UpdateDetails, Temp_byte_Variable4) == 0x000032, "Member 'PartyFinder_C_UpdateDetails::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_UpdateDetails, Temp_byte_Variable5) == 0x000033, "Member 'PartyFinder_C_UpdateDetails::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_UpdateDetails, Temp_byte_Variable6) == 0x000034, "Member 'PartyFinder_C_UpdateDetails::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_UpdateDetails, CallFunc_GetFinderItemVisibility_ReturnValue) == 0x000035, "Member 'PartyFinder_C_UpdateDetails::CallFunc_GetFinderItemVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_UpdateDetails, CallFunc_GetContext_ReturnValue2) == 0x000038, "Member 'PartyFinder_C_UpdateDetails::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_UpdateDetails, CallFunc_GetFinderItemVisibility_ReturnValue2) == 0x000040, "Member 'PartyFinder_C_UpdateDetails::CallFunc_GetFinderItemVisibility_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_UpdateDetails, CallFunc_CanBeJoined_FailReason) == 0x000041, "Member 'PartyFinder_C_UpdateDetails::CallFunc_CanBeJoined_FailReason' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_UpdateDetails, CallFunc_CanBeJoined_ReturnValue) == 0x000042, "Member 'PartyFinder_C_UpdateDetails::CallFunc_CanBeJoined_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_UpdateDetails, K2Node_Select_Default) == 0x000048, "Member 'PartyFinder_C_UpdateDetails::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_UpdateDetails, CallFunc_CanBeInvited_FailReason) == 0x000050, "Member 'PartyFinder_C_UpdateDetails::CallFunc_CanBeInvited_FailReason' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_UpdateDetails, CallFunc_CanBeInvited_ReturnValue) == 0x000051, "Member 'PartyFinder_C_UpdateDetails::CallFunc_CanBeInvited_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_UpdateDetails, K2Node_Select2_Default) == 0x000052, "Member 'PartyFinder_C_UpdateDetails::K2Node_Select2_Default' has a wrong offset!");

// Function PartyFinder.PartyFinder_C.GetFinderItemVisibility
// 0x0010 (0x0010 - 0x0000)
struct PartyFinder_C_GetFinderItemVisibility final
{
public:
	class UFortSocialItem*                        PartyFinderItem;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PartyFinder_C_GetFinderItemVisibility) == 0x000008, "Wrong alignment on PartyFinder_C_GetFinderItemVisibility");
static_assert(sizeof(PartyFinder_C_GetFinderItemVisibility) == 0x000010, "Wrong size on PartyFinder_C_GetFinderItemVisibility");
static_assert(offsetof(PartyFinder_C_GetFinderItemVisibility, PartyFinderItem) == 0x000000, "Member 'PartyFinder_C_GetFinderItemVisibility::PartyFinderItem' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_GetFinderItemVisibility, ReturnValue) == 0x000008, "Member 'PartyFinder_C_GetFinderItemVisibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_GetFinderItemVisibility, Temp_bool_Variable) == 0x000009, "Member 'PartyFinder_C_GetFinderItemVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_GetFinderItemVisibility, Temp_byte_Variable) == 0x00000A, "Member 'PartyFinder_C_GetFinderItemVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_GetFinderItemVisibility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000B, "Member 'PartyFinder_C_GetFinderItemVisibility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_GetFinderItemVisibility, Temp_byte_Variable2) == 0x00000C, "Member 'PartyFinder_C_GetFinderItemVisibility::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_GetFinderItemVisibility, K2Node_Select_Default) == 0x00000D, "Member 'PartyFinder_C_GetFinderItemVisibility::K2Node_Select_Default' has a wrong offset!");

// Function PartyFinder.PartyFinder_C.SendInvite
// 0x0020 (0x0020 - 0x0000)
struct PartyFinder_C_SendInvite final
{
public:
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetSelectedItem_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSocialItem*                        K2Node_DynamicCast_AsFort_Social_Item;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyFinder_C_SendInvite) == 0x000008, "Wrong alignment on PartyFinder_C_SendInvite");
static_assert(sizeof(PartyFinder_C_SendInvite) == 0x000020, "Wrong size on PartyFinder_C_SendInvite");
static_assert(offsetof(PartyFinder_C_SendInvite, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'PartyFinder_C_SendInvite::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_SendInvite, CallFunc_GetSelectedItem_ReturnValue) == 0x000008, "Member 'PartyFinder_C_SendInvite::CallFunc_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_SendInvite, K2Node_DynamicCast_AsFort_Social_Item) == 0x000010, "Member 'PartyFinder_C_SendInvite::K2Node_DynamicCast_AsFort_Social_Item' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_SendInvite, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PartyFinder_C_SendInvite::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_SendInvite, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000019, "Member 'PartyFinder_C_SendInvite::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function PartyFinder.PartyFinder_C.IgnoreInvite
// 0x0020 (0x0020 - 0x0000)
struct PartyFinder_C_IgnoreInvite final
{
public:
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetSelectedItem_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortSocialItem*                        K2Node_DynamicCast_AsFort_Social_Item;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PartyFinder_C_IgnoreInvite) == 0x000008, "Wrong alignment on PartyFinder_C_IgnoreInvite");
static_assert(sizeof(PartyFinder_C_IgnoreInvite) == 0x000020, "Wrong size on PartyFinder_C_IgnoreInvite");
static_assert(offsetof(PartyFinder_C_IgnoreInvite, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'PartyFinder_C_IgnoreInvite::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_IgnoreInvite, CallFunc_GetSelectedItem_ReturnValue) == 0x000008, "Member 'PartyFinder_C_IgnoreInvite::CallFunc_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_IgnoreInvite, K2Node_DynamicCast_AsFort_Social_Item) == 0x000010, "Member 'PartyFinder_C_IgnoreInvite::K2Node_DynamicCast_AsFort_Social_Item' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_IgnoreInvite, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PartyFinder_C_IgnoreInvite::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PartyFinder_C_IgnoreInvite, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000019, "Member 'PartyFinder_C_IgnoreInvite::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function PartyFinder.PartyFinder_C.SocialTreeView_GetChildrenForCategory
// 0x0070 (0x0070 - 0x0000)
struct PartyFinder_C_SocialTreeView_GetChildrenForCategory final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm)
	TArray<class UFortSocialItem*>                SocialItems;                                       // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
