#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PBW_BP_Parent

#include "Basic.hpp"


namespace SDK::Params
{

// Function PBW_BP_Parent.PBW_BP_Parent_C.ExecuteUbergraph_PBW_BP_Parent
// 0x0020 (0x0020 - 0x0000)
struct PBW_BP_Parent_C_ExecuteUbergraph_PBW_BP_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PBW_BP_Parent_C_ExecuteUbergraph_PBW_BP_Parent) == 0x000008, "Wrong alignment on PBW_BP_Parent_C_ExecuteUbergraph_PBW_BP_Parent");
static_assert(sizeof(PBW_BP_Parent_C_ExecuteUbergraph_PBW_BP_Parent) == 0x000020, "Wrong size on PBW_BP_Parent_C_ExecuteUbergraph_PBW_BP_Parent");
static_assert(offsetof(PBW_BP_Parent_C_ExecuteUbergraph_PBW_BP_Parent, EntryPoint) == 0x000000, "Member 'PBW_BP_Parent_C_ExecuteUbergraph_PBW_BP_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(PBW_BP_Parent_C_ExecuteUbergraph_PBW_BP_Parent, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'PBW_BP_Parent_C_ExecuteUbergraph_PBW_BP_Parent::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBW_BP_Parent_C_ExecuteUbergraph_PBW_BP_Parent, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'PBW_BP_Parent_C_ExecuteUbergraph_PBW_BP_Parent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBW_BP_Parent_C_ExecuteUbergraph_PBW_BP_Parent, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'PBW_BP_Parent_C_ExecuteUbergraph_PBW_BP_Parent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBW_BP_Parent_C_ExecuteUbergraph_PBW_BP_Parent, CallFunc_Array_Length_ReturnValue2) == 0x000010, "Member 'PBW_BP_Parent_C_ExecuteUbergraph_PBW_BP_Parent::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PBW_BP_Parent_C_ExecuteUbergraph_PBW_BP_Parent, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000014, "Member 'PBW_BP_Parent_C_ExecuteUbergraph_PBW_BP_Parent::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(PBW_BP_Parent_C_ExecuteUbergraph_PBW_BP_Parent, CallFunc_Array_Get_Item) == 0x000018, "Member 'PBW_BP_Parent_C_ExecuteUbergraph_PBW_BP_Parent::CallFunc_Array_Get_Item' has a wrong offset!");

}

