#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerkTierWidgetNew

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PerkTierWidgetNew.PerkTierWidgetNew_C
// 0x0030 (0x0290 - 0x0260)
class UPerkTierWidgetNew_C final : public UFortPerkTierWidget_NUI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(Transient, DuplicateTransient)
	class UVerticalBox*                           PerkList;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPerkWidget_C*                          PerkWidget;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPerkWidget_C*                          PerkWidget_0;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPerkWidget_C*                          PerkWidget_1;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIncludeName;                                      // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bFirstPerkDone;                                    // 0x0289(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIncludeDescription;                               // 0x028A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	EFortBrushSize                                IconSize;                                          // 0x028B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PerkTierWidgetNew(int32 EntryPoint);
	void OnGeneratePerk(const struct FFortUIPerk& Perk, class UFortPerkWidget_NUI* Param_PerkWidget);
	void Construct();
	void InitializeSettings(bool Param_bIncludeName, bool Param_bIncludeDescription, EFortBrushSize Param_IconSize, const struct FFortUIPerkTier& Param_FortPerkTier);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PerkTierWidgetNew_C">();
	}
	static class UPerkTierWidgetNew_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPerkTierWidgetNew_C>();
	}
};
static_assert(alignof(UPerkTierWidgetNew_C) == 0x000008, "Wrong alignment on UPerkTierWidgetNew_C");
static_assert(sizeof(UPerkTierWidgetNew_C) == 0x000290, "Wrong size on UPerkTierWidgetNew_C");
static_assert(offsetof(UPerkTierWidgetNew_C, UberGraphFrame) == 0x000260, "Member 'UPerkTierWidgetNew_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPerkTierWidgetNew_C, PerkList) == 0x000268, "Member 'UPerkTierWidgetNew_C::PerkList' has a wrong offset!");
static_assert(offsetof(UPerkTierWidgetNew_C, PerkWidget) == 0x000270, "Member 'UPerkTierWidgetNew_C::PerkWidget' has a wrong offset!");
static_assert(offsetof(UPerkTierWidgetNew_C, PerkWidget_0) == 0x000278, "Member 'UPerkTierWidgetNew_C::PerkWidget_0' has a wrong offset!");
static_assert(offsetof(UPerkTierWidgetNew_C, PerkWidget_1) == 0x000280, "Member 'UPerkTierWidgetNew_C::PerkWidget_1' has a wrong offset!");
static_assert(offsetof(UPerkTierWidgetNew_C, bIncludeName) == 0x000288, "Member 'UPerkTierWidgetNew_C::bIncludeName' has a wrong offset!");
static_assert(offsetof(UPerkTierWidgetNew_C, bFirstPerkDone) == 0x000289, "Member 'UPerkTierWidgetNew_C::bFirstPerkDone' has a wrong offset!");
static_assert(offsetof(UPerkTierWidgetNew_C, bIncludeDescription) == 0x00028A, "Member 'UPerkTierWidgetNew_C::bIncludeDescription' has a wrong offset!");
static_assert(offsetof(UPerkTierWidgetNew_C, IconSize) == 0x00028B, "Member 'UPerkTierWidgetNew_C::IconSize' has a wrong offset!");

}

