#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PickupManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PickupManager.PickupManager_C
// 0x0078 (0x02B0 - 0x0238)
class UPickupManager_C final : public UFortHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UPackResource_C*                        _Pack_Resource__Metal;                             // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPackResource_C*                        _Pack_Resource__Stone;                             // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPackResource_C*                        _Pack_Resource__Wood;                              // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           _Vertical_Box__Pickup_Message_Stream;              // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackpackImage;                                     // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBluGloInventory_C*                     BluGloInventory;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorderSurvivorCount;                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Divider;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindInventory;                                  // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USurvivorRescuedCounter_C*              SurvivorRescuedCounter;                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextInventoryCount;                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextInventoryMax;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortUIMessageManager*                  MessageManager;                                    // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Max_Displayed_Items;                               // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastUpdateTime;                                    // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PickupManager(int32 EntryPoint);
	void HandleBuildingMaterialChanged();
	void Destruct();
	void HandleWorldItemListChanged(const TArray<class UFortWorldItem*>& ItemsAdded, const TArray<class UFortWorldItem*>& ItemsRemoved);
	void HandleWorldItemsChanged();
	void Construct();
	void TryGetNextItem();
	void HandleMessageExpired(class UFortUIMessageItemWidget* Message_Item);
	void HandleItemPickedUp(class UFortWorldItem* NewItem, int32 Count);
	void RefreshCounts();
	void UpdateKeybinds();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PickupManager_C">();
	}
	static class UPickupManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPickupManager_C>();
	}
};
static_assert(alignof(UPickupManager_C) == 0x000008, "Wrong alignment on UPickupManager_C");
static_assert(sizeof(UPickupManager_C) == 0x0002B0, "Wrong size on UPickupManager_C");
static_assert(offsetof(UPickupManager_C, UberGraphFrame) == 0x000238, "Member 'UPickupManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPickupManager_C, _Pack_Resource__Metal) == 0x000240, "Member 'UPickupManager_C::_Pack_Resource__Metal' has a wrong offset!");
static_assert(offsetof(UPickupManager_C, _Pack_Resource__Stone) == 0x000248, "Member 'UPickupManager_C::_Pack_Resource__Stone' has a wrong offset!");
static_assert(offsetof(UPickupManager_C, _Pack_Resource__Wood) == 0x000250, "Member 'UPickupManager_C::_Pack_Resource__Wood' has a wrong offset!");
static_assert(offsetof(UPickupManager_C, _Vertical_Box__Pickup_Message_Stream) == 0x000258, "Member 'UPickupManager_C::_Vertical_Box__Pickup_Message_Stream' has a wrong offset!");
static_assert(offsetof(UPickupManager_C, BackpackImage) == 0x000260, "Member 'UPickupManager_C::BackpackImage' has a wrong offset!");
static_assert(offsetof(UPickupManager_C, BluGloInventory) == 0x000268, "Member 'UPickupManager_C::BluGloInventory' has a wrong offset!");
static_assert(offsetof(UPickupManager_C, CommonBorderSurvivorCount) == 0x000270, "Member 'UPickupManager_C::CommonBorderSurvivorCount' has a wrong offset!");
static_assert(offsetof(UPickupManager_C, Image_Divider) == 0x000278, "Member 'UPickupManager_C::Image_Divider' has a wrong offset!");
static_assert(offsetof(UPickupManager_C, KeybindInventory) == 0x000280, "Member 'UPickupManager_C::KeybindInventory' has a wrong offset!");
static_assert(offsetof(UPickupManager_C, SurvivorRescuedCounter) == 0x000288, "Member 'UPickupManager_C::SurvivorRescuedCounter' has a wrong offset!");
static_assert(offsetof(UPickupManager_C, TextInventoryCount) == 0x000290, "Member 'UPickupManager_C::TextInventoryCount' has a wrong offset!");
static_assert(offsetof(UPickupManager_C, TextInventoryMax) == 0x000298, "Member 'UPickupManager_C::TextInventoryMax' has a wrong offset!");
static_assert(offsetof(UPickupManager_C, MessageManager) == 0x0002A0, "Member 'UPickupManager_C::MessageManager' has a wrong offset!");
static_assert(offsetof(UPickupManager_C, Max_Displayed_Items) == 0x0002A8, "Member 'UPickupManager_C::Max_Displayed_Items' has a wrong offset!");
static_assert(offsetof(UPickupManager_C, LastUpdateTime) == 0x0002AC, "Member 'UPickupManager_C::LastUpdateTime' has a wrong offset!");

}

