#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PinnedSchematicItemsWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function PinnedSchematicItemsWidget.PinnedSchematicItemsWidget_C.ExecuteUbergraph_PinnedSchematicItemsWidget
// 0x0040 (0x0040 - 0x0000)
struct PinnedSchematicItemsWidget_C_ExecuteUbergraph_PinnedSchematicItemsWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PinnedSchematicItemsWidget_C_ExecuteUbergraph_PinnedSchematicItemsWidget) == 0x000008, "Wrong alignment on PinnedSchematicItemsWidget_C_ExecuteUbergraph_PinnedSchematicItemsWidget");
static_assert(sizeof(PinnedSchematicItemsWidget_C_ExecuteUbergraph_PinnedSchematicItemsWidget) == 0x000040, "Wrong size on PinnedSchematicItemsWidget_C_ExecuteUbergraph_PinnedSchematicItemsWidget");
static_assert(offsetof(PinnedSchematicItemsWidget_C_ExecuteUbergraph_PinnedSchematicItemsWidget, EntryPoint) == 0x000000, "Member 'PinnedSchematicItemsWidget_C_ExecuteUbergraph_PinnedSchematicItemsWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(PinnedSchematicItemsWidget_C_ExecuteUbergraph_PinnedSchematicItemsWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'PinnedSchematicItemsWidget_C_ExecuteUbergraph_PinnedSchematicItemsWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PinnedSchematicItemsWidget_C_ExecuteUbergraph_PinnedSchematicItemsWidget, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'PinnedSchematicItemsWidget_C_ExecuteUbergraph_PinnedSchematicItemsWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PinnedSchematicItemsWidget_C_ExecuteUbergraph_PinnedSchematicItemsWidget, CallFunc_GetChildrenCount_ReturnValue) == 0x000020, "Member 'PinnedSchematicItemsWidget_C_ExecuteUbergraph_PinnedSchematicItemsWidget::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(PinnedSchematicItemsWidget_C_ExecuteUbergraph_PinnedSchematicItemsWidget, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'PinnedSchematicItemsWidget_C_ExecuteUbergraph_PinnedSchematicItemsWidget::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PinnedSchematicItemsWidget_C_ExecuteUbergraph_PinnedSchematicItemsWidget, Temp_int_Variable) == 0x000028, "Member 'PinnedSchematicItemsWidget_C_ExecuteUbergraph_PinnedSchematicItemsWidget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PinnedSchematicItemsWidget_C_ExecuteUbergraph_PinnedSchematicItemsWidget, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'PinnedSchematicItemsWidget_C_ExecuteUbergraph_PinnedSchematicItemsWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PinnedSchematicItemsWidget_C_ExecuteUbergraph_PinnedSchematicItemsWidget, CallFunc_GetChildAt_ReturnValue) == 0x000030, "Member 'PinnedSchematicItemsWidget_C_ExecuteUbergraph_PinnedSchematicItemsWidget::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PinnedSchematicItemsWidget_C_ExecuteUbergraph_PinnedSchematicItemsWidget, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000038, "Member 'PinnedSchematicItemsWidget_C_ExecuteUbergraph_PinnedSchematicItemsWidget::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function PinnedSchematicItemsWidget.PinnedSchematicItemsWidget_C.Refresh
// 0x0098 (0x0098 - 0x0000)
struct PinnedSchematicItemsWidget_C_Refresh final
{
public:
	class UFortSchematicItem*                     PinnedItem;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFortSchematicItem*>             PinnedSchematics;                                  // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortSchematicItem*>             CallFunc_GetPinnedSchematicList_PinnedItems;       // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPinnedSchematicItemWidget_C*           K2Node_DynamicCast_AsPinned_Schematic_Item_Widget; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortSchematicItem*                     CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue2;                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPinnedSchematicItemWidget_C*           K2Node_DynamicCast_AsPinned_Schematic_Item_Widget2; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PinnedSchematicItemsWidget_C_Refresh) == 0x000008, "Wrong alignment on PinnedSchematicItemsWidget_C_Refresh");
static_assert(sizeof(PinnedSchematicItemsWidget_C_Refresh) == 0x000098, "Wrong size on PinnedSchematicItemsWidget_C_Refresh");
static_assert(offsetof(PinnedSchematicItemsWidget_C_Refresh, PinnedItem) == 0x000000, "Member 'PinnedSchematicItemsWidget_C_Refresh::PinnedItem' has a wrong offset!");
static_assert(offsetof(PinnedSchematicItemsWidget_C_Refresh, Param_Index) == 0x000008, "Member 'PinnedSchematicItemsWidget_C_Refresh::Param_Index' has a wrong offset!");
static_assert(offsetof(PinnedSchematicItemsWidget_C_Refresh, PinnedSchematics) == 0x000010, "Member 'PinnedSchematicItemsWidget_C_Refresh::PinnedSchematics' has a wrong offset!");
static_assert(offsetof(PinnedSchematicItemsWidget_C_Refresh, Temp_int_Variable) == 0x000020, "Member 'PinnedSchematicItemsWidget_C_Refresh::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(PinnedSchematicItemsWidget_C_Refresh, CallFunc_GetContext_ReturnValue) == 0x000028, "Member 'PinnedSchematicItemsWidget_C_Refresh::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PinnedSchematicItemsWidget_C_Refresh, CallFunc_GetPinnedSchematicList_PinnedItems) == 0x000030, "Member 'PinnedSchematicItemsWidget_C_Refresh::CallFunc_GetPinnedSchematicList_PinnedItems' has a wrong offset!");
static_assert(offsetof(PinnedSchematicItemsWidget_C_Refresh, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'PinnedSchematicItemsWidget_C_Refresh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PinnedSchematicItemsWidget_C_Refresh, CallFunc_GetChildAt_ReturnValue) == 0x000048, "Member 'PinnedSchematicItemsWidget_C_Refresh::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PinnedSchematicItemsWidget_C_Refresh, K2Node_DynamicCast_AsPinned_Schematic_Item_Widget) == 0x000050, "Member 'PinnedSchematicItemsWidget_C_Refresh::K2Node_DynamicCast_AsPinned_Schematic_Item_Widget' has a wrong offset!");
static_assert(offsetof(PinnedSchematicItemsWidget_C_Refresh, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'PinnedSchematicItemsWidget_C_Refresh::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PinnedSchematicItemsWidget_C_Refresh, CallFunc_Array_Get_Item) == 0x000060, "Member 'PinnedSchematicItemsWidget_C_Refresh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PinnedSchematicItemsWidget_C_Refresh, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'PinnedSchematicItemsWidget_C_Refresh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PinnedSchematicItemsWidget_C_Refresh, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'PinnedSchematicItemsWidget_C_Refresh::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PinnedSchematicItemsWidget_C_Refresh, CallFunc_GetChildrenCount_ReturnValue) == 0x000070, "Member 'PinnedSchematicItemsWidget_C_Refresh::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(PinnedSchematicItemsWidget_C_Refresh, CallFunc_Subtract_IntInt_ReturnValue) == 0x000074, "Member 'PinnedSchematicItemsWidget_C_Refresh::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PinnedSchematicItemsWidget_C_Refresh, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000078, "Member 'PinnedSchematicItemsWidget_C_Refresh::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PinnedSchematicItemsWidget_C_Refresh, CallFunc_GetChildAt_ReturnValue2) == 0x000080, "Member 'PinnedSchematicItemsWidget_C_Refresh::CallFunc_GetChildAt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PinnedSchematicItemsWidget_C_Refresh, K2Node_DynamicCast_AsPinned_Schematic_Item_Widget2) == 0x000088, "Member 'PinnedSchematicItemsWidget_C_Refresh::K2Node_DynamicCast_AsPinned_Schematic_Item_Widget2' has a wrong offset!");
static_assert(offsetof(PinnedSchematicItemsWidget_C_Refresh, K2Node_DynamicCast_bSuccess2) == 0x000090, "Member 'PinnedSchematicItemsWidget_C_Refresh::K2Node_DynamicCast_bSuccess2' has a wrong offset!");

}

