#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerRankEmblem

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PlayerRankEmblem.PlayerRankEmblem_C.ExecuteUbergraph_PlayerRankEmblem
// 0x0050 (0x0050 - 0x0000)
struct PlayerRankEmblem_C_ExecuteUbergraph_PlayerRankEmblem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetGameAccountId_ReturnValue;             // 0x0020(0x0028)(HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerRankEmblem_C_ExecuteUbergraph_PlayerRankEmblem) == 0x000008, "Wrong alignment on PlayerRankEmblem_C_ExecuteUbergraph_PlayerRankEmblem");
static_assert(sizeof(PlayerRankEmblem_C_ExecuteUbergraph_PlayerRankEmblem) == 0x000050, "Wrong size on PlayerRankEmblem_C_ExecuteUbergraph_PlayerRankEmblem");
static_assert(offsetof(PlayerRankEmblem_C_ExecuteUbergraph_PlayerRankEmblem, EntryPoint) == 0x000000, "Member 'PlayerRankEmblem_C_ExecuteUbergraph_PlayerRankEmblem::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerRankEmblem_C_ExecuteUbergraph_PlayerRankEmblem, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'PlayerRankEmblem_C_ExecuteUbergraph_PlayerRankEmblem::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerRankEmblem_C_ExecuteUbergraph_PlayerRankEmblem, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000010, "Member 'PlayerRankEmblem_C_ExecuteUbergraph_PlayerRankEmblem::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(PlayerRankEmblem_C_ExecuteUbergraph_PlayerRankEmblem, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PlayerRankEmblem_C_ExecuteUbergraph_PlayerRankEmblem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerRankEmblem_C_ExecuteUbergraph_PlayerRankEmblem, CallFunc_GetGameAccountId_ReturnValue) == 0x000020, "Member 'PlayerRankEmblem_C_ExecuteUbergraph_PlayerRankEmblem::CallFunc_GetGameAccountId_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerRankEmblem_C_ExecuteUbergraph_PlayerRankEmblem, K2Node_Event_IsDesignTime) == 0x000048, "Member 'PlayerRankEmblem_C_ExecuteUbergraph_PlayerRankEmblem::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function PlayerRankEmblem.PlayerRankEmblem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct PlayerRankEmblem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerRankEmblem_C_PreConstruct) == 0x000001, "Wrong alignment on PlayerRankEmblem_C_PreConstruct");
static_assert(sizeof(PlayerRankEmblem_C_PreConstruct) == 0x000001, "Wrong size on PlayerRankEmblem_C_PreConstruct");
static_assert(offsetof(PlayerRankEmblem_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'PlayerRankEmblem_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function PlayerRankEmblem.PlayerRankEmblem_C.SetBannerOwner
// 0x0030 (0x0030 - 0x0000)
struct PlayerRankEmblem_C_SetBannerOwner final
{
public:
	class AFortPlayerController*                  Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetGameAccountId_ReturnValue;             // 0x0008(0x0028)(HasGetValueTypeHash)
};
static_assert(alignof(PlayerRankEmblem_C_SetBannerOwner) == 0x000008, "Wrong alignment on PlayerRankEmblem_C_SetBannerOwner");
static_assert(sizeof(PlayerRankEmblem_C_SetBannerOwner) == 0x000030, "Wrong size on PlayerRankEmblem_C_SetBannerOwner");
static_assert(offsetof(PlayerRankEmblem_C_SetBannerOwner, Target) == 0x000000, "Member 'PlayerRankEmblem_C_SetBannerOwner::Target' has a wrong offset!");
static_assert(offsetof(PlayerRankEmblem_C_SetBannerOwner, CallFunc_GetGameAccountId_ReturnValue) == 0x000008, "Member 'PlayerRankEmblem_C_SetBannerOwner::CallFunc_GetGameAccountId_ReturnValue' has a wrong offset!");

// Function PlayerRankEmblem.PlayerRankEmblem_C.SetBannerSurroundLevel
// 0x0008 (0x0008 - 0x0000)
struct PlayerRankEmblem_C_SetBannerSurroundLevel final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Animate;                                           // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerRankEmblem_C_SetBannerSurroundLevel) == 0x000004, "Wrong alignment on PlayerRankEmblem_C_SetBannerSurroundLevel");
static_assert(sizeof(PlayerRankEmblem_C_SetBannerSurroundLevel) == 0x000008, "Wrong size on PlayerRankEmblem_C_SetBannerSurroundLevel");
static_assert(offsetof(PlayerRankEmblem_C_SetBannerSurroundLevel, Level) == 0x000000, "Member 'PlayerRankEmblem_C_SetBannerSurroundLevel::Level' has a wrong offset!");
static_assert(offsetof(PlayerRankEmblem_C_SetBannerSurroundLevel, Animate) == 0x000004, "Member 'PlayerRankEmblem_C_SetBannerSurroundLevel::Animate' has a wrong offset!");

// Function PlayerRankEmblem.PlayerRankEmblem_C.SetBannerInfo
// 0x0038 (0x0038 - 0x0000)
struct PlayerRankEmblem_C_SetBannerInfo final
{
public:
	struct FPlayerBannerInfo                      Banner;                                            // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue2;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlayerRankEmblem_C_SetBannerInfo) == 0x000008, "Wrong alignment on PlayerRankEmblem_C_SetBannerInfo");
static_assert(sizeof(PlayerRankEmblem_C_SetBannerInfo) == 0x000038, "Wrong size on PlayerRankEmblem_C_SetBannerInfo");
static_assert(offsetof(PlayerRankEmblem_C_SetBannerInfo, Banner) == 0x000000, "Member 'PlayerRankEmblem_C_SetBannerInfo::Banner' has a wrong offset!");
static_assert(offsetof(PlayerRankEmblem_C_SetBannerInfo, CallFunc_Conv_StringToName_ReturnValue) == 0x000028, "Member 'PlayerRankEmblem_C_SetBannerInfo::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerRankEmblem_C_SetBannerInfo, CallFunc_Conv_StringToName_ReturnValue2) == 0x000030, "Member 'PlayerRankEmblem_C_SetBannerInfo::CallFunc_Conv_StringToName_ReturnValue2' has a wrong offset!");

}

