#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PowerToastWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PowerToastWidget.PowerToastWidget_C.ExecuteUbergraph_PowerToastWidget
// 0x0368 (0x0368 - 0x0000)
struct PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0040(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent2;                          // 0x0078(0x0070)()
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00E8(0x0070)()
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortTeamMemberInfo                    K2Node_Event_NewInfo;                              // 0x0160(0x01A8)()
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       K2Node_CustomEvent_NewTeamMemberId;                // 0x0318(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_UniqueNetIdReplUniqueNetIdRepl_ReturnValue; // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0343(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue2;                  // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FUniqueNetIdRepl& NewTeamMemberId)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0350(0x0010)(ZeroConstructor, NoDestructor)
	class UFortUITeamInfo*                        CallFunc_GetLocalPlayerTeam_ReturnValue;           // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget) == 0x000008, "Wrong alignment on PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget");
static_assert(sizeof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget) == 0x000368, "Wrong size on PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, EntryPoint) == 0x000000, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, K2Node_CreateDelegate_OutputDelegate3) == 0x000028, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, K2Node_Event_MyGeometry) == 0x000040, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, K2Node_Event_MouseEvent2) == 0x000078, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::K2Node_Event_MouseEvent2' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, K2Node_Event_MouseEvent) == 0x0000E8, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, K2Node_ComponentBoundEvent_Button) == 0x000158, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, K2Node_Event_NewInfo) == 0x000160, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::K2Node_Event_NewInfo' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, CallFunc_GetContext_ReturnValue) == 0x000308, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, CallFunc_GetSubGame_ReturnValue) == 0x000310, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, K2Node_CustomEvent_NewTeamMemberId) == 0x000318, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::K2Node_CustomEvent_NewTeamMemberId' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000340, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, CallFunc_EqualEqual_UniqueNetIdReplUniqueNetIdRepl_ReturnValue) == 0x000341, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::CallFunc_EqualEqual_UniqueNetIdReplUniqueNetIdRepl_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, CallFunc_BooleanAND_ReturnValue) == 0x000342, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, CallFunc_BooleanAND_ReturnValue2) == 0x000343, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, CallFunc_GetContext_ReturnValue2) == 0x000348, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, K2Node_CreateDelegate_OutputDelegate4) == 0x000350, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget, CallFunc_GetLocalPlayerTeam_ReturnValue) == 0x000360, "Member 'PowerToastWidget_C_ExecuteUbergraph_PowerToastWidget::CallFunc_GetLocalPlayerTeam_ReturnValue' has a wrong offset!");

// Function PowerToastWidget.PowerToastWidget_C.OnTeamMemberFinishedSynchronizing_Event_0
// 0x0028 (0x0028 - 0x0000)
struct PowerToastWidget_C_OnTeamMemberFinishedSynchronizing_Event_0 final
{
public:
	struct FUniqueNetIdRepl                       NewTeamMemberId;                                   // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(PowerToastWidget_C_OnTeamMemberFinishedSynchronizing_Event_0) == 0x000008, "Wrong alignment on PowerToastWidget_C_OnTeamMemberFinishedSynchronizing_Event_0");
static_assert(sizeof(PowerToastWidget_C_OnTeamMemberFinishedSynchronizing_Event_0) == 0x000028, "Wrong size on PowerToastWidget_C_OnTeamMemberFinishedSynchronizing_Event_0");
static_assert(offsetof(PowerToastWidget_C_OnTeamMemberFinishedSynchronizing_Event_0, NewTeamMemberId) == 0x000000, "Member 'PowerToastWidget_C_OnTeamMemberFinishedSynchronizing_Event_0::NewTeamMemberId' has a wrong offset!");

// Function PowerToastWidget.PowerToastWidget_C.OnPlayerInfoChanged
// 0x01A8 (0x01A8 - 0x0000)
struct PowerToastWidget_C_OnPlayerInfoChanged final
{
public:
	struct FFortTeamMemberInfo                    NewInfo;                                           // 0x0000(0x01A8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(PowerToastWidget_C_OnPlayerInfoChanged) == 0x000008, "Wrong alignment on PowerToastWidget_C_OnPlayerInfoChanged");
static_assert(sizeof(PowerToastWidget_C_OnPlayerInfoChanged) == 0x0001A8, "Wrong size on PowerToastWidget_C_OnPlayerInfoChanged");
static_assert(offsetof(PowerToastWidget_C_OnPlayerInfoChanged, NewInfo) == 0x000000, "Member 'PowerToastWidget_C_OnPlayerInfoChanged::NewInfo' has a wrong offset!");

// Function PowerToastWidget.PowerToastWidget_C.BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct PowerToastWidget_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PowerToastWidget_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on PowerToastWidget_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(PowerToastWidget_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on PowerToastWidget_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(PowerToastWidget_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'PowerToastWidget_C_BndEvt__OpenButton_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function PowerToastWidget.PowerToastWidget_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct PowerToastWidget_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PowerToastWidget_C_OnMouseLeave) == 0x000008, "Wrong alignment on PowerToastWidget_C_OnMouseLeave");
static_assert(sizeof(PowerToastWidget_C_OnMouseLeave) == 0x000070, "Wrong size on PowerToastWidget_C_OnMouseLeave");
static_assert(offsetof(PowerToastWidget_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'PowerToastWidget_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function PowerToastWidget.PowerToastWidget_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct PowerToastWidget_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PowerToastWidget_C_OnMouseEnter) == 0x000008, "Wrong alignment on PowerToastWidget_C_OnMouseEnter");
static_assert(sizeof(PowerToastWidget_C_OnMouseEnter) == 0x0000A8, "Wrong size on PowerToastWidget_C_OnMouseEnter");
static_assert(offsetof(PowerToastWidget_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'PowerToastWidget_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'PowerToastWidget_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function PowerToastWidget.PowerToastWidget_C.SetToast
// 0x0058 (0x0058 - 0x0000)
struct PowerToastWidget_C_SetToast final
{
public:
	class UFortUINotification*                    Toast;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortRegisteredPlayerInfo*              CallFunc_GetPlayerInfoFromUniqueID_ReturnValue;    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUITeamInfo*                        CallFunc_GetLocalPlayerTeam_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTeamMemberSynchronizing_ReturnValue;    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0040(0x0018)()
};
static_assert(alignof(PowerToastWidget_C_SetToast) == 0x000008, "Wrong alignment on PowerToastWidget_C_SetToast");
static_assert(sizeof(PowerToastWidget_C_SetToast) == 0x000058, "Wrong size on PowerToastWidget_C_SetToast");
static_assert(offsetof(PowerToastWidget_C_SetToast, Toast) == 0x000000, "Member 'PowerToastWidget_C_SetToast::Toast' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_SetToast, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'PowerToastWidget_C_SetToast::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_SetToast, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'PowerToastWidget_C_SetToast::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_SetToast, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'PowerToastWidget_C_SetToast::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_SetToast, CallFunc_GetPlayerInfoFromUniqueID_ReturnValue) == 0x000028, "Member 'PowerToastWidget_C_SetToast::CallFunc_GetPlayerInfoFromUniqueID_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_SetToast, CallFunc_GetLocalPlayerTeam_ReturnValue) == 0x000030, "Member 'PowerToastWidget_C_SetToast::CallFunc_GetLocalPlayerTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_SetToast, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'PowerToastWidget_C_SetToast::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_SetToast, CallFunc_IsTeamMemberSynchronizing_ReturnValue) == 0x000039, "Member 'PowerToastWidget_C_SetToast::CallFunc_IsTeamMemberSynchronizing_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_SetToast, CallFunc_Not_PreBool_ReturnValue) == 0x00003A, "Member 'PowerToastWidget_C_SetToast::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_SetToast, CallFunc_BooleanOR_ReturnValue) == 0x00003B, "Member 'PowerToastWidget_C_SetToast::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_SetToast, CallFunc_MakeLiteralText_ReturnValue) == 0x000040, "Member 'PowerToastWidget_C_SetToast::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");

// Function PowerToastWidget.PowerToastWidget_C.ShowText
// 0x0048 (0x0048 - 0x0000)
struct PowerToastWidget_C_ShowText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UCommonTextBlock*                       TextBlock;                                         // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       LocalTextBlock;                                    // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   LocalText;                                         // 0x0028(0x0018)(Edit, BlueprintVisible)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PowerToastWidget_C_ShowText) == 0x000008, "Wrong alignment on PowerToastWidget_C_ShowText");
static_assert(sizeof(PowerToastWidget_C_ShowText) == 0x000048, "Wrong size on PowerToastWidget_C_ShowText");
static_assert(offsetof(PowerToastWidget_C_ShowText, Text) == 0x000000, "Member 'PowerToastWidget_C_ShowText::Text' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ShowText, TextBlock) == 0x000018, "Member 'PowerToastWidget_C_ShowText::TextBlock' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ShowText, LocalTextBlock) == 0x000020, "Member 'PowerToastWidget_C_ShowText::LocalTextBlock' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ShowText, LocalText) == 0x000028, "Member 'PowerToastWidget_C_ShowText::LocalText' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_ShowText, CallFunc_TextIsEmpty_ReturnValue) == 0x000040, "Member 'PowerToastWidget_C_ShowText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");

// Function PowerToastWidget.PowerToastWidget_C.StartIntro
// 0x0001 (0x0001 - 0x0000)
struct PowerToastWidget_C_StartIntro final
{
public:
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PowerToastWidget_C_StartIntro) == 0x000001, "Wrong alignment on PowerToastWidget_C_StartIntro");
static_assert(sizeof(PowerToastWidget_C_StartIntro) == 0x000001, "Wrong size on PowerToastWidget_C_StartIntro");
static_assert(offsetof(PowerToastWidget_C_StartIntro, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000000, "Member 'PowerToastWidget_C_StartIntro::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");

// Function PowerToastWidget.PowerToastWidget_C.UpdatePowerRating
// 0x0278 (0x0278 - 0x0000)
struct PowerToastWidget_C_UpdatePowerRating final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetHomebaseRating_Rating;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHomebaseRating_ProgressFraction;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHomebaseRating_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHomeBaseContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
	int32                                         CallFunc_GetLocalPlayerHomebaseRating_Rating;      // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLocalPlayerHomebaseRating_ProgressFraction; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLocalPlayerHomebaseRating_ReturnValue; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue2;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortTeamMemberInfo                    CallFunc_GetLocalPlayerTeamMemberInfo_LocalPlayerInfo; // 0x0048(0x01A8)()
	int32                                         CallFunc_GetTeamHomebaseRating_Rating;             // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTeamHomebaseRating_ProgressFraction;   // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetTeamHomebaseRating_ReturnValue;        // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0208(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0248(0x0010)(ZeroConstructor, ReferenceParm)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0260(0x0018)()
};
static_assert(alignof(PowerToastWidget_C_UpdatePowerRating) == 0x000008, "Wrong alignment on PowerToastWidget_C_UpdatePowerRating");
static_assert(sizeof(PowerToastWidget_C_UpdatePowerRating) == 0x000278, "Wrong size on PowerToastWidget_C_UpdatePowerRating");
static_assert(offsetof(PowerToastWidget_C_UpdatePowerRating, Temp_bool_Variable) == 0x000000, "Member 'PowerToastWidget_C_UpdatePowerRating::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_UpdatePowerRating, Temp_byte_Variable) == 0x000001, "Member 'PowerToastWidget_C_UpdatePowerRating::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PowerToastWidget_C_UpdatePowerRating, Temp_byte_Variable2) == 0x000002, "Member 'PowerToastWidget_C_UpdatePowerRating::Temp_byte_Variable2' has a wrong offset!");
