#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestUpdateEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "DynamicQuestUpdateInfo_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QuestUpdateEntry.QuestUpdateEntry_C
// 0x0070 (0x0280 - 0x0210)
class UQuestUpdateEntry_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Disappear;                                         // 0x0218(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Appear;                                            // 0x0220(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ObjectivesBox;                                     // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          OuterBorder;                                       // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       QuestName;                                         // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Separator;                                         // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   AllQuestUpdatesFinished;                           // 0x0248(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FDynamicQuestUpdateInfo>        QuestUpdates;                                      // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         UpdateTweenTime;                                   // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PostUpdatesDelay;                                  // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           PostUpdatesDelayTimerHandle;                       // 0x0270(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          bIsAppearAnimationFinished;                        // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bConfigureAsAnnouncement;                          // 0x0279(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void AllQuestUpdatesFinished__DelegateSignature(class UQuestUpdateEntry_C* UpdateWidget);
	void ExecuteUbergraph_QuestUpdateEntry(int32 EntryPoint);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnReceiveQuestUpdate(const struct FDynamicQuestUpdateInfo& QuestUpdateInfo, bool* Success);
	void CanAddUpdate(const struct FDynamicQuestUpdateInfo& UpdateToAdd, bool* Result);
	void OnAppearAnimationFinished();
	void TryStartUpdates();
	void CanStartUpdate(int32 UpdateIndex, bool* Result);
	void HasUpdateFinished(struct FDynamicQuestUpdateInfo& Update, bool* Result);
	void OnUpdateFinished();
	void HasUpdateStarted(struct FDynamicQuestUpdateInfo& Update, bool* Result);
	void GetObjectiveWidget(class UFortQuestObjectiveInfo* QuestObjective, class UQuestObjectiveEntry_C** ObjectiveWidget);
	void IsUpdateActive(struct FDynamicQuestUpdateInfo& Update, bool* Result);
	void HaveAllUpdatesFinished(bool* Result);
	void OnPostUpdatesDelayFinished();
	void OnDisappearAnimationFinished();
	void CreateObjectiveEntryWidget(class UFortQuestObjectiveInfo* Objective, int32 LastAchievedCount);
	void GetNumDisplayedObjectives(int32* NumObjectives);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuestUpdateEntry_C">();
	}
	static class UQuestUpdateEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestUpdateEntry_C>();
	}
};
static_assert(alignof(UQuestUpdateEntry_C) == 0x000008, "Wrong alignment on UQuestUpdateEntry_C");
static_assert(sizeof(UQuestUpdateEntry_C) == 0x000280, "Wrong size on UQuestUpdateEntry_C");
static_assert(offsetof(UQuestUpdateEntry_C, UberGraphFrame) == 0x000210, "Member 'UQuestUpdateEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQuestUpdateEntry_C, Disappear) == 0x000218, "Member 'UQuestUpdateEntry_C::Disappear' has a wrong offset!");
static_assert(offsetof(UQuestUpdateEntry_C, Appear) == 0x000220, "Member 'UQuestUpdateEntry_C::Appear' has a wrong offset!");
static_assert(offsetof(UQuestUpdateEntry_C, ObjectivesBox) == 0x000228, "Member 'UQuestUpdateEntry_C::ObjectivesBox' has a wrong offset!");
static_assert(offsetof(UQuestUpdateEntry_C, OuterBorder) == 0x000230, "Member 'UQuestUpdateEntry_C::OuterBorder' has a wrong offset!");
static_assert(offsetof(UQuestUpdateEntry_C, QuestName) == 0x000238, "Member 'UQuestUpdateEntry_C::QuestName' has a wrong offset!");
static_assert(offsetof(UQuestUpdateEntry_C, Separator) == 0x000240, "Member 'UQuestUpdateEntry_C::Separator' has a wrong offset!");
static_assert(offsetof(UQuestUpdateEntry_C, AllQuestUpdatesFinished) == 0x000248, "Member 'UQuestUpdateEntry_C::AllQuestUpdatesFinished' has a wrong offset!");
static_assert(offsetof(UQuestUpdateEntry_C, QuestUpdates) == 0x000258, "Member 'UQuestUpdateEntry_C::QuestUpdates' has a wrong offset!");
static_assert(offsetof(UQuestUpdateEntry_C, UpdateTweenTime) == 0x000268, "Member 'UQuestUpdateEntry_C::UpdateTweenTime' has a wrong offset!");
static_assert(offsetof(UQuestUpdateEntry_C, PostUpdatesDelay) == 0x00026C, "Member 'UQuestUpdateEntry_C::PostUpdatesDelay' has a wrong offset!");
static_assert(offsetof(UQuestUpdateEntry_C, PostUpdatesDelayTimerHandle) == 0x000270, "Member 'UQuestUpdateEntry_C::PostUpdatesDelayTimerHandle' has a wrong offset!");
static_assert(offsetof(UQuestUpdateEntry_C, bIsAppearAnimationFinished) == 0x000278, "Member 'UQuestUpdateEntry_C::bIsAppearAnimationFinished' has a wrong offset!");
static_assert(offsetof(UQuestUpdateEntry_C, bConfigureAsAnnouncement) == 0x000279, "Member 'UQuestUpdateEntry_C::bConfigureAsAnnouncement' has a wrong offset!");

}

