#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestTrackerSubEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function QuestTrackerSubEntry.QuestTrackerSubEntry_C.ExecuteUbergraph_QuestTrackerSubEntry
// 0x0040 (0x0040 - 0x0000)
struct QuestTrackerSubEntry_C_ExecuteUbergraph_QuestTrackerSubEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(QuestTrackerSubEntry_C_ExecuteUbergraph_QuestTrackerSubEntry) == 0x000008, "Wrong alignment on QuestTrackerSubEntry_C_ExecuteUbergraph_QuestTrackerSubEntry");
static_assert(sizeof(QuestTrackerSubEntry_C_ExecuteUbergraph_QuestTrackerSubEntry) == 0x000040, "Wrong size on QuestTrackerSubEntry_C_ExecuteUbergraph_QuestTrackerSubEntry");
static_assert(offsetof(QuestTrackerSubEntry_C_ExecuteUbergraph_QuestTrackerSubEntry, EntryPoint) == 0x000000, "Member 'QuestTrackerSubEntry_C_ExecuteUbergraph_QuestTrackerSubEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_ExecuteUbergraph_QuestTrackerSubEntry, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'QuestTrackerSubEntry_C_ExecuteUbergraph_QuestTrackerSubEntry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_ExecuteUbergraph_QuestTrackerSubEntry, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'QuestTrackerSubEntry_C_ExecuteUbergraph_QuestTrackerSubEntry::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_ExecuteUbergraph_QuestTrackerSubEntry, K2Node_CreateDelegate_OutputDelegate2) == 0x000020, "Member 'QuestTrackerSubEntry_C_ExecuteUbergraph_QuestTrackerSubEntry::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_ExecuteUbergraph_QuestTrackerSubEntry, K2Node_CreateDelegate_OutputDelegate3) == 0x000030, "Member 'QuestTrackerSubEntry_C_ExecuteUbergraph_QuestTrackerSubEntry::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");

// Function QuestTrackerSubEntry.QuestTrackerSubEntry_C.UpdateObjectiveText
// 0x01E8 (0x01E8 - 0x0000)
struct QuestTrackerSubEntry_C_UpdateObjectiveText final
{
public:
	class FText                                   ObjectiveProgressText;                             // 0x0000(0x0018)(Edit, BlueprintVisible)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTooltipUIContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortTooltipUIContext*                  CallFunc_GetContext_ReturnValue2;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTooltipContext*                    CallFunc_SpawnTooltipContext_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCombinedDescription_OutDescription;    // 0x0040(0x0018)()
	bool                                          CallFunc_GetCombinedDescription_ReturnValue;       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData2;             // 0x00A0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          Temp_bool_Variable3;                               // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F8(0x0018)()
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0110(0x0018)()
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTooltipContext*                    CallFunc_SpawnTooltipContext_ReturnValue2;         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetTooltipTextFromToken_OutText;          // 0x0138(0x0018)()
	bool                                          CallFunc_GetTooltipTextFromToken_ReturnValue;      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData3;             // 0x0158(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array2;                           // 0x0198(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue2;                      // 0x01B0(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItem*                         CallFunc_GetOwningQuest_ReturnValue;               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsQuestPinned_ReturnValue;                // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasCompleted_ReturnValue;                 // 0x01DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x01DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select3_Default;                            // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestTrackerSubEntry_C_UpdateObjectiveText) == 0x000008, "Wrong alignment on QuestTrackerSubEntry_C_UpdateObjectiveText");
static_assert(sizeof(QuestTrackerSubEntry_C_UpdateObjectiveText) == 0x0001E8, "Wrong size on QuestTrackerSubEntry_C_UpdateObjectiveText");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, ObjectiveProgressText) == 0x000000, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::ObjectiveProgressText' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, Temp_byte_Variable) == 0x000018, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, Temp_byte_Variable2) == 0x000019, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, CallFunc_GetContext_ReturnValue2) == 0x000028, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, Temp_bool_Variable) == 0x000030, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, Temp_bool_Variable2) == 0x000032, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, Temp_byte_Variable3) == 0x000033, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, Temp_byte_Variable4) == 0x000034, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, CallFunc_SpawnTooltipContext_ReturnValue) == 0x000038, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::CallFunc_SpawnTooltipContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, CallFunc_GetCombinedDescription_OutDescription) == 0x000040, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::CallFunc_GetCombinedDescription_OutDescription' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, CallFunc_GetCombinedDescription_ReturnValue) == 0x000058, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::CallFunc_GetCombinedDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, K2Node_MakeStruct_FormatArgumentData2) == 0x0000A0, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::K2Node_MakeStruct_FormatArgumentData2' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, K2Node_MakeArray_Array) == 0x0000E0, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, Temp_bool_Variable3) == 0x0000F0, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, CallFunc_Format_ReturnValue) == 0x0000F8, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, CallFunc_GetEmptyText_ReturnValue) == 0x000110, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, Temp_byte_Variable5) == 0x000128, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, CallFunc_SpawnTooltipContext_ReturnValue2) == 0x000130, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::CallFunc_SpawnTooltipContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, CallFunc_GetTooltipTextFromToken_OutText) == 0x000138, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::CallFunc_GetTooltipTextFromToken_OutText' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, CallFunc_GetTooltipTextFromToken_ReturnValue) == 0x000150, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::CallFunc_GetTooltipTextFromToken_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, Temp_byte_Variable6) == 0x000151, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, K2Node_MakeStruct_FormatArgumentData3) == 0x000158, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::K2Node_MakeStruct_FormatArgumentData3' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, K2Node_MakeArray_Array2) == 0x000198, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, CallFunc_TextIsEmpty_ReturnValue) == 0x0001A8, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, CallFunc_Format_ReturnValue2) == 0x0001B0, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::CallFunc_Format_ReturnValue2' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, CallFunc_IsValid_ReturnValue2) == 0x0001C8, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, CallFunc_GetOwningQuest_ReturnValue) == 0x0001D0, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::CallFunc_GetOwningQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, CallFunc_IsValid_ReturnValue3) == 0x0001D8, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, CallFunc_IsQuestPinned_ReturnValue) == 0x0001D9, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::CallFunc_IsQuestPinned_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, CallFunc_Not_PreBool_ReturnValue) == 0x0001DA, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, CallFunc_HasCompleted_ReturnValue) == 0x0001DB, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::CallFunc_HasCompleted_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, K2Node_Select_Default) == 0x0001DC, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, CallFunc_Not_PreBool_ReturnValue2) == 0x0001DD, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, CallFunc_BooleanAND_ReturnValue) == 0x0001DE, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, CallFunc_BooleanOR_ReturnValue) == 0x0001DF, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, K2Node_Select2_Default) == 0x0001E0, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_UpdateObjectiveText, K2Node_Select3_Default) == 0x0001E1, "Member 'QuestTrackerSubEntry_C_UpdateObjectiveText::K2Node_Select3_Default' has a wrong offset!");

// Function QuestTrackerSubEntry.QuestTrackerSubEntry_C.HideIfEmpty
// 0x0028 (0x0028 - 0x0000)
struct QuestTrackerSubEntry_C_HideIfEmpty final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestTrackerSubEntry_C_HideIfEmpty) == 0x000008, "Wrong alignment on QuestTrackerSubEntry_C_HideIfEmpty");
static_assert(sizeof(QuestTrackerSubEntry_C_HideIfEmpty) == 0x000028, "Wrong size on QuestTrackerSubEntry_C_HideIfEmpty");
static_assert(offsetof(QuestTrackerSubEntry_C_HideIfEmpty, Temp_bool_Variable) == 0x000000, "Member 'QuestTrackerSubEntry_C_HideIfEmpty::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_HideIfEmpty, Temp_byte_Variable) == 0x000001, "Member 'QuestTrackerSubEntry_C_HideIfEmpty::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_HideIfEmpty, Temp_byte_Variable2) == 0x000002, "Member 'QuestTrackerSubEntry_C_HideIfEmpty::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_HideIfEmpty, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'QuestTrackerSubEntry_C_HideIfEmpty::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_HideIfEmpty, CallFunc_TextIsEmpty_ReturnValue) == 0x000020, "Member 'QuestTrackerSubEntry_C_HideIfEmpty::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_HideIfEmpty, K2Node_Select_Default) == 0x000021, "Member 'QuestTrackerSubEntry_C_HideIfEmpty::K2Node_Select_Default' has a wrong offset!");

// Function QuestTrackerSubEntry.QuestTrackerSubEntry_C.GetHeightEstimate
// 0x0030 (0x0030 - 0x0000)
struct QuestTrackerSubEntry_C_GetHeightEstimate final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMissionHUDTextLineHeightEstimate_ReturnValue; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestTrackerSubEntry_C_GetHeightEstimate) == 0x000008, "Wrong alignment on QuestTrackerSubEntry_C_GetHeightEstimate");
static_assert(sizeof(QuestTrackerSubEntry_C_GetHeightEstimate) == 0x000030, "Wrong size on QuestTrackerSubEntry_C_GetHeightEstimate");
static_assert(offsetof(QuestTrackerSubEntry_C_GetHeightEstimate, ReturnValue) == 0x000000, "Member 'QuestTrackerSubEntry_C_GetHeightEstimate::ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_GetHeightEstimate, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'QuestTrackerSubEntry_C_GetHeightEstimate::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_GetHeightEstimate, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'QuestTrackerSubEntry_C_GetHeightEstimate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_GetHeightEstimate, CallFunc_GetMissionHUDTextLineHeightEstimate_ReturnValue) == 0x000024, "Member 'QuestTrackerSubEntry_C_GetHeightEstimate::CallFunc_GetMissionHUDTextLineHeightEstimate_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_GetHeightEstimate, CallFunc_FMax_ReturnValue) == 0x000028, "Member 'QuestTrackerSubEntry_C_GetHeightEstimate::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestTrackerSubEntry_C_GetHeightEstimate, CallFunc_Add_FloatFloat_ReturnValue) == 0x00002C, "Member 'QuestTrackerSubEntry_C_GetHeightEstimate::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

}

