#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestObjectiveEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function QuestObjectiveEntry.QuestObjectiveEntry_C.ExecuteUbergraph_QuestObjectiveEntry
// 0x0020 (0x0020 - 0x0000)
struct QuestObjectiveEntry_C_ExecuteUbergraph_QuestObjectiveEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_InData;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestObjectiveInfo*                K2Node_DynamicCast_AsFort_Quest_Objective_Info;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestObjectiveEntry_C_ExecuteUbergraph_QuestObjectiveEntry) == 0x000008, "Wrong alignment on QuestObjectiveEntry_C_ExecuteUbergraph_QuestObjectiveEntry");
static_assert(sizeof(QuestObjectiveEntry_C_ExecuteUbergraph_QuestObjectiveEntry) == 0x000020, "Wrong size on QuestObjectiveEntry_C_ExecuteUbergraph_QuestObjectiveEntry");
static_assert(offsetof(QuestObjectiveEntry_C_ExecuteUbergraph_QuestObjectiveEntry, EntryPoint) == 0x000000, "Member 'QuestObjectiveEntry_C_ExecuteUbergraph_QuestObjectiveEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_ExecuteUbergraph_QuestObjectiveEntry, K2Node_Event_InData) == 0x000008, "Member 'QuestObjectiveEntry_C_ExecuteUbergraph_QuestObjectiveEntry::K2Node_Event_InData' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_ExecuteUbergraph_QuestObjectiveEntry, K2Node_DynamicCast_AsFort_Quest_Objective_Info) == 0x000010, "Member 'QuestObjectiveEntry_C_ExecuteUbergraph_QuestObjectiveEntry::K2Node_DynamicCast_AsFort_Quest_Objective_Info' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_ExecuteUbergraph_QuestObjectiveEntry, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'QuestObjectiveEntry_C_ExecuteUbergraph_QuestObjectiveEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function QuestObjectiveEntry.QuestObjectiveEntry_C.SetData
// 0x0008 (0x0008 - 0x0000)
struct QuestObjectiveEntry_C_SetData final
{
public:
	class UObject*                                InData;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestObjectiveEntry_C_SetData) == 0x000008, "Wrong alignment on QuestObjectiveEntry_C_SetData");
static_assert(sizeof(QuestObjectiveEntry_C_SetData) == 0x000008, "Wrong size on QuestObjectiveEntry_C_SetData");
static_assert(offsetof(QuestObjectiveEntry_C_SetData, InData) == 0x000000, "Member 'QuestObjectiveEntry_C_SetData::InData' has a wrong offset!");

// Function QuestObjectiveEntry.QuestObjectiveEntry_C.UpdateProgress
// 0x0018 (0x0018 - 0x0000)
struct QuestObjectiveEntry_C_UpdateProgress final
{
public:
	class UFortQuestObjectiveInfo*                Objective;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AchievedCount;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCompleted_ReturnValue;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestObjectiveEntry_C_UpdateProgress) == 0x000008, "Wrong alignment on QuestObjectiveEntry_C_UpdateProgress");
static_assert(sizeof(QuestObjectiveEntry_C_UpdateProgress) == 0x000018, "Wrong size on QuestObjectiveEntry_C_UpdateProgress");
static_assert(offsetof(QuestObjectiveEntry_C_UpdateProgress, Objective) == 0x000000, "Member 'QuestObjectiveEntry_C_UpdateProgress::Objective' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_UpdateProgress, AchievedCount) == 0x000008, "Member 'QuestObjectiveEntry_C_UpdateProgress::AchievedCount' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_UpdateProgress, Temp_byte_Variable) == 0x00000C, "Member 'QuestObjectiveEntry_C_UpdateProgress::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_UpdateProgress, CallFunc_HasCompleted_ReturnValue) == 0x00000D, "Member 'QuestObjectiveEntry_C_UpdateProgress::CallFunc_HasCompleted_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_UpdateProgress, Temp_byte_Variable2) == 0x00000E, "Member 'QuestObjectiveEntry_C_UpdateProgress::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_UpdateProgress, Temp_bool_Variable) == 0x00000F, "Member 'QuestObjectiveEntry_C_UpdateProgress::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_UpdateProgress, K2Node_Select_Default) == 0x000010, "Member 'QuestObjectiveEntry_C_UpdateProgress::K2Node_Select_Default' has a wrong offset!");

// Function QuestObjectiveEntry.QuestObjectiveEntry_C.Update
// 0x00B8 (0x00B8 - 0x0000)
struct QuestObjectiveEntry_C_Update final
{
public:
	class UFortQuestObjectiveInfo*                Objective;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AchievedCount;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortTooltipContext*                    CallFunc_SpawnTooltipContext_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0020(0x0018)()
	class UFortTooltipContext*                    CallFunc_SpawnTooltipContext_ReturnValue2;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortGameStateZone*                     K2Node_DynamicCast_AsFort_Game_State_Zone;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTooltipUIContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCombinedDescription_OutDescription;    // 0x0070(0x0018)()
	bool                                          CallFunc_GetCombinedDescription_ReturnValue;       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTooltipUIContext*                  CallFunc_GetContext_ReturnValue2;                  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCombinedDescription_OutDescription2;   // 0x0098(0x0018)()
	bool                                          CallFunc_GetCombinedDescription_ReturnValue2;      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestObjectiveEntry_C_Update) == 0x000008, "Wrong alignment on QuestObjectiveEntry_C_Update");
static_assert(sizeof(QuestObjectiveEntry_C_Update) == 0x0000B8, "Wrong size on QuestObjectiveEntry_C_Update");
static_assert(offsetof(QuestObjectiveEntry_C_Update, Objective) == 0x000000, "Member 'QuestObjectiveEntry_C_Update::Objective' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_Update, AchievedCount) == 0x000008, "Member 'QuestObjectiveEntry_C_Update::AchievedCount' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_Update, Temp_byte_Variable) == 0x00000C, "Member 'QuestObjectiveEntry_C_Update::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_Update, CallFunc_IsValid_ReturnValue) == 0x00000D, "Member 'QuestObjectiveEntry_C_Update::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_Update, Temp_byte_Variable2) == 0x00000E, "Member 'QuestObjectiveEntry_C_Update::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_Update, Temp_bool_Variable) == 0x00000F, "Member 'QuestObjectiveEntry_C_Update::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_Update, CallFunc_SpawnTooltipContext_ReturnValue) == 0x000010, "Member 'QuestObjectiveEntry_C_Update::CallFunc_SpawnTooltipContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_Update, Temp_byte_Variable3) == 0x000018, "Member 'QuestObjectiveEntry_C_Update::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_Update, CallFunc_GetText_ReturnValue) == 0x000020, "Member 'QuestObjectiveEntry_C_Update::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_Update, CallFunc_SpawnTooltipContext_ReturnValue2) == 0x000038, "Member 'QuestObjectiveEntry_C_Update::CallFunc_SpawnTooltipContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_Update, CallFunc_TextIsEmpty_ReturnValue) == 0x000040, "Member 'QuestObjectiveEntry_C_Update::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_Update, CallFunc_GetGameState_ReturnValue) == 0x000048, "Member 'QuestObjectiveEntry_C_Update::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_Update, K2Node_DynamicCast_AsFort_Game_State_Zone) == 0x000050, "Member 'QuestObjectiveEntry_C_Update::K2Node_DynamicCast_AsFort_Game_State_Zone' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_Update, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'QuestObjectiveEntry_C_Update::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_Update, K2Node_Select_Default) == 0x000059, "Member 'QuestObjectiveEntry_C_Update::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_Update, Temp_byte_Variable4) == 0x00005A, "Member 'QuestObjectiveEntry_C_Update::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_Update, Temp_bool_Variable2) == 0x00005B, "Member 'QuestObjectiveEntry_C_Update::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_Update, CallFunc_GetContext_ReturnValue) == 0x000060, "Member 'QuestObjectiveEntry_C_Update::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_Update, K2Node_Select2_Default) == 0x000068, "Member 'QuestObjectiveEntry_C_Update::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_Update, CallFunc_GetCombinedDescription_OutDescription) == 0x000070, "Member 'QuestObjectiveEntry_C_Update::CallFunc_GetCombinedDescription_OutDescription' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_Update, CallFunc_GetCombinedDescription_ReturnValue) == 0x000088, "Member 'QuestObjectiveEntry_C_Update::CallFunc_GetCombinedDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_Update, CallFunc_GetContext_ReturnValue2) == 0x000090, "Member 'QuestObjectiveEntry_C_Update::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_Update, CallFunc_GetCombinedDescription_OutDescription2) == 0x000098, "Member 'QuestObjectiveEntry_C_Update::CallFunc_GetCombinedDescription_OutDescription2' has a wrong offset!");
static_assert(offsetof(QuestObjectiveEntry_C_Update, CallFunc_GetCombinedDescription_ReturnValue2) == 0x0000B0, "Member 'QuestObjectiveEntry_C_Update::CallFunc_GetCombinedDescription_ReturnValue2' has a wrong offset!");

}

