#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestsModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QuestsModal.QuestsModal_C
// 0x0048 (0x0430 - 0x03E8)
class UQuestsModal_C final : public UFortActivatablePanel
{
public:
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(Transient, DuplicateTransient)
	class UBottomBarWidget_C*                     BottomBarWidget;                                   // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestScreen_C*                         QuestScreen;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    CloseButton;                                       // 0x0418(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          ClosingPanel;                                      // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_QuestsModal(int32 EntryPoint);
	void OnActivated();
	void Construct();
	void ClosePanel(bool* bCommitted);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuestsModal_C">();
	}
	static class UQuestsModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestsModal_C>();
	}
};
static_assert(alignof(UQuestsModal_C) == 0x000008, "Wrong alignment on UQuestsModal_C");
static_assert(sizeof(UQuestsModal_C) == 0x000430, "Wrong size on UQuestsModal_C");
static_assert(offsetof(UQuestsModal_C, UberGraphFrame) == 0x0003F0, "Member 'UQuestsModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQuestsModal_C, BottomBarWidget) == 0x0003F8, "Member 'UQuestsModal_C::BottomBarWidget' has a wrong offset!");
static_assert(offsetof(UQuestsModal_C, Lightbox) == 0x000400, "Member 'UQuestsModal_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UQuestsModal_C, QuestScreen) == 0x000408, "Member 'UQuestsModal_C::QuestScreen' has a wrong offset!");
static_assert(offsetof(UQuestsModal_C, SafeZone_0) == 0x000410, "Member 'UQuestsModal_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UQuestsModal_C, CloseButton) == 0x000418, "Member 'UQuestsModal_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UQuestsModal_C, ClosingPanel) == 0x000428, "Member 'UQuestsModal_C::ClosingPanel' has a wrong offset!");

}

