#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestsModal

#include "Basic.hpp"


namespace SDK::Params
{

// Function QuestsModal.QuestsModal_C.ExecuteUbergraph_QuestsModal
// 0x0028 (0x0028 - 0x0000)
struct QuestsModal_C_ExecuteUbergraph_QuestsModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputManager*                    CallFunc_GetInputManager_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestsModal_C_ExecuteUbergraph_QuestsModal) == 0x000008, "Wrong alignment on QuestsModal_C_ExecuteUbergraph_QuestsModal");
static_assert(sizeof(QuestsModal_C_ExecuteUbergraph_QuestsModal) == 0x000028, "Wrong size on QuestsModal_C_ExecuteUbergraph_QuestsModal");
static_assert(offsetof(QuestsModal_C_ExecuteUbergraph_QuestsModal, EntryPoint) == 0x000000, "Member 'QuestsModal_C_ExecuteUbergraph_QuestsModal::EntryPoint' has a wrong offset!");
static_assert(offsetof(QuestsModal_C_ExecuteUbergraph_QuestsModal, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'QuestsModal_C_ExecuteUbergraph_QuestsModal::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(QuestsModal_C_ExecuteUbergraph_QuestsModal, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'QuestsModal_C_ExecuteUbergraph_QuestsModal::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestsModal_C_ExecuteUbergraph_QuestsModal, CallFunc_GetInputManager_ReturnValue) == 0x000020, "Member 'QuestsModal_C_ExecuteUbergraph_QuestsModal::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");

// Function QuestsModal.QuestsModal_C.ClosePanel
// 0x0028 (0x0028 - 0x0000)
struct QuestsModal_C_ClosePanel final
{
public:
	bool                                          bCommitted;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputManager*                    CallFunc_GetInputManager_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestsModal_C_ClosePanel) == 0x000008, "Wrong alignment on QuestsModal_C_ClosePanel");
static_assert(sizeof(QuestsModal_C_ClosePanel) == 0x000028, "Wrong size on QuestsModal_C_ClosePanel");
static_assert(offsetof(QuestsModal_C_ClosePanel, bCommitted) == 0x000000, "Member 'QuestsModal_C_ClosePanel::bCommitted' has a wrong offset!");
static_assert(offsetof(QuestsModal_C_ClosePanel, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'QuestsModal_C_ClosePanel::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestsModal_C_ClosePanel, CallFunc_GetContext_ReturnValue2) == 0x000010, "Member 'QuestsModal_C_ClosePanel::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(QuestsModal_C_ClosePanel, CallFunc_GetInputManager_ReturnValue) == 0x000018, "Member 'QuestsModal_C_ClosePanel::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestsModal_C_ClosePanel, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000020, "Member 'QuestsModal_C_ClosePanel::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

}

