#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuickbarSlotCooldown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ItemDisplayStyle_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QuickbarSlotCooldown.QuickbarSlotCooldown_C
// 0x0028 (0x02C8 - 0x02A0)
class UQuickbarSlotCooldown_C final : public UFortItemCooldownWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 ImageRadialOpacityLayer;                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageRectangularOpacityLayer;                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  SwitcherOpacityOverlay;                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EItemDisplayStyle                             ItemDisplayStyle;                                  // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_QuickbarSlotCooldown(int32 EntryPoint);
	void OnCooldownStopped(EFortItemCooldownType CooldownType);
	void OnCooldownStarted(EFortItemCooldownType CooldownType);
	void Show_Countdown(bool Show);
	void Initialize(EItemDisplayStyle QuickbarItemDisplayStyle, TArray<EFortItemCooldownType>& DesiredCooldownTypesSupported);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuickbarSlotCooldown_C">();
	}
	static class UQuickbarSlotCooldown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuickbarSlotCooldown_C>();
	}
};
static_assert(alignof(UQuickbarSlotCooldown_C) == 0x000008, "Wrong alignment on UQuickbarSlotCooldown_C");
static_assert(sizeof(UQuickbarSlotCooldown_C) == 0x0002C8, "Wrong size on UQuickbarSlotCooldown_C");
static_assert(offsetof(UQuickbarSlotCooldown_C, UberGraphFrame) == 0x0002A0, "Member 'UQuickbarSlotCooldown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQuickbarSlotCooldown_C, ImageRadialOpacityLayer) == 0x0002A8, "Member 'UQuickbarSlotCooldown_C::ImageRadialOpacityLayer' has a wrong offset!");
static_assert(offsetof(UQuickbarSlotCooldown_C, ImageRectangularOpacityLayer) == 0x0002B0, "Member 'UQuickbarSlotCooldown_C::ImageRectangularOpacityLayer' has a wrong offset!");
static_assert(offsetof(UQuickbarSlotCooldown_C, SwitcherOpacityOverlay) == 0x0002B8, "Member 'UQuickbarSlotCooldown_C::SwitcherOpacityOverlay' has a wrong offset!");
static_assert(offsetof(UQuickbarSlotCooldown_C, ItemDisplayStyle) == 0x0002C0, "Member 'UQuickbarSlotCooldown_C::ItemDisplayStyle' has a wrong offset!");

}

