#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Results_TeamScore

#include "Basic.hpp"


namespace SDK::Params
{

// Function Results_TeamScore.Results_TeamScore_C.ExecuteUbergraph_Results_TeamScore
// 0x0020 (0x0020 - 0x0000)
struct Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue4;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue5;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue6;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue7;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue8;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue9;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue10;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue11;                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue12;                  // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue13;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue14;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue15;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue16;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue17;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue18;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore) == 0x000008, "Wrong alignment on Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore");
static_assert(sizeof(Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore) == 0x000020, "Wrong size on Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore");
static_assert(offsetof(Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore, EntryPoint) == 0x000000, "Member 'Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore::EntryPoint' has a wrong offset!");
static_assert(offsetof(Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore, CallFunc_BooleanOR_ReturnValue2) == 0x000005, "Member 'Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore, CallFunc_BooleanOR_ReturnValue3) == 0x000006, "Member 'Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore, CallFunc_BooleanOR_ReturnValue4) == 0x000007, "Member 'Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore::CallFunc_BooleanOR_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore, CallFunc_BooleanOR_ReturnValue5) == 0x000008, "Member 'Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore::CallFunc_BooleanOR_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore, CallFunc_BooleanOR_ReturnValue6) == 0x000009, "Member 'Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore::CallFunc_BooleanOR_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore, CallFunc_BooleanOR_ReturnValue7) == 0x00000A, "Member 'Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore::CallFunc_BooleanOR_ReturnValue7' has a wrong offset!");
static_assert(offsetof(Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore, CallFunc_BooleanOR_ReturnValue8) == 0x00000B, "Member 'Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore::CallFunc_BooleanOR_ReturnValue8' has a wrong offset!");
static_assert(offsetof(Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore, CallFunc_BooleanOR_ReturnValue9) == 0x00000C, "Member 'Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore::CallFunc_BooleanOR_ReturnValue9' has a wrong offset!");
static_assert(offsetof(Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore, CallFunc_BooleanOR_ReturnValue10) == 0x00000D, "Member 'Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore::CallFunc_BooleanOR_ReturnValue10' has a wrong offset!");
static_assert(offsetof(Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore, CallFunc_BooleanOR_ReturnValue11) == 0x00000E, "Member 'Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore::CallFunc_BooleanOR_ReturnValue11' has a wrong offset!");
static_assert(offsetof(Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore, CallFunc_BooleanOR_ReturnValue12) == 0x00000F, "Member 'Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore::CallFunc_BooleanOR_ReturnValue12' has a wrong offset!");
static_assert(offsetof(Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore, CallFunc_BooleanOR_ReturnValue13) == 0x000010, "Member 'Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore::CallFunc_BooleanOR_ReturnValue13' has a wrong offset!");
static_assert(offsetof(Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore, CallFunc_BooleanOR_ReturnValue14) == 0x000011, "Member 'Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore::CallFunc_BooleanOR_ReturnValue14' has a wrong offset!");
static_assert(offsetof(Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore, CallFunc_BooleanOR_ReturnValue15) == 0x000012, "Member 'Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore::CallFunc_BooleanOR_ReturnValue15' has a wrong offset!");
static_assert(offsetof(Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore, CallFunc_BooleanOR_ReturnValue16) == 0x000013, "Member 'Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore::CallFunc_BooleanOR_ReturnValue16' has a wrong offset!");
static_assert(offsetof(Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore, CallFunc_BooleanOR_ReturnValue17) == 0x000014, "Member 'Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore::CallFunc_BooleanOR_ReturnValue17' has a wrong offset!");
static_assert(offsetof(Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore, CallFunc_BooleanOR_ReturnValue18) == 0x000015, "Member 'Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore::CallFunc_BooleanOR_ReturnValue18' has a wrong offset!");
static_assert(offsetof(Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore, K2Node_ComponentBoundEvent_Button) == 0x000018, "Member 'Results_TeamScore_C_ExecuteUbergraph_Results_TeamScore::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function Results_TeamScore.Results_TeamScore_C.BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Results_TeamScore_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeamScore_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on Results_TeamScore_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(Results_TeamScore_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on Results_TeamScore_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(Results_TeamScore_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'Results_TeamScore_C_BndEvt__ButtonContinue_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function Results_TeamScore.Results_TeamScore_C.Initialize
// 0x0020 (0x0020 - 0x0000)
struct Results_TeamScore_C_Initialize final
{
public:
	class UFortUIScoreReport*                     ScoreReport;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UResults_TeamTotalScore_C*              Param_TeamTotalScore;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(Results_TeamScore_C_Initialize) == 0x000008, "Wrong alignment on Results_TeamScore_C_Initialize");
static_assert(sizeof(Results_TeamScore_C_Initialize) == 0x000020, "Wrong size on Results_TeamScore_C_Initialize");
static_assert(offsetof(Results_TeamScore_C_Initialize, ScoreReport) == 0x000000, "Member 'Results_TeamScore_C_Initialize::ScoreReport' has a wrong offset!");
static_assert(offsetof(Results_TeamScore_C_Initialize, Param_TeamTotalScore) == 0x000008, "Member 'Results_TeamScore_C_Initialize::Param_TeamTotalScore' has a wrong offset!");
static_assert(offsetof(Results_TeamScore_C_Initialize, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'Results_TeamScore_C_Initialize::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function Results_TeamScore.Results_TeamScore_C.InitializeDelays
// 0x0018 (0x0018 - 0x0000)
struct Results_TeamScore_C_InitializeDelays final
{
public:
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue3;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue4;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue5;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue6;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeamScore_C_InitializeDelays) == 0x000004, "Wrong alignment on Results_TeamScore_C_InitializeDelays");
static_assert(sizeof(Results_TeamScore_C_InitializeDelays) == 0x000018, "Wrong size on Results_TeamScore_C_InitializeDelays");
static_assert(offsetof(Results_TeamScore_C_InitializeDelays, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000000, "Member 'Results_TeamScore_C_InitializeDelays::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_TeamScore_C_InitializeDelays, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x000004, "Member 'Results_TeamScore_C_InitializeDelays::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Results_TeamScore_C_InitializeDelays, CallFunc_Divide_FloatFloat_ReturnValue3) == 0x000008, "Member 'Results_TeamScore_C_InitializeDelays::CallFunc_Divide_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Results_TeamScore_C_InitializeDelays, CallFunc_Divide_FloatFloat_ReturnValue4) == 0x00000C, "Member 'Results_TeamScore_C_InitializeDelays::CallFunc_Divide_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Results_TeamScore_C_InitializeDelays, CallFunc_Divide_FloatFloat_ReturnValue5) == 0x000010, "Member 'Results_TeamScore_C_InitializeDelays::CallFunc_Divide_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Results_TeamScore_C_InitializeDelays, CallFunc_Divide_FloatFloat_ReturnValue6) == 0x000014, "Member 'Results_TeamScore_C_InitializeDelays::CallFunc_Divide_FloatFloat_ReturnValue6' has a wrong offset!");

// Function Results_TeamScore.Results_TeamScore_C.Focus
// 0x0008 (0x0008 - 0x0000)
struct Results_TeamScore_C_Focus final
{
public:
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Results_TeamScore_C_Focus) == 0x000008, "Wrong alignment on Results_TeamScore_C_Focus");
static_assert(sizeof(Results_TeamScore_C_Focus) == 0x000008, "Wrong size on Results_TeamScore_C_Focus");
static_assert(offsetof(Results_TeamScore_C_Focus, CallFunc_GetUINavigationManager_ReturnValue) == 0x000000, "Member 'Results_TeamScore_C_Focus::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

}

