#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Results_StatsSubtypeBox

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function Results_StatsSubtypeBox.Results_StatsSubtypeBox_C.ExecuteUbergraph_Results_StatsSubtypeBox
// 0x0008 (0x0008 - 0x0000)
struct Results_StatsSubtypeBox_C_ExecuteUbergraph_Results_StatsSubtypeBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_StatsSubtypeBox_C_ExecuteUbergraph_Results_StatsSubtypeBox) == 0x000004, "Wrong alignment on Results_StatsSubtypeBox_C_ExecuteUbergraph_Results_StatsSubtypeBox");
static_assert(sizeof(Results_StatsSubtypeBox_C_ExecuteUbergraph_Results_StatsSubtypeBox) == 0x000008, "Wrong size on Results_StatsSubtypeBox_C_ExecuteUbergraph_Results_StatsSubtypeBox");
static_assert(offsetof(Results_StatsSubtypeBox_C_ExecuteUbergraph_Results_StatsSubtypeBox, EntryPoint) == 0x000000, "Member 'Results_StatsSubtypeBox_C_ExecuteUbergraph_Results_StatsSubtypeBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(Results_StatsSubtypeBox_C_ExecuteUbergraph_Results_StatsSubtypeBox, K2Node_Event_IsDesignTime) == 0x000004, "Member 'Results_StatsSubtypeBox_C_ExecuteUbergraph_Results_StatsSubtypeBox::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function Results_StatsSubtypeBox.Results_StatsSubtypeBox_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Results_StatsSubtypeBox_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_StatsSubtypeBox_C_PreConstruct) == 0x000001, "Wrong alignment on Results_StatsSubtypeBox_C_PreConstruct");
static_assert(sizeof(Results_StatsSubtypeBox_C_PreConstruct) == 0x000001, "Wrong size on Results_StatsSubtypeBox_C_PreConstruct");
static_assert(offsetof(Results_StatsSubtypeBox_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Results_StatsSubtypeBox_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function Results_StatsSubtypeBox.Results_StatsSubtypeBox_C.InitializeScoreType
// 0x0370 (0x0370 - 0x0000)
struct Results_StatsSubtypeBox_C_InitializeScoreType final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0008(0x0010)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0018(0x0018)(Edit, BlueprintVisible)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue;    // 0x0030(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortScoreStylingInfo                  CallFunc_GetScoreStylingData_ScoreStylingInfo;     // 0x0040(0x02F8)()
	bool                                          CallFunc_GetScoreStylingData_ReturnValue;          // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0340(0x0028)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Results_StatsSubtypeBox_C_InitializeScoreType) == 0x000008, "Wrong alignment on Results_StatsSubtypeBox_C_InitializeScoreType");
static_assert(sizeof(Results_StatsSubtypeBox_C_InitializeScoreType) == 0x000370, "Wrong size on Results_StatsSubtypeBox_C_InitializeScoreType");
static_assert(offsetof(Results_StatsSubtypeBox_C_InitializeScoreType, Texture) == 0x000000, "Member 'Results_StatsSubtypeBox_C_InitializeScoreType::Texture' has a wrong offset!");
static_assert(offsetof(Results_StatsSubtypeBox_C_InitializeScoreType, Color) == 0x000008, "Member 'Results_StatsSubtypeBox_C_InitializeScoreType::Color' has a wrong offset!");
static_assert(offsetof(Results_StatsSubtypeBox_C_InitializeScoreType, Text) == 0x000018, "Member 'Results_StatsSubtypeBox_C_InitializeScoreType::Text' has a wrong offset!");
static_assert(offsetof(Results_StatsSubtypeBox_C_InitializeScoreType, CallFunc_Multiply_LinearColorFloat_ReturnValue) == 0x000030, "Member 'Results_StatsSubtypeBox_C_InitializeScoreType::CallFunc_Multiply_LinearColorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_StatsSubtypeBox_C_InitializeScoreType, CallFunc_GetScoreStylingData_ScoreStylingInfo) == 0x000040, "Member 'Results_StatsSubtypeBox_C_InitializeScoreType::CallFunc_GetScoreStylingData_ScoreStylingInfo' has a wrong offset!");
static_assert(offsetof(Results_StatsSubtypeBox_C_InitializeScoreType, CallFunc_GetScoreStylingData_ReturnValue) == 0x000338, "Member 'Results_StatsSubtypeBox_C_InitializeScoreType::CallFunc_GetScoreStylingData_ReturnValue' has a wrong offset!");
static_assert(offsetof(Results_StatsSubtypeBox_C_InitializeScoreType, K2Node_MakeStruct_SlateColor) == 0x000340, "Member 'Results_StatsSubtypeBox_C_InitializeScoreType::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(Results_StatsSubtypeBox_C_InitializeScoreType, K2Node_SwitchEnum_CmpSuccess) == 0x000368, "Member 'Results_StatsSubtypeBox_C_InitializeScoreType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

