#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RotatorSelector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RotatorSelector.RotatorSelector_C
// 0x0050 (0x0260 - 0x0210)
class URotatorSelector_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UCommonTextBlock*                       DisplayText;                                       // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextRotator_C*                         TextRotator;                                       // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         SelectedIndex;                                     // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   HoverText;                                         // 0x0230(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	UMulticastDelegateProperty_                   Selection_Changed;                                 // 0x0248(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UCommonTextBlock*                       Tab_Tooltip_Text;                                  // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Selection_Changed__DelegateSignature(int32 Selected_Index);
	void ExecuteUbergraph_RotatorSelector(int32 EntryPoint);
	void BndEvt__TextRotator_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__TextRotator_K2Node_ComponentBoundEvent_5_OnRotated__DelegateSignature(int32 Value);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void Construct();
	void Update_Row_Selector(int32 Currently_Selected);
	void Initialize(const class FText& Display_Text, TArray<class FText>& Options, const class FText& Hover_Text, class UCommonTextBlock* Tab_Tooltip);
	void Center_on_Widget();
	void Update_Options(TArray<class FText>& NewParam);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RotatorSelector_C">();
	}
	static class URotatorSelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URotatorSelector_C>();
	}
};
static_assert(alignof(URotatorSelector_C) == 0x000008, "Wrong alignment on URotatorSelector_C");
static_assert(sizeof(URotatorSelector_C) == 0x000260, "Wrong size on URotatorSelector_C");
static_assert(offsetof(URotatorSelector_C, UberGraphFrame) == 0x000210, "Member 'URotatorSelector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URotatorSelector_C, DisplayText) == 0x000218, "Member 'URotatorSelector_C::DisplayText' has a wrong offset!");
static_assert(offsetof(URotatorSelector_C, TextRotator) == 0x000220, "Member 'URotatorSelector_C::TextRotator' has a wrong offset!");
static_assert(offsetof(URotatorSelector_C, SelectedIndex) == 0x000228, "Member 'URotatorSelector_C::SelectedIndex' has a wrong offset!");
static_assert(offsetof(URotatorSelector_C, HoverText) == 0x000230, "Member 'URotatorSelector_C::HoverText' has a wrong offset!");
static_assert(offsetof(URotatorSelector_C, Selection_Changed) == 0x000248, "Member 'URotatorSelector_C::Selection_Changed' has a wrong offset!");
static_assert(offsetof(URotatorSelector_C, Tab_Tooltip_Text) == 0x000258, "Member 'URotatorSelector_C::Tab_Tooltip_Text' has a wrong offset!");

}

