#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScoreBarsWidget

#include "Basic.hpp"

#include "CollectionMissionBadgeDisplayInfo_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ScoreBarsWidget.ScoreBarsWidget_C.ExecuteUbergraph_ScoreBarsWidget
// 0x0040 (0x0040 - 0x0000)
struct ScoreBarsWidget_C_ExecuteUbergraph_ScoreBarsWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasValidBadgeInfos_bHasValidBadgeInfos;   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortMissionState* MissionState)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(ScoreBarsWidget_C_ExecuteUbergraph_ScoreBarsWidget) == 0x000008, "Wrong alignment on ScoreBarsWidget_C_ExecuteUbergraph_ScoreBarsWidget");
static_assert(sizeof(ScoreBarsWidget_C_ExecuteUbergraph_ScoreBarsWidget) == 0x000040, "Wrong size on ScoreBarsWidget_C_ExecuteUbergraph_ScoreBarsWidget");
static_assert(offsetof(ScoreBarsWidget_C_ExecuteUbergraph_ScoreBarsWidget, EntryPoint) == 0x000000, "Member 'ScoreBarsWidget_C_ExecuteUbergraph_ScoreBarsWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_ExecuteUbergraph_ScoreBarsWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'ScoreBarsWidget_C_ExecuteUbergraph_ScoreBarsWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_ExecuteUbergraph_ScoreBarsWidget, CallFunc_HasValidBadgeInfos_bHasValidBadgeInfos) == 0x000018, "Member 'ScoreBarsWidget_C_ExecuteUbergraph_ScoreBarsWidget::CallFunc_HasValidBadgeInfos_bHasValidBadgeInfos' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_ExecuteUbergraph_ScoreBarsWidget, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'ScoreBarsWidget_C_ExecuteUbergraph_ScoreBarsWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_ExecuteUbergraph_ScoreBarsWidget, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'ScoreBarsWidget_C_ExecuteUbergraph_ScoreBarsWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_ExecuteUbergraph_ScoreBarsWidget, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'ScoreBarsWidget_C_ExecuteUbergraph_ScoreBarsWidget::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");

// Function ScoreBarsWidget.ScoreBarsWidget_C.HandleMissionsUpdated
// 0x0060 (0x0060 - 0x0000)
struct ScoreBarsWidget_C_HandleMissionsUpdated final
{
public:
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortMissionState* MissionState)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortMission*>                   CallFunc_GetAllLoadedMissions_ReturnValue;         // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortMission*                           CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesImplementInterface_ReturnValue;       // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ScoreBarsWidget_C_HandleMissionsUpdated) == 0x000008, "Wrong alignment on ScoreBarsWidget_C_HandleMissionsUpdated");
static_assert(sizeof(ScoreBarsWidget_C_HandleMissionsUpdated) == 0x000060, "Wrong size on ScoreBarsWidget_C_HandleMissionsUpdated");
static_assert(offsetof(ScoreBarsWidget_C_HandleMissionsUpdated, Temp_bool_True_if_break_was_hit_Variable) == 0x000000, "Member 'ScoreBarsWidget_C_HandleMissionsUpdated::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleMissionsUpdated, Temp_int_Array_Index_Variable) == 0x000004, "Member 'ScoreBarsWidget_C_HandleMissionsUpdated::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleMissionsUpdated, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'ScoreBarsWidget_C_HandleMissionsUpdated::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleMissionsUpdated, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'ScoreBarsWidget_C_HandleMissionsUpdated::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleMissionsUpdated, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'ScoreBarsWidget_C_HandleMissionsUpdated::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleMissionsUpdated, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'ScoreBarsWidget_C_HandleMissionsUpdated::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleMissionsUpdated, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'ScoreBarsWidget_C_HandleMissionsUpdated::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleMissionsUpdated, CallFunc_GetAllLoadedMissions_ReturnValue) == 0x000030, "Member 'ScoreBarsWidget_C_HandleMissionsUpdated::CallFunc_GetAllLoadedMissions_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleMissionsUpdated, CallFunc_IsValid_ReturnValue2) == 0x000040, "Member 'ScoreBarsWidget_C_HandleMissionsUpdated::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleMissionsUpdated, CallFunc_Array_Get_Item) == 0x000048, "Member 'ScoreBarsWidget_C_HandleMissionsUpdated::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleMissionsUpdated, CallFunc_IsValid_ReturnValue3) == 0x000050, "Member 'ScoreBarsWidget_C_HandleMissionsUpdated::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleMissionsUpdated, CallFunc_DoesImplementInterface_ReturnValue) == 0x000051, "Member 'ScoreBarsWidget_C_HandleMissionsUpdated::CallFunc_DoesImplementInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleMissionsUpdated, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'ScoreBarsWidget_C_HandleMissionsUpdated::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleMissionsUpdated, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'ScoreBarsWidget_C_HandleMissionsUpdated::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleMissionsUpdated, CallFunc_BooleanAND_ReturnValue) == 0x000059, "Member 'ScoreBarsWidget_C_HandleMissionsUpdated::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function ScoreBarsWidget.ScoreBarsWidget_C.InitializeScoreBars
// 0x0080 (0x0080 - 0x0000)
struct ScoreBarsWidget_C_InitializeScoreBars final
{
public:
	bool                                          CallFunc_HasValidBadgeInfos_bHasValidBadgeInfos;   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IScoreBadgeProviderMission_C> K2Node_DynamicCast_AsScore_Badge_Provider_Mission; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IScoreBadgeProviderMission_C> K2Node_DynamicCast_AsScore_Badge_Provider_Mission2; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCollectionMissionBadgeDisplayInfo> CallFunc_GetScoreBadgeInfos_BadgeInfos;            // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FCollectionMissionBadgeDisplayInfo> CallFunc_GetScoreBadgeInfos_BadgeInfos2;           // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	TScriptInterface<class IScoreBadgeProviderMission_C> K2Node_DynamicCast_AsScore_Badge_Provider_Mission3; // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCollectionMissionBadgeDisplayInfo> CallFunc_GetScoreBadgeInfos_BadgeInfos3;           // 0x0070(0x0010)(ZeroConstructor, ReferenceParm)
};
static_assert(alignof(ScoreBarsWidget_C_InitializeScoreBars) == 0x000008, "Wrong alignment on ScoreBarsWidget_C_InitializeScoreBars");
static_assert(sizeof(ScoreBarsWidget_C_InitializeScoreBars) == 0x000080, "Wrong size on ScoreBarsWidget_C_InitializeScoreBars");
static_assert(offsetof(ScoreBarsWidget_C_InitializeScoreBars, CallFunc_HasValidBadgeInfos_bHasValidBadgeInfos) == 0x000000, "Member 'ScoreBarsWidget_C_InitializeScoreBars::CallFunc_HasValidBadgeInfos_bHasValidBadgeInfos' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_InitializeScoreBars, K2Node_DynamicCast_AsScore_Badge_Provider_Mission) == 0x000008, "Member 'ScoreBarsWidget_C_InitializeScoreBars::K2Node_DynamicCast_AsScore_Badge_Provider_Mission' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_InitializeScoreBars, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'ScoreBarsWidget_C_InitializeScoreBars::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_InitializeScoreBars, K2Node_DynamicCast_AsScore_Badge_Provider_Mission2) == 0x000020, "Member 'ScoreBarsWidget_C_InitializeScoreBars::K2Node_DynamicCast_AsScore_Badge_Provider_Mission2' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_InitializeScoreBars, K2Node_DynamicCast_bSuccess2) == 0x000030, "Member 'ScoreBarsWidget_C_InitializeScoreBars::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_InitializeScoreBars, CallFunc_GetScoreBadgeInfos_BadgeInfos) == 0x000038, "Member 'ScoreBarsWidget_C_InitializeScoreBars::CallFunc_GetScoreBadgeInfos_BadgeInfos' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_InitializeScoreBars, CallFunc_GetScoreBadgeInfos_BadgeInfos2) == 0x000048, "Member 'ScoreBarsWidget_C_InitializeScoreBars::CallFunc_GetScoreBadgeInfos_BadgeInfos2' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_InitializeScoreBars, K2Node_DynamicCast_AsScore_Badge_Provider_Mission3) == 0x000058, "Member 'ScoreBarsWidget_C_InitializeScoreBars::K2Node_DynamicCast_AsScore_Badge_Provider_Mission3' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_InitializeScoreBars, K2Node_DynamicCast_bSuccess3) == 0x000068, "Member 'ScoreBarsWidget_C_InitializeScoreBars::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_InitializeScoreBars, CallFunc_GetScoreBadgeInfos_BadgeInfos3) == 0x000070, "Member 'ScoreBarsWidget_C_InitializeScoreBars::CallFunc_GetScoreBadgeInfos_BadgeInfos3' has a wrong offset!");

// Function ScoreBarsWidget.ScoreBarsWidget_C.HasValidBadgeInfos
// 0x0018 (0x0018 - 0x0000)
struct ScoreBarsWidget_C_HasValidBadgeInfos final
{
public:
	bool                                          bHasValidBadgeInfos;                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue3;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ScoreBarsWidget_C_HasValidBadgeInfos) == 0x000004, "Wrong alignment on ScoreBarsWidget_C_HasValidBadgeInfos");
static_assert(sizeof(ScoreBarsWidget_C_HasValidBadgeInfos) == 0x000018, "Wrong size on ScoreBarsWidget_C_HasValidBadgeInfos");
static_assert(offsetof(ScoreBarsWidget_C_HasValidBadgeInfos, bHasValidBadgeInfos) == 0x000000, "Member 'ScoreBarsWidget_C_HasValidBadgeInfos::bHasValidBadgeInfos' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HasValidBadgeInfos, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'ScoreBarsWidget_C_HasValidBadgeInfos::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HasValidBadgeInfos, CallFunc_Array_Length_ReturnValue2) == 0x000008, "Member 'ScoreBarsWidget_C_HasValidBadgeInfos::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HasValidBadgeInfos, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'ScoreBarsWidget_C_HasValidBadgeInfos::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HasValidBadgeInfos, CallFunc_Greater_IntInt_ReturnValue2) == 0x00000D, "Member 'ScoreBarsWidget_C_HasValidBadgeInfos::CallFunc_Greater_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HasValidBadgeInfos, CallFunc_Array_Length_ReturnValue3) == 0x000010, "Member 'ScoreBarsWidget_C_HasValidBadgeInfos::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HasValidBadgeInfos, CallFunc_Greater_IntInt_ReturnValue3) == 0x000014, "Member 'ScoreBarsWidget_C_HasValidBadgeInfos::CallFunc_Greater_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HasValidBadgeInfos, CallFunc_BooleanAND_ReturnValue) == 0x000015, "Member 'ScoreBarsWidget_C_HasValidBadgeInfos::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HasValidBadgeInfos, CallFunc_BooleanAND_ReturnValue2) == 0x000016, "Member 'ScoreBarsWidget_C_HasValidBadgeInfos::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");

// Function ScoreBarsWidget.ScoreBarsWidget_C.UpdateScoreTotals
// 0x0060 (0x0060 - 0x0000)
struct ScoreBarsWidget_C_UpdateScoreTotals final
{
public:
	int32                                         OldUtilityScore;                                   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OldBuildingScore;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OldCombatScore;                                    // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IScoreBadgeProviderMission_C> K2Node_DynamicCast_AsScore_Badge_Provider_Mission; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IScoreBadgeProviderMission_C> K2Node_DynamicCast_AsScore_Badge_Provider_Mission2; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTotalScore_Score;                      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalScore_Score2;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IScoreBadgeProviderMission_C> K2Node_DynamicCast_AsScore_Badge_Provider_Mission3; // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTotalScore_Score3;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ScoreBarsWidget_C_UpdateScoreTotals) == 0x000008, "Wrong alignment on ScoreBarsWidget_C_UpdateScoreTotals");
static_assert(sizeof(ScoreBarsWidget_C_UpdateScoreTotals) == 0x000060, "Wrong size on ScoreBarsWidget_C_UpdateScoreTotals");
static_assert(offsetof(ScoreBarsWidget_C_UpdateScoreTotals, OldUtilityScore) == 0x000000, "Member 'ScoreBarsWidget_C_UpdateScoreTotals::OldUtilityScore' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_UpdateScoreTotals, OldBuildingScore) == 0x000004, "Member 'ScoreBarsWidget_C_UpdateScoreTotals::OldBuildingScore' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_UpdateScoreTotals, OldCombatScore) == 0x000008, "Member 'ScoreBarsWidget_C_UpdateScoreTotals::OldCombatScore' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_UpdateScoreTotals, K2Node_DynamicCast_AsScore_Badge_Provider_Mission) == 0x000010, "Member 'ScoreBarsWidget_C_UpdateScoreTotals::K2Node_DynamicCast_AsScore_Badge_Provider_Mission' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_UpdateScoreTotals, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ScoreBarsWidget_C_UpdateScoreTotals::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_UpdateScoreTotals, K2Node_DynamicCast_AsScore_Badge_Provider_Mission2) == 0x000028, "Member 'ScoreBarsWidget_C_UpdateScoreTotals::K2Node_DynamicCast_AsScore_Badge_Provider_Mission2' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_UpdateScoreTotals, K2Node_DynamicCast_bSuccess2) == 0x000038, "Member 'ScoreBarsWidget_C_UpdateScoreTotals::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_UpdateScoreTotals, CallFunc_GetTotalScore_Score) == 0x00003C, "Member 'ScoreBarsWidget_C_UpdateScoreTotals::CallFunc_GetTotalScore_Score' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_UpdateScoreTotals, CallFunc_GetTotalScore_Score2) == 0x000040, "Member 'ScoreBarsWidget_C_UpdateScoreTotals::CallFunc_GetTotalScore_Score2' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_UpdateScoreTotals, K2Node_DynamicCast_AsScore_Badge_Provider_Mission3) == 0x000048, "Member 'ScoreBarsWidget_C_UpdateScoreTotals::K2Node_DynamicCast_AsScore_Badge_Provider_Mission3' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_UpdateScoreTotals, K2Node_DynamicCast_bSuccess3) == 0x000058, "Member 'ScoreBarsWidget_C_UpdateScoreTotals::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_UpdateScoreTotals, CallFunc_GetTotalScore_Score3) == 0x00005C, "Member 'ScoreBarsWidget_C_UpdateScoreTotals::CallFunc_GetTotalScore_Score3' has a wrong offset!");

// Function ScoreBarsWidget.ScoreBarsWidget_C.HandleUpdateUI
// 0x0010 (0x0010 - 0x0000)
struct ScoreBarsWidget_C_HandleUpdateUI final
{
public:
	class AFortMissionState*                      Mission;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasValidBadgeInfos_bHasValidBadgeInfos;   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ScoreBarsWidget_C_HandleUpdateUI) == 0x000008, "Wrong alignment on ScoreBarsWidget_C_HandleUpdateUI");
static_assert(sizeof(ScoreBarsWidget_C_HandleUpdateUI) == 0x000010, "Wrong size on ScoreBarsWidget_C_HandleUpdateUI");
static_assert(offsetof(ScoreBarsWidget_C_HandleUpdateUI, Mission) == 0x000000, "Member 'ScoreBarsWidget_C_HandleUpdateUI::Mission' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleUpdateUI, CallFunc_HasValidBadgeInfos_bHasValidBadgeInfos) == 0x000008, "Member 'ScoreBarsWidget_C_HandleUpdateUI::CallFunc_HasValidBadgeInfos_bHasValidBadgeInfos' has a wrong offset!");

// Function ScoreBarsWidget.ScoreBarsWidget_C.InitializeIcons
// 0x0170 (0x0170 - 0x0000)
struct ScoreBarsWidget_C_InitializeIcons final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateBrush                            CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue; // 0x0008(0x0078)()
	struct FSlateBrush                            CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue2; // 0x0080(0x0078)()
	struct FSlateBrush                            CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue3; // 0x00F8(0x0078)()
};
static_assert(alignof(ScoreBarsWidget_C_InitializeIcons) == 0x000008, "Wrong alignment on ScoreBarsWidget_C_InitializeIcons");
static_assert(sizeof(ScoreBarsWidget_C_InitializeIcons) == 0x000170, "Wrong size on ScoreBarsWidget_C_InitializeIcons");
static_assert(offsetof(ScoreBarsWidget_C_InitializeIcons, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'ScoreBarsWidget_C_InitializeIcons::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_InitializeIcons, CallFunc_Not_PreBool_ReturnValue2) == 0x000001, "Member 'ScoreBarsWidget_C_InitializeIcons::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_InitializeIcons, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'ScoreBarsWidget_C_InitializeIcons::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_InitializeIcons, CallFunc_BooleanAND_ReturnValue2) == 0x000003, "Member 'ScoreBarsWidget_C_InitializeIcons::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_InitializeIcons, CallFunc_Not_PreBool_ReturnValue3) == 0x000004, "Member 'ScoreBarsWidget_C_InitializeIcons::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_InitializeIcons, CallFunc_BooleanAND_ReturnValue3) == 0x000005, "Member 'ScoreBarsWidget_C_InitializeIcons::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_InitializeIcons, CallFunc_Not_PreBool_ReturnValue4) == 0x000006, "Member 'ScoreBarsWidget_C_InitializeIcons::CallFunc_Not_PreBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_InitializeIcons, CallFunc_BooleanAND_ReturnValue4) == 0x000007, "Member 'ScoreBarsWidget_C_InitializeIcons::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_InitializeIcons, CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue) == 0x000008, "Member 'ScoreBarsWidget_C_InitializeIcons::CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_InitializeIcons, CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue2) == 0x000080, "Member 'ScoreBarsWidget_C_InitializeIcons::CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_InitializeIcons, CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue3) == 0x0000F8, "Member 'ScoreBarsWidget_C_InitializeIcons::CallFunc_GetBrushBySizeFromMultiSizeBrush_ReturnValue3' has a wrong offset!");

// Function ScoreBarsWidget.ScoreBarsWidget_C.HandleScoreStatChanged
// 0x0060 (0x0060 - 0x0000)
struct ScoreBarsWidget_C_HandleScoreStatChanged final
{
public:
	int32                                         Delta;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Param_Name;                                        // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EFortReplicatedStat                           StatType;                                          // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStatCategory                                 StatCategory;                                      // 0x0021(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStatCategory                                 Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScoreMessageNumber_C*                  K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUIMessageItemWidget*               CallFunc_AddMessageItem_ReturnValue;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScoreBarsScoreMessageItem_C*           K2Node_DynamicCast_AsScore_Bars_Score_Message_Item; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ScoreBarsWidget_C_HandleScoreStatChanged) == 0x000008, "Wrong alignment on ScoreBarsWidget_C_HandleScoreStatChanged");
static_assert(sizeof(ScoreBarsWidget_C_HandleScoreStatChanged) == 0x000060, "Wrong size on ScoreBarsWidget_C_HandleScoreStatChanged");
static_assert(offsetof(ScoreBarsWidget_C_HandleScoreStatChanged, Delta) == 0x000000, "Member 'ScoreBarsWidget_C_HandleScoreStatChanged::Delta' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleScoreStatChanged, Param_Name) == 0x000008, "Member 'ScoreBarsWidget_C_HandleScoreStatChanged::Param_Name' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleScoreStatChanged, StatType) == 0x000020, "Member 'ScoreBarsWidget_C_HandleScoreStatChanged::StatType' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleScoreStatChanged, StatCategory) == 0x000021, "Member 'ScoreBarsWidget_C_HandleScoreStatChanged::StatCategory' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleScoreStatChanged, CallFunc_GetEnumeratorName_ReturnValue) == 0x000028, "Member 'ScoreBarsWidget_C_HandleScoreStatChanged::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleScoreStatChanged, Temp_byte_Variable) == 0x000030, "Member 'ScoreBarsWidget_C_HandleScoreStatChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleScoreStatChanged, CallFunc_GetOwningPlayer_ReturnValue) == 0x000038, "Member 'ScoreBarsWidget_C_HandleScoreStatChanged::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleScoreStatChanged, K2Node_Select_Default) == 0x000040, "Member 'ScoreBarsWidget_C_HandleScoreStatChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleScoreStatChanged, CallFunc_AddMessageItem_ReturnValue) == 0x000048, "Member 'ScoreBarsWidget_C_HandleScoreStatChanged::CallFunc_AddMessageItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleScoreStatChanged, K2Node_DynamicCast_AsScore_Bars_Score_Message_Item) == 0x000050, "Member 'ScoreBarsWidget_C_HandleScoreStatChanged::K2Node_DynamicCast_AsScore_Bars_Score_Message_Item' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleScoreStatChanged, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'ScoreBarsWidget_C_HandleScoreStatChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ScoreBarsWidget.ScoreBarsWidget_C.TryGetNextScoreMessage
// 0x0048 (0x0048 - 0x0000)
struct ScoreBarsWidget_C_TryGetNextScoreMessage final
{
public:
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UFortUIMessageItemWidget* MessageItem)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UFortUIMessageItemWidget* MessageItem)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UFortUIMessageItemWidget*               CallFunc_GetNextMessageInQueue_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ScoreBarsWidget_C_TryGetNextScoreMessage) == 0x000008, "Wrong alignment on ScoreBarsWidget_C_TryGetNextScoreMessage");
static_assert(sizeof(ScoreBarsWidget_C_TryGetNextScoreMessage) == 0x000048, "Wrong size on ScoreBarsWidget_C_TryGetNextScoreMessage");
static_assert(offsetof(ScoreBarsWidget_C_TryGetNextScoreMessage, CallFunc_GetChildrenCount_ReturnValue) == 0x000000, "Member 'ScoreBarsWidget_C_TryGetNextScoreMessage::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_TryGetNextScoreMessage, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'ScoreBarsWidget_C_TryGetNextScoreMessage::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_TryGetNextScoreMessage, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'ScoreBarsWidget_C_TryGetNextScoreMessage::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_TryGetNextScoreMessage, CallFunc_GetNextMessageInQueue_ReturnValue) == 0x000028, "Member 'ScoreBarsWidget_C_TryGetNextScoreMessage::CallFunc_GetNextMessageInQueue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_TryGetNextScoreMessage, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'ScoreBarsWidget_C_TryGetNextScoreMessage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_TryGetNextScoreMessage, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000038, "Member 'ScoreBarsWidget_C_TryGetNextScoreMessage::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_TryGetNextScoreMessage, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'ScoreBarsWidget_C_TryGetNextScoreMessage::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ScoreBarsWidget.ScoreBarsWidget_C.HandleScoreMessageExpired
// 0x0048 (0x0048 - 0x0000)
struct ScoreBarsWidget_C_HandleScoreMessageExpired final
{
public:
	class UFortUIMessageItemWidget*               Expired_Message;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFortUIMessageItemWidget* MessageItem)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UScoreBarsScoreMessageItem_C*           K2Node_DynamicCast_AsScore_Bars_Score_Message_Item; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetScoreValueWidget_Widget;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFortUIMessageItemWidget* MessageItem)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ScoreBarsWidget_C_HandleScoreMessageExpired) == 0x000008, "Wrong alignment on ScoreBarsWidget_C_HandleScoreMessageExpired");
static_assert(sizeof(ScoreBarsWidget_C_HandleScoreMessageExpired) == 0x000048, "Wrong size on ScoreBarsWidget_C_HandleScoreMessageExpired");
static_assert(offsetof(ScoreBarsWidget_C_HandleScoreMessageExpired, Expired_Message) == 0x000000, "Member 'ScoreBarsWidget_C_HandleScoreMessageExpired::Expired_Message' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleScoreMessageExpired, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'ScoreBarsWidget_C_HandleScoreMessageExpired::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleScoreMessageExpired, K2Node_DynamicCast_AsScore_Bars_Score_Message_Item) == 0x000018, "Member 'ScoreBarsWidget_C_HandleScoreMessageExpired::K2Node_DynamicCast_AsScore_Bars_Score_Message_Item' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleScoreMessageExpired, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ScoreBarsWidget_C_HandleScoreMessageExpired::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleScoreMessageExpired, CallFunc_GetScoreValueWidget_Widget) == 0x000028, "Member 'ScoreBarsWidget_C_HandleScoreMessageExpired::CallFunc_GetScoreValueWidget_Widget' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleScoreMessageExpired, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'ScoreBarsWidget_C_HandleScoreMessageExpired::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleScoreMessageExpired, CallFunc_RemoveChild_ReturnValue) == 0x000040, "Member 'ScoreBarsWidget_C_HandleScoreMessageExpired::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");

// Function ScoreBarsWidget.ScoreBarsWidget_C.RegisterForScoreStreamEvents
// 0x0070 (0x0070 - 0x0000)
struct ScoreBarsWidget_C_RegisterForScoreStreamEvents final
{
public:
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EStatCategory ChangedScoreCategory)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetMessageManager_bCreatedNew;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIMessageManager*                  CallFunc_GetMessageManager_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EStatCategory ChangedScoreCategory)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EStatCategory ChangedScoreCategory)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 StatDelta, class FText& StatName, EFortReplicatedStat StatType, EStatCategory StatCategory)> K2Node_CreateDelegate_OutputDelegate5;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(ScoreBarsWidget_C_RegisterForScoreStreamEvents) == 0x000008, "Wrong alignment on ScoreBarsWidget_C_RegisterForScoreStreamEvents");
static_assert(sizeof(ScoreBarsWidget_C_RegisterForScoreStreamEvents) == 0x000070, "Wrong size on ScoreBarsWidget_C_RegisterForScoreStreamEvents");
static_assert(offsetof(ScoreBarsWidget_C_RegisterForScoreStreamEvents, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'ScoreBarsWidget_C_RegisterForScoreStreamEvents::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_RegisterForScoreStreamEvents, CallFunc_GetContext_ReturnValue2) == 0x000008, "Member 'ScoreBarsWidget_C_RegisterForScoreStreamEvents::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_RegisterForScoreStreamEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'ScoreBarsWidget_C_RegisterForScoreStreamEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_RegisterForScoreStreamEvents, CallFunc_GetMessageManager_bCreatedNew) == 0x000020, "Member 'ScoreBarsWidget_C_RegisterForScoreStreamEvents::CallFunc_GetMessageManager_bCreatedNew' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_RegisterForScoreStreamEvents, CallFunc_GetMessageManager_ReturnValue) == 0x000028, "Member 'ScoreBarsWidget_C_RegisterForScoreStreamEvents::CallFunc_GetMessageManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_RegisterForScoreStreamEvents, K2Node_CreateDelegate_OutputDelegate2) == 0x000030, "Member 'ScoreBarsWidget_C_RegisterForScoreStreamEvents::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_RegisterForScoreStreamEvents, K2Node_CreateDelegate_OutputDelegate3) == 0x000040, "Member 'ScoreBarsWidget_C_RegisterForScoreStreamEvents::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_RegisterForScoreStreamEvents, K2Node_CreateDelegate_OutputDelegate4) == 0x000050, "Member 'ScoreBarsWidget_C_RegisterForScoreStreamEvents::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_RegisterForScoreStreamEvents, K2Node_CreateDelegate_OutputDelegate5) == 0x000060, "Member 'ScoreBarsWidget_C_RegisterForScoreStreamEvents::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");

// Function ScoreBarsWidget.ScoreBarsWidget_C.HandleMessageDisplayed
// 0x0020 (0x0020 - 0x0000)
struct ScoreBarsWidget_C_HandleMessageDisplayed final
{
public:
	class UFortUIMessageItemWidget*               ItemWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScoreBarsScoreMessageItem_C*           K2Node_DynamicCast_AsScore_Bars_Score_Message_Item; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetScoreValueWidget_Widget;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ScoreBarsWidget_C_HandleMessageDisplayed) == 0x000008, "Wrong alignment on ScoreBarsWidget_C_HandleMessageDisplayed");
static_assert(sizeof(ScoreBarsWidget_C_HandleMessageDisplayed) == 0x000020, "Wrong size on ScoreBarsWidget_C_HandleMessageDisplayed");
static_assert(offsetof(ScoreBarsWidget_C_HandleMessageDisplayed, ItemWidget) == 0x000000, "Member 'ScoreBarsWidget_C_HandleMessageDisplayed::ItemWidget' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleMessageDisplayed, K2Node_DynamicCast_AsScore_Bars_Score_Message_Item) == 0x000008, "Member 'ScoreBarsWidget_C_HandleMessageDisplayed::K2Node_DynamicCast_AsScore_Bars_Score_Message_Item' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleMessageDisplayed, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ScoreBarsWidget_C_HandleMessageDisplayed::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleMessageDisplayed, CallFunc_GetScoreValueWidget_Widget) == 0x000018, "Member 'ScoreBarsWidget_C_HandleMessageDisplayed::CallFunc_GetScoreValueWidget_Widget' has a wrong offset!");

// Function ScoreBarsWidget.ScoreBarsWidget_C.HandleScoreNumberChanged
// 0x0010 (0x0010 - 0x0000)
struct ScoreBarsWidget_C_HandleScoreNumberChanged final
{
public:
	EStatCategory                                 ScoreCategory;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStatCategory                                 Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCollectionMultiProgressBar_C*          K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ScoreBarsWidget_C_HandleScoreNumberChanged) == 0x000008, "Wrong alignment on ScoreBarsWidget_C_HandleScoreNumberChanged");
static_assert(sizeof(ScoreBarsWidget_C_HandleScoreNumberChanged) == 0x000010, "Wrong size on ScoreBarsWidget_C_HandleScoreNumberChanged");
static_assert(offsetof(ScoreBarsWidget_C_HandleScoreNumberChanged, ScoreCategory) == 0x000000, "Member 'ScoreBarsWidget_C_HandleScoreNumberChanged::ScoreCategory' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleScoreNumberChanged, Temp_byte_Variable) == 0x000001, "Member 'ScoreBarsWidget_C_HandleScoreNumberChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_HandleScoreNumberChanged, K2Node_Select_Default) == 0x000008, "Member 'ScoreBarsWidget_C_HandleScoreNumberChanged::K2Node_Select_Default' has a wrong offset!");

// Function ScoreBarsWidget.ScoreBarsWidget_C.UnregisterForScoreStreamEvents
// 0x0060 (0x0060 - 0x0000)
struct ScoreBarsWidget_C_UnregisterForScoreStreamEvents final
{
public:
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EStatCategory ChangedScoreCategory)> K2Node_CreateDelegate_OutputDelegate2;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EStatCategory ChangedScoreCategory)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EStatCategory ChangedScoreCategory)> K2Node_CreateDelegate_OutputDelegate4;             // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 StatDelta, class FText& StatName, EFortReplicatedStat StatType, EStatCategory StatCategory)> K2Node_CreateDelegate_OutputDelegate5;             // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(ScoreBarsWidget_C_UnregisterForScoreStreamEvents) == 0x000008, "Wrong alignment on ScoreBarsWidget_C_UnregisterForScoreStreamEvents");
static_assert(sizeof(ScoreBarsWidget_C_UnregisterForScoreStreamEvents) == 0x000060, "Wrong size on ScoreBarsWidget_C_UnregisterForScoreStreamEvents");
static_assert(offsetof(ScoreBarsWidget_C_UnregisterForScoreStreamEvents, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'ScoreBarsWidget_C_UnregisterForScoreStreamEvents::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScoreBarsWidget_C_UnregisterForScoreStreamEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'ScoreBarsWidget_C_UnregisterForScoreStreamEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
