#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SM_IceCube_Blueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SM_IceCube_Blueprint.SM_IceCube_Blueprint_C
// 0x0038 (0x03A0 - 0x0368)
class ASM_IceCube_Blueprint_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMeshComponent0;                              // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMeshComponent0;                            // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_2192031B426B9BA97253F6AC1B84EB66; // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_2192031B426B9BA97253F6AC1B84EB66; // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_395[0x3];                                      // 0x0395(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SM_IceCube_Blueprint(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SM_IceCube_Blueprint_C">();
	}
	static class ASM_IceCube_Blueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASM_IceCube_Blueprint_C>();
	}
};
static_assert(alignof(ASM_IceCube_Blueprint_C) == 0x000008, "Wrong alignment on ASM_IceCube_Blueprint_C");
static_assert(sizeof(ASM_IceCube_Blueprint_C) == 0x0003A0, "Wrong size on ASM_IceCube_Blueprint_C");
static_assert(offsetof(ASM_IceCube_Blueprint_C, UberGraphFrame) == 0x000368, "Member 'ASM_IceCube_Blueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ASM_IceCube_Blueprint_C, StaticMeshComponent0) == 0x000370, "Member 'ASM_IceCube_Blueprint_C::StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(ASM_IceCube_Blueprint_C, Box) == 0x000378, "Member 'ASM_IceCube_Blueprint_C::Box' has a wrong offset!");
static_assert(offsetof(ASM_IceCube_Blueprint_C, SharedRoot) == 0x000380, "Member 'ASM_IceCube_Blueprint_C::SharedRoot' has a wrong offset!");
static_assert(offsetof(ASM_IceCube_Blueprint_C, SkeletalMeshComponent0) == 0x000388, "Member 'ASM_IceCube_Blueprint_C::SkeletalMeshComponent0' has a wrong offset!");
static_assert(offsetof(ASM_IceCube_Blueprint_C, Timeline_0_NewTrack_0_2192031B426B9BA97253F6AC1B84EB66) == 0x000390, "Member 'ASM_IceCube_Blueprint_C::Timeline_0_NewTrack_0_2192031B426B9BA97253F6AC1B84EB66' has a wrong offset!");
static_assert(offsetof(ASM_IceCube_Blueprint_C, Timeline_0__Direction_2192031B426B9BA97253F6AC1B84EB66) == 0x000394, "Member 'ASM_IceCube_Blueprint_C::Timeline_0__Direction_2192031B426B9BA97253F6AC1B84EB66' has a wrong offset!");
static_assert(offsetof(ASM_IceCube_Blueprint_C, Timeline_0) == 0x000398, "Member 'ASM_IceCube_Blueprint_C::Timeline_0' has a wrong offset!");

}

