#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SM_IceCube_Blueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SM_IceCube_Blueprint.SM_IceCube_Blueprint_C.ExecuteUbergraph_SM_IceCube_Blueprint
// 0x00A0 (0x00A0 - 0x0000)
struct SM_IceCube_Blueprint_C_ExecuteUbergraph_SM_IceCube_Blueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMoveComponentAction                          Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMoveComponentAction                          Temp_byte_Variable2;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMoveComponentAction                          Temp_byte_Variable3;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0010(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0020(0x0080)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(SM_IceCube_Blueprint_C_ExecuteUbergraph_SM_IceCube_Blueprint) == 0x000008, "Wrong alignment on SM_IceCube_Blueprint_C_ExecuteUbergraph_SM_IceCube_Blueprint");
static_assert(sizeof(SM_IceCube_Blueprint_C_ExecuteUbergraph_SM_IceCube_Blueprint) == 0x0000A0, "Wrong size on SM_IceCube_Blueprint_C_ExecuteUbergraph_SM_IceCube_Blueprint");
static_assert(offsetof(SM_IceCube_Blueprint_C_ExecuteUbergraph_SM_IceCube_Blueprint, EntryPoint) == 0x000000, "Member 'SM_IceCube_Blueprint_C_ExecuteUbergraph_SM_IceCube_Blueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(SM_IceCube_Blueprint_C_ExecuteUbergraph_SM_IceCube_Blueprint, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'SM_IceCube_Blueprint_C_ExecuteUbergraph_SM_IceCube_Blueprint::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(SM_IceCube_Blueprint_C_ExecuteUbergraph_SM_IceCube_Blueprint, Temp_byte_Variable) == 0x000008, "Member 'SM_IceCube_Blueprint_C_ExecuteUbergraph_SM_IceCube_Blueprint::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SM_IceCube_Blueprint_C_ExecuteUbergraph_SM_IceCube_Blueprint, Temp_byte_Variable2) == 0x000009, "Member 'SM_IceCube_Blueprint_C_ExecuteUbergraph_SM_IceCube_Blueprint::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(SM_IceCube_Blueprint_C_ExecuteUbergraph_SM_IceCube_Blueprint, Temp_byte_Variable3) == 0x00000A, "Member 'SM_IceCube_Blueprint_C_ExecuteUbergraph_SM_IceCube_Blueprint::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(SM_IceCube_Blueprint_C_ExecuteUbergraph_SM_IceCube_Blueprint, CallFunc_Lerp_ReturnValue) == 0x00000C, "Member 'SM_IceCube_Blueprint_C_ExecuteUbergraph_SM_IceCube_Blueprint::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(SM_IceCube_Blueprint_C_ExecuteUbergraph_SM_IceCube_Blueprint, CallFunc_MakeVector_ReturnValue) == 0x000010, "Member 'SM_IceCube_Blueprint_C_ExecuteUbergraph_SM_IceCube_Blueprint::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SM_IceCube_Blueprint_C_ExecuteUbergraph_SM_IceCube_Blueprint, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000020, "Member 'SM_IceCube_Blueprint_C_ExecuteUbergraph_SM_IceCube_Blueprint::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");

}

