#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StickyNotification

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StickyNotification.StickyNotification_C
// 0x0218 (0x0420 - 0x0208)
class UStickyNotification_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Open;                                              // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       MouseOverButton;                                   // 0x0218(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideContents;                                      // 0x0220(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Outro;                                             // 0x0228(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0230(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowContents;                                      // 0x0238(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBasicStrokeBox_C*                      BasicStrokeBox;                                    // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Bkgd;                                       // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Contents;                                   // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_MainBody;                                   // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULegacyButtonIconText_C*                ButtonIconText_Close;                              // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULegacyButtonIconText_C*                ButtonIconText_Go;                                 // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RayGlow;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Button;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Message;                                 // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bShown;                                            // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0xF];                                      // 0x0291(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortDialogDescription                 DialogDescriptionRef;                              // 0x02A0(0x0150)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn)
	bool                                          HasBeenMinimized;                                  // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Dissmissing;                                       // 0x03F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F2[0x6];                                      // 0x03F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Notification_Appear_Sound;                         // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Notification_Disappear_Sound;                      // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Notification_Hover_Sound;                          // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Notification_Clicked_Sound;                        // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_StickyNotification(int32 EntryPoint);
	void Construct();
	void HandleAccepted();
	void Handle_OpenFinished();
	void BndEvt__ButtonIconText_Close_K2Node_ComponentBoundEvent_1644_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button);
	void BndEvt__ButtonIconText_Go_K2Node_ComponentBoundEvent_1161_On_Mouse_Hovered_Changed__DelegateSignature(bool Is_Hovered);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void Handle_IntroStarted();
	void BndEvt__ButtonIconText_Go_K2Node_ComponentBoundEvent_826_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button);
	void Handle_IntroFinished();
	void Handle_HideFinished();
	void Handle_ShowContentsFinished();
	void Handle_OutroFinished();
	void InitializeNotification();
	void BindDelegates();
	void CloseSticky();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StickyNotification_C">();
	}
	static class UStickyNotification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStickyNotification_C>();
	}
};
static_assert(alignof(UStickyNotification_C) == 0x000010, "Wrong alignment on UStickyNotification_C");
static_assert(sizeof(UStickyNotification_C) == 0x000420, "Wrong size on UStickyNotification_C");
static_assert(offsetof(UStickyNotification_C, UberGraphFrame) == 0x000208, "Member 'UStickyNotification_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStickyNotification_C, Open) == 0x000210, "Member 'UStickyNotification_C::Open' has a wrong offset!");
static_assert(offsetof(UStickyNotification_C, MouseOverButton) == 0x000218, "Member 'UStickyNotification_C::MouseOverButton' has a wrong offset!");
static_assert(offsetof(UStickyNotification_C, HideContents) == 0x000220, "Member 'UStickyNotification_C::HideContents' has a wrong offset!");
static_assert(offsetof(UStickyNotification_C, Outro) == 0x000228, "Member 'UStickyNotification_C::Outro' has a wrong offset!");
static_assert(offsetof(UStickyNotification_C, Intro) == 0x000230, "Member 'UStickyNotification_C::Intro' has a wrong offset!");
static_assert(offsetof(UStickyNotification_C, ShowContents) == 0x000238, "Member 'UStickyNotification_C::ShowContents' has a wrong offset!");
static_assert(offsetof(UStickyNotification_C, BasicStrokeBox) == 0x000240, "Member 'UStickyNotification_C::BasicStrokeBox' has a wrong offset!");
static_assert(offsetof(UStickyNotification_C, Border_Bkgd) == 0x000248, "Member 'UStickyNotification_C::Border_Bkgd' has a wrong offset!");
static_assert(offsetof(UStickyNotification_C, Border_Contents) == 0x000250, "Member 'UStickyNotification_C::Border_Contents' has a wrong offset!");
static_assert(offsetof(UStickyNotification_C, Border_MainBody) == 0x000258, "Member 'UStickyNotification_C::Border_MainBody' has a wrong offset!");
static_assert(offsetof(UStickyNotification_C, ButtonIconText_Close) == 0x000260, "Member 'UStickyNotification_C::ButtonIconText_Close' has a wrong offset!");
static_assert(offsetof(UStickyNotification_C, ButtonIconText_Go) == 0x000268, "Member 'UStickyNotification_C::ButtonIconText_Go' has a wrong offset!");
static_assert(offsetof(UStickyNotification_C, Image_Icon) == 0x000270, "Member 'UStickyNotification_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UStickyNotification_C, Image_RayGlow) == 0x000278, "Member 'UStickyNotification_C::Image_RayGlow' has a wrong offset!");
static_assert(offsetof(UStickyNotification_C, SizeBox_Button) == 0x000280, "Member 'UStickyNotification_C::SizeBox_Button' has a wrong offset!");
static_assert(offsetof(UStickyNotification_C, TextBlock_Message) == 0x000288, "Member 'UStickyNotification_C::TextBlock_Message' has a wrong offset!");
static_assert(offsetof(UStickyNotification_C, bShown) == 0x000290, "Member 'UStickyNotification_C::bShown' has a wrong offset!");
static_assert(offsetof(UStickyNotification_C, DialogDescriptionRef) == 0x0002A0, "Member 'UStickyNotification_C::DialogDescriptionRef' has a wrong offset!");
static_assert(offsetof(UStickyNotification_C, HasBeenMinimized) == 0x0003F0, "Member 'UStickyNotification_C::HasBeenMinimized' has a wrong offset!");
static_assert(offsetof(UStickyNotification_C, Dissmissing) == 0x0003F1, "Member 'UStickyNotification_C::Dissmissing' has a wrong offset!");
static_assert(offsetof(UStickyNotification_C, Notification_Appear_Sound) == 0x0003F8, "Member 'UStickyNotification_C::Notification_Appear_Sound' has a wrong offset!");
static_assert(offsetof(UStickyNotification_C, Notification_Disappear_Sound) == 0x000400, "Member 'UStickyNotification_C::Notification_Disappear_Sound' has a wrong offset!");
static_assert(offsetof(UStickyNotification_C, Notification_Hover_Sound) == 0x000408, "Member 'UStickyNotification_C::Notification_Hover_Sound' has a wrong offset!");
static_assert(offsetof(UStickyNotification_C, Notification_Clicked_Sound) == 0x000410, "Member 'UStickyNotification_C::Notification_Clicked_Sound' has a wrong offset!");

}

