#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreMain_MTXOffer

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function StoreMain_MTXOffer.StoreMain_MTXOffer_C.ExecuteUbergraph_StoreMain_MTXOffer
// 0x0028 (0x0028 - 0x0000)
struct StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_CustomEvent_Button;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonButton* Button)>  K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	EFortMtxStoreOfferType                        CallFunc_GetStoreOfferType_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortMtxStoreOfferType                        CallFunc_GetStoreOfferType_ReturnValue2;           // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer) == 0x000008, "Wrong alignment on StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer");
static_assert(sizeof(StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer) == 0x000028, "Wrong size on StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer");
static_assert(offsetof(StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer, EntryPoint) == 0x000000, "Member 'StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer::EntryPoint' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer, K2Node_CustomEvent_Button) == 0x000008, "Member 'StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer, CallFunc_GetStoreOfferType_ReturnValue) == 0x000020, "Member 'StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer::CallFunc_GetStoreOfferType_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000021, "Member 'StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer, CallFunc_GetStoreOfferType_ReturnValue2) == 0x000022, "Member 'StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer::CallFunc_GetStoreOfferType_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000023, "Member 'StoreMain_MTXOffer_C_ExecuteUbergraph_StoreMain_MTXOffer::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");

// Function StoreMain_MTXOffer.StoreMain_MTXOffer_C.OnClick
// 0x0008 (0x0008 - 0x0000)
struct StoreMain_MTXOffer_C_OnClick final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_MTXOffer_C_OnClick) == 0x000008, "Wrong alignment on StoreMain_MTXOffer_C_OnClick");
static_assert(sizeof(StoreMain_MTXOffer_C_OnClick) == 0x000008, "Wrong size on StoreMain_MTXOffer_C_OnClick");
static_assert(offsetof(StoreMain_MTXOffer_C_OnClick, Button) == 0x000000, "Member 'StoreMain_MTXOffer_C_OnClick::Button' has a wrong offset!");

// Function StoreMain_MTXOffer.StoreMain_MTXOffer_C.InitOffer
// 0x01F0 (0x01F0 - 0x0000)
struct StoreMain_MTXOffer_C_InitOffer final
{
public:
	class FText                                   SalePrice;                                         // 0x0000(0x0018)(Edit, BlueprintVisible)
	bool                                          bIsOnSale;                                         // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   LocalSalePrice;                                    // 0x0020(0x0018)(Edit, BlueprintVisible)
	class FText                                   BonusMTX;                                          // 0x0038(0x0018)(Edit, BlueprintVisible)
	class FText                                   BaseMtx;                                           // 0x0050(0x0018)(Edit, BlueprintVisible)
	class UMaterial*                              OfferMaterial;                                     // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73[0x1];                                       // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBonusQuantity_ReturnValue;             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortMtxStoreOfferType                        CallFunc_GetStoreOfferType_ReturnValue;            // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortMtxGradient                       CallFunc_GetGradient_ReturnValue;                  // 0x0080(0x0020)(NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetBackground_ReturnValue;                // 0x00A8(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_GetTileImage_ReturnValue;                 // 0x00B8(0x0078)()
	class FText                                   CallFunc_GetName_ReturnValue;                      // 0x0130(0x0018)()
	int32                                         CallFunc_GetBonusQuantity_ReturnValue2;            // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0150(0x0018)()
	int32                                         CallFunc_GetBaseQuantity_ReturnValue;              // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetNormalPrice_ReturnValue;               // 0x0170(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue2;              // 0x0188(0x0018)()
	class FText                                   CallFunc_GetNormalPrice_ReturnValue2;              // 0x01A0(0x0018)()
	class FText                                   CallFunc_GetSalePrice_SalePrice;                   // 0x01B8(0x0018)()
	bool                                          CallFunc_GetSalePrice_ReturnValue;                 // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select2_Default;                            // 0x01D8(0x0018)()
};
static_assert(alignof(StoreMain_MTXOffer_C_InitOffer) == 0x000008, "Wrong alignment on StoreMain_MTXOffer_C_InitOffer");
static_assert(sizeof(StoreMain_MTXOffer_C_InitOffer) == 0x0001F0, "Wrong size on StoreMain_MTXOffer_C_InitOffer");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, SalePrice) == 0x000000, "Member 'StoreMain_MTXOffer_C_InitOffer::SalePrice' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, bIsOnSale) == 0x000018, "Member 'StoreMain_MTXOffer_C_InitOffer::bIsOnSale' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, LocalSalePrice) == 0x000020, "Member 'StoreMain_MTXOffer_C_InitOffer::LocalSalePrice' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, BonusMTX) == 0x000038, "Member 'StoreMain_MTXOffer_C_InitOffer::BonusMTX' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, BaseMtx) == 0x000050, "Member 'StoreMain_MTXOffer_C_InitOffer::BaseMtx' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, OfferMaterial) == 0x000068, "Member 'StoreMain_MTXOffer_C_InitOffer::OfferMaterial' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, Temp_byte_Variable) == 0x000070, "Member 'StoreMain_MTXOffer_C_InitOffer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, Temp_byte_Variable2) == 0x000071, "Member 'StoreMain_MTXOffer_C_InitOffer::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, Temp_bool_Variable) == 0x000072, "Member 'StoreMain_MTXOffer_C_InitOffer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetBonusQuantity_ReturnValue) == 0x000074, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetBonusQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_Greater_IntInt_ReturnValue) == 0x000078, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetStoreOfferType_ReturnValue) == 0x000079, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetStoreOfferType_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00007A, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, K2Node_Select_Default) == 0x00007B, "Member 'StoreMain_MTXOffer_C_InitOffer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_BooleanAND_ReturnValue) == 0x00007C, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, Temp_bool_Variable2) == 0x00007D, "Member 'StoreMain_MTXOffer_C_InitOffer::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetGradient_ReturnValue) == 0x000080, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetGradient_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000A0, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetBackground_ReturnValue) == 0x0000A8, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetBackground_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetTileImage_ReturnValue) == 0x0000B8, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetTileImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetName_ReturnValue) == 0x000130, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetName_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetBonusQuantity_ReturnValue2) == 0x000148, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetBonusQuantity_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_Conv_IntToText_ReturnValue) == 0x000150, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetBaseQuantity_ReturnValue) == 0x000168, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetBaseQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetNormalPrice_ReturnValue) == 0x000170, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetNormalPrice_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_Conv_IntToText_ReturnValue2) == 0x000188, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_Conv_IntToText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetNormalPrice_ReturnValue2) == 0x0001A0, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetNormalPrice_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetSalePrice_SalePrice) == 0x0001B8, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetSalePrice_SalePrice' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, CallFunc_GetSalePrice_ReturnValue) == 0x0001D0, "Member 'StoreMain_MTXOffer_C_InitOffer::CallFunc_GetSalePrice_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_InitOffer, K2Node_Select2_Default) == 0x0001D8, "Member 'StoreMain_MTXOffer_C_InitOffer::K2Node_Select2_Default' has a wrong offset!");

// Function StoreMain_MTXOffer.StoreMain_MTXOffer_C.ShowDetails
// 0x0018 (0x0018 - 0x0000)
struct StoreMain_MTXOffer_C_ShowDetails final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStoreMain_OfferDetails_C*              CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_MTXOffer_C_ShowDetails) == 0x000008, "Wrong alignment on StoreMain_MTXOffer_C_ShowDetails");
static_assert(sizeof(StoreMain_MTXOffer_C_ShowDetails) == 0x000018, "Wrong size on StoreMain_MTXOffer_C_ShowDetails");
static_assert(offsetof(StoreMain_MTXOffer_C_ShowDetails, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'StoreMain_MTXOffer_C_ShowDetails::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_ShowDetails, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'StoreMain_MTXOffer_C_ShowDetails::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_MTXOffer_C_ShowDetails, CallFunc_Create_ReturnValue) == 0x000010, "Member 'StoreMain_MTXOffer_C_ShowDetails::CallFunc_Create_ReturnValue' has a wrong offset!");

}

