#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SurvivorSquadBonusTraitsDetailWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SurvivorSquadBonusTraitsDetailWidget.SurvivorSquadBonusTraitsDetailWidget_C
// 0x0210 (0x04B8 - 0x02A8)
class USurvivorSquadBonusTraitsDetailWidget_C final : public UFortSquadSlotSurvivorTraitMatchesDetailWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(Transient, DuplicateTransient)
	class UFortItemCategoryIndicator*             FortItemCategoryIndicatorText;                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeaderMatchesSquadTypeImageIndicator;              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MatchesLeaderPersonalityImageIndicator;            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        PersonalityTraitValueWidgetSwitcher;               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItemCategoryIndicator*             SecondaryCategoryIndicatorIcon;                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItemCategoryIndicator*             SecondaryCategoryIndicatorText;                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                SetBonusMatchCountText;                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SetBonusMatchesBox;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                SetBonusSizeText;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                SubordinateCountText;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonNumericTextBlock*                SubordinatePersonalityMatchCountNumericText;       // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SubordinatePersonalityMatchesBox;                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItemCategoryIndicator*             TertiaryCategoryIndicatorIcon;                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        TertiaryTraitValueWidgetSwitcher;                  // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBonusDivider;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBonusMatch;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextPersonalityDivider;                            // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextPersonalityMatch;                              // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextTertiararyHeader;                              // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            HighlightedCheckmarkBrush;                         // 0x0350(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            NormalCheckmarkBrush;                              // 0x03C8(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            NonMatchBrush;                                     // 0x0440(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_SurvivorSquadBonusTraitsDetailWidget(int32 EntryPoint);
	void HandlePostDifferentItemToDetailSet();
	void HandlePostDifferentSquadSlotSetBP();
	void HandleTraitValuesUpdatedBP();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SurvivorSquadBonusTraitsDetailWidget_C">();
	}
	static class USurvivorSquadBonusTraitsDetailWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USurvivorSquadBonusTraitsDetailWidget_C>();
	}
};
static_assert(alignof(USurvivorSquadBonusTraitsDetailWidget_C) == 0x000008, "Wrong alignment on USurvivorSquadBonusTraitsDetailWidget_C");
static_assert(sizeof(USurvivorSquadBonusTraitsDetailWidget_C) == 0x0004B8, "Wrong size on USurvivorSquadBonusTraitsDetailWidget_C");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, UberGraphFrame) == 0x0002A8, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, FortItemCategoryIndicatorText) == 0x0002B0, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::FortItemCategoryIndicatorText' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, Image_0) == 0x0002B8, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::Image_0' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, LeaderMatchesSquadTypeImageIndicator) == 0x0002C0, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::LeaderMatchesSquadTypeImageIndicator' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, MatchesLeaderPersonalityImageIndicator) == 0x0002C8, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::MatchesLeaderPersonalityImageIndicator' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, PersonalityTraitValueWidgetSwitcher) == 0x0002D0, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::PersonalityTraitValueWidgetSwitcher' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, SecondaryCategoryIndicatorIcon) == 0x0002D8, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::SecondaryCategoryIndicatorIcon' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, SecondaryCategoryIndicatorText) == 0x0002E0, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::SecondaryCategoryIndicatorText' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, SetBonusMatchCountText) == 0x0002E8, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::SetBonusMatchCountText' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, SetBonusMatchesBox) == 0x0002F0, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::SetBonusMatchesBox' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, SetBonusSizeText) == 0x0002F8, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::SetBonusSizeText' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, SubordinateCountText) == 0x000300, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::SubordinateCountText' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, SubordinatePersonalityMatchCountNumericText) == 0x000308, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::SubordinatePersonalityMatchCountNumericText' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, SubordinatePersonalityMatchesBox) == 0x000310, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::SubordinatePersonalityMatchesBox' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, TertiaryCategoryIndicatorIcon) == 0x000318, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::TertiaryCategoryIndicatorIcon' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, TertiaryTraitValueWidgetSwitcher) == 0x000320, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::TertiaryTraitValueWidgetSwitcher' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, TextBonusDivider) == 0x000328, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::TextBonusDivider' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, TextBonusMatch) == 0x000330, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::TextBonusMatch' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, TextPersonalityDivider) == 0x000338, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::TextPersonalityDivider' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, TextPersonalityMatch) == 0x000340, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::TextPersonalityMatch' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, TextTertiararyHeader) == 0x000348, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::TextTertiararyHeader' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, HighlightedCheckmarkBrush) == 0x000350, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::HighlightedCheckmarkBrush' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, NormalCheckmarkBrush) == 0x0003C8, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::NormalCheckmarkBrush' has a wrong offset!");
static_assert(offsetof(USurvivorSquadBonusTraitsDetailWidget_C, NonMatchBrush) == 0x000440, "Member 'USurvivorSquadBonusTraitsDetailWidget_C::NonMatchBrush' has a wrong offset!");

}

