#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TabAccountLinkage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TabAccountLinkage.TabAccountLinkage_C
// 0x0050 (0x0270 - 0x0220)
class UTabAccountLinkage_C final : public UFortAccountOptions
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(Transient, DuplicateTransient)
	class UCommonTextBlock*                       AccountLinkText;                                   // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  ConfigurationSwitcher;                             // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         DefaultConfigurationBox;                           // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortTwitchLogin_C*                     FortTwitchLogin;                                   // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       StaticURLText;                                     // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TooltipTextBox;                                    // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      URLButton;                                         // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           WebsiteConfigurationBox;                           // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TabAccountLinkage(int32 EntryPoint);
	void BndEvt__URLButton_K2Node_ComponentBoundEvent_75_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__FortTwitchLogin_K2Node_ComponentBoundEvent_0_OnRequestToolTipChange__DelegateSignature(const class FText& NewTooltipText);
	void Construct();
	void CenterOnTab();
	void UpdateOptionsTab();
	void Update_Data();
	void Initialize_Data();
	void Fire_Enter_Live_Stream_Analytic();
	struct FFortAnalyticsEventAttribute Build_Player_Name_Analytic_Attribute();
	struct FFortAnalyticsEventAttribute Build_Player_Id_Analytic_Attribute();
	void InitializeWebsiteConfiguration();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TabAccountLinkage_C">();
	}
	static class UTabAccountLinkage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTabAccountLinkage_C>();
	}
};
static_assert(alignof(UTabAccountLinkage_C) == 0x000008, "Wrong alignment on UTabAccountLinkage_C");
static_assert(sizeof(UTabAccountLinkage_C) == 0x000270, "Wrong size on UTabAccountLinkage_C");
static_assert(offsetof(UTabAccountLinkage_C, UberGraphFrame) == 0x000220, "Member 'UTabAccountLinkage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTabAccountLinkage_C, AccountLinkText) == 0x000228, "Member 'UTabAccountLinkage_C::AccountLinkText' has a wrong offset!");
static_assert(offsetof(UTabAccountLinkage_C, ConfigurationSwitcher) == 0x000230, "Member 'UTabAccountLinkage_C::ConfigurationSwitcher' has a wrong offset!");
static_assert(offsetof(UTabAccountLinkage_C, DefaultConfigurationBox) == 0x000238, "Member 'UTabAccountLinkage_C::DefaultConfigurationBox' has a wrong offset!");
static_assert(offsetof(UTabAccountLinkage_C, FortTwitchLogin) == 0x000240, "Member 'UTabAccountLinkage_C::FortTwitchLogin' has a wrong offset!");
static_assert(offsetof(UTabAccountLinkage_C, Image_0) == 0x000248, "Member 'UTabAccountLinkage_C::Image_0' has a wrong offset!");
static_assert(offsetof(UTabAccountLinkage_C, StaticURLText) == 0x000250, "Member 'UTabAccountLinkage_C::StaticURLText' has a wrong offset!");
static_assert(offsetof(UTabAccountLinkage_C, TooltipTextBox) == 0x000258, "Member 'UTabAccountLinkage_C::TooltipTextBox' has a wrong offset!");
static_assert(offsetof(UTabAccountLinkage_C, URLButton) == 0x000260, "Member 'UTabAccountLinkage_C::URLButton' has a wrong offset!");
static_assert(offsetof(UTabAccountLinkage_C, WebsiteConfigurationBox) == 0x000268, "Member 'UTabAccountLinkage_C::WebsiteConfigurationBox' has a wrong offset!");

}

