#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TabGameOptionsMain

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function TabGameOptionsMain.TabGameOptionsMain_C.ExecuteUbergraph_TabGameOptionsMain
// 0x0110 (0x0110 - 0x0000)
struct TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Slider_Value8;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Slider_Value7;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Slider_Value6;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Slider_Value5;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsXboxPlatform_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPS4Platform_ReturnValue;                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0018(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue2;             // 0x0030(0x0018)()
	TArray<class FText>                           CallFunc_GetPossibleLanguages_ReturnValue;         // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_GetCurrentLanguage_ReturnValue;           // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetItemAt_ReturnValue;                    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetListWidget_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Selected_Index14;       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOptionsMenuHudRotator_C*               K2Node_DynamicCast_AsOptions_Menu_Hud_Rotator;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHomebaseUIContext*                 CallFunc_GetContext_ReturnValue;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Selected_Index13;       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHomebaseUIContext*                 CallFunc_GetContext_ReturnValue2;                  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue2;              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index12;       // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Selected_Index11;       // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue3;              // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index10;       // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue4;              // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index9;        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue5;              // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index8;        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue6;              // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index7;        // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue7;              // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index6;        // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue8;              // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index5;        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue9;              // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index4;        // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue10;             // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_Selected_Index3;        // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Slider_Value4;          // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Slider_Value3;          // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Selected_Index2;        // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Slider_Value2;          // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue11;             // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Slider_Value;           // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Selected_Index;         // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue12;             // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain) == 0x000008, "Wrong alignment on TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain");
static_assert(sizeof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain) == 0x000110, "Wrong size on TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, EntryPoint) == 0x000000, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::EntryPoint' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_ComponentBoundEvent_Slider_Value8) == 0x000004, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_ComponentBoundEvent_Slider_Value8' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_ComponentBoundEvent_Slider_Value7) == 0x000008, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_ComponentBoundEvent_Slider_Value7' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_ComponentBoundEvent_Slider_Value6) == 0x00000C, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_ComponentBoundEvent_Slider_Value6' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_ComponentBoundEvent_Slider_Value5) == 0x000010, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_ComponentBoundEvent_Slider_Value5' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_IsXboxPlatform_ReturnValue) == 0x000014, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_IsXboxPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_IsPS4Platform_ReturnValue) == 0x000015, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_IsPS4Platform_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_BooleanOR_ReturnValue) == 0x000016, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_MakeLiteralText_ReturnValue) == 0x000018, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_MakeLiteralText_ReturnValue2) == 0x000030, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_MakeLiteralText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_GetPossibleLanguages_ReturnValue) == 0x000048, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_GetPossibleLanguages_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_GetCurrentLanguage_ReturnValue) == 0x000058, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_GetCurrentLanguage_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_GetItemAt_ReturnValue) == 0x000060, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_GetItemAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_GetListWidget_ReturnValue) == 0x000068, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_GetListWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_ComponentBoundEvent_Selected_Index14) == 0x000070, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_ComponentBoundEvent_Selected_Index14' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_DynamicCast_AsOptions_Menu_Hud_Rotator) == 0x000078, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_DynamicCast_AsOptions_Menu_Hud_Rotator' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_Conv_IntToBool_ReturnValue) == 0x000081, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_GetContext_ReturnValue) == 0x000088, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_ComponentBoundEvent_Selected_Index13) == 0x000090, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_ComponentBoundEvent_Selected_Index13' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_GetContext_ReturnValue2) == 0x000098, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_Conv_IntToBool_ReturnValue2) == 0x0000A0, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_Conv_IntToBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_ComponentBoundEvent_Selected_Index12) == 0x0000A4, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_ComponentBoundEvent_Selected_Index12' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_ComponentBoundEvent_Selected_Index11) == 0x0000A8, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_ComponentBoundEvent_Selected_Index11' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_Conv_IntToBool_ReturnValue3) == 0x0000AC, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_Conv_IntToBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_ComponentBoundEvent_Selected_Index10) == 0x0000B0, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_ComponentBoundEvent_Selected_Index10' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_Conv_IntToBool_ReturnValue4) == 0x0000B4, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_Conv_IntToBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_ComponentBoundEvent_Selected_Index9) == 0x0000B8, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_ComponentBoundEvent_Selected_Index9' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_Conv_IntToBool_ReturnValue5) == 0x0000BC, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_Conv_IntToBool_ReturnValue5' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_ComponentBoundEvent_Selected_Index8) == 0x0000C0, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_ComponentBoundEvent_Selected_Index8' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_Conv_IntToBool_ReturnValue6) == 0x0000C4, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_Conv_IntToBool_ReturnValue6' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_ComponentBoundEvent_Selected_Index7) == 0x0000C8, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_ComponentBoundEvent_Selected_Index7' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_Conv_IntToBool_ReturnValue7) == 0x0000CC, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_Conv_IntToBool_ReturnValue7' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_ComponentBoundEvent_Selected_Index6) == 0x0000D0, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_ComponentBoundEvent_Selected_Index6' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_Conv_IntToBool_ReturnValue8) == 0x0000D4, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_Conv_IntToBool_ReturnValue8' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_ComponentBoundEvent_Selected_Index5) == 0x0000D8, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_ComponentBoundEvent_Selected_Index5' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_Conv_IntToBool_ReturnValue9) == 0x0000DC, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_Conv_IntToBool_ReturnValue9' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_ComponentBoundEvent_Selected_Index4) == 0x0000E0, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_ComponentBoundEvent_Selected_Index4' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_Conv_IntToBool_ReturnValue10) == 0x0000E4, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_Conv_IntToBool_ReturnValue10' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_ComponentBoundEvent_Selected_Index3) == 0x0000E8, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_ComponentBoundEvent_Selected_Index3' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_ComponentBoundEvent_Slider_Value4) == 0x0000EC, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_ComponentBoundEvent_Slider_Value4' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_ComponentBoundEvent_Slider_Value3) == 0x0000F0, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_ComponentBoundEvent_Slider_Value3' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_ComponentBoundEvent_Selected_Index2) == 0x0000F4, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_ComponentBoundEvent_Selected_Index2' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_ComponentBoundEvent_Slider_Value2) == 0x0000F8, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_ComponentBoundEvent_Slider_Value2' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_Conv_IntToBool_ReturnValue11) == 0x0000FC, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_Conv_IntToBool_ReturnValue11' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_ComponentBoundEvent_Slider_Value) == 0x000100, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_ComponentBoundEvent_Slider_Value' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, K2Node_ComponentBoundEvent_Selected_Index) == 0x000104, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::K2Node_ComponentBoundEvent_Selected_Index' has a wrong offset!");
static_assert(offsetof(TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain, CallFunc_Conv_IntToBool_ReturnValue12) == 0x000108, "Member 'TabGameOptionsMain_C_ExecuteUbergraph_TabGameOptionsMain::CallFunc_Conv_IntToBool_ReturnValue12' has a wrong offset!");

// Function TabGameOptionsMain.TabGameOptionsMain_C.BndEvt__ConsoleUnlockedFPS_K2Node_ComponentBoundEvent_300_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabGameOptionsMain_C_BndEvt__ConsoleUnlockedFPS_K2Node_ComponentBoundEvent_300_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptionsMain_C_BndEvt__ConsoleUnlockedFPS_K2Node_ComponentBoundEvent_300_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on TabGameOptionsMain_C_BndEvt__ConsoleUnlockedFPS_K2Node_ComponentBoundEvent_300_Selection_Changed__DelegateSignature");
static_assert(sizeof(TabGameOptionsMain_C_BndEvt__ConsoleUnlockedFPS_K2Node_ComponentBoundEvent_300_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on TabGameOptionsMain_C_BndEvt__ConsoleUnlockedFPS_K2Node_ComponentBoundEvent_300_Selection_Changed__DelegateSignature");
static_assert(offsetof(TabGameOptionsMain_C_BndEvt__ConsoleUnlockedFPS_K2Node_ComponentBoundEvent_300_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'TabGameOptionsMain_C_BndEvt__ConsoleUnlockedFPS_K2Node_ComponentBoundEvent_300_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function TabGameOptionsMain.TabGameOptionsMain_C.BndEvt__GamepadTargetingMultiplier_K2Node_ComponentBoundEvent_423_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabGameOptionsMain_C_BndEvt__GamepadTargetingMultiplier_K2Node_ComponentBoundEvent_423_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptionsMain_C_BndEvt__GamepadTargetingMultiplier_K2Node_ComponentBoundEvent_423_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on TabGameOptionsMain_C_BndEvt__GamepadTargetingMultiplier_K2Node_ComponentBoundEvent_423_SliderChanged__DelegateSignature");
static_assert(sizeof(TabGameOptionsMain_C_BndEvt__GamepadTargetingMultiplier_K2Node_ComponentBoundEvent_423_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on TabGameOptionsMain_C_BndEvt__GamepadTargetingMultiplier_K2Node_ComponentBoundEvent_423_SliderChanged__DelegateSignature");
static_assert(offsetof(TabGameOptionsMain_C_BndEvt__GamepadTargetingMultiplier_K2Node_ComponentBoundEvent_423_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'TabGameOptionsMain_C_BndEvt__GamepadTargetingMultiplier_K2Node_ComponentBoundEvent_423_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function TabGameOptionsMain.TabGameOptionsMain_C.BndEvt__GamepadScopedMultiplier_K2Node_ComponentBoundEvent_401_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabGameOptionsMain_C_BndEvt__GamepadScopedMultiplier_K2Node_ComponentBoundEvent_401_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptionsMain_C_BndEvt__GamepadScopedMultiplier_K2Node_ComponentBoundEvent_401_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on TabGameOptionsMain_C_BndEvt__GamepadScopedMultiplier_K2Node_ComponentBoundEvent_401_SliderChanged__DelegateSignature");
static_assert(sizeof(TabGameOptionsMain_C_BndEvt__GamepadScopedMultiplier_K2Node_ComponentBoundEvent_401_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on TabGameOptionsMain_C_BndEvt__GamepadScopedMultiplier_K2Node_ComponentBoundEvent_401_SliderChanged__DelegateSignature");
static_assert(offsetof(TabGameOptionsMain_C_BndEvt__GamepadScopedMultiplier_K2Node_ComponentBoundEvent_401_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'TabGameOptionsMain_C_BndEvt__GamepadScopedMultiplier_K2Node_ComponentBoundEvent_401_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function TabGameOptionsMain.TabGameOptionsMain_C.BndEvt__ToggleTargeting_K2Node_ComponentBoundEvent_207_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabGameOptionsMain_C_BndEvt__ToggleTargeting_K2Node_ComponentBoundEvent_207_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptionsMain_C_BndEvt__ToggleTargeting_K2Node_ComponentBoundEvent_207_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on TabGameOptionsMain_C_BndEvt__ToggleTargeting_K2Node_ComponentBoundEvent_207_Selection_Changed__DelegateSignature");
static_assert(sizeof(TabGameOptionsMain_C_BndEvt__ToggleTargeting_K2Node_ComponentBoundEvent_207_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on TabGameOptionsMain_C_BndEvt__ToggleTargeting_K2Node_ComponentBoundEvent_207_Selection_Changed__DelegateSignature");
static_assert(offsetof(TabGameOptionsMain_C_BndEvt__ToggleTargeting_K2Node_ComponentBoundEvent_207_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'TabGameOptionsMain_C_BndEvt__ToggleTargeting_K2Node_ComponentBoundEvent_207_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function TabGameOptionsMain.TabGameOptionsMain_C.BndEvt__TargetingMultiplier_K2Node_ComponentBoundEvent_219_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabGameOptionsMain_C_BndEvt__TargetingMultiplier_K2Node_ComponentBoundEvent_219_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptionsMain_C_BndEvt__TargetingMultiplier_K2Node_ComponentBoundEvent_219_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on TabGameOptionsMain_C_BndEvt__TargetingMultiplier_K2Node_ComponentBoundEvent_219_SliderChanged__DelegateSignature");
static_assert(sizeof(TabGameOptionsMain_C_BndEvt__TargetingMultiplier_K2Node_ComponentBoundEvent_219_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on TabGameOptionsMain_C_BndEvt__TargetingMultiplier_K2Node_ComponentBoundEvent_219_SliderChanged__DelegateSignature");
static_assert(offsetof(TabGameOptionsMain_C_BndEvt__TargetingMultiplier_K2Node_ComponentBoundEvent_219_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'TabGameOptionsMain_C_BndEvt__TargetingMultiplier_K2Node_ComponentBoundEvent_219_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function TabGameOptionsMain.TabGameOptionsMain_C.BndEvt__ScopedMultiplier_K2Node_ComponentBoundEvent_201_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabGameOptionsMain_C_BndEvt__ScopedMultiplier_K2Node_ComponentBoundEvent_201_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptionsMain_C_BndEvt__ScopedMultiplier_K2Node_ComponentBoundEvent_201_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on TabGameOptionsMain_C_BndEvt__ScopedMultiplier_K2Node_ComponentBoundEvent_201_SliderChanged__DelegateSignature");
static_assert(sizeof(TabGameOptionsMain_C_BndEvt__ScopedMultiplier_K2Node_ComponentBoundEvent_201_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on TabGameOptionsMain_C_BndEvt__ScopedMultiplier_K2Node_ComponentBoundEvent_201_SliderChanged__DelegateSignature");
static_assert(offsetof(TabGameOptionsMain_C_BndEvt__ScopedMultiplier_K2Node_ComponentBoundEvent_201_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'TabGameOptionsMain_C_BndEvt__ScopedMultiplier_K2Node_ComponentBoundEvent_201_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function TabGameOptionsMain.TabGameOptionsMain_C.BndEvt__Region_K2Node_ComponentBoundEvent_105_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabGameOptionsMain_C_BndEvt__Region_K2Node_ComponentBoundEvent_105_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptionsMain_C_BndEvt__Region_K2Node_ComponentBoundEvent_105_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on TabGameOptionsMain_C_BndEvt__Region_K2Node_ComponentBoundEvent_105_Selection_Changed__DelegateSignature");
static_assert(sizeof(TabGameOptionsMain_C_BndEvt__Region_K2Node_ComponentBoundEvent_105_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on TabGameOptionsMain_C_BndEvt__Region_K2Node_ComponentBoundEvent_105_Selection_Changed__DelegateSignature");
static_assert(offsetof(TabGameOptionsMain_C_BndEvt__Region_K2Node_ComponentBoundEvent_105_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'TabGameOptionsMain_C_BndEvt__Region_K2Node_ComponentBoundEvent_105_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function TabGameOptionsMain.TabGameOptionsMain_C.BndEvt__EquipFirstBuildingPieceWhenSwappingQuickbars_K2Node_ComponentBoundEvent_136_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabGameOptionsMain_C_BndEvt__EquipFirstBuildingPieceWhenSwappingQuickbars_K2Node_ComponentBoundEvent_136_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptionsMain_C_BndEvt__EquipFirstBuildingPieceWhenSwappingQuickbars_K2Node_ComponentBoundEvent_136_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on TabGameOptionsMain_C_BndEvt__EquipFirstBuildingPieceWhenSwappingQuickbars_K2Node_ComponentBoundEvent_136_Selection_Changed__DelegateSignature");
static_assert(sizeof(TabGameOptionsMain_C_BndEvt__EquipFirstBuildingPieceWhenSwappingQuickbars_K2Node_ComponentBoundEvent_136_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on TabGameOptionsMain_C_BndEvt__EquipFirstBuildingPieceWhenSwappingQuickbars_K2Node_ComponentBoundEvent_136_Selection_Changed__DelegateSignature");
static_assert(offsetof(TabGameOptionsMain_C_BndEvt__EquipFirstBuildingPieceWhenSwappingQuickbars_K2Node_ComponentBoundEvent_136_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'TabGameOptionsMain_C_BndEvt__EquipFirstBuildingPieceWhenSwappingQuickbars_K2Node_ComponentBoundEvent_136_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function TabGameOptionsMain.TabGameOptionsMain_C.BndEvt__ForceFeedback_K2Node_ComponentBoundEvent_121_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabGameOptionsMain_C_BndEvt__ForceFeedback_K2Node_ComponentBoundEvent_121_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptionsMain_C_BndEvt__ForceFeedback_K2Node_ComponentBoundEvent_121_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on TabGameOptionsMain_C_BndEvt__ForceFeedback_K2Node_ComponentBoundEvent_121_Selection_Changed__DelegateSignature");
static_assert(sizeof(TabGameOptionsMain_C_BndEvt__ForceFeedback_K2Node_ComponentBoundEvent_121_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on TabGameOptionsMain_C_BndEvt__ForceFeedback_K2Node_ComponentBoundEvent_121_Selection_Changed__DelegateSignature");
static_assert(offsetof(TabGameOptionsMain_C_BndEvt__ForceFeedback_K2Node_ComponentBoundEvent_121_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'TabGameOptionsMain_C_BndEvt__ForceFeedback_K2Node_ComponentBoundEvent_121_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function TabGameOptionsMain.TabGameOptionsMain_C.BndEvt__First-PersonCamera_K2Node_ComponentBoundEvent_106_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabGameOptionsMain_C_BndEvt__FirstMinusPersonCamera_K2Node_ComponentBoundEvent_106_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptionsMain_C_BndEvt__FirstMinusPersonCamera_K2Node_ComponentBoundEvent_106_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on TabGameOptionsMain_C_BndEvt__FirstMinusPersonCamera_K2Node_ComponentBoundEvent_106_Selection_Changed__DelegateSignature");
static_assert(sizeof(TabGameOptionsMain_C_BndEvt__FirstMinusPersonCamera_K2Node_ComponentBoundEvent_106_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on TabGameOptionsMain_C_BndEvt__FirstMinusPersonCamera_K2Node_ComponentBoundEvent_106_Selection_Changed__DelegateSignature");
static_assert(offsetof(TabGameOptionsMain_C_BndEvt__FirstMinusPersonCamera_K2Node_ComponentBoundEvent_106_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'TabGameOptionsMain_C_BndEvt__FirstMinusPersonCamera_K2Node_ComponentBoundEvent_106_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function TabGameOptionsMain.TabGameOptionsMain_C.BndEvt__AutoEquipBetterItems_K2Node_ComponentBoundEvent_93_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabGameOptionsMain_C_BndEvt__AutoEquipBetterItems_K2Node_ComponentBoundEvent_93_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptionsMain_C_BndEvt__AutoEquipBetterItems_K2Node_ComponentBoundEvent_93_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on TabGameOptionsMain_C_BndEvt__AutoEquipBetterItems_K2Node_ComponentBoundEvent_93_Selection_Changed__DelegateSignature");
static_assert(sizeof(TabGameOptionsMain_C_BndEvt__AutoEquipBetterItems_K2Node_ComponentBoundEvent_93_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on TabGameOptionsMain_C_BndEvt__AutoEquipBetterItems_K2Node_ComponentBoundEvent_93_Selection_Changed__DelegateSignature");
static_assert(offsetof(TabGameOptionsMain_C_BndEvt__AutoEquipBetterItems_K2Node_ComponentBoundEvent_93_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'TabGameOptionsMain_C_BndEvt__AutoEquipBetterItems_K2Node_ComponentBoundEvent_93_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function TabGameOptionsMain.TabGameOptionsMain_C.BndEvt__TapInteract_K2Node_ComponentBoundEvent_81_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabGameOptionsMain_C_BndEvt__TapInteract_K2Node_ComponentBoundEvent_81_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptionsMain_C_BndEvt__TapInteract_K2Node_ComponentBoundEvent_81_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on TabGameOptionsMain_C_BndEvt__TapInteract_K2Node_ComponentBoundEvent_81_Selection_Changed__DelegateSignature");
static_assert(sizeof(TabGameOptionsMain_C_BndEvt__TapInteract_K2Node_ComponentBoundEvent_81_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on TabGameOptionsMain_C_BndEvt__TapInteract_K2Node_ComponentBoundEvent_81_Selection_Changed__DelegateSignature");
static_assert(offsetof(TabGameOptionsMain_C_BndEvt__TapInteract_K2Node_ComponentBoundEvent_81_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'TabGameOptionsMain_C_BndEvt__TapInteract_K2Node_ComponentBoundEvent_81_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function TabGameOptionsMain.TabGameOptionsMain_C.BndEvt__SprintCancelsReload_K2Node_ComponentBoundEvent_70_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabGameOptionsMain_C_BndEvt__SprintCancelsReload_K2Node_ComponentBoundEvent_70_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptionsMain_C_BndEvt__SprintCancelsReload_K2Node_ComponentBoundEvent_70_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on TabGameOptionsMain_C_BndEvt__SprintCancelsReload_K2Node_ComponentBoundEvent_70_Selection_Changed__DelegateSignature");
static_assert(sizeof(TabGameOptionsMain_C_BndEvt__SprintCancelsReload_K2Node_ComponentBoundEvent_70_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on TabGameOptionsMain_C_BndEvt__SprintCancelsReload_K2Node_ComponentBoundEvent_70_Selection_Changed__DelegateSignature");
static_assert(offsetof(TabGameOptionsMain_C_BndEvt__SprintCancelsReload_K2Node_ComponentBoundEvent_70_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'TabGameOptionsMain_C_BndEvt__SprintCancelsReload_K2Node_ComponentBoundEvent_70_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function TabGameOptionsMain.TabGameOptionsMain_C.BndEvt__ToggleSprint_K2Node_ComponentBoundEvent_60_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabGameOptionsMain_C_BndEvt__ToggleSprint_K2Node_ComponentBoundEvent_60_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptionsMain_C_BndEvt__ToggleSprint_K2Node_ComponentBoundEvent_60_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on TabGameOptionsMain_C_BndEvt__ToggleSprint_K2Node_ComponentBoundEvent_60_Selection_Changed__DelegateSignature");
static_assert(sizeof(TabGameOptionsMain_C_BndEvt__ToggleSprint_K2Node_ComponentBoundEvent_60_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on TabGameOptionsMain_C_BndEvt__ToggleSprint_K2Node_ComponentBoundEvent_60_Selection_Changed__DelegateSignature");
static_assert(offsetof(TabGameOptionsMain_C_BndEvt__ToggleSprint_K2Node_ComponentBoundEvent_60_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'TabGameOptionsMain_C_BndEvt__ToggleSprint_K2Node_ComponentBoundEvent_60_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function TabGameOptionsMain.TabGameOptionsMain_C.BndEvt__InvertMouse_K2Node_ComponentBoundEvent_51_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabGameOptionsMain_C_BndEvt__InvertMouse_K2Node_ComponentBoundEvent_51_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptionsMain_C_BndEvt__InvertMouse_K2Node_ComponentBoundEvent_51_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on TabGameOptionsMain_C_BndEvt__InvertMouse_K2Node_ComponentBoundEvent_51_Selection_Changed__DelegateSignature");
static_assert(sizeof(TabGameOptionsMain_C_BndEvt__InvertMouse_K2Node_ComponentBoundEvent_51_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on TabGameOptionsMain_C_BndEvt__InvertMouse_K2Node_ComponentBoundEvent_51_Selection_Changed__DelegateSignature");
static_assert(offsetof(TabGameOptionsMain_C_BndEvt__InvertMouse_K2Node_ComponentBoundEvent_51_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'TabGameOptionsMain_C_BndEvt__InvertMouse_K2Node_ComponentBoundEvent_51_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function TabGameOptionsMain.TabGameOptionsMain_C.BndEvt__Language_K2Node_ComponentBoundEvent_42_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabGameOptionsMain_C_BndEvt__Language_K2Node_ComponentBoundEvent_42_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptionsMain_C_BndEvt__Language_K2Node_ComponentBoundEvent_42_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on TabGameOptionsMain_C_BndEvt__Language_K2Node_ComponentBoundEvent_42_Selection_Changed__DelegateSignature");
static_assert(sizeof(TabGameOptionsMain_C_BndEvt__Language_K2Node_ComponentBoundEvent_42_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on TabGameOptionsMain_C_BndEvt__Language_K2Node_ComponentBoundEvent_42_Selection_Changed__DelegateSignature");
static_assert(offsetof(TabGameOptionsMain_C_BndEvt__Language_K2Node_ComponentBoundEvent_42_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'TabGameOptionsMain_C_BndEvt__Language_K2Node_ComponentBoundEvent_42_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function TabGameOptionsMain.TabGameOptionsMain_C.BndEvt__ShowBackpack_K2Node_ComponentBoundEvent_111_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabGameOptionsMain_C_BndEvt__ShowBackpack_K2Node_ComponentBoundEvent_111_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptionsMain_C_BndEvt__ShowBackpack_K2Node_ComponentBoundEvent_111_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on TabGameOptionsMain_C_BndEvt__ShowBackpack_K2Node_ComponentBoundEvent_111_Selection_Changed__DelegateSignature");
static_assert(sizeof(TabGameOptionsMain_C_BndEvt__ShowBackpack_K2Node_ComponentBoundEvent_111_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on TabGameOptionsMain_C_BndEvt__ShowBackpack_K2Node_ComponentBoundEvent_111_Selection_Changed__DelegateSignature");
static_assert(offsetof(TabGameOptionsMain_C_BndEvt__ShowBackpack_K2Node_ComponentBoundEvent_111_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'TabGameOptionsMain_C_BndEvt__ShowBackpack_K2Node_ComponentBoundEvent_111_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function TabGameOptionsMain.TabGameOptionsMain_C.BndEvt__ShowHeadAccessories_K2Node_ComponentBoundEvent_50_Selection Changed__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabGameOptionsMain_C_BndEvt__ShowHeadAccessories_K2Node_ComponentBoundEvent_50_Selection_Changed__DelegateSignature final
{
public:
	int32                                         Selected_Index;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptionsMain_C_BndEvt__ShowHeadAccessories_K2Node_ComponentBoundEvent_50_Selection_Changed__DelegateSignature) == 0x000004, "Wrong alignment on TabGameOptionsMain_C_BndEvt__ShowHeadAccessories_K2Node_ComponentBoundEvent_50_Selection_Changed__DelegateSignature");
static_assert(sizeof(TabGameOptionsMain_C_BndEvt__ShowHeadAccessories_K2Node_ComponentBoundEvent_50_Selection_Changed__DelegateSignature) == 0x000004, "Wrong size on TabGameOptionsMain_C_BndEvt__ShowHeadAccessories_K2Node_ComponentBoundEvent_50_Selection_Changed__DelegateSignature");
static_assert(offsetof(TabGameOptionsMain_C_BndEvt__ShowHeadAccessories_K2Node_ComponentBoundEvent_50_Selection_Changed__DelegateSignature, Selected_Index) == 0x000000, "Member 'TabGameOptionsMain_C_BndEvt__ShowHeadAccessories_K2Node_ComponentBoundEvent_50_Selection_Changed__DelegateSignature::Selected_Index' has a wrong offset!");

// Function TabGameOptionsMain.TabGameOptionsMain_C.BndEvt__SafeZone_K2Node_ComponentBoundEvent_45_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabGameOptionsMain_C_BndEvt__SafeZone_K2Node_ComponentBoundEvent_45_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptionsMain_C_BndEvt__SafeZone_K2Node_ComponentBoundEvent_45_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on TabGameOptionsMain_C_BndEvt__SafeZone_K2Node_ComponentBoundEvent_45_SliderChanged__DelegateSignature");
static_assert(sizeof(TabGameOptionsMain_C_BndEvt__SafeZone_K2Node_ComponentBoundEvent_45_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on TabGameOptionsMain_C_BndEvt__SafeZone_K2Node_ComponentBoundEvent_45_SliderChanged__DelegateSignature");
static_assert(offsetof(TabGameOptionsMain_C_BndEvt__SafeZone_K2Node_ComponentBoundEvent_45_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'TabGameOptionsMain_C_BndEvt__SafeZone_K2Node_ComponentBoundEvent_45_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function TabGameOptionsMain.TabGameOptionsMain_C.BndEvt__GamepadLookSensitivityY_K2Node_ComponentBoundEvent_42_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabGameOptionsMain_C_BndEvt__GamepadLookSensitivityY_K2Node_ComponentBoundEvent_42_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptionsMain_C_BndEvt__GamepadLookSensitivityY_K2Node_ComponentBoundEvent_42_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on TabGameOptionsMain_C_BndEvt__GamepadLookSensitivityY_K2Node_ComponentBoundEvent_42_SliderChanged__DelegateSignature");
static_assert(sizeof(TabGameOptionsMain_C_BndEvt__GamepadLookSensitivityY_K2Node_ComponentBoundEvent_42_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on TabGameOptionsMain_C_BndEvt__GamepadLookSensitivityY_K2Node_ComponentBoundEvent_42_SliderChanged__DelegateSignature");
static_assert(offsetof(TabGameOptionsMain_C_BndEvt__GamepadLookSensitivityY_K2Node_ComponentBoundEvent_42_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'TabGameOptionsMain_C_BndEvt__GamepadLookSensitivityY_K2Node_ComponentBoundEvent_42_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function TabGameOptionsMain.TabGameOptionsMain_C.BndEvt__GamepadLookSensitivityX_K2Node_ComponentBoundEvent_39_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabGameOptionsMain_C_BndEvt__GamepadLookSensitivityX_K2Node_ComponentBoundEvent_39_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptionsMain_C_BndEvt__GamepadLookSensitivityX_K2Node_ComponentBoundEvent_39_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on TabGameOptionsMain_C_BndEvt__GamepadLookSensitivityX_K2Node_ComponentBoundEvent_39_SliderChanged__DelegateSignature");
static_assert(sizeof(TabGameOptionsMain_C_BndEvt__GamepadLookSensitivityX_K2Node_ComponentBoundEvent_39_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on TabGameOptionsMain_C_BndEvt__GamepadLookSensitivityX_K2Node_ComponentBoundEvent_39_SliderChanged__DelegateSignature");
static_assert(offsetof(TabGameOptionsMain_C_BndEvt__GamepadLookSensitivityX_K2Node_ComponentBoundEvent_39_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'TabGameOptionsMain_C_BndEvt__GamepadLookSensitivityX_K2Node_ComponentBoundEvent_39_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function TabGameOptionsMain.TabGameOptionsMain_C.BndEvt__MouseSensitivity_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct TabGameOptionsMain_C_BndEvt__MouseSensitivity_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature final
{
public:
	float                                         Slider_Value;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TabGameOptionsMain_C_BndEvt__MouseSensitivity_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature) == 0x000004, "Wrong alignment on TabGameOptionsMain_C_BndEvt__MouseSensitivity_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature");
static_assert(sizeof(TabGameOptionsMain_C_BndEvt__MouseSensitivity_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature) == 0x000004, "Wrong size on TabGameOptionsMain_C_BndEvt__MouseSensitivity_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature");
static_assert(offsetof(TabGameOptionsMain_C_BndEvt__MouseSensitivity_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature, Slider_Value) == 0x000000, "Member 'TabGameOptionsMain_C_BndEvt__MouseSensitivity_K2Node_ComponentBoundEvent_0_SliderChanged__DelegateSignature::Slider_Value' has a wrong offset!");

// Function TabGameOptionsMain.TabGameOptionsMain_C.Update Data
// 0x0240 (0x0240 - 0x0000)
struct TabGameOptionsMain_C_Update_Data final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortHomebaseUIContext*                 CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHomebaseUIContext*                 CallFunc_GetContext_ReturnValue2;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShowHeroBackpackForLocalPlayer_ReturnValue; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetShowHeroHeadAccessoriesForLocalPlayer_ReturnValue; // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue2;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable8;                               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable9;                               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0030(0x0018)()
