#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TabRevealMeassage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TabRevealMeassage.TabRevealMeassage_C
// 0x0098 (0x0480 - 0x03E8)
class UTabRevealMeassage_C final : public UFortActivatablePanel
{
public:
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(Transient, DuplicateTransient)
	class UIconTextButton_C*                      CloseButton;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox_C_0;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_1;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_2;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextBody;                                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextHeader;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   InHeader;                                          // 0x0438(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   InBody;                                            // 0x0450(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	UMulticastDelegateProperty_                   TabMessageClosed;                                  // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           Timer;                                             // 0x0478(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void TabMessageClosed__DelegateSignature();
	void ExecuteUbergraph_TabRevealMeassage(int32 EntryPoint);
	void CloseWindow();
	void OnActivated();
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void ToggleTimer(bool Enabled);
	void AutoClose();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TabRevealMeassage_C">();
	}
	static class UTabRevealMeassage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTabRevealMeassage_C>();
	}
};
static_assert(alignof(UTabRevealMeassage_C) == 0x000008, "Wrong alignment on UTabRevealMeassage_C");
static_assert(sizeof(UTabRevealMeassage_C) == 0x000480, "Wrong size on UTabRevealMeassage_C");
static_assert(offsetof(UTabRevealMeassage_C, UberGraphFrame) == 0x0003F0, "Member 'UTabRevealMeassage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTabRevealMeassage_C, CloseButton) == 0x0003F8, "Member 'UTabRevealMeassage_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UTabRevealMeassage_C, Lightbox) == 0x000400, "Member 'UTabRevealMeassage_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UTabRevealMeassage_C, Lightbox_C_0) == 0x000408, "Member 'UTabRevealMeassage_C::Lightbox_C_0' has a wrong offset!");
static_assert(offsetof(UTabRevealMeassage_C, SafeZone_0) == 0x000410, "Member 'UTabRevealMeassage_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UTabRevealMeassage_C, SafeZone_1) == 0x000418, "Member 'UTabRevealMeassage_C::SafeZone_1' has a wrong offset!");
static_assert(offsetof(UTabRevealMeassage_C, SafeZone_2) == 0x000420, "Member 'UTabRevealMeassage_C::SafeZone_2' has a wrong offset!");
static_assert(offsetof(UTabRevealMeassage_C, TextBody) == 0x000428, "Member 'UTabRevealMeassage_C::TextBody' has a wrong offset!");
static_assert(offsetof(UTabRevealMeassage_C, TextHeader) == 0x000430, "Member 'UTabRevealMeassage_C::TextHeader' has a wrong offset!");
static_assert(offsetof(UTabRevealMeassage_C, InHeader) == 0x000438, "Member 'UTabRevealMeassage_C::InHeader' has a wrong offset!");
static_assert(offsetof(UTabRevealMeassage_C, InBody) == 0x000450, "Member 'UTabRevealMeassage_C::InBody' has a wrong offset!");
static_assert(offsetof(UTabRevealMeassage_C, TabMessageClosed) == 0x000468, "Member 'UTabRevealMeassage_C::TabMessageClosed' has a wrong offset!");
static_assert(offsetof(UTabRevealMeassage_C, Timer) == 0x000478, "Member 'UTabRevealMeassage_C::Timer' has a wrong offset!");

}

