#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TODM_Disabled

#include "Basic.hpp"


namespace SDK::Params
{

// Function TODM_Disabled.TODM_Disabled_C.ExecuteUbergraph_TODM_Disabled
// 0x0020 (0x0020 - 0x0000)
struct TODM_Disabled_C_ExecuteUbergraph_TODM_Disabled final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetShadowQuality_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TODM_Disabled_C_ExecuteUbergraph_TODM_Disabled) == 0x000008, "Wrong alignment on TODM_Disabled_C_ExecuteUbergraph_TODM_Disabled");
static_assert(sizeof(TODM_Disabled_C_ExecuteUbergraph_TODM_Disabled) == 0x000020, "Wrong size on TODM_Disabled_C_ExecuteUbergraph_TODM_Disabled");
static_assert(offsetof(TODM_Disabled_C_ExecuteUbergraph_TODM_Disabled, EntryPoint) == 0x000000, "Member 'TODM_Disabled_C_ExecuteUbergraph_TODM_Disabled::EntryPoint' has a wrong offset!");
static_assert(offsetof(TODM_Disabled_C_ExecuteUbergraph_TODM_Disabled, CallFunc_GetGameUserSettings_ReturnValue) == 0x000008, "Member 'TODM_Disabled_C_ExecuteUbergraph_TODM_Disabled::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(TODM_Disabled_C_ExecuteUbergraph_TODM_Disabled, CallFunc_GetShadowQuality_ReturnValue) == 0x000010, "Member 'TODM_Disabled_C_ExecuteUbergraph_TODM_Disabled::CallFunc_GetShadowQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(TODM_Disabled_C_ExecuteUbergraph_TODM_Disabled, K2Node_CustomEvent_Enable) == 0x000014, "Member 'TODM_Disabled_C_ExecuteUbergraph_TODM_Disabled::K2Node_CustomEvent_Enable' has a wrong offset!");
static_assert(offsetof(TODM_Disabled_C_ExecuteUbergraph_TODM_Disabled, CallFunc_Greater_IntInt_ReturnValue) == 0x000015, "Member 'TODM_Disabled_C_ExecuteUbergraph_TODM_Disabled::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TODM_Disabled_C_ExecuteUbergraph_TODM_Disabled, K2Node_SwitchInteger_CmpSuccess) == 0x000016, "Member 'TODM_Disabled_C_ExecuteUbergraph_TODM_Disabled::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(TODM_Disabled_C_ExecuteUbergraph_TODM_Disabled, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000018, "Member 'TODM_Disabled_C_ExecuteUbergraph_TODM_Disabled::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");

// Function TODM_Disabled.TODM_Disabled_C.DisableLightAndFog
// 0x0001 (0x0001 - 0x0000)
struct TODM_Disabled_C_DisableLightAndFog final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TODM_Disabled_C_DisableLightAndFog) == 0x000001, "Wrong alignment on TODM_Disabled_C_DisableLightAndFog");
static_assert(sizeof(TODM_Disabled_C_DisableLightAndFog) == 0x000001, "Wrong size on TODM_Disabled_C_DisableLightAndFog");
static_assert(offsetof(TODM_Disabled_C_DisableLightAndFog, Enable) == 0x000000, "Member 'TODM_Disabled_C_DisableLightAndFog::Enable' has a wrong offset!");

}

