#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TooltipMinusCoreStat

#include "Basic.hpp"

#include "HeroCoreStat_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Tooltip-CoreStat.Tooltip-CoreStat_C
// 0x0358 (0x0560 - 0x0208)
class UTooltipMinusCoreStat_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 ImageStatIcon;                                     // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageStatShadow;                                   // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextStatDesc;                                      // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextStatLabel;                                     // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextStatValue;                                     // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FHeroCoreStat                          Data;                                              // 0x0238(0x0320)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Value;                                             // 0x0558(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TooltipMinusCoreStat(int32 EntryPoint);
	void Construct();
	void Update(const struct FHeroCoreStat& Param_Data, float Param_Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tooltip-CoreStat_C">();
	}
	static class UTooltipMinusCoreStat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTooltipMinusCoreStat_C>();
	}
};
static_assert(alignof(UTooltipMinusCoreStat_C) == 0x000008, "Wrong alignment on UTooltipMinusCoreStat_C");
static_assert(sizeof(UTooltipMinusCoreStat_C) == 0x000560, "Wrong size on UTooltipMinusCoreStat_C");
static_assert(offsetof(UTooltipMinusCoreStat_C, UberGraphFrame) == 0x000208, "Member 'UTooltipMinusCoreStat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCoreStat_C, ImageStatIcon) == 0x000210, "Member 'UTooltipMinusCoreStat_C::ImageStatIcon' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCoreStat_C, ImageStatShadow) == 0x000218, "Member 'UTooltipMinusCoreStat_C::ImageStatShadow' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCoreStat_C, TextStatDesc) == 0x000220, "Member 'UTooltipMinusCoreStat_C::TextStatDesc' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCoreStat_C, TextStatLabel) == 0x000228, "Member 'UTooltipMinusCoreStat_C::TextStatLabel' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCoreStat_C, TextStatValue) == 0x000230, "Member 'UTooltipMinusCoreStat_C::TextStatValue' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCoreStat_C, Data) == 0x000238, "Member 'UTooltipMinusCoreStat_C::Data' has a wrong offset!");
static_assert(offsetof(UTooltipMinusCoreStat_C, Value) == 0x000558, "Member 'UTooltipMinusCoreStat_C::Value' has a wrong offset!");

}

