#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TopBar

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function TopBar.TopBar_C.MainMenuStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct TopBar_C_MainMenuStateChanged__DelegateSignature final
{
public:
	bool                                          Open;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopBar_C_MainMenuStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on TopBar_C_MainMenuStateChanged__DelegateSignature");
static_assert(sizeof(TopBar_C_MainMenuStateChanged__DelegateSignature) == 0x000001, "Wrong size on TopBar_C_MainMenuStateChanged__DelegateSignature");
static_assert(offsetof(TopBar_C_MainMenuStateChanged__DelegateSignature, Open) == 0x000000, "Member 'TopBar_C_MainMenuStateChanged__DelegateSignature::Open' has a wrong offset!");

// Function TopBar.TopBar_C.ExecuteUbergraph_TopBar
// 0x0130 (0x0130 - 0x0000)
struct TopBar_C_ExecuteUbergraph_TopBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue2;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EFortDialogResult Result, class FName ResultName)> K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	EFortDialogResult                             K2Node_CustomEvent_Result;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ResultName;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortDialogResult                             Temp_byte_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIDataConfigurationContext*        CallFunc_GetContext_ReturnValue3;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_AreSocialFeaturesEnabled_ReturnValue;     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue4;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0084(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button2;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleCloseAction_PassThrough;            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 PartyInvitesCount)>      K2Node_CreateDelegate_OutputDelegate3;             // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector2D                              Temp_struct_Variable2;                             // 0x00B8(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Event_Animation;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlayingForward_ReturnValue;    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Message;                        // 0x00D0(0x0018)()
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue5;                  // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_ShowConfirmation_NUI*  CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputManager*                    CallFunc_GetInputManager_ReturnValue;              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0104(0x0010)(NoDestructor)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x0124(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBar_C_ExecuteUbergraph_TopBar) == 0x000008, "Wrong alignment on TopBar_C_ExecuteUbergraph_TopBar");
static_assert(sizeof(TopBar_C_ExecuteUbergraph_TopBar) == 0x000130, "Wrong size on TopBar_C_ExecuteUbergraph_TopBar");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, EntryPoint) == 0x000000, "Member 'TopBar_C_ExecuteUbergraph_TopBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'TopBar_C_ExecuteUbergraph_TopBar::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, CallFunc_IsInZone_ReturnValue) == 0x000010, "Member 'TopBar_C_ExecuteUbergraph_TopBar::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, CallFunc_GetContext_ReturnValue2) == 0x000018, "Member 'TopBar_C_ExecuteUbergraph_TopBar::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'TopBar_C_ExecuteUbergraph_TopBar::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'TopBar_C_ExecuteUbergraph_TopBar::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, K2Node_CustomEvent_Result) == 0x000038, "Member 'TopBar_C_ExecuteUbergraph_TopBar::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, K2Node_CustomEvent_ResultName) == 0x000040, "Member 'TopBar_C_ExecuteUbergraph_TopBar::K2Node_CustomEvent_ResultName' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, Temp_name_Variable) == 0x000048, "Member 'TopBar_C_ExecuteUbergraph_TopBar::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, Temp_byte_Variable) == 0x000050, "Member 'TopBar_C_ExecuteUbergraph_TopBar::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, CallFunc_GetContext_ReturnValue3) == 0x000058, "Member 'TopBar_C_ExecuteUbergraph_TopBar::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, K2Node_CreateDelegate_OutputDelegate2) == 0x000060, "Member 'TopBar_C_ExecuteUbergraph_TopBar::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, CallFunc_AreSocialFeaturesEnabled_ReturnValue) == 0x000070, "Member 'TopBar_C_ExecuteUbergraph_TopBar::CallFunc_AreSocialFeaturesEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, CallFunc_GetContext_ReturnValue4) == 0x000078, "Member 'TopBar_C_ExecuteUbergraph_TopBar::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, CallFunc_GetSubGame_ReturnValue) == 0x000080, "Member 'TopBar_C_ExecuteUbergraph_TopBar::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, Temp_struct_Variable) == 0x000084, "Member 'TopBar_C_ExecuteUbergraph_TopBar::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, K2Node_SwitchEnum_CmpSuccess) == 0x00008C, "Member 'TopBar_C_ExecuteUbergraph_TopBar::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000090, "Member 'TopBar_C_ExecuteUbergraph_TopBar::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, K2Node_ComponentBoundEvent_Button2) == 0x000098, "Member 'TopBar_C_ExecuteUbergraph_TopBar::K2Node_ComponentBoundEvent_Button2' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, CallFunc_HandleCloseAction_PassThrough) == 0x0000A0, "Member 'TopBar_C_ExecuteUbergraph_TopBar::CallFunc_HandleCloseAction_PassThrough' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, K2Node_Event_IsDesignTime) == 0x0000A1, "Member 'TopBar_C_ExecuteUbergraph_TopBar::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, K2Node_CreateDelegate_OutputDelegate3) == 0x0000A8, "Member 'TopBar_C_ExecuteUbergraph_TopBar::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, Temp_struct_Variable2) == 0x0000B8, "Member 'TopBar_C_ExecuteUbergraph_TopBar::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, K2Node_Event_Animation) == 0x0000C0, "Member 'TopBar_C_ExecuteUbergraph_TopBar::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000C8, "Member 'TopBar_C_ExecuteUbergraph_TopBar::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, CallFunc_IsAnimationPlayingForward_ReturnValue) == 0x0000C9, "Member 'TopBar_C_ExecuteUbergraph_TopBar::CallFunc_IsAnimationPlayingForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, K2Node_CustomEvent_Message) == 0x0000D0, "Member 'TopBar_C_ExecuteUbergraph_TopBar::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, CallFunc_GetContext_ReturnValue5) == 0x0000E8, "Member 'TopBar_C_ExecuteUbergraph_TopBar::CallFunc_GetContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue) == 0x0000F0, "Member 'TopBar_C_ExecuteUbergraph_TopBar::CallFunc_ShowSimpleConfirmationDialog_CustomInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, CallFunc_GetInputManager_ReturnValue) == 0x0000F8, "Member 'TopBar_C_ExecuteUbergraph_TopBar::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, CallFunc_IsValid_ReturnValue) == 0x000100, "Member 'TopBar_C_ExecuteUbergraph_TopBar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, K2Node_MakeStruct_Margin) == 0x000104, "Member 'TopBar_C_ExecuteUbergraph_TopBar::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, K2Node_ComponentBoundEvent_Button) == 0x000118, "Member 'TopBar_C_ExecuteUbergraph_TopBar::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, Temp_bool_Variable) == 0x000120, "Member 'TopBar_C_ExecuteUbergraph_TopBar::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(TopBar_C_ExecuteUbergraph_TopBar, K2Node_Select_Default) == 0x000124, "Member 'TopBar_C_ExecuteUbergraph_TopBar::K2Node_Select_Default' has a wrong offset!");

// Function TopBar.TopBar_C.BndEvt__MainMenuButton_K2Node_ComponentBoundEvent_70_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TopBar_C_BndEvt__MainMenuButton_K2Node_ComponentBoundEvent_70_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBar_C_BndEvt__MainMenuButton_K2Node_ComponentBoundEvent_70_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on TopBar_C_BndEvt__MainMenuButton_K2Node_ComponentBoundEvent_70_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(TopBar_C_BndEvt__MainMenuButton_K2Node_ComponentBoundEvent_70_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on TopBar_C_BndEvt__MainMenuButton_K2Node_ComponentBoundEvent_70_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(TopBar_C_BndEvt__MainMenuButton_K2Node_ComponentBoundEvent_70_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'TopBar_C_BndEvt__MainMenuButton_K2Node_ComponentBoundEvent_70_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function TopBar.TopBar_C.ShowSocialConfirmation
// 0x0018 (0x0018 - 0x0000)
struct TopBar_C_ShowSocialConfirmation final
{
public:
	class FText                                   MESSAGE;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(TopBar_C_ShowSocialConfirmation) == 0x000008, "Wrong alignment on TopBar_C_ShowSocialConfirmation");
static_assert(sizeof(TopBar_C_ShowSocialConfirmation) == 0x000018, "Wrong size on TopBar_C_ShowSocialConfirmation");
static_assert(offsetof(TopBar_C_ShowSocialConfirmation, MESSAGE) == 0x000000, "Member 'TopBar_C_ShowSocialConfirmation::MESSAGE' has a wrong offset!");

// Function TopBar.TopBar_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct TopBar_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBar_C_OnAnimationFinished) == 0x000008, "Wrong alignment on TopBar_C_OnAnimationFinished");
static_assert(sizeof(TopBar_C_OnAnimationFinished) == 0x000008, "Wrong size on TopBar_C_OnAnimationFinished");
static_assert(offsetof(TopBar_C_OnAnimationFinished, Animation) == 0x000000, "Member 'TopBar_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function TopBar.TopBar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct TopBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopBar_C_PreConstruct) == 0x000001, "Wrong alignment on TopBar_C_PreConstruct");
static_assert(sizeof(TopBar_C_PreConstruct) == 0x000001, "Wrong size on TopBar_C_PreConstruct");
static_assert(offsetof(TopBar_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'TopBar_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function TopBar.TopBar_C.BndEvt__Social_K2Node_ComponentBoundEvent_64_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct TopBar_C_BndEvt__Social_K2Node_ComponentBoundEvent_64_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBar_C_BndEvt__Social_K2Node_ComponentBoundEvent_64_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on TopBar_C_BndEvt__Social_K2Node_ComponentBoundEvent_64_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(TopBar_C_BndEvt__Social_K2Node_ComponentBoundEvent_64_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on TopBar_C_BndEvt__Social_K2Node_ComponentBoundEvent_64_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(TopBar_C_BndEvt__Social_K2Node_ComponentBoundEvent_64_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'TopBar_C_BndEvt__Social_K2Node_ComponentBoundEvent_64_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function TopBar.TopBar_C.DialogResult_32D813B145A5E184B01A15AABE16B774
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) TopBar_C_DialogResult_32D813B145A5E184B01A15AABE16B774 final
{
public:
	EFortDialogResult                             Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResultName;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBar_C_DialogResult_32D813B145A5E184B01A15AABE16B774) == 0x000008, "Wrong alignment on TopBar_C_DialogResult_32D813B145A5E184B01A15AABE16B774");
static_assert(sizeof(TopBar_C_DialogResult_32D813B145A5E184B01A15AABE16B774) == 0x000010, "Wrong size on TopBar_C_DialogResult_32D813B145A5E184B01A15AABE16B774");
static_assert(offsetof(TopBar_C_DialogResult_32D813B145A5E184B01A15AABE16B774, Result) == 0x000000, "Member 'TopBar_C_DialogResult_32D813B145A5E184B01A15AABE16B774::Result' has a wrong offset!");
static_assert(offsetof(TopBar_C_DialogResult_32D813B145A5E184B01A15AABE16B774, ResultName) == 0x000008, "Member 'TopBar_C_DialogResult_32D813B145A5E184B01A15AABE16B774::ResultName' has a wrong offset!");

// Function TopBar.TopBar_C.OpenMainMenu
// 0x0014 (0x0014 - 0x0000)
struct TopBar_C_OpenMainMenu final
{
public:
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0000(0x0010)(NoDestructor)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBar_C_OpenMainMenu) == 0x000004, "Wrong alignment on TopBar_C_OpenMainMenu");
static_assert(sizeof(TopBar_C_OpenMainMenu) == 0x000014, "Wrong size on TopBar_C_OpenMainMenu");
static_assert(offsetof(TopBar_C_OpenMainMenu, K2Node_MakeStruct_Margin) == 0x000000, "Member 'TopBar_C_OpenMainMenu::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(TopBar_C_OpenMainMenu, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000010, "Member 'TopBar_C_OpenMainMenu::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");

// Function TopBar.TopBar_C.CloseMainMenu
// 0x0020 (0x0020 - 0x0000)
struct TopBar_C_CloseMainMenu final
{
public:
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0000(0x0010)(NoDestructor)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopBar_C_CloseMainMenu) == 0x000008, "Wrong alignment on TopBar_C_CloseMainMenu");
static_assert(sizeof(TopBar_C_CloseMainMenu) == 0x000020, "Wrong size on TopBar_C_CloseMainMenu");
static_assert(offsetof(TopBar_C_CloseMainMenu, K2Node_MakeStruct_Margin) == 0x000000, "Member 'TopBar_C_CloseMainMenu::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(TopBar_C_CloseMainMenu, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'TopBar_C_CloseMainMenu::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_CloseMainMenu, CallFunc_GetSubGame_ReturnValue) == 0x000018, "Member 'TopBar_C_CloseMainMenu::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_CloseMainMenu, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'TopBar_C_CloseMainMenu::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(TopBar_C_CloseMainMenu, CallFunc_IsAnimationPlaying_ReturnValue) == 0x00001A, "Member 'TopBar_C_CloseMainMenu::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");

// Function TopBar.TopBar_C.BindPanelControl
// 0x0020 (0x0020 - 0x0000)
struct TopBar_C_BindPanelControl final
{
public:
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0010(0x0010)(NoDestructor)
};
static_assert(alignof(TopBar_C_BindPanelControl) == 0x000008, "Wrong alignment on TopBar_C_BindPanelControl");
static_assert(sizeof(TopBar_C_BindPanelControl) == 0x000020, "Wrong size on TopBar_C_BindPanelControl");
static_assert(offsetof(TopBar_C_BindPanelControl, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'TopBar_C_BindPanelControl::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TopBar_C_BindPanelControl, K2Node_MakeStruct_DataTableRowHandle) == 0x000010, "Member 'TopBar_C_BindPanelControl::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");

// Function TopBar.TopBar_C.HandleCloseAction
// 0x0020 (0x0020 - 0x0000)
struct TopBar_C_HandleCloseAction final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortHUDContext*                        CallFunc_GetContext_ReturnValue2;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopBar_C_HandleCloseAction) == 0x000008, "Wrong alignment on TopBar_C_HandleCloseAction");
static_assert(sizeof(TopBar_C_HandleCloseAction) == 0x000020, "Wrong size on TopBar_C_HandleCloseAction");
static_assert(offsetof(TopBar_C_HandleCloseAction, Passthrough) == 0x000000, "Member 'TopBar_C_HandleCloseAction::Passthrough' has a wrong offset!");
static_assert(offsetof(TopBar_C_HandleCloseAction, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'TopBar_C_HandleCloseAction::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_HandleCloseAction, CallFunc_GetContext_ReturnValue2) == 0x000010, "Member 'TopBar_C_HandleCloseAction::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TopBar_C_HandleCloseAction, CallFunc_IsInZone_ReturnValue) == 0x000018, "Member 'TopBar_C_HandleCloseAction::CallFunc_IsInZone_ReturnValue' has a wrong offset!");

// Function TopBar.TopBar_C.CreateWidgets
// 0x0010 (0x0010 - 0x0000)
struct TopBar_C_CreateWidgets final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFeedback_C*                            CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBar_C_CreateWidgets) == 0x000008, "Wrong alignment on TopBar_C_CreateWidgets");
static_assert(sizeof(TopBar_C_CreateWidgets) == 0x000010, "Wrong size on TopBar_C_CreateWidgets");
static_assert(offsetof(TopBar_C_CreateWidgets, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'TopBar_C_CreateWidgets::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_CreateWidgets, CallFunc_Create_ReturnValue) == 0x000008, "Member 'TopBar_C_CreateWidgets::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function TopBar.TopBar_C.GetSocialMenuContent
// 0x0020 (0x0020 - 0x0000)
struct TopBar_C_GetSocialMenuContent final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USlateContentCalloutMenu_C*             CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               CallFunc_Get_Size_Box_Size_Box;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBar_C_GetSocialMenuContent) == 0x000008, "Wrong alignment on TopBar_C_GetSocialMenuContent");
static_assert(sizeof(TopBar_C_GetSocialMenuContent) == 0x000020, "Wrong size on TopBar_C_GetSocialMenuContent");
static_assert(offsetof(TopBar_C_GetSocialMenuContent, ReturnValue) == 0x000000, "Member 'TopBar_C_GetSocialMenuContent::ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_GetSocialMenuContent, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'TopBar_C_GetSocialMenuContent::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_GetSocialMenuContent, CallFunc_Create_ReturnValue) == 0x000010, "Member 'TopBar_C_GetSocialMenuContent::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_GetSocialMenuContent, CallFunc_Get_Size_Box_Size_Box) == 0x000018, "Member 'TopBar_C_GetSocialMenuContent::CallFunc_Get_Size_Box_Size_Box' has a wrong offset!");

// Function TopBar.TopBar_C.ForceMenuOpen
// 0x0010 (0x0010 - 0x0000)
struct TopBar_C_ForceMenuOpen final
{
public:
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputManager*                    CallFunc_GetInputManager_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBar_C_ForceMenuOpen) == 0x000008, "Wrong alignment on TopBar_C_ForceMenuOpen");
static_assert(sizeof(TopBar_C_ForceMenuOpen) == 0x000010, "Wrong size on TopBar_C_ForceMenuOpen");
static_assert(offsetof(TopBar_C_ForceMenuOpen, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'TopBar_C_ForceMenuOpen::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_ForceMenuOpen, CallFunc_GetInputManager_ReturnValue) == 0x000008, "Member 'TopBar_C_ForceMenuOpen::CallFunc_GetInputManager_ReturnValue' has a wrong offset!");

// Function TopBar.TopBar_C.BindNavigationDelegates
// 0x0018 (0x0018 - 0x0000)
struct TopBar_C_BindNavigationDelegates final
{
public:
	TDelegate<void(EFortUIFeature Feature)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBar_C_BindNavigationDelegates) == 0x000008, "Wrong alignment on TopBar_C_BindNavigationDelegates");
static_assert(sizeof(TopBar_C_BindNavigationDelegates) == 0x000018, "Wrong size on TopBar_C_BindNavigationDelegates");
static_assert(offsetof(TopBar_C_BindNavigationDelegates, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'TopBar_C_BindNavigationDelegates::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TopBar_C_BindNavigationDelegates, CallFunc_GetUINavigationManager_ReturnValue) == 0x000010, "Member 'TopBar_C_BindNavigationDelegates::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

// Function TopBar.TopBar_C.UnbindNavigationDelegates
// 0x0020 (0x0020 - 0x0000)
struct TopBar_C_UnbindNavigationDelegates final
{
public:
	TDelegate<void(EFortUIFeature Feature)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopBar_C_UnbindNavigationDelegates) == 0x000008, "Wrong alignment on TopBar_C_UnbindNavigationDelegates");
static_assert(sizeof(TopBar_C_UnbindNavigationDelegates) == 0x000020, "Wrong size on TopBar_C_UnbindNavigationDelegates");
static_assert(offsetof(TopBar_C_UnbindNavigationDelegates, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'TopBar_C_UnbindNavigationDelegates::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TopBar_C_UnbindNavigationDelegates, CallFunc_GetUINavigationManager_ReturnValue) == 0x000010, "Member 'TopBar_C_UnbindNavigationDelegates::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_UnbindNavigationDelegates, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'TopBar_C_UnbindNavigationDelegates::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function TopBar.TopBar_C.HandleFeatureSwitchOp
// 0x0018 (0x0018 - 0x0000)
struct TopBar_C_HandleFeatureSwitchOp final
{
public:
	EFortUIFeature                                Feature;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopBar_C_HandleFeatureSwitchOp) == 0x000008, "Wrong alignment on TopBar_C_HandleFeatureSwitchOp");
static_assert(sizeof(TopBar_C_HandleFeatureSwitchOp) == 0x000018, "Wrong size on TopBar_C_HandleFeatureSwitchOp");
static_assert(offsetof(TopBar_C_HandleFeatureSwitchOp, Feature) == 0x000000, "Member 'TopBar_C_HandleFeatureSwitchOp::Feature' has a wrong offset!");
static_assert(offsetof(TopBar_C_HandleFeatureSwitchOp, CallFunc_GetUINavigationManager_ReturnValue) == 0x000008, "Member 'TopBar_C_HandleFeatureSwitchOp::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_HandleFeatureSwitchOp, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'TopBar_C_HandleFeatureSwitchOp::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function TopBar.TopBar_C.HandleSwitchProfileAction
// 0x0030 (0x0030 - 0x0000)
struct TopBar_C_HandleSwitchProfileAction final
{
public:
	bool                                          Passthrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 ControllerIndex, bool bUserSwitched)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetPlayerControllerID_ReturnValue;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBar_C_HandleSwitchProfileAction) == 0x000008, "Wrong alignment on TopBar_C_HandleSwitchProfileAction");
static_assert(sizeof(TopBar_C_HandleSwitchProfileAction) == 0x000030, "Wrong size on TopBar_C_HandleSwitchProfileAction");
static_assert(offsetof(TopBar_C_HandleSwitchProfileAction, Passthrough) == 0x000000, "Member 'TopBar_C_HandleSwitchProfileAction::Passthrough' has a wrong offset!");
static_assert(offsetof(TopBar_C_HandleSwitchProfileAction, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'TopBar_C_HandleSwitchProfileAction::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_HandleSwitchProfileAction, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'TopBar_C_HandleSwitchProfileAction::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TopBar_C_HandleSwitchProfileAction, CallFunc_GetPlayerControllerID_ReturnValue) == 0x000020, "Member 'TopBar_C_HandleSwitchProfileAction::CallFunc_GetPlayerControllerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_HandleSwitchProfileAction, CallFunc_GetContext_ReturnValue) == 0x000028, "Member 'TopBar_C_HandleSwitchProfileAction::CallFunc_GetContext_ReturnValue' has a wrong offset!");

// Function TopBar.TopBar_C.BindSwitchProfileAction
// 0x0050 (0x0050 - 0x0000)
struct TopBar_C_BindSwitchProfileAction final
{
public:
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0038(0x0010)(NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopBar_C_BindSwitchProfileAction) == 0x000008, "Wrong alignment on TopBar_C_BindSwitchProfileAction");
static_assert(sizeof(TopBar_C_BindSwitchProfileAction) == 0x000050, "Wrong size on TopBar_C_BindSwitchProfileAction");
static_assert(offsetof(TopBar_C_BindSwitchProfileAction, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'TopBar_C_BindSwitchProfileAction::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_BindSwitchProfileAction, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'TopBar_C_BindSwitchProfileAction::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TopBar_C_BindSwitchProfileAction, CallFunc_IsInZone_ReturnValue) == 0x000018, "Member 'TopBar_C_BindSwitchProfileAction::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_BindSwitchProfileAction, CallFunc_GetPlatformName_ReturnValue) == 0x000020, "Member 'TopBar_C_BindSwitchProfileAction::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_BindSwitchProfileAction, CallFunc_Not_PreBool_ReturnValue) == 0x000030, "Member 'TopBar_C_BindSwitchProfileAction::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_BindSwitchProfileAction, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000031, "Member 'TopBar_C_BindSwitchProfileAction::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_BindSwitchProfileAction, K2Node_MakeStruct_DataTableRowHandle) == 0x000038, "Member 'TopBar_C_BindSwitchProfileAction::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(TopBar_C_BindSwitchProfileAction, CallFunc_BooleanAND_ReturnValue) == 0x000048, "Member 'TopBar_C_BindSwitchProfileAction::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function TopBar.TopBar_C.BindActiveFriendsCountChangedEvent
// 0x0048 (0x0048 - 0x0000)
struct TopBar_C_BindActiveFriendsCountChangedEvent final
{
public:
	TDelegate<void(int32 ActiveFriendsCount)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortSocialItem*>                CallFunc_GetActiveFriendsList_OutActiveFriends;    // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0030(0x0018)()
};
static_assert(alignof(TopBar_C_BindActiveFriendsCountChangedEvent) == 0x000008, "Wrong alignment on TopBar_C_BindActiveFriendsCountChangedEvent");
static_assert(sizeof(TopBar_C_BindActiveFriendsCountChangedEvent) == 0x000048, "Wrong size on TopBar_C_BindActiveFriendsCountChangedEvent");
static_assert(offsetof(TopBar_C_BindActiveFriendsCountChangedEvent, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'TopBar_C_BindActiveFriendsCountChangedEvent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TopBar_C_BindActiveFriendsCountChangedEvent, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'TopBar_C_BindActiveFriendsCountChangedEvent::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_BindActiveFriendsCountChangedEvent, CallFunc_GetActiveFriendsList_OutActiveFriends) == 0x000018, "Member 'TopBar_C_BindActiveFriendsCountChangedEvent::CallFunc_GetActiveFriendsList_OutActiveFriends' has a wrong offset!");
static_assert(offsetof(TopBar_C_BindActiveFriendsCountChangedEvent, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'TopBar_C_BindActiveFriendsCountChangedEvent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_BindActiveFriendsCountChangedEvent, CallFunc_Conv_IntToText_ReturnValue) == 0x000030, "Member 'TopBar_C_BindActiveFriendsCountChangedEvent::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function TopBar.TopBar_C.HandleActiveFriendsCountChanged
// 0x0020 (0x0020 - 0x0000)
struct TopBar_C_HandleActiveFriendsCountChanged final
{
public:
	int32                                         ActiveFriendsCount;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(TopBar_C_HandleActiveFriendsCountChanged) == 0x000008, "Wrong alignment on TopBar_C_HandleActiveFriendsCountChanged");
static_assert(sizeof(TopBar_C_HandleActiveFriendsCountChanged) == 0x000020, "Wrong size on TopBar_C_HandleActiveFriendsCountChanged");
static_assert(offsetof(TopBar_C_HandleActiveFriendsCountChanged, ActiveFriendsCount) == 0x000000, "Member 'TopBar_C_HandleActiveFriendsCountChanged::ActiveFriendsCount' has a wrong offset!");
static_assert(offsetof(TopBar_C_HandleActiveFriendsCountChanged, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'TopBar_C_HandleActiveFriendsCountChanged::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function TopBar.TopBar_C.UnbindActiveFriendsCountChangedEvent
// 0x0018 (0x0018 - 0x0000)
struct TopBar_C_UnbindActiveFriendsCountChangedEvent final
{
public:
	TDelegate<void(int32 ActiveFriendsCount)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TopBar_C_UnbindActiveFriendsCountChangedEvent) == 0x000008, "Wrong alignment on TopBar_C_UnbindActiveFriendsCountChangedEvent");
static_assert(sizeof(TopBar_C_UnbindActiveFriendsCountChangedEvent) == 0x000018, "Wrong size on TopBar_C_UnbindActiveFriendsCountChangedEvent");
static_assert(offsetof(TopBar_C_UnbindActiveFriendsCountChangedEvent, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'TopBar_C_UnbindActiveFriendsCountChangedEvent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TopBar_C_UnbindActiveFriendsCountChangedEvent, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'TopBar_C_UnbindActiveFriendsCountChangedEvent::CallFunc_GetContext_ReturnValue' has a wrong offset!");

// Function TopBar.TopBar_C.HandleAccountPickerResult
// 0x0020 (0x0020 - 0x0000)
struct TopBar_C_HandleAccountPickerResult final
{
public:
	int32                                         ControllerIndex;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UserSwitched;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerControllerID_ReturnValue;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopBar_C_HandleAccountPickerResult) == 0x000008, "Wrong alignment on TopBar_C_HandleAccountPickerResult");
static_assert(sizeof(TopBar_C_HandleAccountPickerResult) == 0x000020, "Wrong size on TopBar_C_HandleAccountPickerResult");
static_assert(offsetof(TopBar_C_HandleAccountPickerResult, ControllerIndex) == 0x000000, "Member 'TopBar_C_HandleAccountPickerResult::ControllerIndex' has a wrong offset!");
static_assert(offsetof(TopBar_C_HandleAccountPickerResult, UserSwitched) == 0x000004, "Member 'TopBar_C_HandleAccountPickerResult::UserSwitched' has a wrong offset!");
static_assert(offsetof(TopBar_C_HandleAccountPickerResult, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'TopBar_C_HandleAccountPickerResult::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_HandleAccountPickerResult, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'TopBar_C_HandleAccountPickerResult::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_HandleAccountPickerResult, CallFunc_GetPlayerControllerID_ReturnValue) == 0x000018, "Member 'TopBar_C_HandleAccountPickerResult::CallFunc_GetPlayerControllerID_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_HandleAccountPickerResult, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00001C, "Member 'TopBar_C_HandleAccountPickerResult::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_HandleAccountPickerResult, CallFunc_BooleanAND_ReturnValue) == 0x00001D, "Member 'TopBar_C_HandleAccountPickerResult::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function TopBar.TopBar_C.HandleActiveInvitesCountChanged
// 0x0008 (0x0008 - 0x0000)
struct TopBar_C_HandleActiveInvitesCountChanged final
{
public:
	int32                                         ActiveInvitesCount;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopBar_C_HandleActiveInvitesCountChanged) == 0x000004, "Wrong alignment on TopBar_C_HandleActiveInvitesCountChanged");
static_assert(sizeof(TopBar_C_HandleActiveInvitesCountChanged) == 0x000008, "Wrong size on TopBar_C_HandleActiveInvitesCountChanged");
static_assert(offsetof(TopBar_C_HandleActiveInvitesCountChanged, ActiveInvitesCount) == 0x000000, "Member 'TopBar_C_HandleActiveInvitesCountChanged::ActiveInvitesCount' has a wrong offset!");
static_assert(offsetof(TopBar_C_HandleActiveInvitesCountChanged, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'TopBar_C_HandleActiveInvitesCountChanged::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function TopBar.TopBar_C.GetFriendsTooltipWidget
// 0x0058 (0x0058 - 0x0000)
struct TopBar_C_GetFriendsTooltipWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0010(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue2;             // 0x0028(0x0018)()
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_Basic_Tooltip_Output;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopBar_C_GetFriendsTooltipWidget) == 0x000008, "Wrong alignment on TopBar_C_GetFriendsTooltipWidget");
static_assert(sizeof(TopBar_C_GetFriendsTooltipWidget) == 0x000058, "Wrong size on TopBar_C_GetFriendsTooltipWidget");
static_assert(offsetof(TopBar_C_GetFriendsTooltipWidget, ReturnValue) == 0x000000, "Member 'TopBar_C_GetFriendsTooltipWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_GetFriendsTooltipWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'TopBar_C_GetFriendsTooltipWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_GetFriendsTooltipWidget, CallFunc_MakeLiteralText_ReturnValue) == 0x000010, "Member 'TopBar_C_GetFriendsTooltipWidget::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_GetFriendsTooltipWidget, CallFunc_MakeLiteralText_ReturnValue2) == 0x000028, "Member 'TopBar_C_GetFriendsTooltipWidget::CallFunc_MakeLiteralText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(TopBar_C_GetFriendsTooltipWidget, CallFunc_GetContext_ReturnValue) == 0x000040, "Member 'TopBar_C_GetFriendsTooltipWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_GetFriendsTooltipWidget, CallFunc_Create_Basic_Tooltip_Output) == 0x000048, "Member 'TopBar_C_GetFriendsTooltipWidget::CallFunc_Create_Basic_Tooltip_Output' has a wrong offset!");
static_assert(offsetof(TopBar_C_GetFriendsTooltipWidget, CallFunc_IsUsingGamepad_ReturnValue) == 0x000050, "Member 'TopBar_C_GetFriendsTooltipWidget::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");

// Function TopBar.TopBar_C.GetMainMenuTooltipWidget
// 0x0028 (0x0028 - 0x0000)
struct TopBar_C_GetMainMenuTooltipWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonUIContext*                       CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Create_Basic_Tooltip_Output;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingGamepad_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TopBar_C_GetMainMenuTooltipWidget) == 0x000008, "Wrong alignment on TopBar_C_GetMainMenuTooltipWidget");
static_assert(sizeof(TopBar_C_GetMainMenuTooltipWidget) == 0x000028, "Wrong size on TopBar_C_GetMainMenuTooltipWidget");
static_assert(offsetof(TopBar_C_GetMainMenuTooltipWidget, ReturnValue) == 0x000000, "Member 'TopBar_C_GetMainMenuTooltipWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_GetMainMenuTooltipWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'TopBar_C_GetMainMenuTooltipWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_GetMainMenuTooltipWidget, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'TopBar_C_GetMainMenuTooltipWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(TopBar_C_GetMainMenuTooltipWidget, CallFunc_Create_Basic_Tooltip_Output) == 0x000018, "Member 'TopBar_C_GetMainMenuTooltipWidget::CallFunc_Create_Basic_Tooltip_Output' has a wrong offset!");
static_assert(offsetof(TopBar_C_GetMainMenuTooltipWidget, CallFunc_IsUsingGamepad_ReturnValue) == 0x000020, "Member 'TopBar_C_GetMainMenuTooltipWidget::CallFunc_IsUsingGamepad_ReturnValue' has a wrong offset!");

// Function TopBar.TopBar_C.FireOpenAnalyticsEvent
// 0x0078 (0x0078 - 0x0000)
struct TopBar_C_FireOpenAnalyticsEvent final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetGameAccountId_ReturnValue;             // 0x0018(0x0028)(HasGetValueTypeHash)
	class UFortRegisteredPlayerInfo*              CallFunc_GetPlayerInfoFromUniqueID_ReturnValue;    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
