#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TutorialTransparentRichText

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TutorialTransparentRichText.TutorialTransparentRichText_C
// 0x0028 (0x0238 - 0x0210)
class UTutorialTransparentRichText_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UFortRichTextBlock*                     FortRichTextBlock_0;                               // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0220(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_TutorialTransparentRichText(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TutorialTransparentRichText_C">();
	}
	static class UTutorialTransparentRichText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTutorialTransparentRichText_C>();
	}
};
static_assert(alignof(UTutorialTransparentRichText_C) == 0x000008, "Wrong alignment on UTutorialTransparentRichText_C");
static_assert(sizeof(UTutorialTransparentRichText_C) == 0x000238, "Wrong size on UTutorialTransparentRichText_C");
static_assert(offsetof(UTutorialTransparentRichText_C, UberGraphFrame) == 0x000210, "Member 'UTutorialTransparentRichText_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTutorialTransparentRichText_C, FortRichTextBlock_0) == 0x000218, "Member 'UTutorialTransparentRichText_C::FortRichTextBlock_0' has a wrong offset!");
static_assert(offsetof(UTutorialTransparentRichText_C, Text) == 0x000220, "Member 'UTutorialTransparentRichText_C::Text' has a wrong offset!");

}

