#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VinderTech_Umbrella_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass VinderTech_Umbrella_AnimBP.VinderTech_Umbrella_AnimBP_C
// 0x05D8 (0x0990 - 0x03B8)
class UVinderTech_Umbrella_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_3B8[0x8];                                      // 0x03B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_47C162A34E75B5D855F1039C8811E06C; // 0x03C8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_55B0C7EB4409F55E838D3CA7B7457964; // 0x0410(0x0068)()
	uint8                                         Pad_478[0x8];                                      // 0x0478(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9592CEBA49F2B067A15FFFBB6AB5105E; // 0x0480(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F81EA3C344FA6DFC7A5EA1B792B511A5; // 0x0500(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3753F99B490EFDA0C68FF0B8819E664F; // 0x0580(0x0080)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1A7F7CBD4C68973F2BBDFCBF93433107; // 0x0600(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8F6CE6514B2B120BE5A47CA93BF6B64F; // 0x0680(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_0FA712374C2DD4AE7BAB068F07EF1E2A; // 0x06F0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_FB121E7E466BDC2AEC2334AABA7B7973; // 0x0738(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_12B937664A6236CA6C6F30B310D7D872; // 0x07A8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_CAD550DB43A0B090364489A1ED4F53F6; // 0x07F0(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_90756A2C41FA0E67C991218B04CCA9C1; // 0x0860(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_AD38D8EC41D7A5D47CC14C9AC67E6D6E; // 0x08A8(0x00D8)()
	bool                                          IsParachuteOpen;                                   // 0x0980(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_981[0x3];                                      // 0x0981(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeltaSeconds;                                      // 0x0984(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeployAnimRate;                                    // 0x0988(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VinderTech_Umbrella_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_VinderTech_Umbrella_AnimBP_AnimGraphNode_TransitionResult_9592CEBA49F2B067A15FFFBB6AB5105E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_VinderTech_Umbrella_AnimBP_AnimGraphNode_SequencePlayer_CAD550DB43A0B090364489A1ED4F53F6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_VinderTech_Umbrella_AnimBP_AnimGraphNode_SequencePlayer_FB121E7E466BDC2AEC2334AABA7B7973();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_VinderTech_Umbrella_AnimBP_AnimGraphNode_TransitionResult_F81EA3C344FA6DFC7A5EA1B792B511A5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_VinderTech_Umbrella_AnimBP_AnimGraphNode_TransitionResult_1A7F7CBD4C68973F2BBDFCBF93433107();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_VinderTech_Umbrella_AnimBP_AnimGraphNode_TransitionResult_3753F99B490EFDA0C68FF0B8819E664F();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VinderTech_Umbrella_AnimBP_C">();
	}
	static class UVinderTech_Umbrella_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVinderTech_Umbrella_AnimBP_C>();
	}
};
static_assert(alignof(UVinderTech_Umbrella_AnimBP_C) == 0x000010, "Wrong alignment on UVinderTech_Umbrella_AnimBP_C");
static_assert(sizeof(UVinderTech_Umbrella_AnimBP_C) == 0x000990, "Wrong size on UVinderTech_Umbrella_AnimBP_C");
static_assert(offsetof(UVinderTech_Umbrella_AnimBP_C, UberGraphFrame) == 0x0003C0, "Member 'UVinderTech_Umbrella_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVinderTech_Umbrella_AnimBP_C, AnimGraphNode_Root_47C162A34E75B5D855F1039C8811E06C) == 0x0003C8, "Member 'UVinderTech_Umbrella_AnimBP_C::AnimGraphNode_Root_47C162A34E75B5D855F1039C8811E06C' has a wrong offset!");
static_assert(offsetof(UVinderTech_Umbrella_AnimBP_C, AnimGraphNode_Slot_55B0C7EB4409F55E838D3CA7B7457964) == 0x000410, "Member 'UVinderTech_Umbrella_AnimBP_C::AnimGraphNode_Slot_55B0C7EB4409F55E838D3CA7B7457964' has a wrong offset!");
static_assert(offsetof(UVinderTech_Umbrella_AnimBP_C, AnimGraphNode_TransitionResult_9592CEBA49F2B067A15FFFBB6AB5105E) == 0x000480, "Member 'UVinderTech_Umbrella_AnimBP_C::AnimGraphNode_TransitionResult_9592CEBA49F2B067A15FFFBB6AB5105E' has a wrong offset!");
static_assert(offsetof(UVinderTech_Umbrella_AnimBP_C, AnimGraphNode_TransitionResult_F81EA3C344FA6DFC7A5EA1B792B511A5) == 0x000500, "Member 'UVinderTech_Umbrella_AnimBP_C::AnimGraphNode_TransitionResult_F81EA3C344FA6DFC7A5EA1B792B511A5' has a wrong offset!");
static_assert(offsetof(UVinderTech_Umbrella_AnimBP_C, AnimGraphNode_TransitionResult_3753F99B490EFDA0C68FF0B8819E664F) == 0x000580, "Member 'UVinderTech_Umbrella_AnimBP_C::AnimGraphNode_TransitionResult_3753F99B490EFDA0C68FF0B8819E664F' has a wrong offset!");
static_assert(offsetof(UVinderTech_Umbrella_AnimBP_C, AnimGraphNode_TransitionResult_1A7F7CBD4C68973F2BBDFCBF93433107) == 0x000600, "Member 'UVinderTech_Umbrella_AnimBP_C::AnimGraphNode_TransitionResult_1A7F7CBD4C68973F2BBDFCBF93433107' has a wrong offset!");
static_assert(offsetof(UVinderTech_Umbrella_AnimBP_C, AnimGraphNode_SequencePlayer_8F6CE6514B2B120BE5A47CA93BF6B64F) == 0x000680, "Member 'UVinderTech_Umbrella_AnimBP_C::AnimGraphNode_SequencePlayer_8F6CE6514B2B120BE5A47CA93BF6B64F' has a wrong offset!");
static_assert(offsetof(UVinderTech_Umbrella_AnimBP_C, AnimGraphNode_StateResult_0FA712374C2DD4AE7BAB068F07EF1E2A) == 0x0006F0, "Member 'UVinderTech_Umbrella_AnimBP_C::AnimGraphNode_StateResult_0FA712374C2DD4AE7BAB068F07EF1E2A' has a wrong offset!");
static_assert(offsetof(UVinderTech_Umbrella_AnimBP_C, AnimGraphNode_SequencePlayer_FB121E7E466BDC2AEC2334AABA7B7973) == 0x000738, "Member 'UVinderTech_Umbrella_AnimBP_C::AnimGraphNode_SequencePlayer_FB121E7E466BDC2AEC2334AABA7B7973' has a wrong offset!");
static_assert(offsetof(UVinderTech_Umbrella_AnimBP_C, AnimGraphNode_StateResult_12B937664A6236CA6C6F30B310D7D872) == 0x0007A8, "Member 'UVinderTech_Umbrella_AnimBP_C::AnimGraphNode_StateResult_12B937664A6236CA6C6F30B310D7D872' has a wrong offset!");
static_assert(offsetof(UVinderTech_Umbrella_AnimBP_C, AnimGraphNode_SequencePlayer_CAD550DB43A0B090364489A1ED4F53F6) == 0x0007F0, "Member 'UVinderTech_Umbrella_AnimBP_C::AnimGraphNode_SequencePlayer_CAD550DB43A0B090364489A1ED4F53F6' has a wrong offset!");
static_assert(offsetof(UVinderTech_Umbrella_AnimBP_C, AnimGraphNode_StateResult_90756A2C41FA0E67C991218B04CCA9C1) == 0x000860, "Member 'UVinderTech_Umbrella_AnimBP_C::AnimGraphNode_StateResult_90756A2C41FA0E67C991218B04CCA9C1' has a wrong offset!");
static_assert(offsetof(UVinderTech_Umbrella_AnimBP_C, AnimGraphNode_StateMachine_AD38D8EC41D7A5D47CC14C9AC67E6D6E) == 0x0008A8, "Member 'UVinderTech_Umbrella_AnimBP_C::AnimGraphNode_StateMachine_AD38D8EC41D7A5D47CC14C9AC67E6D6E' has a wrong offset!");
static_assert(offsetof(UVinderTech_Umbrella_AnimBP_C, IsParachuteOpen) == 0x000980, "Member 'UVinderTech_Umbrella_AnimBP_C::IsParachuteOpen' has a wrong offset!");
static_assert(offsetof(UVinderTech_Umbrella_AnimBP_C, DeltaSeconds) == 0x000984, "Member 'UVinderTech_Umbrella_AnimBP_C::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(UVinderTech_Umbrella_AnimBP_C, DeployAnimRate) == 0x000988, "Member 'UVinderTech_Umbrella_AnimBP_C::DeployAnimRate' has a wrong offset!");

}

