#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: XpBoostInfoText

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function XpBoostInfoText.XpBoostInfoText_C.ExecuteUbergraph_XpBoostInfoText
// 0x0068 (0x0068 - 0x0000)
struct XpBoostInfoText_C_ExecuteUbergraph_XpBoostInfoText final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FFortPublicAccountInfo& NewInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 BoostAmount)>            K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortPublicAccountInfo                 K2Node_CustomEvent_NewInfo;                        // 0x0030(0x0034)(NoDestructor)
	int32                                         K2Node_CustomEvent_BoostAmount;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(XpBoostInfoText_C_ExecuteUbergraph_XpBoostInfoText) == 0x000008, "Wrong alignment on XpBoostInfoText_C_ExecuteUbergraph_XpBoostInfoText");
static_assert(sizeof(XpBoostInfoText_C_ExecuteUbergraph_XpBoostInfoText) == 0x000068, "Wrong size on XpBoostInfoText_C_ExecuteUbergraph_XpBoostInfoText");
static_assert(offsetof(XpBoostInfoText_C_ExecuteUbergraph_XpBoostInfoText, EntryPoint) == 0x000000, "Member 'XpBoostInfoText_C_ExecuteUbergraph_XpBoostInfoText::EntryPoint' has a wrong offset!");
static_assert(offsetof(XpBoostInfoText_C_ExecuteUbergraph_XpBoostInfoText, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'XpBoostInfoText_C_ExecuteUbergraph_XpBoostInfoText::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(XpBoostInfoText_C_ExecuteUbergraph_XpBoostInfoText, K2Node_CreateDelegate_OutputDelegate2) == 0x000018, "Member 'XpBoostInfoText_C_ExecuteUbergraph_XpBoostInfoText::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(XpBoostInfoText_C_ExecuteUbergraph_XpBoostInfoText, CallFunc_GetContext_ReturnValue) == 0x000028, "Member 'XpBoostInfoText_C_ExecuteUbergraph_XpBoostInfoText::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(XpBoostInfoText_C_ExecuteUbergraph_XpBoostInfoText, K2Node_CustomEvent_NewInfo) == 0x000030, "Member 'XpBoostInfoText_C_ExecuteUbergraph_XpBoostInfoText::K2Node_CustomEvent_NewInfo' has a wrong offset!");
static_assert(offsetof(XpBoostInfoText_C_ExecuteUbergraph_XpBoostInfoText, K2Node_CustomEvent_BoostAmount) == 0x000064, "Member 'XpBoostInfoText_C_ExecuteUbergraph_XpBoostInfoText::K2Node_CustomEvent_BoostAmount' has a wrong offset!");

// Function XpBoostInfoText.XpBoostInfoText_C.Xp Boost Changed
// 0x0004 (0x0004 - 0x0000)
struct XpBoostInfoText_C_Xp_Boost_Changed final
{
public:
	int32                                         BoostAmount;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(XpBoostInfoText_C_Xp_Boost_Changed) == 0x000004, "Wrong alignment on XpBoostInfoText_C_Xp_Boost_Changed");
static_assert(sizeof(XpBoostInfoText_C_Xp_Boost_Changed) == 0x000004, "Wrong size on XpBoostInfoText_C_Xp_Boost_Changed");
static_assert(offsetof(XpBoostInfoText_C_Xp_Boost_Changed, BoostAmount) == 0x000000, "Member 'XpBoostInfoText_C_Xp_Boost_Changed::BoostAmount' has a wrong offset!");

// Function XpBoostInfoText.XpBoostInfoText_C.HandleAccountUpdate
// 0x0034 (0x0034 - 0x0000)
struct XpBoostInfoText_C_HandleAccountUpdate final
{
public:
	struct FFortPublicAccountInfo                 NewInfo;                                           // 0x0000(0x0034)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(XpBoostInfoText_C_HandleAccountUpdate) == 0x000004, "Wrong alignment on XpBoostInfoText_C_HandleAccountUpdate");
static_assert(sizeof(XpBoostInfoText_C_HandleAccountUpdate) == 0x000034, "Wrong size on XpBoostInfoText_C_HandleAccountUpdate");
static_assert(offsetof(XpBoostInfoText_C_HandleAccountUpdate, NewInfo) == 0x000000, "Member 'XpBoostInfoText_C_HandleAccountUpdate::NewInfo' has a wrong offset!");

// Function XpBoostInfoText.XpBoostInfoText_C.Update Available Boosts
// 0x0040 (0x0040 - 0x0000)
struct XpBoostInfoText_C_Update_Available_Boosts final
{
public:
	class UFortItemDefinition*                    Xpboostitem;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortTooltipUIContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortTooltipContext*                    CallFunc_SpawnTooltipContextWithSource_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCombinedDescription_OutDescription;    // 0x0020(0x0018)()
	bool                                          CallFunc_GetCombinedDescription_ReturnValue;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(XpBoostInfoText_C_Update_Available_Boosts) == 0x000008, "Wrong alignment on XpBoostInfoText_C_Update_Available_Boosts");
static_assert(sizeof(XpBoostInfoText_C_Update_Available_Boosts) == 0x000040, "Wrong size on XpBoostInfoText_C_Update_Available_Boosts");
static_assert(offsetof(XpBoostInfoText_C_Update_Available_Boosts, Xpboostitem) == 0x000000, "Member 'XpBoostInfoText_C_Update_Available_Boosts::Xpboostitem' has a wrong offset!");
static_assert(offsetof(XpBoostInfoText_C_Update_Available_Boosts, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'XpBoostInfoText_C_Update_Available_Boosts::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(XpBoostInfoText_C_Update_Available_Boosts, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'XpBoostInfoText_C_Update_Available_Boosts::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(XpBoostInfoText_C_Update_Available_Boosts, CallFunc_SpawnTooltipContextWithSource_ReturnValue) == 0x000018, "Member 'XpBoostInfoText_C_Update_Available_Boosts::CallFunc_SpawnTooltipContextWithSource_ReturnValue' has a wrong offset!");
static_assert(offsetof(XpBoostInfoText_C_Update_Available_Boosts, CallFunc_GetCombinedDescription_OutDescription) == 0x000020, "Member 'XpBoostInfoText_C_Update_Available_Boosts::CallFunc_GetCombinedDescription_OutDescription' has a wrong offset!");
static_assert(offsetof(XpBoostInfoText_C_Update_Available_Boosts, CallFunc_GetCombinedDescription_ReturnValue) == 0x000038, "Member 'XpBoostInfoText_C_Update_Available_Boosts::CallFunc_GetCombinedDescription_ReturnValue' has a wrong offset!");

}

