#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ZoneScoreWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ZoneScoreWidget.ZoneScoreWidget_C
// 0x00B0 (0x02E8 - 0x0238)
class UZoneScoreWidget_C final : public UFortHUDElementWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro_EndOfDayRecapAnim;                           // 0x0240(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       XPIntroAnim;                                       // 0x0248(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTeamScoreToPlayerXPRewardWidget_C*     TeamScoreToPlayerXPRewardWidget;                   // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextEndOfDayHeader;                                // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBoxPlayerScoreContributions;               // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           XP_Vbox;                                           // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UZoneDayCompletion_ScoreBlock_C*        ZoneDayCompletion_ScoreBlock;                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UPlayerZoneTeamScoreContributionWidget_C*> PlayerScoreContributionWidgets;                    // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          ShouldBeTweeningScores;                            // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldBeTweeningXP;                                // 0x0289(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28A[0x2];                                      // 0x028A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TweenTimeRemaining;                                // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TweenDuration;                                     // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pre_And_Post_Tween_Delay;                          // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        XPTweenLoopSound;                                  // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        TeamScoreTweenLoopSound;                           // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEndOfDayRecap                         End_of_Day_Recap;                                  // 0x02A8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAudioComponent*                        ZoneScoreMusic_Sound;                              // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnEndOfDayRecapEnded;                              // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class USoundBase*                             EndOfDay_Recap_Appear_Sound;                       // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnEndOfDayRecapEnded__DelegateSignature();
	void ExecuteUbergraph_ZoneScoreWidget(int32 EntryPoint);
	void OnEndOfDayRecap(const struct FEndOfDayRecap& EndOfDayRecap);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnScoreTweenEndEvent();
	void OnXPTweenEndEvent();
	void StartEndOfDayRecapAfterAnimation();
	void BeginTweeningScores();
	void UpdateScoresLERP(float LERP_Factor);
	void BeginTweeningXP();
	void UpdateXPLERP(float LERP_Factor);
	void ShowXPReward();
	void ShowTeamScoreContributions();
	void BindEndOfDayHeaderText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ZoneScoreWidget_C">();
	}
	static class UZoneScoreWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZoneScoreWidget_C>();
	}
};
static_assert(alignof(UZoneScoreWidget_C) == 0x000008, "Wrong alignment on UZoneScoreWidget_C");
static_assert(sizeof(UZoneScoreWidget_C) == 0x0002E8, "Wrong size on UZoneScoreWidget_C");
static_assert(offsetof(UZoneScoreWidget_C, UberGraphFrame) == 0x000238, "Member 'UZoneScoreWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UZoneScoreWidget_C, Intro_EndOfDayRecapAnim) == 0x000240, "Member 'UZoneScoreWidget_C::Intro_EndOfDayRecapAnim' has a wrong offset!");
static_assert(offsetof(UZoneScoreWidget_C, XPIntroAnim) == 0x000248, "Member 'UZoneScoreWidget_C::XPIntroAnim' has a wrong offset!");
static_assert(offsetof(UZoneScoreWidget_C, TeamScoreToPlayerXPRewardWidget) == 0x000250, "Member 'UZoneScoreWidget_C::TeamScoreToPlayerXPRewardWidget' has a wrong offset!");
static_assert(offsetof(UZoneScoreWidget_C, TextEndOfDayHeader) == 0x000258, "Member 'UZoneScoreWidget_C::TextEndOfDayHeader' has a wrong offset!");
static_assert(offsetof(UZoneScoreWidget_C, VerticalBoxPlayerScoreContributions) == 0x000260, "Member 'UZoneScoreWidget_C::VerticalBoxPlayerScoreContributions' has a wrong offset!");
static_assert(offsetof(UZoneScoreWidget_C, XP_Vbox) == 0x000268, "Member 'UZoneScoreWidget_C::XP_Vbox' has a wrong offset!");
static_assert(offsetof(UZoneScoreWidget_C, ZoneDayCompletion_ScoreBlock) == 0x000270, "Member 'UZoneScoreWidget_C::ZoneDayCompletion_ScoreBlock' has a wrong offset!");
static_assert(offsetof(UZoneScoreWidget_C, PlayerScoreContributionWidgets) == 0x000278, "Member 'UZoneScoreWidget_C::PlayerScoreContributionWidgets' has a wrong offset!");
static_assert(offsetof(UZoneScoreWidget_C, ShouldBeTweeningScores) == 0x000288, "Member 'UZoneScoreWidget_C::ShouldBeTweeningScores' has a wrong offset!");
static_assert(offsetof(UZoneScoreWidget_C, ShouldBeTweeningXP) == 0x000289, "Member 'UZoneScoreWidget_C::ShouldBeTweeningXP' has a wrong offset!");
static_assert(offsetof(UZoneScoreWidget_C, TweenTimeRemaining) == 0x00028C, "Member 'UZoneScoreWidget_C::TweenTimeRemaining' has a wrong offset!");
static_assert(offsetof(UZoneScoreWidget_C, TweenDuration) == 0x000290, "Member 'UZoneScoreWidget_C::TweenDuration' has a wrong offset!");
static_assert(offsetof(UZoneScoreWidget_C, Pre_And_Post_Tween_Delay) == 0x000294, "Member 'UZoneScoreWidget_C::Pre_And_Post_Tween_Delay' has a wrong offset!");
static_assert(offsetof(UZoneScoreWidget_C, XPTweenLoopSound) == 0x000298, "Member 'UZoneScoreWidget_C::XPTweenLoopSound' has a wrong offset!");
static_assert(offsetof(UZoneScoreWidget_C, TeamScoreTweenLoopSound) == 0x0002A0, "Member 'UZoneScoreWidget_C::TeamScoreTweenLoopSound' has a wrong offset!");
static_assert(offsetof(UZoneScoreWidget_C, End_of_Day_Recap) == 0x0002A8, "Member 'UZoneScoreWidget_C::End_of_Day_Recap' has a wrong offset!");
static_assert(offsetof(UZoneScoreWidget_C, ZoneScoreMusic_Sound) == 0x0002C8, "Member 'UZoneScoreWidget_C::ZoneScoreMusic_Sound' has a wrong offset!");
static_assert(offsetof(UZoneScoreWidget_C, OnEndOfDayRecapEnded) == 0x0002D0, "Member 'UZoneScoreWidget_C::OnEndOfDayRecapEnded' has a wrong offset!");
static_assert(offsetof(UZoneScoreWidget_C, EndOfDay_Recap_Appear_Sound) == 0x0002E0, "Member 'UZoneScoreWidget_C::EndOfDay_Recap_Appear_Sound' has a wrong offset!");

}

