#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ZoneDayCompletion_ScoreBlock

#include "Basic.hpp"


namespace SDK::Params
{

// Function ZoneDayCompletion_ScoreBlock.ZoneDayCompletion_ScoreBlock_C.ExecuteUbergraph_ZoneDayCompletion_ScoreBlock
// 0x0010 (0x0010 - 0x0000)
struct ZoneDayCompletion_ScoreBlock_C_ExecuteUbergraph_ZoneDayCompletion_ScoreBlock final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortNumericTextBlock*                  K2Node_ComponentBoundEvent_NumericTextBlock;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ZoneDayCompletion_ScoreBlock_C_ExecuteUbergraph_ZoneDayCompletion_ScoreBlock) == 0x000008, "Wrong alignment on ZoneDayCompletion_ScoreBlock_C_ExecuteUbergraph_ZoneDayCompletion_ScoreBlock");
static_assert(sizeof(ZoneDayCompletion_ScoreBlock_C_ExecuteUbergraph_ZoneDayCompletion_ScoreBlock) == 0x000010, "Wrong size on ZoneDayCompletion_ScoreBlock_C_ExecuteUbergraph_ZoneDayCompletion_ScoreBlock");
static_assert(offsetof(ZoneDayCompletion_ScoreBlock_C_ExecuteUbergraph_ZoneDayCompletion_ScoreBlock, EntryPoint) == 0x000000, "Member 'ZoneDayCompletion_ScoreBlock_C_ExecuteUbergraph_ZoneDayCompletion_ScoreBlock::EntryPoint' has a wrong offset!");
static_assert(offsetof(ZoneDayCompletion_ScoreBlock_C_ExecuteUbergraph_ZoneDayCompletion_ScoreBlock, K2Node_ComponentBoundEvent_NumericTextBlock) == 0x000008, "Member 'ZoneDayCompletion_ScoreBlock_C_ExecuteUbergraph_ZoneDayCompletion_ScoreBlock::K2Node_ComponentBoundEvent_NumericTextBlock' has a wrong offset!");

// Function ZoneDayCompletion_ScoreBlock.ZoneDayCompletion_ScoreBlock_C.BndEvt__NumericTextScore_K2Node_ComponentBoundEvent_51_FortCountingFinished__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ZoneDayCompletion_ScoreBlock_C_BndEvt__NumericTextScore_K2Node_ComponentBoundEvent_51_FortCountingFinished__DelegateSignature final
{
public:
	class UFortNumericTextBlock*                  NumericTextBlock;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ZoneDayCompletion_ScoreBlock_C_BndEvt__NumericTextScore_K2Node_ComponentBoundEvent_51_FortCountingFinished__DelegateSignature) == 0x000008, "Wrong alignment on ZoneDayCompletion_ScoreBlock_C_BndEvt__NumericTextScore_K2Node_ComponentBoundEvent_51_FortCountingFinished__DelegateSignature");
static_assert(sizeof(ZoneDayCompletion_ScoreBlock_C_BndEvt__NumericTextScore_K2Node_ComponentBoundEvent_51_FortCountingFinished__DelegateSignature) == 0x000008, "Wrong size on ZoneDayCompletion_ScoreBlock_C_BndEvt__NumericTextScore_K2Node_ComponentBoundEvent_51_FortCountingFinished__DelegateSignature");
static_assert(offsetof(ZoneDayCompletion_ScoreBlock_C_BndEvt__NumericTextScore_K2Node_ComponentBoundEvent_51_FortCountingFinished__DelegateSignature, NumericTextBlock) == 0x000000, "Member 'ZoneDayCompletion_ScoreBlock_C_BndEvt__NumericTextScore_K2Node_ComponentBoundEvent_51_FortCountingFinished__DelegateSignature::NumericTextBlock' has a wrong offset!");

// Function ZoneDayCompletion_ScoreBlock.ZoneDayCompletion_ScoreBlock_C.Increment
// 0x0020 (0x0020 - 0x0000)
struct ZoneDayCompletion_ScoreBlock_C_Increment final
{
public:
	int32                                         New_Score;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Interpolation_Length;                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ZoneDayCompletion_ScoreBlock_C_Increment) == 0x000008, "Wrong alignment on ZoneDayCompletion_ScoreBlock_C_Increment");
static_assert(sizeof(ZoneDayCompletion_ScoreBlock_C_Increment) == 0x000020, "Wrong size on ZoneDayCompletion_ScoreBlock_C_Increment");
static_assert(offsetof(ZoneDayCompletion_ScoreBlock_C_Increment, New_Score) == 0x000000, "Member 'ZoneDayCompletion_ScoreBlock_C_Increment::New_Score' has a wrong offset!");
static_assert(offsetof(ZoneDayCompletion_ScoreBlock_C_Increment, Interpolation_Length) == 0x000004, "Member 'ZoneDayCompletion_ScoreBlock_C_Increment::Interpolation_Length' has a wrong offset!");
static_assert(offsetof(ZoneDayCompletion_ScoreBlock_C_Increment, CallFunc_SpawnSound2D_ReturnValue) == 0x000008, "Member 'ZoneDayCompletion_ScoreBlock_C_Increment::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZoneDayCompletion_ScoreBlock_C_Increment, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'ZoneDayCompletion_ScoreBlock_C_Increment::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZoneDayCompletion_ScoreBlock_C_Increment, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000014, "Member 'ZoneDayCompletion_ScoreBlock_C_Increment::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZoneDayCompletion_ScoreBlock_C_Increment, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000018, "Member 'ZoneDayCompletion_ScoreBlock_C_Increment::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZoneDayCompletion_ScoreBlock_C_Increment, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x00001C, "Member 'ZoneDayCompletion_ScoreBlock_C_Increment::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");

// Function ZoneDayCompletion_ScoreBlock.ZoneDayCompletion_ScoreBlock_C.SetScore
// 0x0008 (0x0008 - 0x0000)
struct ZoneDayCompletion_ScoreBlock_C_SetScore final
{
public:
	int32                                         New_Score;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ZoneDayCompletion_ScoreBlock_C_SetScore) == 0x000004, "Wrong alignment on ZoneDayCompletion_ScoreBlock_C_SetScore");
static_assert(sizeof(ZoneDayCompletion_ScoreBlock_C_SetScore) == 0x000008, "Wrong size on ZoneDayCompletion_ScoreBlock_C_SetScore");
static_assert(offsetof(ZoneDayCompletion_ScoreBlock_C_SetScore, New_Score) == 0x000000, "Member 'ZoneDayCompletion_ScoreBlock_C_SetScore::New_Score' has a wrong offset!");
static_assert(offsetof(ZoneDayCompletion_ScoreBlock_C_SetScore, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'ZoneDayCompletion_ScoreBlock_C_SetScore::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");

}

